$VAR1 = {
  'ABI_DUMPER_VERSION' => '1.2',
  'ABI_DUMP_VERSION' => '3.5',
  'Arch' => 'x86_64',
  'GccVersion' => '13.2.0',
  'Headers' => {
    'af-mctp.h' => 1,
    'base.h' => 1,
    'bios.h' => 1,
    'bios_table.h' => 1,
    'file_io.h' => 1,
    'firmware_update.h' => 1,
    'fru.h' => 1,
    'host.h' => 1,
    'instance-id.h' => 1,
    'mctp-demux.h' => 1,
    'pdr.h' => 1,
    'platform.h' => 1,
    'pldm.h' => 1,
    'pldm_types.h' => 1,
    'transport.h' => 1,
    'utils.h' => 1
  },
  'Language' => 'C',
  'LibraryName' => 'libpldm.so.0.8.0',
  'LibraryVersion' => '0.8.0',
  'NameSpaces' => {},
  'Needed' => {
    'libc.so.6' => 1
  },
  'PublicABI' => '1',
  'Sources' => {
    'af-mctp.c' => 1,
    'bios_table.c' => 1,
    'instance-id.c' => 1,
    'mctp-demux.c' => 1,
    'pdr.c' => 1
  },
  'SymbolInfo' => {
    '1431' => {
      'Header' => 'base.h',
      'Line' => '607',
      'Param' => {
        '0' => {
          'name' => 'msg_type',
          'type' => '140'
        },
        '1' => {
          'name' => 'instance_id',
          'type' => '140'
        },
        '2' => {
          'name' => 'pldm_type',
          'type' => '140'
        },
        '3' => {
          'name' => 'command',
          'type' => '140'
        },
        '4' => {
          'name' => 'msg',
          'type' => '1624'
        }
      },
      'Return' => '100',
      'ShortName' => 'encode_pldm_header_only'
    },
    '1629' => {
      'Header' => 'base.h',

      'pldm_bios_table_string_find_by_string' => 1,
      'pldm_close' => 1,
      'pldm_entity_association_pdr_add_check' => 1,
      'pldm_entity_association_pdr_add_from_node_check' => 1,
      'pldm_entity_association_pdr_add_from_node_with_record_handle' => 1,
      'pldm_entity_association_pdr_extract' => 1,
      'pldm_entity_association_tree_add' => 1,
      'pldm_entity_association_tree_add_entity' => 1,
      'pldm_entity_association_tree_copy_root' => 1,
      'pldm_entity_association_tree_destroy' => 1,
      'pldm_entity_association_tree_destroy_root' => 1,
      'pldm_entity_association_tree_find' => 1,
      'pldm_entity_association_tree_find_with_locality' => 1,
      'pldm_entity_association_tree_init' => 1,
      'pldm_entity_association_tree_visit' => 1,
      'pldm_entity_extract' => 1,
      'pldm_entity_get_num_children' => 1,
      'pldm_entity_get_parent' => 1,
      'pldm_entity_is_exist_parent' => 1,
      'pldm_entity_is_node_parent' => 1,
      'pldm_entity_node_get_remote_container_id' => 1,
      'pldm_find_entity_ref_in_tree' => 1,
      'pldm_instance_db_destroy' => 1,
      'pldm_instance_db_init' => 1,
      'pldm_instance_db_init_default' => 1,
      'pldm_instance_id_alloc' => 1,
      'pldm_instance_id_free' => 1,
      'pldm_is_current_parent_child' => 1,
      'pldm_is_empty_entity_assoc_tree' => 1,
      'pldm_msg_hdr_correlate_response' => 1,
      'pldm_open' => 1,
      'pldm_pdr_add_check' => 1,
      'pldm_pdr_add_fru_record_set_check' => 1,
      'pldm_pdr_destroy' => 1,
      'pldm_pdr_find_last_in_range' => 1,
      'pldm_pdr_find_record' => 1,
      'pldm_pdr_find_record_by_type' => 1,
      'pldm_pdr_fru_record_set_find_by_rsi' => 1,
      'pldm_pdr_get_next_record' => 1,
      'pldm_pdr_get_record_count' => 1,
      'pldm_pdr_get_record_handle' => 1,
      'pldm_pdr_get_repo_size' => 1,
      'pldm_pdr_init' => 1,
      'pldm_pdr_record_is_remote' => 1,
      'pldm_pdr_remove_pdrs_by_terminus_handle' => 1,
      'pldm_pdr_remove_remote_pdrs' => 1,
      'pldm_pdr_update_TL_pdr' => 1,
      'pldm_recv' => 1,
      'pldm_recv_any' => 1,
      'pldm_send' => 1,
      'pldm_send_recv' => 1,
      'pldm_transport_af_mctp_bind' => 1,
      'pldm_transport_af_mctp_core' => 1,
      'pldm_transport_af_mctp_destroy' => 1,
      'pldm_transport_af_mctp_init' => 1,
      'pldm_transport_af_mctp_init_pollfd' => 1,
      'pldm_transport_af_mctp_map_tid' => 1,
      'pldm_transport_af_mctp_unmap_tid' => 1,
      'pldm_transport_mctp_demux_core' => 1,
      'pldm_transport_mctp_demux_destroy' => 1,
      'pldm_transport_mctp_demux_init' => 1,
      'pldm_transport_mctp_demux_init_pollfd' => 1,
      'pldm_transport_mctp_demux_map_tid' => 1,
      'pldm_transport_mctp_demux_unmap_tid' => 1,
      'pldm_transport_poll' => 1,
      'pldm_transport_recv_msg' => 1,
      'pldm_transport_send_msg' => 1,
      'pldm_transport_send_recv_msg' => 1,
      'unpack_pldm_header' => 1,
      'ver2str' => 1
    }
  },
  'Target' => 'unix',
  'TypeInfo' => {
    '1' => {
      'Name' => 'void',
      'Type' => 'Intrinsic'
    },
    '46' => {
      'Name' => 'unsigned char',
      'Size' => '1',
      'Type' => 'Intrinsic'
    },
    '53' => {
      'Name' => 'unsigned short',
      'Size' => '2',
      'Type' => 'Intrinsic'
    },
    '60' => {
      'Name' => 'unsigned int',
      'Size' => '4',
      'Type' => 'Intrinsic'
    },
    '67' => {
      'Name' => 'unsigned long',
      'Size' => '8',
      'Type' => 'Intrinsic'
    },
    '74' => {
      'Name' => 'signed char',
      'Size' => '1',
      'Type' => 'Intrinsic'
    },
    '81' => {
      'BaseType' => '46',
      'Header' => 'types.h',
      'Line' => '38',
      'Name' => '__uint8_t',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '93' => {
      'Name' => 'short',
      'Size' => '2',
      'Type' => 'Intrinsic'
    },
    '100' => {
      'Name' => 'int',
      'Size' => '4',
      'Type' => 'Intrinsic'
    },
    '107' => {
      'BaseType' => '60',
      'Header' => 'types.h',
      'Line' => '42',
      'Name' => '__uint32_t',
      'PrivateABI' => 1,
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '119' => {
      'Name' => 'long',
      'Size' => '8',
      'Type' => 'Intrinsic'
    },
    '126' => {
      'BaseType' => '1',
      'Name' => 'void*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '133' => {
      'Name' => 'char',
      'Size' => '1',
      'Type' => 'Intrinsic'
    },
    '140' => {
      'BaseType' => '81',
      'Header' => 'stdint-uintn.h',
      'Line' => '24',
      'Name' => 'uint8_t',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '152' => {
      'BaseType' => '107',
      'Header' => 'stdint-uintn.h',
      'Line' => '26',
      'Name' => 'uint32_t',
      'PrivateABI' => 1,
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '164' => {
      'Header' => 'pldm_types.h',
      'Line' => '9',
      'Name' => 'anon-struct-pldm_types.h-9',
      'Size' => '1',
      'Type' => 'Struct'
    },
    '318' => {
      'Header' => 'pldm_types.h',
      'Line' => '19',
      'Memb' => {
        '0' => {
          'name' => 'byte',
          'offset' => '0',
          'type' => '140'
        },
        '1' => {
          'name' => 'bits',
          'offset' => '0',
          'type' => '164'
        }
      },
      'Name' => 'union bitfield8_t',
      'Size' => '1',
      'Type' => 'Union'
    },
    '330' => {
      'BaseType' => '318',
      'Name' => 'bitfield8_t const',
      'Size' => '1',
      'Type' => 'Const'
    },
    '335' => {
      'Header' => 'pldm_types.h',
      'Line' => '25',
      'Memb' => {
        '0' => {
          'name' => 'alpha',
          'offset' => '0',
          'type' => '140'
        },
        '1' => {
          'name' => 'update',
          'offset' => '1',
          'type' => '140'
        },
        '2' => {
          'name' => 'minor',
          'offset' => '2',
          'type' => '140'
        },
        '3' => {
          'name' => 'major',
          'offset' => '3',
          'type' => '140'
        }
      },
      'Name' => 'struct pldm_version',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '401' => {
      'BaseType' => '335',
      'Header' => 'pldm_types.h',
      'Line' => '30',
      'Name' => 'ver32_t',
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '413' => {
      'BaseType' => '401',
      'Name' => 'ver32_t const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '418' => {
      'Name' => 'float',
      'Size' => '4',
      'Type' => 'Intrinsic'
    },
    '453' => {
      'BaseType' => '67',
      'Header' => 'stddef.h',
      'Line' => '214',
      'Name' => 'size_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '733' => {
      'Header' => 'base.h',
      'Line' => '92',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_RESPONSE',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_REQUEST',
          'value' => '1'
        },
        '2' => {
          'name' => 'PLDM_RESERVED',
          'value' => '2'
        },
        '3' => {
          'name' => 'PLDM_ASYNC_REQUEST_NOTIFY',
          'value' => '3'
        }
      },
      'Name' => 'enum MessageType',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '745' => {
      'Header' => 'base.h',
      'Line' => '136',
      'Memb' => {
        '0' => {
          'name' => 'command',
          'offset' => '2',
          'type' => '140'
        }
      },
      'Name' => 'struct pldm_msg_hdr',
      'Size' => '3',
      'Type' => 'Struct'
    },
    '856' => {
      'BaseType' => '745',
      'Name' => 'struct pldm_msg_hdr const',
      'Size' => '3',
      'Type' => 'Const'
    },
    '861' => {
      'Header' => 'base.h',
      'Line' => '169',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '745'
        },
        '1' => {
          'name' => 'payload',
          'offset' => '3',
          'type' => '906'
        }
      },
      'Name' => 'struct pldm_msg',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '901' => {
      'BaseType' => '861',
      'Name' => 'struct pldm_msg const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '906' => {
      'BaseType' => '140',
      'Name' => 'uint8_t[1]',
      'Size' => '1',
      'Type' => 'Array'
    },
    '922' => {
      'Header' => 'base.h',
      'Line' => '195',
      'Memb' => {
        '0' => {
          'name' => 'msg_type',
          'offset' => '0',
          'type' => '733'
        },
        '1' => {
          'name' => 'instance',
          'offset' => '4',
          'type' => '140'
        },
        '2' => {
          'name' => 'pldm_type',
          'offset' => '5',
          'type' => '140'
        },
        '3' => {
          'name' => 'command',
          'offset' => '6',
          'type' => '140'
        },
        '4' => {
          'name' => 'completion_code',
          'offset' => '7',
          'type' => '140'
        }
      },
      'Name' => 'struct pldm_header_info',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '1001' => {
      'BaseType' => '922',
      'Name' => 'struct pldm_header_info const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '1624' => {
      'BaseType' => '861',
      'Name' => 'struct pldm_msg*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2071' => {
      'BaseType' => '901',
      'Name' => 'struct pldm_msg const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2076' => {
      'BaseType' => '140',
      'Name' => 'uint8_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2081' => {
      'BaseType' => '152',
      'Name' => 'uint32_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2976' => {
      'BaseType' => '401',
      'Name' => 'ver32_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '3481' => {
      'BaseType' => '413',
      'Name' => 'ver32_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '3889' => {
      'BaseType' => '318',
      'Name' => 'bitfield8_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '4347' => {
      'BaseType' => '330',
      'Name' => 'bitfield8_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '5123' => {
      'Name' => '_Bool',
      'Size' => '1',
      'Type' => 'Intrinsic'
    },
    '5130' => {
      'BaseType' => '856',
      'Name' => 'struct pldm_msg_hdr const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '5196' => {
      'BaseType' => '922',
      'Name' => 'struct pldm_header_info*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '5287' => {
      'BaseType' => '1001',
      'Name' => 'struct pldm_header_info const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '5292' => {
      'BaseType' => '745',
      'Name' => 'struct pldm_msg_hdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '5342' => {
      'BaseType' => '5352',
      'Name' => 'void const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '5352' => {
      'BaseType' => '1',
      'Name' => 'void const',
      'Type' => 'Const'
    },
    '5504' => {
      'BaseType' => '53',
      'Header' => 'types.h',
      'Line' => '40',
      'Name' => '__uint16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '5568' => {
      'BaseType' => '140',
      'Name' => 'uint8_t const',
      'Size' => '1',
      'Type' => 'Const'
    },
    '5573' => {
      'BaseType' => '5504',
      'Header' => 'stdint-uintn.h',
      'Line' => '25',
      'Name' => 'uint16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '6778' => {
      'Header' => 'utils.h',
      'Line' => '20',
      'Memb' => {
        '0' => {
          'name' => 'ptr',
          'offset' => '0',
          'type' => '6817'
        },
        '1' => {
          'name' => 'length',
          'offset' => '8',
          'type' => '453'
        }
      },
      'Name' => 'struct variable_field',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '6817' => {
      'BaseType' => '5568',
      'Name' => 'uint8_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '7174' => {
      'BaseType' => '6778',
      'Name' => 'struct variable_field*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '9256' => {
      'BaseType' => '5573',
      'Name' => 'uint16_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '9819' => {
      'BaseType' => '453',
      'Name' => 'size_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '12431' => {
      'BaseType' => '74',
      'Header' => 'types.h',
      'Line' => '37',
      'Name' => '__int8_t',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '12462' => {
      'BaseType' => '93',
      'Header' => 'types.h',
      'Line' => '39',
      'Name' => '__int16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '12493' => {
      'BaseType' => '100',
      'Header' => 'types.h',
      'Line' => '41',
      'Name' => '__int32_t',
      'PrivateABI' => 1,
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '12550' => {
      'BaseType' => '133',
      'Name' => 'char*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '12567' => {
      'BaseType' => '133',
      'Name' => 'char const',
      'Size' => '1',
      'Type' => 'Const'
    },
    '12572' => {
      'BaseType' => '12431',
      'Header' => 'stdint-intn.h',
      'Line' => '24',
      'Name' => 'int8_t',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '12584' => {
      'BaseType' => '12462',
      'Header' => 'stdint-intn.h',
      'Line' => '25',
      'Name' => 'int16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '12596' => {
      'BaseType' => '12493',
      'Header' => 'stdint-intn.h',
      'Line' => '26',
      'Name' => 'int32_t',
      'PrivateABI' => 1,
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '12637' => {
      'BaseType' => '5573',
      'Name' => 'uint16_t const',
      'Size' => '2',
      'Type' => 'Const'
    },
    '12654' => {
      'BaseType' => '152',
      'Name' => 'uint32_t const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '12849' => {
      'BaseType' => '140',
      'Header' => 'pldm_types.h',
      'Line' => '32',
      'Name' => 'bool8_t',
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '12861' => {
      'BaseType' => '418',
      'Header' => 'pldm_types.h',
      'Line' => '164',
      'Name' => 'real32_t',
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '12920' => {
      'BaseType' => '453',
      'Name' => 'size_t const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '13466' => {
      'BaseType' => '12567',
      'Name' => 'char const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '14095' => {
      'Header' => 'platform.h',
      'Line' => '260',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_SENSOR_OP_STATE',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_STATE_SENSOR_STATE',
          'value' => '1'
        },
        '2' => {
          'name' => 'PLDM_NUMERIC_SENSOR_STATE',
          'value' => '2'
        }
      },
      'Name' => 'enum sensor_event_class_states',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '14129' => {
      'BaseType' => '14095',
      'Name' => 'enum sensor_event_class_states const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '14352' => {
      'Header' => 'platform.h',
      'Line' => '482',
      'Memb' => {
        '0' => {
          'name' => 'record_handle',
          'offset' => '0',
          'type' => '152'
        },
        '1' => {
          'name' => 'version',
          'offset' => '4',
          'type' => '140'
        },
        '2' => {
          'name' => 'type',
          'offset' => '5',
          'type' => '140'
        },
        '3' => {
          'name' => 'record_change_num',
          'offset' => '6',
          'type' => '5573'
        },
        '4' => {
          'name' => 'length',
          'offset' => '8',
          'type' => '5573'
        }
      },
      'Name' => 'struct pldm_pdr_hdr',
      'Size' => '10',
      'Type' => 'Struct'
    },
    '14431' => {
      'Header' => 'platform.h',
      'Line' => '557',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '14352'
        },
        '1' => {
          'name' => 'terminus_handle',
          'offset' => '16',
          'type' => '5573'
        },
        '2' => {
          'name' => 'sensor_id',
          'offset' => '18',
          'type' => '5573'
        },
        '3' => {
          'name' => 'entity_type',
          'offset' => '20',
          'type' => '5573'
        },
        '4' => {
          'name' => 'entity_instance',
          'offset' => '22',
          'type' => '5573'
        },
        '5' => {
          'name' => 'container_id',
          'offset' => '24',
          'type' => '5573'
        },
        '6' => {
          'name' => 'sensor_init',
          'offset' => '32',
          'type' => '140'
        },
        '7' => {
          'name' => 'sensor_auxiliary_names_pdr',
          'offset' => '33',
          'type' => '12849'
        },
        '8' => {
          'name' => 'composite_sensor_count',
          'offset' => '34',
          'type' => '140'
        },
        '9' => {
          'name' => 'possible_states',
          'offset' => '35',
          'type' => '906'
        }
      },
      'Name' => 'struct pldm_state_sensor_pdr',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '14575' => {
      'Header' => 'platform.h',
      'Line' => '574',
      'Memb' => {
        '0' => {
          'name' => 'state_set_id',
          'offset' => '0',
          'type' => '5573'
        },
        '1' => {
          'name' => 'possible_states_size',
          'offset' => '2',
          'type' => '140'
        },
        '2' => {
          'name' => 'states',
          'offset' => '3',
          'type' => '14633'
        }
      },
      'Name' => 'struct state_sensor_possible_states',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '14628' => {
      'BaseType' => '14575',
      'Name' => 'struct state_sensor_possible_states const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '14633' => {
      'BaseType' => '318',
      'Name' => 'bitfield8_t[1]',
      'Size' => '1',
      'Type' => 'Array'
    },
    '14649' => {
      'Header' => 'platform.h',
      'Line' => '584',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '14352'
        },
        '1' => {
          'name' => 'terminus_handle',
          'offset' => '16',
          'type' => '5573'
        },
        '2' => {
          'name' => 'effecter_id',
          'offset' => '18',
          'type' => '5573'
        },
        '3' => {
          'name' => 'entity_type',
          'offset' => '20',
          'type' => '5573'
        },
        '4' => {
          'name' => 'entity_instance',
          'offset' => '22',
          'type' => '5573'
        },
        '5' => {
          'name' => 'container_id',
          'offset' => '24',
          'type' => '5573'
        },
        '6' => {
          'name' => 'effecter_semantic_id',
          'offset' => '32',
          'type' => '5573'
        },
        '7' => {
          'name' => 'effecter_init',
          'offset' => '34',
          'type' => '140'
        },
        '8' => {
          'name' => 'has_description_pdr',
          'offset' => '35',
          'type' => '12849'
        },
        '9' => {
          'name' => 'composite_effecter_count',
          'offset' => '36',
          'type' => '140'
        },
        '10' => {
          'name' => 'possible_states',
          'offset' => '37',
          'type' => '906'
        }
      },
      'Name' => 'struct pldm_state_effecter_pdr',
      'Size' => '26',
      'Type' => 'Struct'
    },
    '14994' => {
      'Header' => 'platform.h',
      'Line' => '675',
      'Memb' => {
        '0' => {
          'name' => 'value_u8',
          'offset' => '0',
          'type' => '140'
        },
        '1' => {
          'name' => 'value_s8',
          'offset' => '0',
          'type' => '12572'
        },
        '2' => {
          'name' => 'value_u16',
          'offset' => '0',
          'type' => '5573'
        },
        '3' => {
          'name' => 'value_s16',
          'offset' => '0',
          'type' => '12584'
        },
        '4' => {
          'name' => 'value_u32',
          'offset' => '0',
          'type' => '152'
        },
        '5' => {
          'name' => 'value_s32',
          'offset' => '0',
          'type' => '12596'
        },
        '6' => {
          'name' => 'value_f32',
          'offset' => '0',
          'type' => '12861'
        }
      },
      'Name' => 'union union_range_field_format',
      'Size' => '4',
      'Type' => 'Union'
    },
    '15557' => {
      'Header' => 'platform.h',
      'Line' => '732',
      'Memb' => {
        '0' => {
          'name' => 'value_u8',
          'offset' => '0',
          'type' => '140'
        },
        '1' => {
          'name' => 'value_s8',
          'offset' => '0',
          'type' => '12572'
        },
        '2' => {
          'name' => 'value_u16',
          'offset' => '0',
          'type' => '5573'
        },
        '3' => {
          'name' => 'value_s16',
          'offset' => '0',
          'type' => '12584'
        },
        '4' => {
          'name' => 'value_u32',
          'offset' => '0',
          'type' => '152'
        },
        '5' => {
          'name' => 'value_s32',
          'offset' => '0',
          'type' => '12596'
        }
      },
      'Name' => 'union union_sensor_data_size',
      'Size' => '4',
      'Type' => 'Union'
    },
    '15569' => {
      'Header' => 'platform.h',
      'Line' => '739',
      'Memb' => {
        '0' => {
          'name' => 'record_handle',
          'offset' => '0',
          'type' => '152'
        },
        '1' => {
          'name' => 'version',
          'offset' => '4',
          'type' => '140'
        },
        '2' => {
          'name' => 'type',
          'offset' => '5',
          'type' => '140'
        },
        '3' => {
          'name' => 'record_change_num',
          'offset' => '6',
          'type' => '5573'
        },
        '4' => {
          'name' => 'length',
          'offset' => '8',
          'type' => '5573'
        }
      },
      'Name' => 'struct pldm_value_pdr_hdr',
      'Size' => '12',
      'Type' => 'Struct'
    },
    '15648' => {
      'Header' => 'platform.h',
      'Line' => '757',
      'Memb' => {
        '0' => {
          'name' => 'entity_instance_num',
          'offset' => '0',
          'type' => '5573'
        },
        '1' => {
          'name' => 'entity_instance',
          'offset' => '0',
          'type' => '5573'
        }
      },
      'Name' => 'anon-union-platform.h-757',
      'Size' => '2',
      'Type' => 'Union'
    },
    '15682' => {
      'Header' => 'platform.h',
      'Line' => '752',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '15569'
        },
        '1' => {
          'name' => 'terminus_handle',
          'offset' => '18',
          'type' => '5573'
        },
        '2' => {
          'name' => 'sensor_id',
          'offset' => '20',
          'type' => '5573'
        },
        '3' => {
          'name' => 'entity_type',
          'offset' => '22',
          'type' => '5573'
        },
        '4' => {
          'name' => 'unnamed0',
          'offset' => '24',
          'type' => '15648'
        },
        '5' => {
          'name' => 'container_id',
          'offset' => '32',
          'type' => '5573'
        },
        '6' => {
          'name' => 'sensor_init',
          'offset' => '34',
          'type' => '140'
        },
        '7' => {
          'name' => 'sensor_auxiliary_names_pdr',
          'offset' => '35',
          'type' => '12849'
        },
        '8' => {
          'name' => 'base_unit',
          'offset' => '36',
          'type' => '140'
        },
        '9' => {
          'name' => 'unit_modifier',
          'offset' => '37',
          'type' => '12572'
        },
        '10' => {
          'name' => 'rate_unit',
          'offset' => '38',
          'type' => '140'
        },
        '11' => {
          'name' => 'base_oem_unit_handle',
          'offset' => '39',
          'type' => '140'
        },
        '12' => {
          'name' => 'aux_unit',
          'offset' => '40',
          'type' => '140'
        },
        '13' => {
          'name' => 'aux_unit_modifier',
          'offset' => '41',
          'type' => '12572'
        },
        '14' => {
          'name' => 'aux_rate_unit',
          'offset' => '48',
          'type' => '140'
        },
        '15' => {
          'name' => 'rel',
          'offset' => '49',
          'type' => '140'
        },
        '16' => {
          'name' => 'aux_oem_unit_handle',
          'offset' => '50',
          'type' => '140'
        },
        '17' => {
          'name' => 'is_linear',
          'offset' => '51',
          'type' => '12849'
        },
        '18' => {
          'name' => 'sensor_data_size',
          'offset' => '52',
          'type' => '140'
        },
        '19' => {
          'name' => 'resolution',
          'offset' => '54',
          'type' => '12861'
        },
        '20' => {
          'name' => 'offset',
          'offset' => '64',
          'type' => '12861'
        },
        '21' => {
          'name' => 'accuracy',
          'offset' => '68',
          'type' => '5573'
        },
        '22' => {
          'name' => 'plus_tolerance',
          'offset' => '70',
          'type' => '140'
        },
        '23' => {
          'name' => 'minus_tolerance',
          'offset' => '71',
          'type' => '140'
        },
        '24' => {
          'name' => 'hysteresis',
          'offset' => '72',
          'type' => '15557'
        },
        '25' => {
          'name' => 'supported_thresholds',
          'offset' => '82',
          'type' => '318'
        },
        '26' => {
          'name' => 'threshold_and_hysteresis_volatility',
          'offset' => '83',
          'type' => '318'
        },
        '27' => {
          'name' => 'state_transition_interval',
          'offset' => '86',
          'type' => '12861'
        },
        '28' => {
          'name' => 'update_interval',
          'offset' => '96',
          'type' => '12861'
        },
        '29' => {
          'name' => 'max_readable',
          'offset' => '100',
          'type' => '15557'
        },
        '30' => {
          'name' => 'min_readable',
          'offset' => '104',
          'type' => '15557'
        },
        '31' => {
          'name' => 'range_field_format',
          'offset' => '114',
          'type' => '140'
        },
        '32' => {
          'name' => 'range_field_support',
          'offset' => '115',
          'type' => '318'
        },
        '33' => {
          'name' => 'nominal_value',
          'offset' => '118',
          'type' => '14994'
        },
        '34' => {
          'name' => 'normal_max',
          'offset' => '128',
          'type' => '14994'
        },
        '35' => {
          'name' => 'normal_min',
          'offset' => '132',
          'type' => '14994'
        },
        '36' => {
          'name' => 'warning_high',
          'offset' => '136',
          'type' => '14994'
        },
        '37' => {
          'name' => 'warning_low',
          'offset' => '146',
          'type' => '14994'
        },
        '38' => {
          'name' => 'critical_high',
          'offset' => '150',
          'type' => '14994'
        },
        '39' => {
          'name' => 'critical_low',
          'offset' => '256',
          'type' => '14994'
        },
        '40' => {
          'name' => 'fatal_high',
          'offset' => '260',
          'type' => '14994'
        },
        '41' => {
          'name' => 'fatal_low',
          'offset' => '264',
          'type' => '14994'
        }
      },
      'Name' => 'struct pldm_numeric_sensor_value_pdr',
      'Size' => '112',
      'Type' => 'Struct'
    },
    '16235' => {
      'Header' => 'platform.h',
      'Line' => '804',
      'Memb' => {
        '0' => {
          'name' => 'state_set_id',
          'offset' => '0',
          'type' => '5573'
        },
        '1' => {
          'name' => 'possible_states_size',
          'offset' => '2',
          'type' => '140'
        },
        '2' => {
          'name' => 'states',
          'offset' => '3',
          'type' => '14633'
        }
      },
      'Name' => 'struct state_effecter_possible_states',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '16288' => {
      'BaseType' => '16235',
      'Name' => 'struct state_effecter_possible_states const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '16293' => {
      'Header' => 'platform.h',
      'Line' => '852',
      'Memb' => {
        '0' => {
          'name' => 'set_request',
          'offset' => '0',
          'type' => '140'
        },
        '1' => {
          'name' => 'effecter_state',
          'offset' => '1',
          'type' => '140'
        }
      },
      'Name' => 'struct state_field_for_state_effecter_set',
      'Size' => '2',
      'Type' => 'Struct'
    },
    '16333' => {
      'BaseType' => '16293',
      'Header' => 'platform.h',
      'Line' => '855',
      'Name' => 'set_effecter_state_field',
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '16345' => {
      'Header' => 'platform.h',
      'Line' => '861',
      'Memb' => {
        '0' => {
          'name' => 'sensor_op_state',
          'offset' => '0',
          'type' => '140'
        },
        '1' => {
          'name' => 'present_state',
          'offset' => '1',
          'type' => '140'
        },
        '2' => {
          'name' => 'previous_state',
          'offset' => '2',
          'type' => '140'
        },
        '3' => {
          'name' => 'event_state',
          'offset' => '3',
          'type' => '140'
        }
      },
      'Name' => 'struct state_field_for_get_state_sensor_readings',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '16411' => {
      'BaseType' => '16345',
      'Header' => 'platform.h',
      'Line' => '869',
      'Name' => 'get_sensor_state_field',
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '16423' => {
      'Header' => 'platform.h',
      'Line' => '875',
      'Memb' => {
        '0' => {
          'name' => 'effecter_op_state',
          'offset' => '0',
          'type' => '140'
        },
        '1' => {
          'name' => 'pending_state',
          'offset' => '1',
          'type' => '140'
        },
        '2' => {
          'name' => 'present_state',
          'offset' => '2',
          'type' => '140'
        }
      },
      'Name' => 'struct state_field_for_get_state_effecter_states',
      'Size' => '3',
      'Type' => 'Struct'
    },
    '16476' => {
      'BaseType' => '16423',
      'Header' => 'platform.h',
      'Line' => '879',
      'Name' => 'get_effecter_state_field',
      'Size' => '3',
      'Type' => 'Typedef'
    },
    '16675' => {
      'BaseType' => '140',
      'Name' => 'uint8_t[13]',
      'Size' => '13',
      'Type' => 'Array'
    },
    '17157' => {
      'Header' => 'platform.h',
      'Line' => '1024',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '140'
        },
        '1' => {
          'name' => 'comp_effecter_count',
          'offset' => '1',
          'type' => '140'
        },
        '2' => {
          'name' => 'field',
          'offset' => '2',
          'type' => '17210'
        }
      },
      'Name' => 'struct pldm_get_state_effecter_states_resp',
      'Size' => '26',
      'Type' => 'Struct'
    },
    '17210' => {
      'BaseType' => '16476',
      'Name' => 'get_effecter_state_field[8]',
      'Size' => '24',
      'Type' => 'Array'
    },
    '17226' => {
      'Header' => 'platform.h',
      'Line' => '1034',
      'Memb' => {
        '0' => {
          'name' => 'sensor_id',
          'offset' => '0',
          'type' => '5573'
        },
        '1' => {
          'name' => 'sensor_event_class_type',
          'offset' => '2',
          'type' => '140'
        },
        '2' => {
          'name' => 'event_class',
          'offset' => '3',
          'type' => '906'
        }
      },
      'Name' => 'struct pldm_sensor_event_data',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '17438' => {
      'Header' => 'platform.h',
      'Line' => '1115',
      'Memb' => {
        '0' => {
          'name' => 'event_data_format',
          'offset' => '0',
          'type' => '140'
        },
        '1' => {
          'name' => 'number_of_change_records',
          'offset' => '1',
          'type' => '140'
        },
        '2' => {
          'name' => 'change_records',
          'offset' => '2',
          'type' => '906'
        }
      },
      'Name' => 'struct pldm_pdr_repository_chg_event_data',
      'Size' => '3',
      'Type' => 'Struct'
    },
    '19506' => {
      'BaseType' => '17157',
      'Name' => 'struct pldm_get_state_effecter_states_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '65866' => {
      'BaseType' => '126',
      'Name' => 'void**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '76038' => {
      'BaseType' => '9819',
      'Name' => 'size_t*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '79648' => {
      'BaseType' => '79658',
      'Name' => 'uint32_t const*const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '79653' => {
      'BaseType' => '12654',
      'Name' => 'uint32_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '79658' => {
      'BaseType' => '79653',
      'Name' => 'uint32_t const*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '79663' => {
      'BaseType' => '17438',
      'Name' => 'struct pldm_pdr_repository_chg_event_data*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '144167' => {
      'BaseType' => '15682',
      'Name' => 'struct pldm_numeric_sensor_value_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '159562' => {
      'BaseType' => '17226',
      'Name' => 'struct pldm_sensor_event_data*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '159567' => {
      'BaseType' => '159562',
      'Name' => 'struct pldm_sensor_event_data*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '162501' => {
      'BaseType' => '16411',
      'Name' => 'get_sensor_state_field*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '175762' => {
      'BaseType' => '16333',
      'Name' => 'set_effecter_state_field*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '176728' => {
      'BaseType' => '14431',
      'Name' => 'struct pldm_state_sensor_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '176733' => {
      'BaseType' => '176728',
      'Name' => 'struct pldm_state_sensor_pdr*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '176738' => {
      'BaseType' => '14628',
      'Name' => 'struct state_sensor_possible_states const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '176743' => {
      'BaseType' => '176738',
      'Name' => 'struct state_sensor_possible_states const*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '177132' => {
      'BaseType' => '14649',
      'Name' => 'struct pldm_state_effecter_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '177137' => {
      'BaseType' => '177132',
      'Name' => 'struct pldm_state_effecter_pdr*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '177142' => {
      'BaseType' => '16288',
      'Name' => 'struct state_effecter_possible_states const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '177147' => {
      'BaseType' => '177142',
      'Name' => 'struct state_effecter_possible_states const*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '182135' => {
      'BaseType' => '67',
      'Header' => 'types.h',
      'Line' => '45',
      'Name' => '__uint64_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '182154' => {
      'BaseType' => '119',
      'Header' => 'types.h',
      'Line' => '194',
      'Name' => '__ssize_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '182229' => {
      'BaseType' => '182135',
      'Header' => 'stdint-uintn.h',
      'Line' => '27',
      'Name' => 'uint64_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '182375' => {
      'Header' => 'bios.h',
      'Line' => '39',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_BIOS_STRING_TABLE',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_BIOS_ATTR_TABLE',
          'value' => '1'
        },
        '2' => {
          'name' => 'PLDM_BIOS_ATTR_VAL_TABLE',
          'value' => '2'
        }
      },
      'Name' => 'enum pldm_bios_table_types',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '182409' => {
      'Header' => 'bios.h',
      'Line' => '48',
      'Memb' => {
        '0' => {
          'name' => 'string_handle',
          'offset' => '0',
          'type' => '5573'
        },
        '1' => {
          'name' => 'string_length',
          'offset' => '2',
          'type' => '5573'
        },
        '2' => {
          'name' => 'name',
          'offset' => '4',
          'type' => '182466'
        }
      },
      'Name' => 'struct pldm_bios_string_table_entry',
      'Size' => '5',
      'Type' => 'Struct'
    },
    '182461' => {
      'BaseType' => '182409',
      'Name' => 'struct pldm_bios_string_table_entry const',
      'Size' => '5',
      'Type' => 'Const'
    },
    '182466' => {
      'BaseType' => '133',
      'Name' => 'char[1]',
      'Size' => '1',
      'Type' => 'Array'
    },
    '182482' => {
      'Header' => 'bios.h',
      'Line' => '54',
      'Memb' => {
        '0' => {
          'name' => 'attr_handle',
          'offset' => '0',
          'type' => '5573'
        },
        '1' => {
          'name' => 'attr_type',
          'offset' => '2',
          'type' => '140'
        },
        '2' => {
          'name' => 'string_handle',
          'offset' => '3',
          'type' => '5573'
        },
        '3' => {
          'name' => 'metadata',
          'offset' => '5',
          'type' => '906'
        }
      },
      'Name' => 'struct pldm_bios_attr_table_entry',
      'Size' => '6',
      'Type' => 'Struct'
    },
    '182547' => {
      'BaseType' => '182482',
      'Name' => 'struct pldm_bios_attr_table_entry const',
      'Size' => '6',
      'Type' => 'Const'
    },
    '182552' => {
      'Header' => 'bios.h',
      'Line' => '66',
      'Memb' => {
        '0' => {
          'name' => 'attr_handle',
          'offset' => '0',
          'type' => '5573'
        },
        '1' => {
          'name' => 'attr_type',
          'offset' => '2',
          'type' => '140'
        },
        '2' => {
          'name' => 'value',
          'offset' => '3',
          'type' => '906'
        }
      },
      'Name' => 'struct pldm_bios_attr_val_table_entry',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '182604' => {
      'BaseType' => '182552',
      'Name' => 'struct pldm_bios_attr_val_table_entry const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '182673' => {
      'Header' => 'bios_table.h',
      'Line' => '206',
      'Memb' => {
        '0' => {
          'name' => 'name_handle',
          'offset' => '0',
          'type' => '5573'
        },
        '1' => {
          'name' => 'read_only',
          'offset' => '2',
          'type' => '5123'
        },
        '2' => {
          'name' => 'pv_num',
          'offset' => '3',
          'type' => '140'
        },
        '3' => {
          'name' => 'pv_handle',
          'offset' => '8',
          'type' => '182776'
        },
        '4' => {
          'name' => 'def_num',
          'offset' => '22',
          'type' => '140'
        },
        '5' => {
          'name' => 'def_index',
          'offset' => '36',
          'type' => '6817'
        }
      },
      'Name' => 'struct pldm_bios_table_attr_entry_enum_info',
      'Size' => '32',
      'Type' => 'Struct'
    },
    '182764' => {
      'BaseType' => '182673',
      'Name' => 'struct pldm_bios_table_attr_entry_enum_info const',
      'Size' => '32',
      'Type' => 'Const'
    },
    '182776' => {
      'BaseType' => '12637',
      'Name' => 'uint16_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '182786' => {
      'Header' => 'bios_table.h',
      'Line' => '294',
      'Memb' => {
        '0' => {
          'name' => 'name_handle',
          'offset' => '0',
          'type' => '5573'
        },
        '1' => {
          'name' => 'read_only',
          'offset' => '2',
          'type' => '5123'
        },
        '2' => {
          'name' => 'string_type',
          'offset' => '3',
          'type' => '140'
        },
        '3' => {
          'name' => 'min_length',
          'offset' => '4',
          'type' => '5573'
        },
        '4' => {
          'name' => 'max_length',
          'offset' => '6',
          'type' => '5573'
        },
        '5' => {
          'name' => 'def_length',
          'offset' => '8',
          'type' => '5573'
        },
        '6' => {
          'name' => 'def_string',
          'offset' => '22',
          'type' => '13466'
        }
      },
      'Name' => 'struct pldm_bios_table_attr_entry_string_info',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '182898' => {
      'BaseType' => '182786',
      'Name' => 'struct pldm_bios_table_attr_entry_string_info const',
      'Size' => '24',
      'Type' => 'Const'
    },
    '182908' => {
      'Header' => 'bios_table.h',
      'Line' => '384',
      'Memb' => {
        '0' => {
          'name' => 'name_handle',
          'offset' => '0',
          'type' => '5573'
        },
        '1' => {
          'name' => 'read_only',
          'offset' => '2',
          'type' => '5123'
        },
        '2' => {
          'name' => 'lower_bound',
          'offset' => '8',
          'type' => '182229'
        },
        '3' => {
          'name' => 'upper_bound',
          'offset' => '22',
          'type' => '182229'
        },
        '4' => {
          'name' => 'scalar_increment',
          'offset' => '36',
          'type' => '152'
        },
        '5' => {
          'name' => 'default_value',
          'offset' => '50',
          'type' => '182229'
        }
      },
      'Name' => 'struct pldm_bios_table_attr_entry_integer_info',
      'Size' => '40',
      'Type' => 'Struct'
    },
    '183006' => {
      'BaseType' => '182908',
      'Name' => 'struct pldm_bios_table_attr_entry_integer_info const',
      'Size' => '40',
      'Type' => 'Const'
    },
    '183011' => {
      'BaseType' => '182154',
      'Header' => 'types.h',
      'Line' => '108',
      'Name' => 'ssize_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '183289' => {
      'Name' => 'ssize_t(*)(void const*)',
      'Param' => {
        '0' => {
          'type' => '5342'
        }
      },
      'Return' => '183011',
      'Size' => '8',
      'Type' => 'FuncPtr'
    },
    '183359' => {
      'Line' => '938',
      'Memb' => {
        '0' => {
          'name' => 'table_data',
          'offset' => '0',
          'type' => '6817'
        },
        '1' => {
          'name' => 'table_len',
          'offset' => '8',
          'type' => '453'
        },
        '2' => {
          'name' => 'current_pos',
          'offset' => '22',
          'type' => '453'
        },
        '3' => {
          'name' => 'entry_length_handler',
          'offset' => '36',
          'type' => '183289'
        }
      },
      'Name' => 'struct pldm_bios_table_iter',
      'PrivateABI' => 1,
      'Size' => '32',
      'Source' => 'bios_table.c',
      'Type' => 'Struct'
    },
    '183429' => {
      'BaseType' => '183359',
      'Name' => 'struct pldm_bios_table_iter const',
      'Size' => '32',
      'Type' => 'Const'
    },
    '184499' => {
      'BaseType' => '183359',
      'Name' => 'struct pldm_bios_table_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '184504' => {
      'BaseType' => '182604',
      'Name' => 'struct pldm_bios_attr_val_table_entry const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '184918' => {
      'BaseType' => '182547',
      'Name' => 'struct pldm_bios_attr_table_entry const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '185522' => {
      'BaseType' => '182461',
      'Name' => 'struct pldm_bios_string_table_entry const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '186685' => {
      'BaseType' => '183429',
      'Name' => 'struct pldm_bios_table_iter const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '190958' => {
      'BaseType' => '182229',
      'Name' => 'uint64_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '191235' => {
      'BaseType' => '183006',
      'Name' => 'struct pldm_bios_table_attr_entry_integer_info const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '191544' => {
      'BaseType' => '13466',
      'Name' => 'char const**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '192716' => {
      'BaseType' => '182898',
      'Name' => 'struct pldm_bios_table_attr_entry_string_info const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '194216' => {
      'BaseType' => '182764',
      'Name' => 'struct pldm_bios_table_attr_entry_enum_info const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '196434' => {
      'Header' => 'pldm_types.h',
      'Line' => '36',
      'Name' => 'anon-struct-pldm_types.h-36',
      'Size' => '2',
      'Type' => 'Struct'
    },
    '196698' => {
      'Header' => 'pldm_types.h',
      'Line' => '54',
      'Memb' => {
        '0' => {
          'name' => 'value',
          'offset' => '0',
          'type' => '5573'
        },
        '1' => {
          'name' => 'bits',
          'offset' => '0',
          'type' => '196434'
        }
      },
      'Name' => 'union bitfield16_t',
      'Size' => '2',
      'Type' => 'Union'
    },
    '196710' => {
      'Header' => 'pldm_types.h',
      'Line' => '58',
      'Name' => 'anon-struct-pldm_types.h-58',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '197198' => {
      'Header' => 'pldm_types.h',
      'Line' => '92',
      'Memb' => {
        '0' => {
          'name' => 'value',
          'offset' => '0',
          'type' => '152'
        },
        '1' => {
          'name' => 'bits',
          'offset' => '0',
          'type' => '196710'
        }
      },
      'Name' => 'union bitfield32_t',
      'Size' => '4',
      'Type' => 'Union'
    },
    '197210' => {
      'Header' => 'pldm_types.h',
      'Line' => '96',
      'Name' => 'anon-struct-pldm_types.h-96',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '198146' => {
      'Header' => 'pldm_types.h',
      'Line' => '162',
      'Memb' => {
        '0' => {
          'name' => 'value',
          'offset' => '0',
          'type' => '182229'
        },
        '1' => {
          'name' => 'bits',
          'offset' => '0',
          'type' => '197210'
        }
      },
      'Name' => 'union bitfield64_t',
      'Size' => '8',
      'Type' => 'Union'
    },
    '199960' => {
      'Header' => 'firmware_update.h',
      'Line' => '372',
      'Memb' => {
        '0' => {
          'name' => 'uuid',
          'offset' => '0',
          'type' => '200064'
        },
        '1' => {
          'name' => 'package_header_format_version',
          'offset' => '22',
          'type' => '140'
        },
        '2' => {
          'name' => 'package_header_size',
          'offset' => '23',
          'type' => '5573'
        },
        '3' => {
          'name' => 'package_release_date_time',
          'offset' => '25',
          'type' => '16675'
        },
        '4' => {
          'name' => 'component_bitmap_bit_length',
          'offset' => '50',
          'type' => '5573'
        },
        '5' => {
          'name' => 'package_version_string_type',
          'offset' => '52',
          'type' => '140'
        },
        '6' => {
          'name' => 'package_version_string_length',
          'offset' => '53',
          'type' => '140'
        }
      },
      'Name' => 'struct pldm_package_header_information',
      'Size' => '36',
      'Type' => 'Struct'
    },
    '200064' => {
      'BaseType' => '140',
      'Name' => 'uint8_t[16]',
      'Size' => '16',
      'Type' => 'Array'
    },
    '200096' => {
      'Header' => 'firmware_update.h',
      'Line' => '386',
      'Memb' => {
        '0' => {
          'name' => 'record_length',
          'offset' => '0',
          'type' => '5573'
        },
        '1' => {
          'name' => 'descriptor_count',
          'offset' => '2',
          'type' => '140'
        },
        '2' => {
          'name' => 'device_update_option_flags',
          'offset' => '3',
          'type' => '197198'
        },
        '3' => {
          'name' => 'comp_image_set_version_string_type',
          'offset' => '7',
          'type' => '140'
        },
        '4' => {
          'name' => 'comp_image_set_version_string_length',
          'offset' => '8',
          'type' => '140'
        },
        '5' => {
          'name' => 'fw_device_pkg_data_length',
          'offset' => '9',
          'type' => '5573'
        }
      },
      'Name' => 'struct pldm_firmware_device_id_record',
      'Size' => '11',
      'Type' => 'Struct'
    },
    '200291' => {
      'Header' => 'firmware_update.h',
      'Line' => '420',
      'Memb' => {
        '0' => {
          'name' => 'comp_classification',
          'offset' => '0',
          'type' => '5573'
        },
        '1' => {
          'name' => 'comp_identifier',
          'offset' => '2',
          'type' => '5573'
        },
        '2' => {
          'name' => 'comp_comparison_stamp',
          'offset' => '4',
          'type' => '152'
        },
        '3' => {
          'name' => 'comp_options',
          'offset' => '8',
          'type' => '196698'
        },
        '4' => {
          'name' => 'requested_comp_activation_method',
          'offset' => '16',
          'type' => '196698'
        },
        '5' => {
          'name' => 'comp_location_offset',
          'offset' => '18',
          'type' => '152'
        },
        '6' => {
          'name' => 'comp_size',
          'offset' => '22',
          'type' => '152'
        },
        '7' => {
          'name' => 'comp_version_string_type',
          'offset' => '32',
          'type' => '140'
        },
        '8' => {
          'name' => 'comp_version_string_length',
          'offset' => '33',
          'type' => '140'
        }
      },
      'Name' => 'struct pldm_component_image_information',
      'Size' => '22',
      'Type' => 'Struct'
    },
    '200473' => {
      'Header' => 'firmware_update.h',
      'Line' => '446',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '140'
        },
        '1' => {
          'name' => 'capabilities_during_update',
          'offset' => '1',
          'type' => '197198'
        },
        '2' => {
          'name' => 'comp_count',
          'offset' => '5',
          'type' => '5573'
        },
        '3' => {
          'name' => 'active_comp_image_set_ver_str_type',
          'offset' => '7',
          'type' => '140'
        },
        '4' => {
          'name' => 'active_comp_image_set_ver_str_len',
          'offset' => '8',
          'type' => '140'
        },
        '5' => {
          'name' => 'pending_comp_image_set_ver_str_type',
          'offset' => '9',
          'type' => '140'
        },
        '6' => {
          'name' => 'pending_comp_image_set_ver_str_len',
          'offset' => '16',
          'type' => '140'
        }
      },
      'Name' => 'struct pldm_get_firmware_parameters_resp',
      'Size' => '11',
      'Type' => 'Struct'
    },
    '200655' => {
      'Header' => 'firmware_update.h',
      'Line' => '474',
      'Memb' => {
        '0' => {
          'name' => 'comp_classification',
          'offset' => '0',
          'type' => '5573'
        },
        '1' => {
          'name' => 'comp_identifier',
          'offset' => '2',
          'type' => '5573'
        },
        '2' => {
          'name' => 'comp_classification_index',
          'offset' => '4',
          'type' => '140'
        },
        '3' => {
          'name' => 'active_comp_comparison_stamp',
          'offset' => '5',
          'type' => '152'
        },
        '4' => {
          'name' => 'active_comp_ver_str_type',
          'offset' => '9',
          'type' => '140'
        },
        '5' => {
          'name' => 'active_comp_ver_str_len',
          'offset' => '16',
          'type' => '140'
        },
        '6' => {
          'name' => 'active_comp_release_date',
          'offset' => '17',
          'type' => '200837'
        },
        '7' => {
          'name' => 'pending_comp_comparison_stamp',
          'offset' => '25',
          'type' => '152'
        },
        '8' => {
          'name' => 'pending_comp_ver_str_type',
          'offset' => '35',
          'type' => '140'
        },
        '9' => {
          'name' => 'pending_comp_ver_str_len',
          'offset' => '36',
          'type' => '140'
        },
        '10' => {
          'name' => 'pending_comp_release_date',
          'offset' => '37',
          'type' => '200837'
        },
        '11' => {
          'name' => 'comp_activation_methods',
          'offset' => '51',
          'type' => '196698'
        },
        '12' => {
          'name' => 'capabilities_during_update',
          'offset' => '53',
          'type' => '197198'
        }
      },
      'Name' => 'struct pldm_component_parameter_entry',
      'Size' => '39',
      'Type' => 'Struct'
    },
    '200837' => {
      'BaseType' => '140',
      'Name' => 'uint8_t[8]',
      'Size' => '8',
      'Type' => 'Array'
    },
    '201775' => {
      'BaseType' => '6778',
      'Name' => 'struct variable_field const',
      'Size' => '16',
      'Type' => 'Const'
    },
    '202113' => {
      'BaseType' => '12849',
      'Name' => 'bool8_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '202118' => {
      'BaseType' => '198146',
      'Name' => 'bitfield64_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '202875' => {
      'BaseType' => '197198',
      'Name' => 'bitfield32_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '203727' => {
      'BaseType' => '196698',
      'Name' => 'bitfield16_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '205285' => {
      'BaseType' => '201775',
      'Name' => 'struct variable_field const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '211581' => {
      'BaseType' => '200655',
      'Name' => 'struct pldm_component_parameter_entry*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '211806' => {
      'BaseType' => '200473',
      'Name' => 'struct pldm_get_firmware_parameters_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '212107' => {
      'BaseType' => '2076',
      'Name' => 'uint8_t**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '212404' => {
      'BaseType' => '200291',
      'Name' => 'struct pldm_component_image_information*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '213020' => {
      'BaseType' => '200096',
      'Name' => 'struct pldm_firmware_device_id_record*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '213330' => {
      'BaseType' => '199960',
      'Name' => 'struct pldm_package_header_information*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '221432' => {
      'BaseType' => '221449',
      'Header' => 'pdr.h',
      'Line' => '16',
      'Name' => 'pldm_pdr',
      'PrivateABI' => 1,
      'Size' => '24',
      'Type' => 'Typedef'
    },
    '221444' => {
      'BaseType' => '221432',
      'Name' => 'pldm_pdr const',
      'Size' => '24',
      'Type' => 'Const'
    },
    '221449' => {
      'Line' => '25',
      'Memb' => {
        '0' => {
          'name' => 'record_count',
          'offset' => '0',
          'type' => '152'
        },
        '1' => {
          'name' => 'size',
          'offset' => '4',
          'type' => '152'
        },
        '2' => {
          'name' => 'first',
          'offset' => '8',
          'type' => '222540'
        },
        '3' => {
          'name' => 'last',
          'offset' => '22',
          'type' => '222540'
        }
      },
      'Name' => 'struct pldm_pdr',
      'PrivateABI' => 1,
      'Size' => '24',
      'Source' => 'pdr.c',
      'Type' => 'Struct'
    },
    '221515' => {
      'BaseType' => '221532',
      'Header' => 'pdr.h',
      'Line' => '21',
      'Name' => 'pldm_pdr_record',
      'PrivateABI' => 1,
      'Size' => '32',
      'Type' => 'Typedef'
    },
    '221527' => {
      'BaseType' => '221515',
      'Name' => 'pldm_pdr_record const',
      'Size' => '32',
      'Type' => 'Const'
    },
    '221532' => {
      'Line' => '16',
      'Memb' => {
        '0' => {
          'name' => 'record_handle',
          'offset' => '0',
          'type' => '152'
        },
        '1' => {
          'name' => 'size',
          'offset' => '4',
          'type' => '152'
        },
        '2' => {
          'name' => 'data',
          'offset' => '8',
          'type' => '2076'
        },
        '3' => {
          'name' => 'next',
          'offset' => '22',
          'type' => '222528'
        },
        '4' => {
          'name' => 'is_remote',
          'offset' => '36',
          'type' => '5123'
        },
        '5' => {
          'name' => 'terminus_handle',
          'offset' => '38',
          'type' => '5573'
        }
      },
      'Name' => 'struct pldm_pdr_record',
      'PrivateABI' => 1,
      'Size' => '32',
      'Source' => 'pdr.c',
      'Type' => 'Struct'
    },
    '221624' => {
      'Header' => 'pdr.h',
      'Line' => '275',
      'Memb' => {
        '0' => {
          'name' => 'entity_type',
          'offset' => '0',
          'type' => '5573'
        },
        '1' => {
          'name' => 'entity_instance_num',
          'offset' => '2',
          'type' => '5573'
        },
        '2' => {
          'name' => 'entity_container_id',
          'offset' => '4',
          'type' => '5573'
        }
      },
      'Name' => 'struct pldm_entity',
      'Size' => '6',
      'Type' => 'Struct'
    },
    '221681' => {
      'BaseType' => '221624',
      'Header' => 'pdr.h',
      'Line' => '279',
      'Name' => 'pldm_entity',
      'Size' => '6',
      'Type' => 'Typedef'
    },
    '221725' => {
      'BaseType' => '221737',
      'Header' => 'pdr.h',
      'Line' => '289',
      'Name' => 'pldm_entity_association_tree',
      'PrivateABI' => 1,
      'Size' => '16',
      'Type' => 'Typedef'
    },
    '221737' => {
      'Line' => '440',
      'Memb' => {
        '0' => {
          'name' => 'root',
          'offset' => '0',
          'type' => '222545'
        },
        '1' => {
          'name' => 'last_used_container_id',
          'offset' => '8',
          'type' => '5573'
        }
      },
      'Name' => 'struct pldm_entity_association_tree',
      'PrivateABI' => 1,
      'Size' => '16',
      'Source' => 'pdr.c',
      'Type' => 'Struct'
    },
    '221780' => {
      'BaseType' => '221797',
      'Header' => 'pdr.h',
      'Line' => '294',
      'Name' => 'pldm_entity_node',
      'PrivateABI' => 1,
      'Size' => '40',
      'Type' => 'Typedef'
    },
    '221792' => {
      'BaseType' => '221780',
      'Name' => 'pldm_entity_node const',
      'Size' => '40',
      'Type' => 'Const'
    },
    '221797' => {
      'Line' => '445',
      'Memb' => {
        '0' => {
          'name' => 'entity',
          'offset' => '0',
          'type' => '221681'
        },
        '1' => {
          'name' => 'parent',
          'offset' => '6',
          'type' => '221681'
        },
        '2' => {
          'name' => 'remote_container_id',
          'offset' => '18',
          'type' => '5573'
        },
        '3' => {
          'name' => 'first_child',
          'offset' => '22',
          'type' => '222545'
        },
        '4' => {
          'name' => 'next_sibling',
          'offset' => '36',
          'type' => '222545'
        },
        '5' => {
          'name' => 'association_type',
          'offset' => '50',
          'type' => '140'
        }
      },
      'Name' => 'struct pldm_entity_node',
      'PrivateABI' => 1,
      'Size' => '40',
      'Source' => 'pdr.c',
      'Type' => 'Struct'
    },
    '222528' => {
      'BaseType' => '221532',
      'Name' => 'struct pldm_pdr_record*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '222540' => {
      'BaseType' => '221515',
      'Name' => 'pldm_pdr_record*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '222545' => {
      'BaseType' => '221780',
      'Name' => 'pldm_entity_node*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '227410' => {
      'BaseType' => '221432',
      'Name' => 'pldm_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '227415' => {
      'BaseType' => '221681',
      'Name' => 'pldm_entity*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '235282' => {
      'BaseType' => '227415',
      'Name' => 'pldm_entity**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '235346' => {
      'BaseType' => '221725',
      'Name' => 'pldm_entity_association_tree*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '235793' => {
      'BaseType' => '222545',
      'Name' => 'pldm_entity_node**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '236582' => {
      'BaseType' => '221444',
      'Name' => 'pldm_pdr const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '241918' => {
      'BaseType' => '221792',
      'Name' => 'pldm_entity_node const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '243082' => {
      'BaseType' => '221527',
      'Name' => 'pldm_pdr_record const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '247270' => {
      'BaseType' => '140',
      'Header' => 'base.h',
      'Line' => '16',
      'Name' => 'pldm_tid_t',
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '247282' => {
      'BaseType' => '140',
      'Header' => 'instance-id.h',
      'Line' => '13',
      'Name' => 'pldm_instance_id_t',
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '247294' => {
      'Header' => 'responder.h',
      'Line' => '10',
      'Memb' => {
        '0' => {
          'name' => 'tid',
          'offset' => '0',
          'type' => '247270'
        },
        '1' => {
          'name' => 'instance_id',
          'offset' => '1',
          'type' => '247282'
        },
        '2' => {
          'name' => 'type',
          'offset' => '2',
          'type' => '140'
        },
        '3' => {
          'name' => 'command',
          'offset' => '3',
          'type' => '140'
        },
        '4' => {
          'name' => 'next',
          'offset' => '8',
          'type' => '247374'
        }
      },
      'Name' => 'struct pldm_responder_cookie',
      'PrivateABI' => 1,
      'Size' => '16',
      'Type' => 'Struct'
    },
    '247374' => {
      'BaseType' => '247294',
      'Name' => 'struct pldm_responder_cookie*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '247379' => {
      'Header' => 'pldm.h',
      'Line' => '15',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_REQUESTER_SUCCESS',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_REQUESTER_OPEN_FAIL',
          'value' => '18446744073709551615 (-1)'
        },
        '2' => {
          'name' => 'PLDM_REQUESTER_NOT_PLDM_MSG',
          'value' => '18446744073709551614 (-2)'
        },
        '3' => {
          'name' => 'PLDM_REQUESTER_NOT_RESP_MSG',
          'value' => '18446744073709551613 (-3)'
        },
        '4' => {
          'name' => 'PLDM_REQUESTER_NOT_REQ_MSG',
          'value' => '18446744073709551612 (-4)'
        },
        '5' => {
          'name' => 'PLDM_REQUESTER_RESP_MSG_TOO_SMALL',
          'value' => '18446744073709551611 (-5)'
        },
        '6' => {
          'name' => 'PLDM_REQUESTER_INSTANCE_ID_MISMATCH',
          'value' => '18446744073709551610 (-6)'
        },
        '7' => {
          'name' => 'PLDM_REQUESTER_SEND_FAIL',
          'value' => '18446744073709551609 (-7)'
        },
        '8' => {
          'name' => 'PLDM_REQUESTER_RECV_FAIL',
          'value' => '18446744073709551608 (-8)'
        },
        '9' => {
          'name' => 'PLDM_REQUESTER_INVALID_RECV_LEN',
          'value' => '18446744073709551607 (-9)'
        },
        '10' => {
          'name' => 'PLDM_REQUESTER_SETUP_FAIL',
          'value' => '18446744073709551606 (-10)'
        },
        '11' => {
          'name' => 'PLDM_REQUESTER_INVALID_SETUP',
          'value' => '18446744073709551605 (-11)'
        },
        '12' => {
          'name' => 'PLDM_REQUESTER_POLL_FAIL',
          'value' => '18446744073709551604 (-12)'
        },
        '13' => {
          'name' => 'PLDM_REQUESTER_TRANSPORT_BUSY',
          'value' => '18446744073709551603 (-13)'
        }
      },
      'Name' => 'enum pldm_requester_error_codes',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '250314' => {
      'Line' => '20',
      'Memb' => {
        '0' => {
          'name' => 'prev',
          'offset' => '0',
          'type' => '247282'
        },
        '1' => {
          'name' => 'allocations',
          'offset' => '4',
          'type' => '152'
        }
      },
      'Name' => 'struct pldm_tid_state',
      'PrivateABI' => 1,
      'Size' => '8',
      'Source' => 'instance-id.c',
      'Type' => 'Struct'
    },
    '250353' => {
      'Line' => '25',
      'Memb' => {
        '0' => {
          'name' => 'state',
          'offset' => '0',
          'type' => '250395'
        },
        '1' => {
          'name' => 'lock_db_fd',
          'offset' => '8264',
          'type' => '100'
        }
      },
      'Name' => 'struct pldm_instance_db',
      'PrivateABI' => 1,
      'Size' => '2052',
      'Source' => 'instance-id.c',
      'Type' => 'Struct'
    },
    '250395' => {
      'BaseType' => '250314',
      'Name' => 'struct pldm_tid_state[256]',
      'Size' => '2048',
      'Type' => 'Array'
    },
    '250865' => {
      'BaseType' => '250353',
      'Name' => 'struct pldm_instance_db*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '251290' => {
      'BaseType' => '247282',
      'Name' => 'pldm_instance_id_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '251466' => {
      'BaseType' => '250865',
      'Name' => 'struct pldm_instance_db**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '252223' => {
      'BaseType' => '140',
      'Header' => 'pldm.h',
      'Line' => '13',
      'Name' => 'mctp_eid_t',
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '252338' => {
      'BaseType' => '247379',
      'Header' => 'pldm.h',
      'Line' => '30',
      'Name' => 'pldm_requester_rc_t',
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '252356' => {
      'Line' => '25',
      'Memb' => {
        '0' => {
          'name' => 'transport',
          'offset' => '0',
          'type' => '252429'
        },
        '1' => {
          'name' => 'socket',
          'offset' => '64',
          'type' => '100'
        },
        '2' => {
          'name' => 'tid_eid_map',
          'offset' => '68',
          'type' => '256061'
        },
        '3' => {
          'name' => 'socket_send_buf',
          'offset' => '768',
          'type' => '255010'
        }
      },
      'Name' => 'struct pldm_transport_mctp_demux',
      'PrivateABI' => 1,
      'Size' => '312',
      'Source' => 'mctp-demux.c',
      'Type' => 'Struct'
    },
    '252382' => {
      'BaseType' => '252356',
      'Name' => 'struct pldm_transport_mctp_demux*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '252424' => {
      'BaseType' => '252429',
      'Name' => 'struct pldm_transport*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '252429' => {
      'Header' => 'transport.h',
      'Line' => '18',
      'Memb' => {
        '0' => {
          'name' => 'name',
          'offset' => '0',
          'type' => '13466'
        },
        '1' => {
          'name' => 'version',
          'offset' => '8',
          'type' => '140'
        },
        '2' => {
          'name' => 'recv',
          'offset' => '22',
          'type' => '255321'
        },
        '3' => {
          'name' => 'send',
          'offset' => '36',
          'type' => '255362'
        },
        '4' => {
          'name' => 'init_pollfd',
          'offset' => '50',
          'type' => '255442'
        }
      },
      'Name' => 'struct pldm_transport',
      'PrivateABI' => 1,
      'Size' => '40',
      'Type' => 'Struct'
    },
    '252565' => {
      'BaseType' => '247270',
      'Name' => 'pldm_tid_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '252668' => {
      'BaseType' => '252382',
      'Name' => 'struct pldm_transport_mctp_demux**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '254730' => {
      'BaseType' => '46',
      'Header' => 'int-ll64.h',
      'Line' => '21',
      'Name' => '__u8',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '254742' => {
      'BaseType' => '53',
      'Header' => 'int-ll64.h',
      'Line' => '24',
      'Name' => '__u16',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '255010' => {
      'Header' => 'socket.h',
      'Line' => '5',
      'Memb' => {
        '0' => {
          'name' => 'size',
          'offset' => '0',
          'type' => '100'
        },
        '1' => {
          'name' => 'socket',
          'offset' => '4',
          'type' => '100'
        },
        '2' => {
          'name' => 'max_size',
          'offset' => '8',
          'type' => '100'
        }
      },
      'Name' => 'struct pldm_socket_sndbuf',
      'PrivateABI' => 1,
      'Size' => '12',
      'Type' => 'Struct'
    },
    '255321' => {
      'Name' => 'pldm_requester_rc_t(*)(struct pldm_transport*, pldm_tid_t*, void**, size_t*)',
      'Param' => {
        '0' => {
          'type' => '252424'
        },
        '1' => {
          'type' => '252565'
        },
        '2' => {
          'type' => '65866'
        },
        '3' => {
          'type' => '9819'
        }
      },
      'Return' => '252338',
      'Size' => '8',
      'Type' => 'FuncPtr'
    },
    '255362' => {
      'Name' => 'pldm_requester_rc_t(*)(struct pldm_transport*, pldm_tid_t, void const*, size_t)',
      'Param' => {
        '0' => {
          'type' => '252424'
        },
        '1' => {
          'type' => '247270'
        },
        '2' => {
          'type' => '5342'
        },
        '3' => {
          'type' => '453'
        }
      },
      'Return' => '252338',
      'Size' => '8',
      'Type' => 'FuncPtr'
    },
    '255387' => {
      'BaseType' => '255392',
      'Name' => 'struct pollfd*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '255392' => {
      'Header' => 'poll.h',
      'Line' => '36',
      'Memb' => {
        '0' => {
          'name' => 'fd',
          'offset' => '0',
          'type' => '100'
        },
        '1' => {
          'name' => 'events',
          'offset' => '4',
          'type' => '93'
        },
        '2' => {
          'name' => 'revents',
          'offset' => '6',
          'type' => '93'
        }
      },
      'Name' => 'struct pollfd',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Struct'
    },
    '255442' => {
      'Name' => 'int(*)(struct pldm_transport*, struct pollfd*)',
      'Param' => {
        '0' => {
          'type' => '252424'
        },
        '1' => {
          'type' => '255387'
        }
      },
      'Return' => '100',
      'Size' => '8',
      'Type' => 'FuncPtr'
    },
    '255447' => {
      'BaseType' => '53',
      'Header' => 'socket.h',
      'Line' => '10',
      'Name' => '__kernel_sa_family_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '255795' => {
      'Header' => 'mctp.h',
      'Line' => '18',
      'Memb' => {
        '0' => {
          'name' => 's_addr',
          'offset' => '0',
          'type' => '252223'
        }
      },
      'Name' => 'struct mctp_addr',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Struct'
    },
    '255821' => {
      'Header' => 'mctp.h',
      'Line' => '22',
      'Memb' => {
        '0' => {
          'name' => 'smctp_family',
          'offset' => '0',
          'type' => '255447'
        },
        '1' => {
          'name' => '__smctp_pad0',
          'offset' => '2',
          'type' => '254742'
        },
        '2' => {
          'name' => 'smctp_network',
          'offset' => '4',
          'type' => '60'
        },
        '3' => {
          'name' => 'smctp_addr',
          'offset' => '8',
          'type' => '255795'
        },
        '4' => {
          'name' => 'smctp_type',
          'offset' => '9',
          'type' => '254730'
        },
        '5' => {
          'name' => 'smctp_tag',
          'offset' => '16',
          'type' => '254730'
        },
        '6' => {
          'name' => '__smctp_pad1',
          'offset' => '17',
          'type' => '254730'
        }
      },
      'Name' => 'struct sockaddr_mctp',
      'PrivateABI' => 1,
      'Size' => '12',
      'Type' => 'Struct'
    },
    '255925' => {
      'BaseType' => '255821',
      'Name' => 'struct sockaddr_mctp const',
      'Size' => '12',
      'Type' => 'Const'
    },
    '255968' => {
      'Line' => '34',
      'Memb' => {
        '0' => {
          'name' => 'transport',
          'offset' => '0',
          'type' => '252429'
        },
        '1' => {
          'name' => 'socket',
          'offset' => '64',
          'type' => '100'
        },
        '2' => {
          'name' => 'tid_eid_map',
          'offset' => '68',
          'type' => '256061'
        },
        '3' => {
          'name' => 'socket_send_buf',
          'offset' => '768',
          'type' => '255010'
        },
        '4' => {
          'name' => 'bound',
          'offset' => '786',
          'type' => '5123'
        },
        '5' => {
          'name' => 'cookie_jar',
          'offset' => '800',
          'type' => '247294'
        }
      },
      'Name' => 'struct pldm_transport_af_mctp',
      'PrivateABI' => 1,
      'Size' => '336',
      'Source' => 'af-mctp.c',
      'Type' => 'Struct'
    },
    '256061' => {
      'BaseType' => '247270',
      'Name' => 'pldm_tid_t[256]',
      'Size' => '256',
      'Type' => 'Array'
    },
    '256877' => {
      'BaseType' => '255968',
      'Name' => 'struct pldm_transport_af_mctp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '256882' => {
      'BaseType' => '255925',
      'Name' => 'struct sockaddr_mctp const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '257195' => {
      'BaseType' => '256877',
      'Name' => 'struct pldm_transport_af_mctp**',
      'Size' => '8',
      'Type' => 'Pointer'
    }
  },
  'UndefinedSymbols' => {
    'libpldm.so.0.8.0' => {
      '_ITM_deregisterTMCloneTable' => 0,
      '_ITM_registerTMCloneTable' => 0,
      '__assert_fail@GLIBC_2.2.5' => 0,
      '__cxa_finalize@GLIBC_2.2.5' => 0,
      '__errno_location@GLIBC_2.2.5' => 0,
      '__gmon_start__' => 0,
      '__memcpy_chk@GLIBC_2.3.4' => 0,
      '__recv_chk@GLIBC_2.4' => 0,
      '__recvfrom_chk@GLIBC_2.4' => 0,
      '__stack_chk_fail@GLIBC_2.4' => 0,
      'bind@GLIBC_2.2.5' => 0,
      'calloc@GLIBC_2.2.5' => 0,
      'clock_gettime@GLIBC_2.17' => 0,
      'close@GLIBC_2.2.5' => 0,
      'connect@GLIBC_2.2.5' => 0,
      'dup@GLIBC_2.2.5' => 0,
      'fclose@GLIBC_2.2.5' => 0,
      'fcntl64@GLIBC_2.28' => 0,
      'fgets@GLIBC_2.2.5' => 0,
      'fopen64@GLIBC_2.2.5' => 0,
      'free@GLIBC_2.2.5' => 0,
      'getsockopt@GLIBC_2.2.5' => 0,
      'malloc@GLIBC_2.2.5' => 0,
      'memcmp@GLIBC_2.2.5' => 0,
      'memcpy@GLIBC_2.14' => 0,
      'open64@GLIBC_2.2.5' => 0,
      'poll@GLIBC_2.2.5' => 0,
      'ppoll@GLIBC_2.4' => 0,
      'recv@GLIBC_2.2.5' => 0,
      'recvmsg@GLIBC_2.2.5' => 0,
      'sendmsg@GLIBC_2.2.5' => 0,
      'sendto@GLIBC_2.2.5' => 0,
      'setsockopt@GLIBC_2.2.5' => 0,
      'socket@GLIBC_2.2.5' => 0,
      'stat64@GLIBC_2.33' => 0,
      'strlen@GLIBC_2.2.5' => 0,
      'strtol@GLIBC_2.2.5' => 0,
      'timerfd_create@GLIBC_2.8' => 0,
      'timerfd_settime@GLIBC_2.8' => 0,
      'write@GLIBC_2.2.5' => 0
    }
  },
  'WordSize' => '8'
};
