$VAR1 = {
  'ABI_DUMPER_VERSION' => '1.4',
  'ABI_DUMP_VERSION' => '3.5',
  'Arch' => 'x86_64',
  'GccVersion' => '14.2.0',
  'Headers' => {
    'af-mctp.h' => 1,
    'base.h' => 1,
    'bcd.h' => 1,
    'bios.h' => 1,
    'bios_table.h' => 1,
    'edac.h' => 1,
    'file.h' => 1,
    'file_io.h' => 1,
    'firmware_update.h' => 1,
    'fru.h' => 1,
    'host.h' => 1,
    'instance-id.h' => 1,
    'mctp-demux.h' => 1,
    'pdr.h' => 1,
    'platform.h' => 1,
    'pldm.h' => 1,
    'pldm_types.h' => 1,
    'transport.h' => 1
  },
  'Language' => 'C',
  'LibraryName' => 'libpldm.so.0.17.0',
  'LibraryVersion' => '0.17.0',
  'NameSpaces' => {},
  'Needed' => {
    'libc.so.6' => 1
  },
  'PublicABI' => '1',
  'Sources' => {
    'bios_table.c' => 1,
    'instance-id.c' => 1,
    'mctp-demux.c' => 1,
    'pdr.c' => 1
  },
  'SymbolInfo' => {
    '181' => {
      'Header' => 'bcd.h',
      'Line' => '44',
      'Param' => {
        '0' => {
          'name' => 'dec',
          'type' => '169'
        }
      },
      'Return' => '169',
      'ShortName' => 'pldm_bcd_dec2bcd32'
    },
    '310' => {
      'Header' => 'bcd.h',
      'Line' => '38',
      'Param' => {
        '0' => {
          'name' => 'bcd',
          'type' => '169'
        }
      },
      'Return' => '169',
      'ShortName' => 'pldm_bcd_bcd2dec32'
    },
    '413' => {
      'Header' => 'bcd.h',
      'Line' => '32',
      'Param' => {
        '0' => {
          'name' => 'dec',
          'type' => '157'

      'pldm_entity_association_tree_find' => 1,
      'pldm_entity_association_tree_find_with_locality' => 1,
      'pldm_entity_association_tree_init' => 1,
      'pldm_entity_association_tree_visit' => 1,
      'pldm_entity_extract' => 1,
      'pldm_entity_get_num_children' => 1,
      'pldm_entity_get_parent' => 1,
      'pldm_entity_is_exist_parent' => 1,
      'pldm_entity_is_node_parent' => 1,
      'pldm_entity_node_get_remote_container_id' => 1,
      'pldm_find_entity_ref_in_tree' => 1,
      'pldm_instance_db_destroy' => 1,
      'pldm_instance_db_init' => 1,
      'pldm_instance_db_init_default' => 1,
      'pldm_instance_id_alloc' => 1,
      'pldm_instance_id_free' => 1,
      'pldm_is_current_parent_child' => 1,
      'pldm_is_empty_entity_assoc_tree' => 1,
      'pldm_msg_hdr_correlate_response' => 1,
      'pldm_oem_meta_file_io_read_resp_data' => 1,
      'pldm_oem_meta_file_io_write_req_data' => 1,
      'pldm_package_component_image_information_iter_init' => 1,
      'pldm_package_downstream_device_id_record_iter_init' => 1,
      'pldm_package_firmware_device_id_record_iter_init' => 1,
      'pldm_pdr_add' => 1,
      'pldm_pdr_add_fru_record_set' => 1,
      'pldm_pdr_delete_by_effecter_id' => 1,
      'pldm_pdr_delete_by_record_handle' => 1,
      'pldm_pdr_delete_by_sensor_id' => 1,
      'pldm_pdr_destroy' => 1,
      'pldm_pdr_find_last_in_range' => 1,
      'pldm_pdr_find_record' => 1,
      'pldm_pdr_find_record_by_type' => 1,
      'pldm_pdr_fru_record_set_find_by_rsi' => 1,
      'pldm_pdr_get_next_record' => 1,
      'pldm_pdr_get_record_count' => 1,
      'pldm_pdr_get_record_handle' => 1,
      'pldm_pdr_get_repo_size' => 1,
      'pldm_pdr_init' => 1,
      'pldm_pdr_record_is_remote' => 1,
      'pldm_pdr_remove_fru_record_set_by_rsi' => 1,
      'pldm_pdr_remove_pdrs_by_terminus_handle' => 1,
      'pldm_pdr_remove_remote_pdrs' => 1,
      'pldm_pdr_update_TL_pdr' => 1,
      'pldm_platform_cper_event_event_data' => 1,
      'pldm_platform_state_effecter_pdr_iter_init' => 1,
      'pldm_platform_state_effecter_pdr_possible_states_iter_init' => 1,
      'pldm_transport_af_mctp_bind' => 1,
      'pldm_transport_af_mctp_core' => 1,
      'pldm_transport_af_mctp_destroy' => 1,
      'pldm_transport_af_mctp_init' => 1,
      'pldm_transport_af_mctp_init_pollfd' => 1,
      'pldm_transport_af_mctp_map_tid' => 1,
      'pldm_transport_af_mctp_map_tid_fqe' => 1,
      'pldm_transport_af_mctp_unmap_tid' => 1,
      'pldm_transport_af_mctp_unmap_tid_fqe' => 1,
      'pldm_transport_mctp_demux_core' => 1,
      'pldm_transport_mctp_demux_destroy' => 1,
      'pldm_transport_mctp_demux_init' => 1,
      'pldm_transport_mctp_demux_init_pollfd' => 1,
      'pldm_transport_mctp_demux_map_tid' => 1,
      'pldm_transport_mctp_demux_unmap_tid' => 1,
      'pldm_transport_poll' => 1,
      'pldm_transport_recv_msg' => 1,
      'pldm_transport_send_msg' => 1,
      'pldm_transport_send_recv_msg' => 1,
      'unpack_pldm_header' => 1
    }
  },
  'Target' => 'unix',
  'TypeInfo' => {
    '1' => {
      'Name' => 'void',
      'Type' => 'Intrinsic'
    },
    '46' => {
      'Name' => 'unsigned char',
      'Size' => '1',
      'Type' => 'Intrinsic'
    },
    '53' => {
      'Name' => 'unsigned short',
      'Size' => '2',
      'Type' => 'Intrinsic'
    },
    '60' => {
      'Name' => 'unsigned int',
      'Size' => '4',
      'Type' => 'Intrinsic'
    },
    '67' => {
      'Name' => 'unsigned long',
      'Size' => '8',
      'Type' => 'Intrinsic'
    },
    '74' => {
      'Name' => 'signed char',
      'Size' => '1',
      'Type' => 'Intrinsic'
    },
    '81' => {
      'BaseType' => '46',
      'Header' => 'types.h',
      'Line' => '38',
      'Name' => '__uint8_t',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '93' => {
      'Name' => 'short',
      'Size' => '2',
      'Type' => 'Intrinsic'
    },
    '100' => {
      'BaseType' => '53',
      'Header' => 'types.h',
      'Line' => '40',
      'Name' => '__uint16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '112' => {
      'Name' => 'int',
      'Size' => '4',
      'Type' => 'Intrinsic'
    },
    '119' => {
      'BaseType' => '60',
      'Header' => 'types.h',
      'Line' => '42',
      'Name' => '__uint32_t',
      'PrivateABI' => 1,
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '131' => {
      'Name' => 'long',
      'Size' => '8',
      'Type' => 'Intrinsic'
    },
    '138' => {
      'Name' => 'char',
      'Size' => '1',
      'Type' => 'Intrinsic'
    },
    '145' => {
      'BaseType' => '81',
      'Header' => 'stdint-uintn.h',
      'Line' => '24',
      'Name' => 'uint8_t',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '157' => {
      'BaseType' => '100',
      'Header' => 'stdint-uintn.h',
      'Line' => '25',
      'Name' => 'uint16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '169' => {
      'BaseType' => '119',
      'Header' => 'stdint-uintn.h',
      'Line' => '26',
      'Name' => 'uint32_t',
      'PrivateABI' => 1,
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '862' => {
      'BaseType' => '1',
      'Name' => 'void*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '895' => {
      'BaseType' => '169',
      'Name' => 'uint32_t const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '900' => {
      'BaseType' => '67',
      'Header' => 'stddef.h',
      'Line' => '214',
      'Name' => 'size_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '947' => {
      'Header' => 'pldm_types.h',
      'Line' => '14',
      'Name' => 'struct bits8',
      'Size' => '1',
      'Type' => 'Struct'
    },
    '1105' => {
      'Header' => 'pldm_types.h',
      'Line' => '24',
      'Memb' => {
        '0' => {
          'name' => 'byte',
          'offset' => '0',
          'type' => '145'
        },
        '1' => {
          'name' => 'bits',
          'offset' => '0',
          'type' => '947'
        }
      },
      'Name' => 'union bitfield8_t',
      'Size' => '1',
      'Type' => 'Union'
    },
    '1117' => {
      'BaseType' => '1105',
      'Name' => 'bitfield8_t const',
      'Size' => '1',
      'Type' => 'Const'
    },
    '1122' => {
      'Header' => 'pldm_types.h',
      'Line' => '30',
      'Memb' => {
        '0' => {
          'name' => 'alpha',
          'offset' => '0',
          'type' => '145'
        },
        '1' => {
          'name' => 'update',
          'offset' => '1',
          'type' => '145'
        },
        '2' => {
          'name' => 'minor',
          'offset' => '2',
          'type' => '145'
        },
        '3' => {
          'name' => 'major',
          'offset' => '3',
          'type' => '145'
        }
      },
      'Name' => 'struct pldm_version',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '1188' => {
      'BaseType' => '1122',
      'Header' => 'pldm_types.h',
      'Line' => '35',
      'Name' => 'ver32_t',
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '1200' => {
      'BaseType' => '1188',
      'Name' => 'ver32_t const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '1205' => {
      'Name' => 'float',
      'Size' => '4',
      'Type' => 'Intrinsic'
    },
    '1625' => {
      'Header' => 'base.h',
      'Line' => '137',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_RESPONSE',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_REQUEST',
          'value' => '1'
        },
        '2' => {
          'name' => 'PLDM_RESERVED',
          'value' => '2'
        },
        '3' => {
          'name' => 'PLDM_ASYNC_REQUEST_NOTIFY',
          'value' => '3'
        }
      },
      'Name' => 'enum MessageType',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '1637' => {
      'Header' => 'base.h',
      'Line' => '190',
      'Memb' => {
        '0' => {
          'name' => 'command',
          'offset' => '2',
          'type' => '145'
        }
      },
      'Name' => 'struct pldm_msg_hdr',
      'Size' => '3',
      'Type' => 'Struct'
    },
    '1748' => {
      'BaseType' => '1637',
      'Name' => 'struct pldm_msg_hdr const',
      'Size' => '3',
      'Type' => 'Const'
    },
    '1753' => {
      'Header' => 'base.h',
      'Line' => '217',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '1637'
        },
        '1' => {
          'name' => 'payload',
          'offset' => '3',
          'type' => '1798'
        }
      },
      'Name' => 'struct pldm_msg',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '1793' => {
      'BaseType' => '1753',
      'Name' => 'struct pldm_msg const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '1798' => {
      'BaseType' => '145',
      'Name' => 'uint8_t[1]',
      'Size' => '1',
      'Type' => 'Array'
    },
    '1814' => {
      'Header' => 'base.h',
      'Line' => '297',
      'Memb' => {
        '0' => {
          'name' => 'msg_type',
          'offset' => '0',
          'type' => '1625'
        },
        '1' => {
          'name' => 'instance',
          'offset' => '4',
          'type' => '145'
        },
        '2' => {
          'name' => 'pldm_type',
          'offset' => '5',
          'type' => '145'
        },
        '3' => {
          'name' => 'command',
          'offset' => '6',
          'type' => '145'
        },
        '4' => {
          'name' => 'completion_code',
          'offset' => '7',
          'type' => '145'
        }
      },
      'Name' => 'struct pldm_header_info',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '1892' => {
      'BaseType' => '1814',
      'Name' => 'struct pldm_header_info const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '1897' => {
      'BaseType' => '1105',
      'Name' => 'bitfield8_t[8]',
      'Size' => '8',
      'Type' => 'Array'
    },
    '1913' => {
      'Header' => 'base.h',
      'Line' => '920',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '145'
        },
        '1' => {
          'name' => 'tid',
          'offset' => '1',
          'type' => '145'
        }
      },
      'Name' => 'struct pldm_base_get_tid_resp',
      'Size' => '2',
      'Type' => 'Struct'
    },
    '1953' => {
      'BaseType' => '1913',
      'Name' => 'struct pldm_base_get_tid_resp const',
      'Size' => '2',
      'Type' => 'Const'
    },
    '1958' => {
      'Header' => 'base.h',
      'Line' => '963',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '145'
        },
        '1' => {
          'name' => 'pldm_types',
          'offset' => '1',
          'type' => '1897'
        }
      },
      'Name' => 'struct pldm_base_get_pldm_types_resp',
      'Size' => '9',
      'Type' => 'Struct'
    },
    '1997' => {
      'BaseType' => '1958',
      'Name' => 'struct pldm_base_get_pldm_types_resp const',
      'Size' => '9',
      'Type' => 'Const'
    },
    '2148' => {
      'BaseType' => '2153',
      'Name' => 'void const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2153' => {
      'BaseType' => '1',
      'Name' => 'void const',
      'Type' => 'Const'
    },
    '2154' => {
      'BaseType' => '1117',
      'Name' => 'bitfield8_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2329' => {
      'BaseType' => '1753',
      'Name' => 'struct pldm_msg*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2408' => {
      'BaseType' => '1793',
      'Name' => 'struct pldm_msg const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2413' => {
      'BaseType' => '145',
      'Name' => 'uint8_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2418' => {
      'BaseType' => '1188',
      'Name' => 'ver32_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2460' => {
      'BaseType' => '1997',
      'Name' => 'struct pldm_base_get_pldm_types_resp const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2465' => {
      'BaseType' => '900',
      'Name' => 'size_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2522' => {
      'BaseType' => '1200',
      'Name' => 'ver32_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2569' => {
      'BaseType' => '169',
      'Name' => 'uint32_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2611' => {
      'BaseType' => '1953',
      'Name' => 'struct pldm_base_get_tid_resp const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2643' => {
      'BaseType' => '1748',
      'Name' => 'struct pldm_msg_hdr const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2648' => {
      'BaseType' => '1814',
      'Name' => 'struct pldm_header_info*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '4058' => {
      'BaseType' => '1892',
      'Name' => 'struct pldm_header_info const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '5544' => {
      'BaseType' => '145',
      'Name' => 'uint8_t const',
      'Size' => '1',
      'Type' => 'Const'
    },
    '5790' => {
      'BaseType' => '5544',
      'Name' => 'uint8_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '6323' => {
      'BaseType' => '145',
      'Header' => 'base.h',
      'Line' => '19',
      'Name' => 'pldm_tid_t',
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '6335' => {
      'BaseType' => '145',
      'Header' => 'instance-id.h',
      'Line' => '12',
      'Name' => 'pldm_instance_id_t',
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '6347' => {
      'Header' => 'responder.h',
      'Line' => '9',
      'Memb' => {
        '0' => {
          'name' => 'tid',
          'offset' => '0',
          'type' => '6323'
        },
        '1' => {
          'name' => 'instance_id',
          'offset' => '1',
          'type' => '6335'
        },
        '2' => {
          'name' => 'type',
          'offset' => '2',
          'type' => '145'
        },
        '3' => {
          'name' => 'command',
          'offset' => '3',
          'type' => '145'
        },
        '4' => {
          'name' => 'next',
          'offset' => '8',
          'type' => '6427'
        }
      },
      'Name' => 'struct pldm_responder_cookie',
      'PrivateABI' => 1,
      'Size' => '16',
      'Type' => 'Struct'
    },
    '6427' => {
      'BaseType' => '6347',
      'Name' => 'struct pldm_responder_cookie*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '6432' => {
      'Header' => 'pldm.h',
      'Line' => '14',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_REQUESTER_SUCCESS',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_REQUESTER_OPEN_FAIL',
          'value' => '18446744073709551615 (-1)'
        },
        '2' => {
          'name' => 'PLDM_REQUESTER_NOT_PLDM_MSG',
          'value' => '18446744073709551614 (-2)'
        },
        '3' => {
          'name' => 'PLDM_REQUESTER_NOT_RESP_MSG',
          'value' => '18446744073709551613 (-3)'
        },
        '4' => {
          'name' => 'PLDM_REQUESTER_NOT_REQ_MSG',
          'value' => '18446744073709551612 (-4)'
        },
        '5' => {
          'name' => 'PLDM_REQUESTER_RESP_MSG_TOO_SMALL',
          'value' => '18446744073709551611 (-5)'
        },
        '6' => {
          'name' => 'PLDM_REQUESTER_INSTANCE_ID_MISMATCH',
          'value' => '18446744073709551610 (-6)'
        },
        '7' => {
          'name' => 'PLDM_REQUESTER_SEND_FAIL',
          'value' => '18446744073709551609 (-7)'
        },
        '8' => {
          'name' => 'PLDM_REQUESTER_RECV_FAIL',
          'value' => '18446744073709551608 (-8)'
        },
        '9' => {
          'name' => 'PLDM_REQUESTER_INVALID_RECV_LEN',
          'value' => '18446744073709551607 (-9)'
        },
        '10' => {
          'name' => 'PLDM_REQUESTER_SETUP_FAIL',
          'value' => '18446744073709551606 (-10)'
        },
        '11' => {
          'name' => 'PLDM_REQUESTER_INVALID_SETUP',
          'value' => '18446744073709551605 (-11)'
        },
        '12' => {
          'name' => 'PLDM_REQUESTER_POLL_FAIL',
          'value' => '18446744073709551604 (-12)'
        },
        '13' => {
          'name' => 'PLDM_REQUESTER_TRANSPORT_BUSY',
          'value' => '18446744073709551603 (-13)'
        }
      },
      'Name' => 'enum pldm_requester_error_codes',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '6953' => {
      'Name' => '_Bool',
      'Size' => '1',
      'Type' => 'Intrinsic'
    },
    '7570' => {
      'BaseType' => '138',
      'Name' => 'char*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '7582' => {
      'BaseType' => '138',
      'Name' => 'char const',
      'Size' => '1',
      'Type' => 'Const'
    },
    '7726' => {
      'BaseType' => '131',
      'Header' => 'types.h',
      'Line' => '194',
      'Name' => '__ssize_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '7767' => {
      'BaseType' => '157',
      'Name' => 'uint16_t const',
      'Size' => '2',
      'Type' => 'Const'
    },
    '8097' => {
      'Header' => 'pldm_types.h',
      'Line' => '177',
      'Memb' => {
        '0' => {
          'name' => 'ptr',
          'offset' => '0',
          'type' => '5790'
        },
        '1' => {
          'name' => 'length',
          'offset' => '8',
          'type' => '900'
        }
      },
      'Name' => 'struct variable_field',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '8141' => {
      'BaseType' => '7726',
      'Header' => 'types.h',
      'Line' => '108',
      'Name' => 'ssize_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '9285' => {
      'Header' => 'base.h',
      'Line' => '395',
      'Memb' => {
        '0' => {
          'name' => 'pldm_type',
          'offset' => '0',
          'type' => '145'
        },
        '1' => {
          'name' => 'transfer_opflag',
          'offset' => '1',
          'type' => '145'
        },
        '2' => {
          'name' => 'transfer_ctx',
          'offset' => '4',
          'type' => '169'
        },
        '3' => {
          'name' => 'transfer_handle',
          'offset' => '8',
          'type' => '169'
        },
        '4' => {
          'name' => 'section_offset',
          'offset' => '18',
          'type' => '169'
        },
        '5' => {
          'name' => 'section_length',
          'offset' => '22',
          'type' => '169'
        }
      },
      'Name' => 'struct pldm_base_multipart_receive_req',
      'Size' => '20',
      'Type' => 'Struct'
    },
    '9376' => {
      'BaseType' => '9285',
      'Name' => 'struct pldm_base_multipart_receive_req const',
      'Size' => '20',
      'Type' => 'Const'
    },
    '9381' => {
      'Header' => 'base.h',
      'Line' => '413',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '145'
        },
        '1' => {
          'name' => 'transfer_flag',
          'offset' => '1',
          'type' => '145'
        },
        '2' => {
          'name' => 'next_transfer_handle',
          'offset' => '4',
          'type' => '169'
        },
        '3' => {
          'name' => 'data',
          'offset' => '8',
          'type' => '8097'
        }
      },
      'Name' => 'struct pldm_base_multipart_receive_resp',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '9451' => {
      'Header' => 'base.h',
      'Line' => '425',
      'Memb' => {
        '0' => {
          'name' => 'requester_part_size',
          'offset' => '0',
          'type' => '157'
        },
        '1' => {
          'name' => 'requester_protocol_support',
          'offset' => '2',
          'type' => '1897'
        }
      },
      'Name' => 'struct pldm_base_negotiate_transfer_params_req',
      'Size' => '10',
      'Type' => 'Struct'
    },
    '9490' => {
      'BaseType' => '9451',
      'Name' => 'struct pldm_base_negotiate_transfer_params_req const',
      'Size' => '10',
      'Type' => 'Const'
    },
    '9511' => {
      'Header' => 'base.h',
      'Line' => '434',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '145'
        },
        '1' => {
          'name' => 'responder_part_size',
          'offset' => '2',
          'type' => '157'
        },
        '2' => {
          'name' => 'responder_protocol_support',
          'offset' => '4',
          'type' => '1897'
        }
      },
      'Name' => 'struct pldm_base_negotiate_transfer_params_resp',
      'Size' => '12',
      'Type' => 'Struct'
    },
    '9687' => {
      'BaseType' => '7582',
      'Name' => 'char const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '11306' => {
      'BaseType' => '1958',
      'Name' => 'struct pldm_base_get_pldm_types_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '14413' => {
      'BaseType' => '1913',
      'Name' => 'struct pldm_base_get_tid_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '18071' => {
      'BaseType' => '9511',
      'Name' => 'struct pldm_base_negotiate_transfer_params_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '23634' => {
      'BaseType' => '9490',
      'Name' => 'struct pldm_base_negotiate_transfer_params_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '43984' => {
      'BaseType' => '9381',
      'Name' => 'struct pldm_base_multipart_receive_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '46781' => {
      'BaseType' => '9376',
      'Name' => 'struct pldm_base_multipart_receive_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '52229' => {
      'BaseType' => '1105',
      'Name' => 'bitfield8_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '53670' => {
      'BaseType' => '1637',
      'Name' => 'struct pldm_msg_hdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '57971' => {
      'BaseType' => '8097',
      'Name' => 'struct variable_field*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '60053' => {
      'BaseType' => '157',
      'Name' => 'uint16_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '63340' => {
      'BaseType' => '67',
      'Header' => 'types.h',
      'Line' => '45',
      'Name' => '__uint64_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '63417' => {
      'BaseType' => '63340',
      'Header' => 'stdint-uintn.h',
      'Line' => '27',
      'Name' => 'uint64_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '63687' => {
      'Header' => 'bios.h',
      'Line' => '50',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_BIOS_STRING_TABLE',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_BIOS_ATTR_TABLE',
          'value' => '1'
        },
        '2' => {
          'name' => 'PLDM_BIOS_ATTR_VAL_TABLE',
          'value' => '2'
        }
      },
      'Name' => 'enum pldm_bios_table_types',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '63721' => {
      'Header' => 'bios.h',
      'Line' => '56',
      'Memb' => {
        '0' => {
          'name' => 'string_handle',
          'offset' => '0',
          'type' => '157'
        },
        '1' => {
          'name' => 'string_length',
          'offset' => '2',
          'type' => '157'
        },
        '2' => {
          'name' => 'name',
          'offset' => '4',
          'type' => '63778'
        }
      },
      'Name' => 'struct pldm_bios_string_table_entry',
      'Size' => '5',
      'Type' => 'Struct'
    },
    '63773' => {
      'BaseType' => '63721',
      'Name' => 'struct pldm_bios_string_table_entry const',
      'Size' => '5',
      'Type' => 'Const'
    },
    '63778' => {
      'BaseType' => '138',
      'Name' => 'char[1]',
      'Size' => '1',
      'Type' => 'Array'
    },
    '63794' => {
      'Header' => 'bios.h',
      'Line' => '62',
      'Memb' => {
        '0' => {
          'name' => 'attr_handle',
          'offset' => '0',
          'type' => '157'
        },
        '1' => {
          'name' => 'attr_type',
          'offset' => '2',
          'type' => '145'
        },
        '2' => {
          'name' => 'string_handle',
          'offset' => '3',
          'type' => '157'
        },
        '3' => {
          'name' => 'metadata',
          'offset' => '5',
          'type' => '1798'
        }
      },
      'Name' => 'struct pldm_bios_attr_table_entry',
      'Size' => '6',
      'Type' => 'Struct'
    },
    '63859' => {
      'BaseType' => '63794',
      'Name' => 'struct pldm_bios_attr_table_entry const',
      'Size' => '6',
      'Type' => 'Const'
    },
    '63864' => {
      'Header' => 'bios.h',
      'Line' => '74',
      'Memb' => {
        '0' => {
          'name' => 'attr_handle',
          'offset' => '0',
          'type' => '157'
        },
        '1' => {
          'name' => 'attr_type',
          'offset' => '2',
          'type' => '145'
        },
        '2' => {
          'name' => 'value',
          'offset' => '3',
          'type' => '1798'
        }
      },
      'Name' => 'struct pldm_bios_attr_val_table_entry',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '63916' => {
      'BaseType' => '63864',
      'Name' => 'struct pldm_bios_attr_val_table_entry const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '63985' => {
      'Header' => 'bios_table.h',
      'Line' => '205',
      'Memb' => {
        '0' => {
          'name' => 'name_handle',
          'offset' => '0',
          'type' => '157'
        },
        '1' => {
          'name' => 'read_only',
          'offset' => '2',
          'type' => '6953'
        },
        '2' => {
          'name' => 'pv_num',
          'offset' => '3',
          'type' => '145'
        },
        '3' => {
          'name' => 'pv_handle',
          'offset' => '8',
          'type' => '64088'
        },
        '4' => {
          'name' => 'def_num',
          'offset' => '22',
          'type' => '145'
        },
        '5' => {
          'name' => 'def_index',
          'offset' => '36',
          'type' => '5790'
        }
      },
      'Name' => 'struct pldm_bios_table_attr_entry_enum_info',
      'Size' => '32',
      'Type' => 'Struct'
    },
    '64076' => {
      'BaseType' => '63985',
      'Name' => 'struct pldm_bios_table_attr_entry_enum_info const',
      'Size' => '32',
      'Type' => 'Const'
    },
    '64088' => {
      'BaseType' => '7767',
      'Name' => 'uint16_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '64093' => {
      'Header' => 'bios_table.h',
      'Line' => '293',
      'Memb' => {
        '0' => {
          'name' => 'name_handle',
          'offset' => '0',
          'type' => '157'
        },
        '1' => {
          'name' => 'read_only',
          'offset' => '2',
          'type' => '6953'
        },
        '2' => {
          'name' => 'string_type',
          'offset' => '3',
          'type' => '145'
        },
        '3' => {
          'name' => 'min_length',
          'offset' => '4',
          'type' => '157'
        },
        '4' => {
          'name' => 'max_length',
          'offset' => '6',
          'type' => '157'
        },
        '5' => {
          'name' => 'def_length',
          'offset' => '8',
          'type' => '157'
        },
        '6' => {
          'name' => 'def_string',
          'offset' => '22',
          'type' => '9687'
        }
      },
      'Name' => 'struct pldm_bios_table_attr_entry_string_info',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '64205' => {
      'BaseType' => '64093',
      'Name' => 'struct pldm_bios_table_attr_entry_string_info const',
      'Size' => '24',
      'Type' => 'Const'
    },
    '64215' => {
      'Header' => 'bios_table.h',
      'Line' => '384',
      'Memb' => {
        '0' => {
          'name' => 'name_handle',
          'offset' => '0',
          'type' => '157'
        },
        '1' => {
          'name' => 'read_only',
          'offset' => '2',
          'type' => '6953'
        },
        '2' => {
          'name' => 'lower_bound',
          'offset' => '8',
          'type' => '63417'
        },
        '3' => {
          'name' => 'upper_bound',
          'offset' => '22',
          'type' => '63417'
        },
        '4' => {
          'name' => 'scalar_increment',
          'offset' => '36',
          'type' => '169'
        },
        '5' => {
          'name' => 'default_value',
          'offset' => '50',
          'type' => '63417'
        }
      },
      'Name' => 'struct pldm_bios_table_attr_entry_integer_info',
      'Size' => '40',
      'Type' => 'Struct'
    },
    '64313' => {
      'BaseType' => '64215',
      'Name' => 'struct pldm_bios_table_attr_entry_integer_info const',
      'Size' => '40',
      'Type' => 'Const'
    },
    '64580' => {
      'Name' => 'ssize_t(*)(void const*)',
      'Param' => {
        '0' => {
          'type' => '2148'
        }
      },
      'Return' => '8141',
      'Size' => '8',
      'Type' => 'FuncPtr'
    },
    '64650' => {
      'Line' => '958',
      'Memb' => {
        '0' => {
          'name' => 'table_data',
          'offset' => '0',
          'type' => '5790'
        },
        '1' => {
          'name' => 'table_len',
          'offset' => '8',
          'type' => '900'
        },
        '2' => {
          'name' => 'current_pos',
          'offset' => '22',
          'type' => '900'
        },
        '3' => {
          'name' => 'entry_length_handler',
          'offset' => '36',
          'type' => '64580'
        }
      },
      'Name' => 'struct pldm_bios_table_iter',
      'PrivateABI' => 1,
      'Size' => '32',
      'Source' => 'bios_table.c',
      'Type' => 'Struct'
    },
    '64720' => {
      'BaseType' => '64650',
      'Name' => 'struct pldm_bios_table_iter const',
      'Size' => '32',
      'Type' => 'Const'
    },
    '65790' => {
      'BaseType' => '64650',
      'Name' => 'struct pldm_bios_table_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '65795' => {
      'BaseType' => '63916',
      'Name' => 'struct pldm_bios_attr_val_table_entry const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '66209' => {
      'BaseType' => '63859',
      'Name' => 'struct pldm_bios_attr_table_entry const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '66812' => {
      'BaseType' => '63773',
      'Name' => 'struct pldm_bios_string_table_entry const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '67975' => {
      'BaseType' => '64720',
      'Name' => 'struct pldm_bios_table_iter const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '72158' => {
      'BaseType' => '63417',
      'Name' => 'uint64_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '72435' => {
      'BaseType' => '64313',
      'Name' => 'struct pldm_bios_table_attr_entry_integer_info const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '72744' => {
      'BaseType' => '9687',
      'Name' => 'char const**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '73873' => {
      'BaseType' => '64205',
      'Name' => 'struct pldm_bios_table_attr_entry_string_info const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '75328' => {
      'BaseType' => '64076',
      'Name' => 'struct pldm_bios_table_attr_entry_enum_info const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '77488' => {
      'Header' => 'pldm_types.h',
      'Line' => '41',
      'Name' => 'struct bits16',
      'Size' => '2',
      'Type' => 'Struct'
    },
    '77758' => {
      'Header' => 'pldm_types.h',
      'Line' => '59',
      'Memb' => {
        '0' => {
          'name' => 'value',
          'offset' => '0',
          'type' => '157'
        },
        '1' => {
          'name' => 'bits',
          'offset' => '0',
          'type' => '77488'
        }
      },
      'Name' => 'union bitfield16_t',
      'Size' => '2',
      'Type' => 'Union'
    },
    '78495' => {
      'Header' => 'file.h',
      'Line' => '52',
      'Memb' => {
        '0' => {
          'name' => 'file_identifier',
          'offset' => '0',
          'type' => '157'
        },
        '1' => {
          'name' => 'file_attribute',
          'offset' => '2',
          'type' => '77758'
        }
      },
      'Name' => 'struct pldm_file_df_open_req',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '78535' => {
      'BaseType' => '78495',
      'Name' => 'struct pldm_file_df_open_req const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '78540' => {
      'Header' => 'file.h',
      'Line' => '61',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '145'
        },
        '1' => {
          'name' => 'file_descriptor',
          'offset' => '2',
          'type' => '157'
        }
      },
      'Name' => 'struct pldm_file_df_open_resp',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '78585' => {
      'Header' => 'file.h',
      'Line' => '70',
      'Memb' => {
        '0' => {
          'name' => 'file_descriptor',
          'offset' => '0',
          'type' => '157'
        },
        '1' => {
          'name' => 'df_close_options',
          'offset' => '2',
          'type' => '77758'
        }
      },
      'Name' => 'struct pldm_file_df_close_req',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '78625' => {
      'BaseType' => '78585',
      'Name' => 'struct pldm_file_df_close_req const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '78630' => {
      'Header' => 'file.h',
      'Line' => '79',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '145'
        }
      },
      'Name' => 'struct pldm_file_df_close_resp',
      'Size' => '1',
      'Type' => 'Struct'
    },
    '78662' => {
      'Header' => 'file.h',
      'Line' => '87',
      'Memb' => {
        '0' => {
          'name' => 'file_descriptor',
          'offset' => '0',
          'type' => '157'
        },
        '1' => {
          'name' => 'requester_max_interval',
          'offset' => '4',
          'type' => '169'
        }
      },
      'Name' => 'struct pldm_file_df_heartbeat_req',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '78702' => {
      'BaseType' => '78662',
      'Name' => 'struct pldm_file_df_heartbeat_req const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '78707' => {
      'Header' => 'file.h',
      'Line' => '96',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '145'
        },
        '1' => {
          'name' => 'responder_max_interval',
          'offset' => '4',
          'type' => '169'
        }
      },
      'Name' => 'struct pldm_file_df_heartbeat_resp',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '83470' => {
      'BaseType' => '78707',
      'Name' => 'struct pldm_file_df_heartbeat_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '85064' => {
      'BaseType' => '78702',
      'Name' => 'struct pldm_file_df_heartbeat_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '85190' => {
      'BaseType' => '78630',
      'Name' => 'struct pldm_file_df_close_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '89541' => {
      'BaseType' => '78625',
      'Name' => 'struct pldm_file_df_close_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '91309' => {
      'BaseType' => '78540',
      'Name' => 'struct pldm_file_df_open_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '95961' => {
      'BaseType' => '78535',
      'Name' => 'struct pldm_file_df_open_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '97739' => {
      'BaseType' => '900',
      'Name' => 'size_t const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '97751' => {
      'BaseType' => '145',
      'Header' => 'pldm_types.h',
      'Line' => '37',
      'Name' => 'bool8_t',
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '98043' => {
      'Header' => 'pldm_types.h',
      'Line' => '63',
      'Name' => 'struct bits32',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '98535' => {
      'Header' => 'pldm_types.h',
      'Line' => '97',
      'Memb' => {
        '0' => {
          'name' => 'value',
          'offset' => '0',
          'type' => '169'
        },
        '1' => {
          'name' => 'bits',
          'offset' => '0',
          'type' => '98043'
        }
      },
      'Name' => 'union bitfield32_t',
      'Size' => '4',
      'Type' => 'Union'
    },
    '98547' => {
      'Header' => 'pldm_types.h',
      'Line' => '101',
      'Name' => 'struct bits64',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '99487' => {
      'Header' => 'pldm_types.h',
      'Line' => '167',
      'Memb' => {
        '0' => {
          'name' => 'value',
          'offset' => '0',
          'type' => '63417'
        },
        '1' => {
          'name' => 'bits',
          'offset' => '0',
          'type' => '98547'
        }
      },
      'Name' => 'union bitfield64_t',
      'Size' => '8',
      'Type' => 'Union'
    },
    '99506' => {
      'BaseType' => '99518',
      'Header' => 'pldm_types.h',
      'Line' => '171',
      'Name' => 'pldm_uuid',
      'Size' => '16',
      'Type' => 'Typedef'
    },
    '99518' => {
      'BaseType' => '145',
      'Name' => 'uint8_t[16]',
      'Size' => '16',
      'Type' => 'Array'
    },
    '99534' => {
      'BaseType' => '99518',
      'Name' => 'uint8_t[16] const',
      'Size' => '16',
      'Type' => 'Const'
    },
    '99578' => {
      'BaseType' => '8097',
      'Name' => 'struct variable_field const',
      'Size' => '16',
      'Type' => 'Const'
    },
    '101710' => {
      'BaseType' => '145',
      'Name' => 'uint8_t[8]',
      'Size' => '8',
      'Type' => 'Array'
    },
    '101726' => {
      'Header' => 'firmware_update.h',
      'Line' => '465',
      'Memb' => {
        '0' => {
          'name' => 'uuid',
          'offset' => '0',
          'type' => '99518'
        },
        '1' => {
          'name' => 'package_header_format_version',
          'offset' => '22',
          'type' => '145'
        },
        '2' => {
          'name' => 'package_header_size',
          'offset' => '23',
          'type' => '157'
        },
        '3' => {
          'name' => 'package_release_date_time',
          'offset' => '25',
          'type' => '101839'
        },
        '4' => {
          'name' => 'component_bitmap_bit_length',
          'offset' => '50',
          'type' => '157'
        },
        '5' => {
          'name' => 'package_version_string_type',
          'offset' => '52',
          'type' => '145'
        },
        '6' => {
          'name' => 'package_version_string_length',
          'offset' => '53',
          'type' => '145'
        }
      },
      'Name' => 'struct pldm_package_header_information',
      'Size' => '36',
      'Type' => 'Struct'
    },
    '101839' => {
      'BaseType' => '145',
      'Name' => 'uint8_t[13]',
      'Size' => '13',
      'Type' => 'Array'
    },
    '101855' => {
      'Header' => 'firmware_update.h',
      'Line' => '479',
      'Memb' => {
        '0' => {
          'name' => 'record_length',
          'offset' => '0',
          'type' => '157'
        },
        '1' => {
          'name' => 'descriptor_count',
          'offset' => '2',
          'type' => '145'
        },
        '2' => {
          'name' => 'device_update_option_flags',
          'offset' => '3',
          'type' => '98535'
        },
        '3' => {
          'name' => 'comp_image_set_version_string_type',
          'offset' => '7',
          'type' => '145'
        },
        '4' => {
          'name' => 'comp_image_set_version_string_length',
          'offset' => '8',
          'type' => '145'
        },
        '5' => {
          'name' => 'fw_device_pkg_data_length',
          'offset' => '9',
          'type' => '157'
        }
      },
      'Name' => 'struct pldm_firmware_device_id_record',
      'Size' => '11',
      'Type' => 'Struct'
    },
    '102068' => {
      'Header' => 'firmware_update.h',
      'Line' => '513',
      'Memb' => {
        '0' => {
          'name' => 'comp_classification',
          'offset' => '0',
          'type' => '157'
        },
        '1' => {
          'name' => 'comp_identifier',
          'offset' => '2',
          'type' => '157'
        },
        '2' => {
          'name' => 'comp_comparison_stamp',
          'offset' => '4',
          'type' => '169'
        },
        '3' => {
          'name' => 'comp_options',
          'offset' => '8',
          'type' => '77758'
        },
        '4' => {
          'name' => 'requested_comp_activation_method',
          'offset' => '16',
          'type' => '77758'
        },
        '5' => {
          'name' => 'comp_location_offset',
          'offset' => '18',
          'type' => '169'
        },
        '6' => {
          'name' => 'comp_size',
          'offset' => '22',
          'type' => '169'
        },
        '7' => {
          'name' => 'comp_version_string_type',
          'offset' => '32',
          'type' => '145'
        },
        '8' => {
          'name' => 'comp_version_string_length',
          'offset' => '33',
          'type' => '145'
        }
      },
      'Name' => 'struct pldm_component_image_information',
      'Size' => '22',
      'Type' => 'Struct'
    },
    '102266' => {
      'Header' => 'firmware_update.h',
      'Line' => '539',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '145'
        },
        '1' => {
          'name' => 'capabilities_during_update',
          'offset' => '1',
          'type' => '98535'
        },
        '2' => {
          'name' => 'comp_count',
          'offset' => '5',
          'type' => '157'
        },
        '3' => {
          'name' => 'active_comp_image_set_ver_str_type',
          'offset' => '7',
          'type' => '145'
        },
        '4' => {
          'name' => 'active_comp_image_set_ver_str_len',
          'offset' => '8',
          'type' => '145'
        },
        '5' => {
          'name' => 'pending_comp_image_set_ver_str_type',
          'offset' => '9',
          'type' => '145'
        },
        '6' => {
          'name' => 'pending_comp_image_set_ver_str_len',
          'offset' => '16',
          'type' => '145'
        }
      },
      'Name' => 'struct pldm_get_firmware_parameters_resp',
      'Size' => '11',
      'Type' => 'Struct'
    },
    '102469' => {
      'Header' => 'firmware_update.h',
      'Line' => '567',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '145'
        },
        '1' => {
          'name' => 'downstream_device_update_supported',
          'offset' => '1',
          'type' => '145'
        },
        '2' => {
          'name' => 'number_of_downstream_devices',
          'offset' => '2',
          'type' => '157'
        },
        '3' => {
          'name' => 'max_number_of_downstream_devices',
          'offset' => '4',
          'type' => '157'
        },
        '4' => {
          'name' => 'capabilities',
          'offset' => '8',
          'type' => '98535'
        }
      },
      'Name' => 'struct pldm_query_downstream_devices_resp',
      'Size' => '12',
      'Type' => 'Struct'
    },
    '102554' => {
      'Header' => 'firmware_update.h',
      'Line' => '579',
      'Memb' => {
        '0' => {
          'name' => 'comp_classification',
          'offset' => '0',
          'type' => '157'
        },
        '1' => {
          'name' => 'comp_identifier',
          'offset' => '2',
          'type' => '157'
        },
        '2' => {
          'name' => 'comp_classification_index',
          'offset' => '4',
          'type' => '145'
        },
        '3' => {
          'name' => 'active_comp_comparison_stamp',
          'offset' => '5',
          'type' => '169'
        },
        '4' => {
          'name' => 'active_comp_ver_str_type',
          'offset' => '9',
          'type' => '145'
        },
        '5' => {
          'name' => 'active_comp_ver_str_len',
          'offset' => '16',
          'type' => '145'
        },
        '6' => {
          'name' => 'active_comp_release_date',
          'offset' => '17',
          'type' => '101710'
        },
        '7' => {
          'name' => 'pending_comp_comparison_stamp',
          'offset' => '25',
          'type' => '169'
        },
        '8' => {
          'name' => 'pending_comp_ver_str_type',
          'offset' => '35',
          'type' => '145'
        },
        '9' => {
          'name' => 'pending_comp_ver_str_len',
          'offset' => '36',
          'type' => '145'
        },
        '10' => {
          'name' => 'pending_comp_release_date',
          'offset' => '37',
          'type' => '101710'
        },
        '11' => {
          'name' => 'comp_activation_methods',
          'offset' => '51',
          'type' => '77758'
        },
        '12' => {
          'name' => 'capabilities_during_update',
          'offset' => '53',
          'type' => '98535'
        }
      },
      'Name' => 'struct pldm_component_parameter_entry',
      'Size' => '39',
      'Type' => 'Struct'
    },
    '102869' => {
      'Header' => 'firmware_update.h',
      'Line' => '618',
      'Memb' => {
        '0' => {
          'name' => 'data_transfer_handle',
          'offset' => '0',
          'type' => '169'
        },
        '1' => {
          'name' => 'transfer_operation_flag',
          'offset' => '4',
          'type' => '145'
        }
      },
      'Name' => 'struct pldm_query_downstream_identifiers_req',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '102912' => {
      'BaseType' => '102869',
      'Name' => 'struct pldm_query_downstream_identifiers_req const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '102917' => {
      'Header' => 'firmware_update.h',
      'Line' => '632',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '145'
        },
        '1' => {
          'name' => 'next_data_transfer_handle',
          'offset' => '4',
          'type' => '169'
        },
        '2' => {
          'name' => 'transfer_flag',
          'offset' => '8',
          'type' => '145'
        },
        '3' => {
          'name' => 'downstream_devices_length',
          'offset' => '18',
          'type' => '169'
        },
        '4' => {
          'name' => 'number_of_downstream_devices',
          'offset' => '22',
          'type' => '157'
        }
      },
      'Name' => 'struct pldm_query_downstream_identifiers_resp',
      'Size' => '20',
      'Type' => 'Struct'
    },
    '103002' => {
      'Header' => 'firmware_update.h',
      'Line' => '645',
      'Memb' => {
        '0' => {
          'name' => 'downstream_device_index',
          'offset' => '0',
          'type' => '157'
        },
        '1' => {
          'name' => 'downstream_descriptor_count',
          'offset' => '2',
          'type' => '145'
        }
      },
      'Name' => 'struct pldm_downstream_device',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '103045' => {
      'Header' => 'firmware_update.h',
      'Line' => '651',
      'Memb' => {
        '0' => {
          'name' => 'field',
          'offset' => '0',
          'type' => '8097'
        },
        '1' => {
          'name' => 'devs',
          'offset' => '22',
          'type' => '900'
        }
      },
      'Name' => 'struct pldm_downstream_device_iter',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '103088' => {
      'Header' => 'firmware_update.h',
      'Line' => '725',
      'Memb' => {
        '0' => {
          'name' => 'descriptor_type',
          'offset' => '0',
          'type' => '157'
        },
        '1' => {
          'name' => 'descriptor_length',
          'offset' => '2',
          'type' => '157'
        },
        '2' => {
          'name' => 'descriptor_data',
          'offset' => '8',
          'type' => '2148'
        }
      },
      'Name' => 'struct pldm_descriptor',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '103161' => {
      'Header' => 'firmware_update.h',
      'Line' => '731',
      'Memb' => {
        '0' => {
          'name' => 'field',
          'offset' => '0',
          'type' => '57971'
        },
        '1' => {
          'name' => 'count',
          'offset' => '8',
          'type' => '900'
        }
      },
      'Name' => 'struct pldm_descriptor_iter',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '103209' => {
      'Header' => 'firmware_update.h',
      'Line' => '824',
      'Memb' => {
        '0' => {
          'name' => 'data_transfer_handle',
          'offset' => '0',
          'type' => '169'
        },
        '1' => {
          'name' => 'transfer_operation_flag',
          'offset' => '4',
          'type' => '145'
        }
      },
      'Name' => 'struct pldm_get_downstream_firmware_parameters_req',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '103252' => {
      'BaseType' => '103209',
      'Name' => 'struct pldm_get_downstream_firmware_parameters_req const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '103257' => {
      'Header' => 'firmware_update.h',
      'Line' => '839',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '145'
        },
        '1' => {
          'name' => 'next_data_transfer_handle',
          'offset' => '4',
          'type' => '169'
        },
        '2' => {
          'name' => 'transfer_flag',
          'offset' => '8',
          'type' => '145'
        },
        '3' => {
          'name' => 'fdp_capabilities_during_update',
          'offset' => '18',
          'type' => '98535'
        },
        '4' => {
          'name' => 'downstream_device_count',
          'offset' => '22',
          'type' => '157'
        }
      },
      'Name' => 'struct pldm_get_downstream_firmware_parameters_resp',
      'Size' => '20',
      'Type' => 'Struct'
    },
    '103342' => {
      'Header' => 'firmware_update.h',
      'Line' => '857',
      'Memb' => {
        '0' => {
          'name' => 'downstream_device_index',
          'offset' => '0',
          'type' => '157'
        },
        '1' => {
          'name' => 'active_comp_comparison_stamp',
          'offset' => '4',
          'type' => '169'
        },
        '2' => {
          'name' => 'active_comp_ver_str_type',
          'offset' => '8',
          'type' => '145'
        },
        '3' => {
          'name' => 'active_comp_ver_str_len',
          'offset' => '9',
          'type' => '145'
        },
        '4' => {
          'name' => 'active_comp_release_date',
          'offset' => '16',
          'type' => '103539'
        },
        '5' => {
          'name' => 'pending_comp_comparison_stamp',
          'offset' => '32',
          'type' => '169'
        },
        '6' => {
          'name' => 'pending_comp_ver_str_type',
          'offset' => '36',
          'type' => '145'
        },
        '7' => {
          'name' => 'pending_comp_ver_str_len',
          'offset' => '37',
          'type' => '145'
        },
        '8' => {
          'name' => 'pending_comp_release_date',
          'offset' => '38',
          'type' => '103539'
        },
        '9' => {
          'name' => 'comp_activation_methods',
          'offset' => '54',
          'type' => '77758'
        },
        '10' => {
          'name' => 'capabilities_during_update',
          'offset' => '64',
          'type' => '98535'
        },
        '11' => {
          'name' => 'active_comp_ver_str',
          'offset' => '72',
          'type' => '2148'
        },
        '12' => {
          'name' => 'pending_comp_ver_str',
          'offset' => '86',
          'type' => '2148'
        }
      },
      'Name' => 'struct pldm_downstream_device_parameters_entry',
      'Size' => '64',
      'Type' => 'Struct'
    },
    '103539' => {
      'BaseType' => '138',
      'Name' => 'char[9]',
      'Size' => '9',
      'Type' => 'Array'
    },
    '104910' => {
      'Header' => 'firmware_update.h',
      'Line' => '1089',
      'Memb' => {
        '0' => {
          'name' => 'component_classification',
          'offset' => '0',
          'type' => '157'
        },
        '1' => {
          'name' => 'component_identifier',
          'offset' => '2',
          'type' => '157'
        },
        '2' => {
          'name' => 'component_classification_index',
          'offset' => '4',
          'type' => '145'
        }
      },
      'Name' => 'struct pldm_fwup_update_security_revision_req',
      'Size' => '6',
      'Type' => 'Struct'
    },
    '104967' => {
      'BaseType' => '104910',
      'Name' => 'struct pldm_fwup_update_security_revision_req const',
      'Size' => '6',
      'Type' => 'Const'
    },
    '104972' => {
      'Header' => 'firmware_update.h',
      'Line' => '1404',
      'Memb' => {
        '0' => {
          'name' => 'field',
          'offset' => '0',
          'type' => '8097'
        },
        '1' => {
          'name' => 'entries',
          'offset' => '22',
          'type' => '900'
        }
      },
      'Name' => 'struct pldm_downstream_device_parameters_iter',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '105015' => {
      'Header' => 'firmware_update.h',
      'Line' => '2277',
      'Memb' => {
        '0' => {
          'name' => 'magic',
          'offset' => '0',
          'type' => '895'
        },
        '1' => {
          'name' => 'version',
          'offset' => '4',
          'type' => '5544'
        }
      },
      'Name' => 'anon-struct-firmware_update.h-2277',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '105052' => {
      'Header' => 'firmware_update.h',
      'Line' => '2296',
      'Memb' => {
        '0' => {
          'name' => 'identifier',
          'offset' => '0',
          'type' => '99534'
        },
        '1' => {
          'name' => 'revision',
          'offset' => '22',
          'type' => '5544'
        }
      },
      'Name' => 'anon-struct-firmware_update.h-2296',
      'Size' => '17',
      'Type' => 'Struct'
    },
    '105089' => {
      'Header' => 'firmware_update.h',
      'Line' => '2276',
      'Memb' => {
        '0' => {
          'name' => 'meta',
          'offset' => '0',
          'type' => '105015'
        },
        '1' => {
          'name' => 'format',
          'offset' => '8',
          'type' => '105052'
        }
      },
      'Name' => 'struct pldm_package_format_pin',
      'Size' => '28',
      'Type' => 'Struct'
    },
    '105132' => {
      'BaseType' => '105089',
      'Name' => 'struct pldm_package_format_pin const',
      'Size' => '28',
      'Type' => 'Const'
    },
    '105137' => {
      'Header' => 'firmware_update.h',
      'Line' => '2305',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_PACKAGE_PARSE_INIT',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_PACKAGE_PARSE_COMPLETE',
          'value' => '1'
        },
        '2' => {
          'name' => 'PLDM_PACKAGE_PARSE_HEADER',
          'value' => '2'
        },
        '3' => {
          'name' => 'PLDM_PACKAGE_PARSE_FIRMWARE_DEVICES',
          'value' => '3'
        },
        '4' => {
          'name' => 'PLDM_PACKAGE_PARSE_DOWNSTREAM_DEVICES',
          'value' => '4'
        },
        '5' => {
          'name' => 'PLDM_PACKAGE_PARSE_COMPONENT_IMAGE_INFORMATION',
          'value' => '5'
        }
      },
      'Name' => 'enum pldm_package_parse',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '105189' => {
      'Header' => 'firmware_update.h',
      'Line' => '2314',
      'Memb' => {
        '0' => {
          'name' => 'field',
          'offset' => '0',
          'type' => '8097'
        },
        '1' => {
          'name' => 'entries',
          'offset' => '22',
          'type' => '900'
        }
      },
      'Name' => 'struct pldm_package_iter',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '105232' => {
      'Header' => 'firmware_update.h',
      'Line' => '2327',
      'Memb' => {
        '0' => {
          'name' => 'package_header_identifier',
          'offset' => '0',
          'type' => '99506'
        },
        '1' => {
          'name' => 'package_header_format_revision',
          'offset' => '22',
          'type' => '145'
        },
        '2' => {
          'name' => 'package_release_date_time',
          'offset' => '23',
          'type' => '101839'
        },
        '3' => {
          'name' => 'component_bitmap_bit_length',
          'offset' => '48',
          'type' => '157'
        },
        '4' => {
          'name' => 'package_version_string_type',
          'offset' => '50',
          'type' => '145'
        },
        '5' => {
          'name' => 'package_version_string',
          'offset' => '64',
          'type' => '8097'
        }
      },
      'Name' => 'struct pldm__package_header_information',
      'Size' => '56',
      'Type' => 'Struct'
    },
    '105331' => {
      'BaseType' => '105232',
      'Header' => 'firmware_update.h',
      'Line' => '2340',
      'Name' => 'pldm_package_header_information_pad',
      'Size' => '56',
      'Type' => 'Typedef'
    },
    '105344' => {
      'BaseType' => '105331',
      'Name' => 'pldm_package_header_information_pad const',
      'Size' => '56',
      'Type' => 'Const'
    },
    '105349' => {
      'Header' => 'firmware_update.h',
      'Line' => '2343',
      'Memb' => {
        '0' => {
          'name' => 'bitmap',
          'offset' => '0',
          'type' => '8097'
        }
      },
      'Name' => 'struct pldm_package_component_bitmap',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '105378' => {
      'Header' => 'firmware_update.h',
      'Line' => '2355',
      'Memb' => {
        '0' => {
          'name' => 'descriptor_count',
          'offset' => '0',
          'type' => '145'
        },
        '1' => {
          'name' => 'device_update_option_flags',
          'offset' => '4',
          'type' => '98535'
        },
        '2' => {
          'name' => 'component_image_set_version_string_type',
          'offset' => '8',
          'type' => '145'
        },
        '3' => {
          'name' => 'component_image_set_version_string',
          'offset' => '22',
          'type' => '8097'
        },
        '4' => {
          'name' => 'applicable_components',
          'offset' => '50',
          'type' => '105349'
        },
        '5' => {
          'name' => 'record_descriptors',
          'offset' => '72',
          'type' => '8097'
        },
        '6' => {
          'name' => 'firmware_device_package_data',
          'offset' => '100',
          'type' => '8097'
        },
        '7' => {
          'name' => 'reference_manifest_data',
          'offset' => '128',
          'type' => '8097'
        }
      },
      'Name' => 'struct pldm_package_firmware_device_id_record',
      'Size' => '96',
      'Type' => 'Struct'
    },
    '105505' => {
      'Header' => 'firmware_update.h',
      'Line' => '2406',
      'Memb' => {
        '0' => {
          'name' => 'descriptor_count',
          'offset' => '0',
          'type' => '145'
        },
        '1' => {
          'name' => 'update_option_flags',
          'offset' => '4',
          'type' => '98535'
        },
        '2' => {
          'name' => 'self_contained_activation_min_version_string_type',
          'offset' => '8',
          'type' => '145'
        },
        '3' => {
          'name' => 'self_contained_activation_min_version_string',
          'offset' => '22',
          'type' => '8097'
        },
        '4' => {
          'name' => 'self_contained_activation_min_version_comparison_stamp',
          'offset' => '50',
          'type' => '169'
        },
        '5' => {
          'name' => 'applicable_components',
          'offset' => '64',
          'type' => '105349'
        },
        '6' => {
          'name' => 'record_descriptors',
          'offset' => '86',
          'type' => '8097'
        },
        '7' => {
          'name' => 'package_data',
          'offset' => '114',
          'type' => '8097'
        },
        '8' => {
          'name' => 'reference_manifest_data',
          'offset' => '136',
          'type' => '8097'
        }
      },
      'Name' => 'struct pldm_package_downstream_device_id_record',
      'Size' => '104',
      'Type' => 'Struct'
    },
    '105646' => {
      'Header' => 'firmware_update.h',
      'Line' => '2456',
      'Memb' => {
        '0' => {
          'name' => 'component_classification',
          'offset' => '0',
          'type' => '157'
        },
        '1' => {
          'name' => 'component_identifier',
          'offset' => '2',
          'type' => '157'
        },
        '2' => {
          'name' => 'component_comparison_stamp',
          'offset' => '4',
          'type' => '169'
        },
        '3' => {
          'name' => 'component_options',
          'offset' => '8',
          'type' => '77758'
        },
        '4' => {
          'name' => 'requested_component_activation_method',
          'offset' => '16',
          'type' => '77758'
        },
        '5' => {
          'name' => 'component_image',
          'offset' => '22',
          'type' => '8097'
        },
        '6' => {
          'name' => 'component_version_string_type',
          'offset' => '50',
          'type' => '145'
        },
        '7' => {
          'name' => 'component_version_string',
          'offset' => '64',
          'type' => '8097'
        },
        '8' => {
          'name' => 'component_opaque_data',
          'offset' => '86',
          'type' => '8097'
        }
      },
      'Name' => 'struct pldm_package_component_image_information',
      'Size' => '72',
      'Type' => 'Struct'
    },
    '105787' => {
      'Header' => 'firmware_update.h',
      'Line' => '2497',
      'Memb' => {
        '0' => {
          'name' => 'pin',
          'offset' => '0',
          'type' => '105898'
        },
        '1' => {
          'name' => 'hdr',
          'offset' => '8',
          'type' => '105903'
        },
        '2' => {
          'name' => 'state',
          'offset' => '22',
          'type' => '105137'
        },
        '3' => {
          'name' => 'flags',
          'offset' => '32',
          'type' => '169'
        },
        '4' => {
          'name' => 'package',
          'offset' => '36',
          'type' => '8097'
        },
        '5' => {
          'name' => 'areas',
          'offset' => '64',
          'type' => '8097'
        },
        '6' => {
          'name' => 'iter',
          'offset' => '86',
          'type' => '105189'
        }
      },
      'Name' => 'struct pldm_package',
      'Size' => '80',
      'Type' => 'Struct'
    },
    '105898' => {
      'BaseType' => '105132',
      'Name' => 'struct pldm_package_format_pin const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '105903' => {
      'BaseType' => '105344',
      'Name' => 'pldm_package_header_information_pad const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '112891' => {
      'BaseType' => '105787',
      'Name' => 'struct pldm_package*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '112896' => {
      'BaseType' => '105646',
      'Name' => 'struct pldm_package_component_image_information*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '121099' => {
      'BaseType' => '105505',
      'Name' => 'struct pldm_package_downstream_device_id_record*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '122776' => {
      'BaseType' => '105378',
      'Name' => 'struct pldm_package_firmware_device_id_record*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '124552' => {
      'BaseType' => '105331',
      'Name' => 'pldm_package_header_information_pad*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '127534' => {
      'BaseType' => '104967',
      'Name' => 'struct pldm_fwup_update_security_revision_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '129635' => {
      'BaseType' => '97751',
      'Name' => 'bool8_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '129640' => {
      'BaseType' => '99487',
      'Name' => 'bitfield64_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '133761' => {
      'BaseType' => '98535',
      'Name' => 'bitfield32_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '138933' => {
      'BaseType' => '77758',
      'Name' => 'bitfield16_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '151810' => {
      'BaseType' => '99578',
      'Name' => 'struct variable_field const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '179058' => {
      'BaseType' => '104972',
      'Name' => 'struct pldm_downstream_device_parameters_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '179063' => {
      'BaseType' => '103342',
      'Name' => 'struct pldm_downstream_device_parameters_entry*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '182569' => {
      'BaseType' => '103257',
      'Name' => 'struct pldm_get_downstream_firmware_parameters_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '184036' => {
      'BaseType' => '103252',
      'Name' => 'struct pldm_get_downstream_firmware_parameters_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '185626' => {
      'BaseType' => '103045',
      'Name' => 'struct pldm_downstream_device_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '185631' => {
      'BaseType' => '103002',
      'Name' => 'struct pldm_downstream_device*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '189134' => {
      'BaseType' => '102917',
      'Name' => 'struct pldm_query_downstream_identifiers_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '190601' => {
      'BaseType' => '102912',
      'Name' => 'struct pldm_query_downstream_identifiers_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '194010' => {
      'BaseType' => '102469',
      'Name' => 'struct pldm_query_downstream_devices_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '194457' => {
      'BaseType' => '102554',
      'Name' => 'struct pldm_component_parameter_entry*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '205044' => {
      'BaseType' => '102266',
      'Name' => 'struct pldm_get_firmware_parameters_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '208712' => {
      'BaseType' => '2413',
      'Name' => 'uint8_t**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '209054' => {
      'BaseType' => '102068',
      'Name' => 'struct pldm_component_image_information*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '212062' => {
      'BaseType' => '103161',
      'Name' => 'struct pldm_descriptor_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '212067' => {
      'BaseType' => '103088',
      'Name' => 'struct pldm_descriptor*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '212451' => {
      'BaseType' => '101855',
      'Name' => 'struct pldm_firmware_device_id_record*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '221334' => {
      'BaseType' => '862',
      'Name' => 'void**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '221835' => {
      'BaseType' => '101726',
      'Name' => 'struct pldm_package_header_information*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '239481' => {
      'BaseType' => '239498',
      'Header' => 'pdr.h',
      'Line' => '15',
      'Name' => 'pldm_pdr',
      'PrivateABI' => 1,
      'Size' => '24',
      'Type' => 'Typedef'
    },
    '239493' => {
      'BaseType' => '239481',
      'Name' => 'pldm_pdr const',
      'Size' => '24',
      'Type' => 'Const'
    },
    '239498' => {
      'Line' => '33',
      'Memb' => {
        '0' => {
          'name' => 'record_count',
          'offset' => '0',
          'type' => '169'
        },
        '1' => {
          'name' => 'size',
          'offset' => '4',
          'type' => '169'
        },
        '2' => {
          'name' => 'first',
          'offset' => '8',
          'type' => '240968'
        },
        '3' => {
          'name' => 'last',
          'offset' => '22',
          'type' => '240968'
        }
      },
      'Name' => 'struct pldm_pdr',
      'PrivateABI' => 1,
      'Size' => '24',
      'Source' => 'pdr.c',
      'Type' => 'Struct'
    },
    '239564' => {
      'BaseType' => '239581',
      'Header' => 'pdr.h',
      'Line' => '20',
      'Name' => 'pldm_pdr_record',
      'PrivateABI' => 1,
      'Size' => '32',
      'Type' => 'Typedef'
    },
    '239576' => {
      'BaseType' => '239564',
      'Name' => 'pldm_pdr_record const',
      'Size' => '32',
      'Type' => 'Const'
    },
    '239581' => {
      'Line' => '24',
      'Memb' => {
        '0' => {
          'name' => 'record_handle',
          'offset' => '0',
          'type' => '169'
        },
        '1' => {
          'name' => 'size',
          'offset' => '4',
          'type' => '169'
        },
        '2' => {
          'name' => 'data',
          'offset' => '8',
          'type' => '2413'
        },
        '3' => {
          'name' => 'next',
          'offset' => '22',
          'type' => '240956'
        },
        '4' => {
          'name' => 'is_remote',
          'offset' => '36',
          'type' => '6953'
        },
        '5' => {
          'name' => 'terminus_handle',
          'offset' => '38',
          'type' => '157'
        }
      },
      'Name' => 'struct pldm_pdr_record',
      'PrivateABI' => 1,
      'Size' => '32',
      'Source' => 'pdr.c',
      'Type' => 'Struct'
    },
    '239673' => {
      'Header' => 'pdr.h',
      'Line' => '326',
      'Memb' => {
        '0' => {
          'name' => 'entity_type',
          'offset' => '0',
          'type' => '157'
        },
        '1' => {
          'name' => 'entity_instance_num',
          'offset' => '2',
          'type' => '157'
        },
        '2' => {
          'name' => 'entity_container_id',
          'offset' => '4',
          'type' => '157'
        }
      },
      'Name' => 'struct pldm_entity',
      'Size' => '6',
      'Type' => 'Struct'
    },
    '239735' => {
      'BaseType' => '239673',
      'Header' => 'pdr.h',
      'Line' => '330',
      'Name' => 'pldm_entity',
      'Size' => '6',
      'Type' => 'Typedef'
    },
    '239747' => {
      'BaseType' => '239735',
      'Name' => 'pldm_entity const',
      'Size' => '6',
      'Type' => 'Const'
    },
    '239781' => {
      'BaseType' => '239793',
      'Header' => 'pdr.h',
      'Line' => '340',
      'Name' => 'pldm_entity_association_tree',
      'PrivateABI' => 1,
      'Size' => '16',
      'Type' => 'Typedef'
    },
    '239793' => {
      'Line' => '652',
      'Memb' => {
        '0' => {
          'name' => 'root',
          'offset' => '0',
          'type' => '240973'
        },
        '1' => {
          'name' => 'last_used_container_id',
          'offset' => '8',
          'type' => '157'
        }
      },
      'Name' => 'struct pldm_entity_association_tree',
      'PrivateABI' => 1,
      'Size' => '16',
      'Source' => 'pdr.c',
      'Type' => 'Struct'
    },
    '239836' => {
      'BaseType' => '239853',
      'Header' => 'pdr.h',
      'Line' => '345',
      'Name' => 'pldm_entity_node',
      'PrivateABI' => 1,
      'Size' => '40',
      'Type' => 'Typedef'
    },
    '239848' => {
      'BaseType' => '239836',
      'Name' => 'pldm_entity_node const',
      'Size' => '40',
      'Type' => 'Const'
    },
    '239853' => {
      'Line' => '657',
      'Memb' => {
        '0' => {
          'name' => 'entity',
          'offset' => '0',
          'type' => '239735'
        },
        '1' => {
          'name' => 'parent',
          'offset' => '6',
          'type' => '239735'
        },
        '2' => {
          'name' => 'remote_container_id',
          'offset' => '18',
          'type' => '157'
        },
        '3' => {
          'name' => 'first_child',
          'offset' => '22',
          'type' => '240973'
        },
        '4' => {
          'name' => 'next_sibling',
          'offset' => '36',
          'type' => '240973'
        },
        '5' => {
          'name' => 'association_type',
          'offset' => '50',
          'type' => '145'
        }
      },
      'Name' => 'struct pldm_entity_node',
      'PrivateABI' => 1,
      'Size' => '40',
      'Source' => 'pdr.c',
      'Type' => 'Struct'
    },
    '240174' => {
      'Header' => 'platform.h',
      'Line' => '593',
      'Memb' => {
        '0' => {
          'name' => 'record_handle',
          'offset' => '0',
          'type' => '169'
        },
        '1' => {
          'name' => 'version',
          'offset' => '4',
          'type' => '145'
        },
        '2' => {
          'name' => 'type',
          'offset' => '5',
          'type' => '145'
        },
        '3' => {
          'name' => 'record_change_num',
          'offset' => '6',
          'type' => '157'
        },
        '4' => {
          'name' => 'length',
          'offset' => '8',
          'type' => '157'
        }
      },
      'Name' => 'struct pldm_pdr_hdr',
      'Size' => '10',
      'Type' => 'Struct'
    },
    '240623' => {
      'Header' => 'platform.h',
      'Line' => '668',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '240174'
        },
        '1' => {
          'name' => 'terminus_handle',
          'offset' => '16',
          'type' => '157'
        },
        '2' => {
          'name' => 'sensor_id',
          'offset' => '18',
          'type' => '157'
        },
        '3' => {
          'name' => 'entity_type',
          'offset' => '20',
          'type' => '157'
        },
        '4' => {
          'name' => 'entity_instance',
          'offset' => '22',
          'type' => '157'
        },
        '5' => {
          'name' => 'container_id',
          'offset' => '24',
          'type' => '157'
        },
        '6' => {
          'name' => 'sensor_init',
          'offset' => '32',
          'type' => '145'
        },
        '7' => {
          'name' => 'sensor_auxiliary_names_pdr',
          'offset' => '33',
          'type' => '97751'
        },
        '8' => {
          'name' => 'composite_sensor_count',
          'offset' => '34',
          'type' => '145'
        },
        '9' => {
          'name' => 'possible_states',
          'offset' => '35',
          'type' => '1798'
        }
      },
      'Name' => 'struct pldm_state_sensor_pdr',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '240777' => {
      'Header' => 'platform.h',
      'Line' => '695',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '240174'
        },
        '1' => {
          'name' => 'terminus_handle',
          'offset' => '16',
          'type' => '157'
        },
        '2' => {
          'name' => 'effecter_id',
          'offset' => '18',
          'type' => '157'
        },
        '3' => {
          'name' => 'entity_type',
          'offset' => '20',
          'type' => '157'
        },
        '4' => {
          'name' => 'entity_instance',
          'offset' => '22',
          'type' => '157'
        },
        '5' => {
          'name' => 'container_id',
          'offset' => '24',
          'type' => '157'
        },
        '6' => {
          'name' => 'effecter_semantic_id',
          'offset' => '32',
          'type' => '157'
        },
        '7' => {
          'name' => 'effecter_init',
          'offset' => '34',
          'type' => '145'
        },
        '8' => {
          'name' => 'has_description_pdr',
          'offset' => '35',
          'type' => '97751'
        },
        '9' => {
          'name' => 'composite_effecter_count',
          'offset' => '36',
          'type' => '145'
        },
        '10' => {
          'name' => 'possible_states',
          'offset' => '37',
          'type' => '1798'
        }
      },
      'Name' => 'struct pldm_state_effecter_pdr',
      'Size' => '26',
      'Type' => 'Struct'
    },
    '240956' => {
      'BaseType' => '239581',
      'Name' => 'struct pldm_pdr_record*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '240968' => {
      'BaseType' => '239564',
      'Name' => 'pldm_pdr_record*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '240973' => {
      'BaseType' => '239836',
      'Name' => 'pldm_entity_node*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '241340' => {
      'BaseType' => '239781',
      'Name' => 'pldm_entity_association_tree*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '241345' => {
      'BaseType' => '239747',
      'Name' => 'pldm_entity const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '242847' => {
      'BaseType' => '239481',
      'Name' => 'pldm_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '244520' => {
      'BaseType' => '239576',
      'Name' => 'pldm_pdr_record const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '253358' => {
      'BaseType' => '239735',
      'Name' => 'pldm_entity*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '273376' => {
      'BaseType' => '253358',
      'Name' => 'pldm_entity**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '274023' => {
      'BaseType' => '240973',
      'Name' => 'pldm_entity_node**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '274812' => {
      'BaseType' => '239493',
      'Name' => 'pldm_pdr const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '280476' => {
      'BaseType' => '239848',
      'Name' => 'pldm_entity_node const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '287411' => {
      'BaseType' => '240777',
      'Name' => 'struct pldm_state_effecter_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '293180' => {
      'BaseType' => '240623',
      'Name' => 'struct pldm_state_sensor_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '298457' => {
      'BaseType' => '74',
      'Header' => 'types.h',
      'Line' => '37',
      'Name' => '__int8_t',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '298481' => {
      'BaseType' => '93',
      'Header' => 'types.h',
      'Line' => '39',
      'Name' => '__int16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '298505' => {
      'BaseType' => '112',
      'Header' => 'types.h',
      'Line' => '41',
      'Name' => '__int32_t',
      'PrivateABI' => 1,
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '298529' => {
      'BaseType' => '100',
      'Header' => 'types.h',
      'Line' => '55',
      'Name' => '__uint_least16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '298560' => {
      'BaseType' => '298457',
      'Header' => 'stdint-intn.h',
      'Line' => '24',
      'Name' => 'int8_t',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '298572' => {
      'BaseType' => '298481',
      'Header' => 'stdint-intn.h',
      'Line' => '25',
      'Name' => 'int16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '298584' => {
      'BaseType' => '298505',
      'Header' => 'stdint-intn.h',
      'Line' => '26',
      'Name' => 'int32_t',
      'PrivateABI' => 1,
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '299245' => {
      'BaseType' => '1205',
      'Header' => 'pldm_types.h',
      'Line' => '169',
      'Name' => 'real32_t',
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '299984' => {
      'BaseType' => '298529',
      'Header' => 'uchar.h',
      'Line' => '51',
      'Name' => 'char16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '300907' => {
      'Header' => 'platform.h',
      'Line' => '345',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_SENSOR_OP_STATE',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_STATE_SENSOR_STATE',
          'value' => '1'
        },
        '2' => {
          'name' => 'PLDM_NUMERIC_SENSOR_STATE',
          'value' => '2'
        }
      },
      'Name' => 'enum sensor_event_class_states',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '300941' => {
      'BaseType' => '300907',
      'Name' => 'enum sensor_event_class_states const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '301437' => {
      'Header' => 'platform.h',
      'Line' => '685',
      'Memb' => {
        '0' => {
          'name' => 'state_set_id',
          'offset' => '0',
          'type' => '157'
        },
        '1' => {
          'name' => 'possible_states_size',
          'offset' => '2',
          'type' => '145'
        },
        '2' => {
          'name' => 'states',
          'offset' => '3',
          'type' => '301499'
        }
      },
      'Name' => 'struct state_sensor_possible_states',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '301494' => {
      'BaseType' => '301437',
      'Name' => 'struct state_sensor_possible_states const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '301499' => {
      'BaseType' => '1105',
      'Name' => 'bitfield8_t[1]',
      'Size' => '1',
      'Type' => 'Array'
    },
    '301683' => {
      'BaseType' => '240777',
      'Name' => 'struct pldm_state_effecter_pdr const',
      'Size' => '26',
      'Type' => 'Const'
    },
    '301877' => {
      'Header' => 'platform.h',
      'Line' => '786',
      'Memb' => {
        '0' => {
          'name' => 'value_u8',
          'offset' => '0',
          'type' => '145'
        },
        '1' => {
          'name' => 'value_s8',
          'offset' => '0',
          'type' => '298560'
        },
        '2' => {
          'name' => 'value_u16',
          'offset' => '0',
          'type' => '157'
        },
        '3' => {
          'name' => 'value_s16',
          'offset' => '0',
          'type' => '298572'
        },
        '4' => {
          'name' => 'value_u32',
          'offset' => '0',
          'type' => '169'
        },
        '5' => {
          'name' => 'value_s32',
          'offset' => '0',
          'type' => '298584'
        },
        '6' => {
          'name' => 'value_f32',
          'offset' => '0',
          'type' => '299245'
        }
      },
      'Name' => 'union union_range_field_format',
      'Size' => '4',
      'Type' => 'Union'
    },
    '302476' => {
      'Header' => 'platform.h',
      'Line' => '843',
      'Memb' => {
        '0' => {
          'name' => 'value_u8',
          'offset' => '0',
          'type' => '145'
        },
        '1' => {
          'name' => 'value_s8',
          'offset' => '0',
          'type' => '298560'
        },
        '2' => {
          'name' => 'value_u16',
          'offset' => '0',
          'type' => '157'
        },
        '3' => {
          'name' => 'value_s16',
          'offset' => '0',
          'type' => '298572'
        },
        '4' => {
          'name' => 'value_u32',
          'offset' => '0',
          'type' => '169'
        },
        '5' => {
          'name' => 'value_s32',
          'offset' => '0',
          'type' => '298584'
        }
      },
      'Name' => 'union union_sensor_data_size',
      'Size' => '4',
      'Type' => 'Union'
    },
    '302489' => {
      'Header' => 'platform.h',
      'Line' => '850',
      'Memb' => {
        '0' => {
          'name' => 'record_handle',
          'offset' => '0',
          'type' => '169'
        },
        '1' => {
          'name' => 'version',
          'offset' => '4',
          'type' => '145'
        },
        '2' => {
          'name' => 'type',
          'offset' => '5',
          'type' => '145'
        },
        '3' => {
          'name' => 'record_change_num',
          'offset' => '6',
          'type' => '157'
        },
        '4' => {
          'name' => 'length',
          'offset' => '8',
          'type' => '157'
        }
      },
      'Name' => 'struct pldm_value_pdr_hdr',
      'Size' => '12',
      'Type' => 'Struct'
    },
    '302574' => {
      'Header' => 'platform.h',
      'Line' => '868',
      'Memb' => {
        '0' => {
          'name' => 'entity_instance_num',
          'offset' => '0',
          'type' => '157'
        },
        '1' => {
          'name' => 'entity_instance',
          'offset' => '0',
          'type' => '157'
        }
      },
      'Name' => 'anon-union-platform.h-868',
      'Size' => '2',
      'Type' => 'Union'
    },
    '302609' => {
      'Header' => 'platform.h',
      'Line' => '863',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '302489'
        },
        '1' => {
          'name' => 'terminus_handle',
          'offset' => '18',
          'type' => '157'
        },
        '2' => {
          'name' => 'sensor_id',
          'offset' => '20',
          'type' => '157'
        },
        '3' => {
          'name' => 'entity_type',
          'offset' => '22',
          'type' => '157'
        },
        '4' => {
          'name' => 'unnamed0',
          'offset' => '24',
          'type' => '302574'
        },
        '5' => {
          'name' => 'container_id',
          'offset' => '32',
          'type' => '157'
        },
        '6' => {
          'name' => 'sensor_init',
          'offset' => '34',
          'type' => '145'
        },
        '7' => {
          'name' => 'sensor_auxiliary_names_pdr',
          'offset' => '35',
          'type' => '97751'
        },
        '8' => {
          'name' => 'base_unit',
          'offset' => '36',
          'type' => '145'
        },
        '9' => {
          'name' => 'unit_modifier',
          'offset' => '37',
          'type' => '298560'
        },
        '10' => {
          'name' => 'rate_unit',
          'offset' => '38',
          'type' => '145'
        },
        '11' => {
          'name' => 'base_oem_unit_handle',
          'offset' => '39',
          'type' => '145'
        },
        '12' => {
          'name' => 'aux_unit',
          'offset' => '40',
          'type' => '145'
        },
        '13' => {
          'name' => 'aux_unit_modifier',
          'offset' => '41',
          'type' => '298560'
        },
        '14' => {
          'name' => 'aux_rate_unit',
          'offset' => '48',
          'type' => '145'
        },
        '15' => {
          'name' => 'rel',
          'offset' => '49',
          'type' => '145'
        },
        '16' => {
          'name' => 'aux_oem_unit_handle',
          'offset' => '50',
          'type' => '145'
        },
        '17' => {
          'name' => 'is_linear',
          'offset' => '51',
          'type' => '97751'
        },
        '18' => {
          'name' => 'sensor_data_size',
          'offset' => '52',
          'type' => '145'
        },
        '19' => {
          'name' => 'resolution',
          'offset' => '54',
          'type' => '299245'
        },
        '20' => {
          'name' => 'offset',
          'offset' => '64',
          'type' => '299245'
        },
        '21' => {
          'name' => 'accuracy',
          'offset' => '68',
          'type' => '157'
        },
        '22' => {
          'name' => 'plus_tolerance',
          'offset' => '70',
          'type' => '145'
        },
        '23' => {
          'name' => 'minus_tolerance',
          'offset' => '71',
          'type' => '145'
        },
        '24' => {
          'name' => 'hysteresis',
          'offset' => '72',
          'type' => '302476'
        },
        '25' => {
          'name' => 'supported_thresholds',
          'offset' => '82',
          'type' => '1105'
        },
        '26' => {
          'name' => 'threshold_and_hysteresis_volatility',
          'offset' => '83',
          'type' => '1105'
        },
        '27' => {
          'name' => 'state_transition_interval',
          'offset' => '86',
          'type' => '299245'
        },
        '28' => {
          'name' => 'update_interval',
          'offset' => '96',
          'type' => '299245'
        },
        '29' => {
          'name' => 'max_readable',
          'offset' => '100',
          'type' => '302476'
        },
        '30' => {
          'name' => 'min_readable',
          'offset' => '104',
          'type' => '302476'
        },
        '31' => {
          'name' => 'range_field_format',
          'offset' => '114',
          'type' => '145'
        },
        '32' => {
          'name' => 'range_field_support',
          'offset' => '115',
          'type' => '1105'
        },
        '33' => {
          'name' => 'nominal_value',
          'offset' => '118',
          'type' => '301877'
        },
        '34' => {
          'name' => 'normal_max',
          'offset' => '128',
          'type' => '301877'
        },
        '35' => {
          'name' => 'normal_min',
          'offset' => '132',
          'type' => '301877'
        },
        '36' => {
          'name' => 'warning_high',
          'offset' => '136',
          'type' => '301877'
        },
        '37' => {
          'name' => 'warning_low',
          'offset' => '146',
          'type' => '301877'
        },
        '38' => {
          'name' => 'critical_high',
          'offset' => '150',
          'type' => '301877'
        },
        '39' => {
          'name' => 'critical_low',
          'offset' => '256',
          'type' => '301877'
        },
        '40' => {
          'name' => 'fatal_high',
          'offset' => '260',
          'type' => '301877'
        },
        '41' => {
          'name' => 'fatal_low',
          'offset' => '264',
          'type' => '301877'
        }
      },
      'Name' => 'struct pldm_numeric_sensor_value_pdr',
      'Size' => '112',
      'Type' => 'Struct'
    },
    '303202' => {
      'BaseType' => '299984',
      'Header' => 'platform.h',
      'Line' => '911',
      'Name' => 'pldm_utf16be',
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '303215' => {
      'Header' => 'platform.h',
      'Line' => '913',
      'Memb' => {
        '0' => {
          'name' => 'tag',
          'offset' => '0',
          'type' => '7570'
        },
        '1' => {
          'name' => 'name',
          'offset' => '8',
          'type' => '303257'
        }
      },
      'Name' => 'struct pldm_entity_auxiliary_name',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '303257' => {
      'BaseType' => '303202',
      'Name' => 'pldm_utf16be*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '303262' => {
      'Header' => 'platform.h',
      'Line' => '923',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '302489'
        },
        '1' => {
          'name' => 'container',
          'offset' => '18',
          'type' => '239735'
        },
        '2' => {
          'name' => 'shared_name_count',
          'offset' => '24',
          'type' => '145'
        },
        '3' => {
          'name' => 'name_string_count',
          'offset' => '25',
          'type' => '145'
        },
        '4' => {
          'name' => 'names',
          'offset' => '36',
          'type' => '303376'
        },
        '5' => {
          'name' => 'auxiliary_name_data_size',
          'offset' => '50',
          'type' => '900'
        },
        '6' => {
          'name' => 'auxiliary_name_data',
          'offset' => '64',
          'type' => '303381'
        }
      },
      'Name' => 'struct pldm_entity_auxiliary_names_pdr',
      'Size' => '40',
      'Type' => 'Struct'
    },
    '303376' => {
      'BaseType' => '303215',
      'Name' => 'struct pldm_entity_auxiliary_name*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '303381' => {
      'BaseType' => '138',
      'Name' => 'char[]',
      'Size' => '8',
      'Type' => 'Array'
    },
    '303396' => {
      'Header' => 'platform.h',
      'Line' => '953',
      'Memb' => {
        '0' => {
          'name' => 'state_set_id',
          'offset' => '0',
          'type' => '157'
        },
        '1' => {
          'name' => 'possible_states_size',
          'offset' => '2',
          'type' => '145'
        },
        '2' => {
          'name' => 'states',
          'offset' => '3',
          'type' => '301499'
        }
      },
      'Name' => 'struct state_effecter_possible_states',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '303453' => {
      'BaseType' => '303396',
      'Name' => 'struct state_effecter_possible_states const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '303458' => {
      'Header' => 'platform.h',
      'Line' => '977',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '302489'
        },
        '1' => {
          'name' => 'terminus_handle',
          'offset' => '18',
          'type' => '157'
        },
        '2' => {
          'name' => 'file_identifier',
          'offset' => '20',
          'type' => '157'
        },
        '3' => {
          'name' => 'container',
          'offset' => '22',
          'type' => '239735'
        },
        '4' => {
          'name' => 'superior_directory_file_identifier',
          'offset' => '34',
          'type' => '157'
        },
        '5' => {
          'name' => 'file_classification',
          'offset' => '36',
          'type' => '145'
        },
        '6' => {
          'name' => 'oem_file_classification',
          'offset' => '37',
          'type' => '145'
        },
        '7' => {
          'name' => 'file_capabilities',
          'offset' => '38',
          'type' => '77758'
        },
        '8' => {
          'name' => 'file_version',
          'offset' => '40',
          'type' => '1188'
        },
        '9' => {
          'name' => 'file_maximum_size',
          'offset' => '50',
          'type' => '169'
        },
        '10' => {
          'name' => 'file_maximum_file_descriptor_count',
          'offset' => '54',
          'type' => '145'
        },
        '11' => {
          'name' => 'file_name',
          'offset' => '64',
          'type' => '8097'
        },
        '12' => {
          'name' => 'oem_file_classification_name',
          'offset' => '86',
          'type' => '8097'
        }
      },
      'Name' => 'struct pldm_platform_file_descriptor_pdr',
      'Size' => '72',
      'Type' => 'Struct'
    },
    '303659' => {
      'Header' => 'platform.h',
      'Line' => '1023',
      'Memb' => {
        '0' => {
          'name' => 'set_request',
          'offset' => '0',
          'type' => '145'
        },
        '1' => {
          'name' => 'effecter_state',
          'offset' => '1',
          'type' => '145'
        }
      },
      'Name' => 'struct state_field_for_state_effecter_set',
      'Size' => '2',
      'Type' => 'Struct'
    },
    '303702' => {
      'BaseType' => '303659',
      'Header' => 'platform.h',
      'Line' => '1026',
      'Name' => 'set_effecter_state_field',
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '303715' => {
      'Header' => 'platform.h',
      'Line' => '1032',
      'Memb' => {
        '0' => {
          'name' => 'sensor_op_state',
          'offset' => '0',
          'type' => '145'
        },
        '1' => {
          'name' => 'present_state',
          'offset' => '1',
          'type' => '145'
        },
        '2' => {
          'name' => 'previous_state',
          'offset' => '2',
          'type' => '145'
        },
        '3' => {
          'name' => 'event_state',
          'offset' => '3',
          'type' => '145'
        }
      },
      'Name' => 'struct state_field_for_get_state_sensor_readings',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '303786' => {
      'BaseType' => '303715',
      'Header' => 'platform.h',
      'Line' => '1040',
      'Name' => 'get_sensor_state_field',
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '303799' => {
      'Header' => 'platform.h',
      'Line' => '1046',
      'Memb' => {
        '0' => {
          'name' => 'effecter_op_state',
          'offset' => '0',
          'type' => '145'
        },
        '1' => {
          'name' => 'pending_state',
          'offset' => '1',
          'type' => '145'
        },
        '2' => {
          'name' => 'present_state',
          'offset' => '2',
          'type' => '145'
        }
      },
      'Name' => 'struct state_field_for_get_state_effecter_states',
      'Size' => '3',
      'Type' => 'Struct'
    },
    '303856' => {
      'BaseType' => '303799',
      'Header' => 'platform.h',
      'Line' => '1050',
      'Name' => 'get_effecter_state_field',
      'Size' => '3',
      'Type' => 'Typedef'
    },
    '304340' => {
      'Header' => 'platform.h',
      'Line' => '1125',
      'Memb' => {
        '0' => {
          'name' => 'mctp_eid',
          'offset' => '0',
          'type' => '145'
        },
        '1' => {
          'name' => 'vendor_specific',
          'offset' => '0',
          'type' => '8097'
        }
      },
      'Name' => 'anon-union-platform.h-1125',
      'Size' => '16',
      'Type' => 'Union'
    },
    '304374' => {
      'Header' => 'platform.h',
      'Line' => '1122',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '145'
        },
        '1' => {
          'name' => 'transport_protocol_type',
          'offset' => '1',
          'type' => '145'
        },
        '2' => {
          'name' => 'event_receiver_address',
          'offset' => '8',
          'type' => '304340'
        }
      },
      'Name' => 'struct pldm_get_event_receiver_resp',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '304676' => {
      'Header' => 'platform.h',
      'Line' => '1210',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '145'
        },
        '1' => {
          'name' => 'comp_effecter_count',
          'offset' => '1',
          'type' => '145'
        },
        '2' => {
          'name' => 'field',
          'offset' => '2',
          'type' => '304733'
        }
      },
      'Name' => 'struct pldm_get_state_effecter_states_resp',
      'Size' => '26',
      'Type' => 'Struct'
    },
    '304733' => {
      'BaseType' => '303856',
      'Name' => 'get_effecter_state_field[8]',
      'Size' => '24',
      'Type' => 'Array'
    },
    '304749' => {
      'Header' => 'platform.h',
      'Line' => '1220',
      'Memb' => {
        '0' => {
          'name' => 'sensor_id',
          'offset' => '0',
          'type' => '157'
        },
        '1' => {
          'name' => 'sensor_event_class_type',
          'offset' => '2',
          'type' => '145'
        },
        '2' => {
          'name' => 'event_class',
          'offset' => '3',
          'type' => '1798'
        }
      },
      'Name' => 'struct pldm_sensor_event_data',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '304863' => {
      'Header' => 'platform.h',
      'Line' => '1260',
      'Memb' => {
        '0' => {
          'name' => 'format_version',
          'offset' => '0',
          'type' => '145'
        },
        '1' => {
          'name' => 'event_id',
          'offset' => '2',
          'type' => '157'
        },
        '2' => {
          'name' => 'data_transfer_handle',
          'offset' => '4',
          'type' => '169'
        }
      },
      'Name' => 'struct pldm_message_poll_event',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '304925' => {
      'Header' => 'platform.h',
      'Line' => '1270',
      'Memb' => {
        '0' => {
          'name' => 'format_version',
          'offset' => '0',
          'type' => '145'
        },
        '1' => {
          'name' => 'format_type',
          'offset' => '1',
          'type' => '145'
        },
        '2' => {
          'name' => 'event_data_length',
          'offset' => '2',
          'type' => '157'
        },
        '3' => {
          'name' => 'event_data',
          'offset' => '4',
          'type' => '304996'
        }
      },
      'Name' => 'struct pldm_platform_cper_event',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '304996' => {
      'BaseType' => '145',
      'Name' => 'uint8_t[]',
      'Size' => '8',
      'Type' => 'Array'
    },
    '305152' => {
      'Header' => 'platform.h',
      'Line' => '1330',
      'Memb' => {
        '0' => {
          'name' => 'event_data_format',
          'offset' => '0',
          'type' => '145'
        },
        '1' => {
          'name' => 'number_of_change_records',
          'offset' => '1',
          'type' => '145'
        },
        '2' => {
          'name' => 'change_records',
          'offset' => '2',
          'type' => '1798'
        }
      },
      'Name' => 'struct pldm_pdr_repository_chg_event_data',
      'Size' => '3',
      'Type' => 'Struct'
    },
    '305730' => {
      'Header' => 'platform.h',
      'Line' => '2843',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '302489'
        },
        '1' => {
          'name' => 'resource_id',
          'offset' => '18',
          'type' => '169'
        },
        '2' => {
          'name' => 'resource_flags',
          'offset' => '22',
          'type' => '1105'
        },
        '3' => {
          'name' => 'containing_resource_id',
          'offset' => '32',
          'type' => '169'
        },
        '4' => {
          'name' => 'proposed_containing_resource_name',
          'offset' => '36',
          'type' => '8097'
        },
        '5' => {
          'name' => 'sub_uri',
          'offset' => '64',
          'type' => '8097'
        },
        '6' => {
          'name' => 'additional_resource_id_count',
          'offset' => '86',
          'type' => '157'
        },
        '7' => {
          'name' => 'additional_resources',
          'offset' => '100',
          'type' => '8097'
        },
        '8' => {
          'name' => 'major_schema_version',
          'offset' => '128',
          'type' => '1188'
        },
        '9' => {
          'name' => 'major_schema_dictionary_length_bytes',
          'offset' => '132',
          'type' => '157'
        },
        '10' => {
          'name' => 'major_schema_dictionary_signature',
          'offset' => '136',
          'type' => '169'
        },
        '11' => {
          'name' => 'major_schema_name',
          'offset' => '150',
          'type' => '8097'
        },
        '12' => {
          'name' => 'oem_count',
          'offset' => '274',
          'type' => '157'
        },
        '13' => {
          'name' => 'oem_names',
          'offset' => '288',
          'type' => '8097'
        }
      },
      'Name' => 'struct pldm_platform_redfish_resource_pdr',
      'Size' => '136',
      'Type' => 'Struct'
    },
    '305940' => {
      'Header' => 'platform.h',
      'Line' => '2919',
      'Memb' => {
        '0' => {
          'name' => 'id',
          'offset' => '0',
          'type' => '169'
        },
        '1' => {
          'name' => 'sub_uri',
          'offset' => '8',
          'type' => '8097'
        }
      },
      'Name' => 'struct pldm_platform_redfish_resource_pdr_additional_resource',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '305981' => {
      'Header' => 'platform.h',
      'Line' => '2924',
      'Memb' => {
        '0' => {
          'name' => 'field',
          'offset' => '0',
          'type' => '8097'
        },
        '1' => {
          'name' => 'entries',
          'offset' => '22',
          'type' => '900'
        }
      },
      'Name' => 'struct pldm_platform_redfish_resource_pdr_additional_resource_iter',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '306024' => {
      'Header' => 'platform.h',
      'Line' => '3019',
      'Memb' => {
        '0' => {
          'name' => 'name',
          'offset' => '0',
          'type' => '8097'
        }
      },
      'Name' => 'struct pldm_platform_redfish_resource_pdr_oem_name',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '306053' => {
      'Header' => 'platform.h',
      'Line' => '3023',
      'Memb' => {
        '0' => {
          'name' => 'field',
          'offset' => '0',
          'type' => '8097'
        },
        '1' => {
          'name' => 'entries',
          'offset' => '22',
          'type' => '900'
        }
      },
      'Name' => 'struct pldm_platform_redfish_resource_pdr_oem_name_iter',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '306096' => {
      'Header' => 'platform.h',
      'Line' => '3113',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '302489'
        },
        '1' => {
          'name' => 'action_pdr_index',
          'offset' => '18',
          'type' => '145'
        },
        '2' => {
          'name' => 'related_resource_count',
          'offset' => '20',
          'type' => '157'
        },
        '3' => {
          'name' => 'related_resources',
          'offset' => '22',
          'type' => '8097'
        },
        '4' => {
          'name' => 'action_count',
          'offset' => '50',
          'type' => '145'
        },
        '5' => {
          'name' => 'actions',
          'offset' => '64',
          'type' => '8097'
        }
      },
      'Name' => 'struct pldm_platform_redfish_action_pdr',
      'Size' => '56',
      'Type' => 'Struct'
    },
    '306194' => {
      'Header' => 'platform.h',
      'Line' => '3173',
      'Memb' => {
        '0' => {
          'name' => 'field',
          'offset' => '0',
          'type' => '8097'
        },
        '1' => {
          'name' => 'entries',
          'offset' => '22',
          'type' => '900'
        }
      },
      'Name' => 'struct pldm_platform_redfish_action_pdr_related_resource_id_iter',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '306237' => {
      'Header' => 'platform.h',
      'Line' => '3265',
      'Memb' => {
        '0' => {
          'name' => 'name',
          'offset' => '0',
          'type' => '8097'
        },
        '1' => {
          'name' => 'path',
          'offset' => '22',
          'type' => '8097'
        }
      },
      'Name' => 'struct pldm_platform_redfish_action_pdr_action',
      'Size' => '32',
      'Type' => 'Struct'
    },
    '306280' => {
      'Header' => 'platform.h',
      'Line' => '3270',
      'Memb' => {
        '0' => {
          'name' => 'field',
          'offset' => '0',
          'type' => '8097'
        },
        '1' => {
          'name' => 'entries',
          'offset' => '22',
          'type' => '900'
        }
      },
      'Name' => 'struct pldm_platform_redfish_action_pdr_action_iter',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '306323' => {
      'Header' => 'platform.h',
      'Line' => '3369',
      'Memb' => {
        '0' => {
          'name' => 'field',
          'offset' => '0',
          'type' => '8097'
        },
        '1' => {
          'name' => 'current_states',
          'offset' => '22',
          'type' => '8097'
        },
        '2' => {
          'name' => 'total_count',
          'offset' => '50',
          'type' => '145'
        },
        '3' => {
          'name' => 'current_index',
          'offset' => '51',
          'type' => '145'
        }
      },
      'Name' => 'struct pldm_platform_state_effecter_pdr_iter',
      'Size' => '40',
      'Type' => 'Struct'
    },
    '306394' => {
      'BaseType' => '306323',
      'Name' => 'struct pldm_platform_state_effecter_pdr_iter const',
      'Size' => '40',
      'Type' => 'Const'
    },
    '306399' => {
      'Header' => 'platform.h',
      'Line' => '3470',
      'Memb' => {
        '0' => {
          'name' => 'field',
          'offset' => '0',
          'type' => '8097'
        },
        '1' => {
          'name' => 'total_count',
          'offset' => '22',
          'type' => '145'
        },
        '2' => {
          'name' => 'current_index',
          'offset' => '23',
          'type' => '145'
        }
      },
      'Name' => 'struct pldm_platform_state_effecter_pdr_possible_states_iter',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '307827' => {
      'BaseType' => '306399',
      'Name' => 'struct pldm_platform_state_effecter_pdr_possible_states_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '307926' => {
      'BaseType' => '306394',
      'Name' => 'struct pldm_platform_state_effecter_pdr_iter const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '307931' => {
      'BaseType' => '112',
      'Name' => 'int*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '310016' => {
      'BaseType' => '306323',
      'Name' => 'struct pldm_platform_state_effecter_pdr_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '310021' => {
      'BaseType' => '303396',
      'Name' => 'struct state_effecter_possible_states*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '310124' => {
      'BaseType' => '301683',
      'Name' => 'struct pldm_state_effecter_pdr const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '312483' => {
      'BaseType' => '306280',
      'Name' => 'struct pldm_platform_redfish_action_pdr_action_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '312488' => {
      'BaseType' => '306237',
      'Name' => 'struct pldm_platform_redfish_action_pdr_action*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '313793' => {
      'BaseType' => '306194',
      'Name' => 'struct pldm_platform_redfish_action_pdr_related_resource_id_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '320073' => {
      'BaseType' => '306096',
      'Name' => 'struct pldm_platform_redfish_action_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '321720' => {
      'BaseType' => '306053',
      'Name' => 'struct pldm_platform_redfish_resource_pdr_oem_name_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '321725' => {
      'BaseType' => '306024',
      'Name' => 'struct pldm_platform_redfish_resource_pdr_oem_name*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '323768' => {
      'BaseType' => '305981',
      'Name' => 'struct pldm_platform_redfish_resource_pdr_additional_resource_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '323773' => {
      'BaseType' => '305940',
      'Name' => 'struct pldm_platform_redfish_resource_pdr_additional_resource*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '335051' => {
      'BaseType' => '305730',
      'Name' => 'struct pldm_platform_redfish_resource_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '342850' => {
      'BaseType' => '2465',
      'Name' => 'size_t*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '352086' => {
      'BaseType' => '303458',
      'Name' => 'struct pldm_platform_file_descriptor_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '352140' => {
      'BaseType' => '304925',
      'Name' => 'struct pldm_platform_cper_event*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '356665' => {
      'BaseType' => '303262',
      'Name' => 'struct pldm_entity_auxiliary_names_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '368793' => {
      'BaseType' => '304676',
      'Name' => 'struct pldm_get_state_effecter_states_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '416261' => {
      'BaseType' => '304374',
      'Name' => 'struct pldm_get_event_receiver_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '439007' => {
      'BaseType' => '304863',
      'Name' => 'struct pldm_message_poll_event*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '440774' => {
      'BaseType' => '440784',
      'Name' => 'uint32_t const*const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '440779' => {
      'BaseType' => '895',
      'Name' => 'uint32_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '440784' => {
      'BaseType' => '440779',
      'Name' => 'uint32_t const*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '440789' => {
      'BaseType' => '305152',
      'Name' => 'struct pldm_pdr_repository_chg_event_data*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '492093' => {
      'BaseType' => '302609',
      'Name' => 'struct pldm_numeric_sensor_value_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '520405' => {
      'BaseType' => '304749',
      'Name' => 'struct pldm_sensor_event_data*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '520410' => {
      'BaseType' => '520405',
      'Name' => 'struct pldm_sensor_event_data*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '525504' => {
      'BaseType' => '303786',
      'Name' => 'get_sensor_state_field*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '553784' => {
      'BaseType' => '303702',
      'Name' => 'set_effecter_state_field*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '554765' => {
      'BaseType' => '293180',
      'Name' => 'struct pldm_state_sensor_pdr*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '554770' => {
      'BaseType' => '301494',
      'Name' => 'struct state_sensor_possible_states const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '554775' => {
      'BaseType' => '554770',
      'Name' => 'struct state_sensor_possible_states const*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '555175' => {
      'BaseType' => '287411',
      'Name' => 'struct pldm_state_effecter_pdr*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '555180' => {
      'BaseType' => '303453',
      'Name' => 'struct state_effecter_possible_states const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '555185' => {
      'BaseType' => '555180',
      'Name' => 'struct state_effecter_possible_states const*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '559733' => {
      'Line' => '20',
      'Memb' => {
        '0' => {
          'name' => 'prev',
          'offset' => '0',
          'type' => '6335'
        },
        '1' => {
          'name' => 'allocations',
          'offset' => '4',
          'type' => '169'
        }
      },
      'Name' => 'struct pldm_tid_state',
      'PrivateABI' => 1,
      'Size' => '8',
      'Source' => 'instance-id.c',
      'Type' => 'Struct'
    },
    '559772' => {
      'Line' => '25',
      'Memb' => {
        '0' => {
          'name' => 'state',
          'offset' => '0',
          'type' => '559814'
        },
        '1' => {
          'name' => 'lock_db_fd',
          'offset' => '8264',
          'type' => '112'
        }
      },
      'Name' => 'struct pldm_instance_db',
      'PrivateABI' => 1,
      'Size' => '2052',
      'Source' => 'instance-id.c',
      'Type' => 'Struct'
    },
    '559814' => {
      'BaseType' => '559733',
      'Name' => 'struct pldm_tid_state[256]',
      'Size' => '2048',
      'Type' => 'Array'
    },
    '560370' => {
      'BaseType' => '559772',
      'Name' => 'struct pldm_instance_db*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '560757' => {
      'BaseType' => '6335',
      'Name' => 'pldm_instance_id_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '560933' => {
      'BaseType' => '560370',
      'Name' => 'struct pldm_instance_db**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '561460' => {
      'Header' => 'socket.h',
      'Line' => '4',
      'Memb' => {
        '0' => {
          'name' => 'size',
          'offset' => '0',
          'type' => '112'
        },
        '1' => {
          'name' => 'socket',
          'offset' => '4',
          'type' => '112'
        },
        '2' => {
          'name' => 'max_size',
          'offset' => '8',
          'type' => '112'
        }
      },
      'Name' => 'struct pldm_socket_sndbuf',
      'PrivateABI' => 1,
      'Size' => '12',
      'Type' => 'Struct'
    },
    '563392' => {
      'BaseType' => '46',
      'Header' => 'int-ll64.h',
      'Line' => '21',
      'Name' => '__u8',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '563418' => {
      'BaseType' => '53',
      'Header' => 'int-ll64.h',
      'Line' => '24',
      'Name' => '__u16',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '563887' => {
      'BaseType' => '145',
      'Header' => 'pldm.h',
      'Line' => '12',
      'Name' => 'mctp_eid_t',
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '564001' => {
      'BaseType' => '6432',
      'Header' => 'pldm.h',
      'Line' => '29',
      'Name' => 'pldm_requester_rc_t',
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '564013' => {
      'Header' => 'transport.h',
      'Line' => '17',
      'Memb' => {
        '0' => {
          'name' => 'name',
          'offset' => '0',
          'type' => '9687'
        },
        '1' => {
          'name' => 'version',
          'offset' => '8',
          'type' => '145'
        },
        '2' => {
          'name' => 'recv',
          'offset' => '22',
          'type' => '564147'
        },
        '3' => {
          'name' => 'send',
          'offset' => '36',
          'type' => '564188'
        },
        '4' => {
          'name' => 'init_pollfd',
          'offset' => '50',
          'type' => '564270'
        }
      },
      'Name' => 'struct pldm_transport',
      'PrivateABI' => 1,
      'Size' => '40',
      'Type' => 'Struct'
    },
    '564127' => {
      'BaseType' => '564013',
      'Name' => 'struct pldm_transport*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '564132' => {
      'BaseType' => '6323',
      'Name' => 'pldm_tid_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '564147' => {
      'Name' => 'pldm_requester_rc_t(*)(struct pldm_transport*, pldm_tid_t*, void**, size_t*)',
      'Param' => {
        '0' => {
          'type' => '564127'
        },
        '1' => {
          'type' => '564132'
        },
        '2' => {
          'type' => '221334'
        },
        '3' => {
          'type' => '2465'
        }
      },
      'Return' => '564001',
      'Size' => '8',
      'Type' => 'FuncPtr'
    },
    '564188' => {
      'Name' => 'pldm_requester_rc_t(*)(struct pldm_transport*, pldm_tid_t, void const*, size_t)',
      'Param' => {
        '0' => {
          'type' => '564127'
        },
        '1' => {
          'type' => '6323'
        },
        '2' => {
          'type' => '2148'
        },
        '3' => {
          'type' => '900'
        }
      },
      'Return' => '564001',
      'Size' => '8',
      'Type' => 'FuncPtr'
    },
    '564213' => {
      'BaseType' => '564218',
      'Name' => 'struct pollfd*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '564218' => {
      'Header' => 'poll.h',
      'Line' => '36',
      'Memb' => {
        '0' => {
          'name' => 'fd',
          'offset' => '0',
          'type' => '112'
        },
        '1' => {
          'name' => 'events',
          'offset' => '4',
          'type' => '93'
        },
        '2' => {
          'name' => 'revents',
          'offset' => '6',
          'type' => '93'
        }
      },
      'Name' => 'struct pollfd',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Struct'
    },
    '564270' => {
      'Name' => 'int(*)(struct pldm_transport*, struct pollfd*)',
      'Param' => {
        '0' => {
          'type' => '564127'
        },
        '1' => {
          'type' => '564213'
        }
      },
      'Return' => '112',
      'Size' => '8',
      'Type' => 'FuncPtr'
    },
    '564275' => {
      'BaseType' => '53',
      'Header' => 'socket.h',
      'Line' => '10',
      'Name' => '__kernel_sa_family_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '564650' => {
      'Header' => 'mctp.h',
      'Line' => '18',
      'Memb' => {
        '0' => {
          'name' => 's_addr',
          'offset' => '0',
          'type' => '563887'
        }
      },
      'Name' => 'struct mctp_addr',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Struct'
    },
    '564677' => {
      'Header' => 'mctp.h',
      'Line' => '22',
      'Memb' => {
        '0' => {
          'name' => 'smctp_family',
          'offset' => '0',
          'type' => '564275'
        },
        '1' => {
          'name' => '__smctp_pad0',
          'offset' => '2',
          'type' => '563418'
        },
        '2' => {
          'name' => 'smctp_network',
          'offset' => '4',
          'type' => '60'
        },
        '3' => {
          'name' => 'smctp_addr',
          'offset' => '8',
          'type' => '564650'
        },
        '4' => {
          'name' => 'smctp_type',
          'offset' => '9',
          'type' => '563392'
        },
        '5' => {
          'name' => 'smctp_tag',
          'offset' => '16',
          'type' => '563392'
        },
        '6' => {
          'name' => '__smctp_pad1',
          'offset' => '17',
          'type' => '563392'
        }
      },
      'Name' => 'struct sockaddr_mctp',
      'PrivateABI' => 1,
      'Size' => '12',
      'Type' => 'Struct'
    },
    '564782' => {
      'BaseType' => '564677',
      'Name' => 'struct sockaddr_mctp const',
      'Size' => '12',
      'Type' => 'Const'
    },
    '564787' => {
      'Header' => 'af-mctp-internal.h',
      'Line' => '18',
      'Memb' => {
        '0' => {
          'name' => 'net',
          'offset' => '0',
          'type' => '60'
        },
        '1' => {
          'name' => 'eid',
          'offset' => '4',
          'type' => '563887'
        }
      },
      'Name' => 'struct mctp_fq_addr',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Struct'
    },
    '564827' => {
      'Header' => 'af-mctp-internal.h',
      'Line' => '24',
      'Memb' => {
        '0' => {
          'name' => 'transport',
          'offset' => '0',
          'type' => '564013'
        },
        '1' => {
          'name' => 'socket',
          'offset' => '64',
          'type' => '112'
        },
        '2' => {
          'name' => 'tid_map',
          'offset' => '68',
          'type' => '564920'
        },
        '3' => {
          'name' => 'socket_send_buf',
          'offset' => '8338',
          'type' => '561460'
        },
        '4' => {
          'name' => 'bound',
          'offset' => '8452',
          'type' => '6953'
        },
        '5' => {
          'name' => 'cookie_jar',
          'offset' => '8466',
          'type' => '6347'
        }
      },
      'Name' => 'struct pldm_transport_af_mctp',
      'PrivateABI' => 1,
      'Size' => '2128',
      'Type' => 'Struct'
    },
    '564920' => {
      'BaseType' => '564787',
      'Name' => 'struct mctp_fq_addr[256]',
      'Size' => '2048',
      'Type' => 'Array'
    },
    '565796' => {
      'BaseType' => '564827',
      'Name' => 'struct pldm_transport_af_mctp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '565801' => {
      'BaseType' => '564782',
      'Name' => 'struct sockaddr_mctp const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '566118' => {
      'BaseType' => '565796',
      'Name' => 'struct pldm_transport_af_mctp**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '569679' => {
      'Line' => '27',
      'Memb' => {
        '0' => {
          'name' => 'transport',
          'offset' => '0',
          'type' => '564013'
        },
        '1' => {
          'name' => 'socket',
          'offset' => '64',
          'type' => '112'
        },
        '2' => {
          'name' => 'tid_eid_map',
          'offset' => '68',
          'type' => '569747'
        },
        '3' => {
          'name' => 'socket_send_buf',
          'offset' => '768',
          'type' => '561460'
        }
      },
      'Name' => 'struct pldm_transport_mctp_demux',
      'PrivateABI' => 1,
      'Size' => '312',
      'Source' => 'mctp-demux.c',
      'Type' => 'Struct'
    },
    '569747' => {
      'BaseType' => '6323',
      'Name' => 'pldm_tid_t[256]',
      'Size' => '256',
      'Type' => 'Array'
    },
    '570284' => {
      'BaseType' => '569679',
      'Name' => 'struct pldm_transport_mctp_demux*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '570790' => {
      'BaseType' => '570284',
      'Name' => 'struct pldm_transport_mctp_demux**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '592186' => {
      'Header' => 'file_io.h',
      'Line' => '32',
      'Memb' => {
        '0' => {
          'name' => 'handle',
          'offset' => '0',
          'type' => '145'
        },
        '1' => {
          'name' => 'length',
          'offset' => '4',
          'type' => '169'
        },
        '2' => {
          'name' => 'data',
          'offset' => '8',
          'type' => '304996'
        }
      },
      'Name' => 'struct pldm_oem_meta_file_io_write_req',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '592253' => {
      'Header' => 'file_io.h',
      'Line' => '45',
      'Memb' => {
        '0' => {
          'name' => 'transferFlag',
          'offset' => '0',
          'type' => '145'
        },
        '1' => {
          'name' => 'offset',
          'offset' => '2',
          'type' => '157'
        }
      },
      'Name' => 'struct pldm_oem_meta_file_io_read_data_info',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '592292' => {
      'Header' => 'file_io.h',
      'Line' => '55',
      'Memb' => {
        '0' => {
          'name' => 'size',
          'offset' => '0',
          'type' => '157'
        },
        '1' => {
          'name' => 'crc32',
          'offset' => '4',
          'type' => '169'
        }
      },
      'Name' => 'struct pldm_oem_meta_file_io_read_attr_info',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '592331' => {
      'Header' => 'file_io.h',
      'Line' => '70',
      'Memb' => {
        '0' => {
          'name' => 'data',
          'offset' => '0',
          'type' => '592253'
        }
      },
      'Name' => 'anon-union-file_io.h-70',
      'Size' => '4',
      'Type' => 'Union'
    },
    '592349' => {
      'Header' => 'file_io.h',
      'Line' => '65',
      'Memb' => {
        '0' => {
          'name' => 'version',
          'offset' => '0',
          'type' => '900'
        },
        '1' => {
          'name' => 'handle',
          'offset' => '8',
          'type' => '145'
        },
        '2' => {
          'name' => 'option',
          'offset' => '9',
          'type' => '145'
        },
        '3' => {
          'name' => 'length',
          'offset' => '16',
          'type' => '145'
        },
        '4' => {
          'name' => 'info',
          'offset' => '18',
          'type' => '592331'
        }
      },
      'Name' => 'struct pldm_oem_meta_file_io_read_req',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '592427' => {
      'Header' => 'file_io.h',
      'Line' => '86',
      'Memb' => {
        '0' => {
          'name' => 'attr',
          'offset' => '0',
          'type' => '592292'
        },
        '1' => {
          'name' => 'data',
          'offset' => '0',
          'type' => '592253'
        }
      },
      'Name' => 'anon-union-file_io.h-86',
      'Size' => '8',
      'Type' => 'Union'
    },
    '592455' => {
      'Header' => 'file_io.h',
      'Line' => '80',
      'Memb' => {
        '0' => {
          'name' => 'version',
          'offset' => '0',
          'type' => '900'
        },
        '1' => {
          'name' => 'completion_code',
          'offset' => '8',
          'type' => '145'
        },
        '2' => {
          'name' => 'handle',
          'offset' => '9',
          'type' => '145'
        },
        '3' => {
          'name' => 'option',
          'offset' => '16',
          'type' => '145'
        },
        '4' => {
          'name' => 'length',
          'offset' => '17',
          'type' => '145'
        },
        '5' => {
          'name' => 'info',
          'offset' => '18',
          'type' => '592427'
        },
        '6' => {
          'name' => 'data',
          'offset' => '32',
          'type' => '304996'
        }
      },
      'Name' => 'struct pldm_oem_meta_file_io_read_resp',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '596802' => {
      'BaseType' => '592455',
      'Name' => 'struct pldm_oem_meta_file_io_read_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '599723' => {
      'BaseType' => '592349',
      'Name' => 'struct pldm_oem_meta_file_io_read_req*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '600164' => {
      'BaseType' => '592186',
      'Name' => 'struct pldm_oem_meta_file_io_write_req*',
      'Size' => '8',
      'Type' => 'Pointer'
    }
  },
  'UndefinedSymbols' => {
    'libpldm.so.0.17.0' => {
      '_ITM_deregisterTMCloneTable' => 0,
      '_ITM_registerTMCloneTable' => 0,
      '__assert_fail@GLIBC_2.2.5' => 0,
      '__cxa_finalize@GLIBC_2.2.5' => 0,
      '__errno_location@GLIBC_2.2.5' => 0,
      '__gmon_start__' => 0,
      '__isoc23_strtol@GLIBC_2.38' => 0,
      '__memcpy_chk@GLIBC_2.3.4' => 0,
      '__recv_chk@GLIBC_2.4' => 0,
      '__recvfrom_chk@GLIBC_2.4' => 0,
      '__stack_chk_fail@GLIBC_2.4' => 0,
      'bind@GLIBC_2.2.5' => 0,
      'calloc@GLIBC_2.2.5' => 0,
      'clock_gettime@GLIBC_2.17' => 0,
      'close@GLIBC_2.2.5' => 0,
      'connect@GLIBC_2.2.5' => 0,
      'dup@GLIBC_2.2.5' => 0,
      'fclose@GLIBC_2.2.5' => 0,
      'fcntl64@GLIBC_2.28' => 0,
      'fgets@GLIBC_2.2.5' => 0,
      'fopen64@GLIBC_2.2.5' => 0,
      'free@GLIBC_2.2.5' => 0,
      'getsockopt@GLIBC_2.2.5' => 0,
      'malloc@GLIBC_2.2.5' => 0,
      'memcmp@GLIBC_2.2.5' => 0,
      'memcpy@GLIBC_2.14' => 0,
      'memmem@GLIBC_2.2.5' => 0,
      'open64@GLIBC_2.2.5' => 0,
      'poll@GLIBC_2.2.5' => 0,
      'ppoll@GLIBC_2.4' => 0,
      'recv@GLIBC_2.2.5' => 0,
      'recvmsg@GLIBC_2.2.5' => 0,
      'sendmsg@GLIBC_2.2.5' => 0,
      'sendto@GLIBC_2.2.5' => 0,
      'setsockopt@GLIBC_2.2.5' => 0,
      'socket@GLIBC_2.2.5' => 0,
      'stat64@GLIBC_2.33' => 0,
      'strlen@GLIBC_2.2.5' => 0,
      'strnlen@GLIBC_2.2.5' => 0,
      'timerfd_create@GLIBC_2.8' => 0,
      'timerfd_settime@GLIBC_2.8' => 0,
      'write@GLIBC_2.2.5' => 0
    }
  },
  'WordSize' => '8'
};
