$VAR1 = {
          'ABI_DUMPER_VERSION' => '1.4',
          'ABI_DUMP_VERSION' => '3.5',
          'Arch' => 'x86_64',
          'GccVersion' => '15.2.0',
          'Headers' => {
                         'af-mctp.h' => 1,
                         'base.h' => 1,
                         'bios.h' => 1,
                         'bios_table.h' => 1,
                         'control.h' => 1,
                         'file.h' => 1,
                         'file_io.h' => 1,
                         'firmware_fd.h' => 1,
                         'firmware_update.h' => 1,
                         'fru.h' => 1,
                         'host.h' => 1,
                         'instance-id.h' => 1,
                         'mctp-demux.h' => 1,
                         'pdr.h' => 1,
                         'platform.h' => 1,
                         'pldm.h' => 1,
                         'pldm_types.h' => 1,
                         'transport.h' => 1,
                         'utils.h' => 1
                       },
          'Language' => 'C',
          'LibraryName' => 'libpldm.so.0.14.0',
          'LibraryVersion' => '0.14.0',
          'NameSpaces' => {},
          'Needed' => {
                        'libc.so.6' => 1
                      },
          'PublicABI' => '1',
          'Sources' => {
                         'af-mctp.c' => 1,
                         'bios_table.c' => 1,
                         'instance-id.c' => 1,
                         'mctp-demux.c' => 1,

                                                  'pldm_pdr_get_record_count' => 1,
                                                  'pldm_pdr_get_record_handle' => 1,
                                                  'pldm_pdr_get_repo_size' => 1,
                                                  'pldm_pdr_get_terminus_handle' => 1,
                                                  'pldm_pdr_init' => 1,
                                                  'pldm_pdr_record_is_remote' => 1,
                                                  'pldm_pdr_remove_fru_record_set_by_rsi' => 1,
                                                  'pldm_pdr_remove_pdrs_by_terminus_handle' => 1,
                                                  'pldm_pdr_remove_remote_pdrs' => 1,
                                                  'pldm_pdr_update_TL_pdr' => 1,
                                                  'pldm_platform_cper_event_event_data' => 1,
                                                  'pldm_transport_af_mctp_bind' => 1,
                                                  'pldm_transport_af_mctp_core' => 1,
                                                  'pldm_transport_af_mctp_destroy' => 1,
                                                  'pldm_transport_af_mctp_init' => 1,
                                                  'pldm_transport_af_mctp_init_pollfd' => 1,
                                                  'pldm_transport_af_mctp_map_tid' => 1,
                                                  'pldm_transport_af_mctp_unmap_tid' => 1,
                                                  'pldm_transport_mctp_demux_core' => 1,
                                                  'pldm_transport_mctp_demux_destroy' => 1,
                                                  'pldm_transport_mctp_demux_init' => 1,
                                                  'pldm_transport_mctp_demux_init_pollfd' => 1,
                                                  'pldm_transport_mctp_demux_map_tid' => 1,
                                                  'pldm_transport_mctp_demux_unmap_tid' => 1,
                                                  'pldm_transport_poll' => 1,
                                                  'pldm_transport_recv_msg' => 1,
                                                  'pldm_transport_send_msg' => 1,
                                                  'pldm_transport_send_recv_msg' => 1,
                                                  'pldm_transport_test_core' => 1,
                                                  'pldm_transport_test_destroy' => 1,
                                                  'pldm_transport_test_init' => 1,
                                                  'pldm_transport_test_init_pollfd' => 1,
                                                  'unpack_pldm_header' => 1,
                                                  'ver2str' => 1
                                                }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '51' => {
                                    'Name' => 'char',
                                    'Size' => '1',
                                    'Type' => 'Intrinsic'
                                  },
                          '58' => {
                                    'Name' => 'int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  },
                          '65' => {
                                    'Name' => 'unsigned char',
                                    'Size' => '1',
                                    'Type' => 'Intrinsic'
                                  },
                          '72' => {
                                    'Name' => 'unsigned short',
                                    'Size' => '2',
                                    'Type' => 'Intrinsic'
                                  },
                          '79' => {
                                    'Name' => 'unsigned int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  },
                          '86' => {
                                    'Name' => 'unsigned long',
                                    'Size' => '8',
                                    'Type' => 'Intrinsic'
                                  },
                          '93' => {
                                    'Name' => 'signed char',
                                    'Size' => '1',
                                    'Type' => 'Intrinsic'
                                  },
                          '100' => {
                                     'BaseType' => '65',
                                     'Header' => 'types.h',
                                     'Line' => '38',
                                     'Name' => '__uint8_t',
                                     'PrivateABI' => 1,
                                     'Size' => '1',
                                     'Type' => 'Typedef'
                                   },
                          '112' => {
                                     'Name' => 'short',
                                     'Size' => '2',
                                     'Type' => 'Intrinsic'
                                   },
                          '119' => {
                                     'BaseType' => '79',
                                     'Header' => 'types.h',
                                     'Line' => '42',
                                     'Name' => '__uint32_t',
                                     'PrivateABI' => 1,
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '131' => {
                                     'Name' => 'long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '138' => {
                                     'BaseType' => '1',
                                     'Name' => 'void*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '140' => {
                                     'BaseType' => '100',
                                     'Header' => 'stdint-uintn.h',
                                     'Line' => '24',
                                     'Name' => 'uint8_t',
                                     'PrivateABI' => 1,
                                     'Size' => '1',
                                     'Type' => 'Typedef'
                                   },
                          '152' => {
                                     'BaseType' => '119',
                                     'Header' => 'stdint-uintn.h',
                                     'Line' => '26',
                                     'Name' => 'uint32_t',
                                     'PrivateABI' => 1,
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '164' => {
                                     'BaseType' => '152',
                                     'Name' => 'uint32_t const',
                                     'Size' => '4',
                                     'Type' => 'Const'
                                   },
                          '169' => {
                                     'BaseType' => '86',
                                     'Header' => 'stddef.h',
                                     'Line' => '229',
                                     'Name' => 'size_t',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '195' => {
                                     'Header' => 'pldm_types.h',
                                     'Line' => '13',
                                     'Name' => 'struct bits8',
                                     'Size' => '1',
                                     'Type' => 'Struct'
                                   },
                          '353' => {
                                     'Header' => 'pldm_types.h',
                                     'Line' => '23',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'byte',
                                                          'offset' => '0',
                                                          'type' => '140'
                                                        },
                                                 '1' => {
                                                          'name' => 'bits',
                                                          'offset' => '0',
                                                          'type' => '195'
                                                        }
                                               },
                                     'Name' => 'union bitfield8_t',
                                     'Size' => '1',
                                     'Type' => 'Union'
                                   },
                          '365' => {
                                     'BaseType' => '353',
                                     'Name' => 'bitfield8_t const',
                                     'Size' => '1',
                                     'Type' => 'Const'
                                   },
                          '370' => {
                                     'Header' => 'pldm_types.h',
                                     'Line' => '29',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'alpha',
                                                          'offset' => '0',
                                                          'type' => '140'
                                                        },
                                                 '1' => {
                                                          'name' => 'update',
                                                          'offset' => '1',
                                                          'type' => '140'
                                                        },
                                                 '2' => {
                                                          'name' => 'minor',
                                                          'offset' => '2',
                                                          'type' => '140'
                                                        },
                                                 '3' => {
                                                          'name' => 'major',
                                                          'offset' => '3',
                                                          'type' => '140'
                                                        }
                                               },
                                     'Name' => 'struct pldm_version',
                                     'Size' => '4',
                                     'Type' => 'Struct'
                                   },
                          '436' => {
                                     'BaseType' => '370',
                                     'Header' => 'pldm_types.h',
                                     'Line' => '34',
                                     'Name' => 'ver32_t',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '448' => {
                                     'BaseType' => '436',
                                     'Name' => 'ver32_t const',
                                     'Size' => '4',
                                     'Type' => 'Const'
                                   },
                          '453' => {
                                     'Name' => 'float',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '894' => {
                                     'Header' => 'base.h',
                                     'Line' => '130',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'PLDM_RESPONSE',
                                                          'value' => '0'
                                                        },
                                                 '1' => {
                                                          'name' => 'PLDM_REQUEST',
                                                          'value' => '1'
                                                        },
                                                 '2' => {
                                                          'name' => 'PLDM_RESERVED',
                                                          'value' => '2'
                                                        },
                                                 '3' => {
                                                          'name' => 'PLDM_ASYNC_REQUEST_NOTIFY',
                                                          'value' => '3'
                                                        }
                                               },
                                     'Name' => 'enum MessageType',
                                     'Size' => '4',
                                     'Type' => 'Enum'
                                   },
                          '906' => {
                                     'Header' => 'base.h',
                                     'Line' => '183',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'command',
                                                          'offset' => '2',
                                                          'type' => '140'
                                                        }
                                               },
                                     'Name' => 'struct pldm_msg_hdr',
                                     'Size' => '3',
                                     'Type' => 'Struct'
                                   },
                          '1017' => {
                                      'BaseType' => '906',
                                      'Name' => 'struct pldm_msg_hdr const',
                                      'Size' => '3',
                                      'Type' => 'Const'
                                    },
                          '1022' => {
                                      'Header' => 'base.h',
                                      'Line' => '216',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'hdr',
                                                           'offset' => '0',
                                                           'type' => '906'
                                                         },
                                                  '1' => {
                                                           'name' => 'payload',
                                                           'offset' => '3',
                                                           'type' => '1067'
                                                         }
                                                },
                                      'Name' => 'struct pldm_msg',
                                      'Size' => '4',
                                      'Type' => 'Struct'
                                    },
                          '1062' => {
                                      'BaseType' => '1022',
                                      'Name' => 'struct pldm_msg const',
                                      'Size' => '4',
                                      'Type' => 'Const'
                                    },
                          '1067' => {
                                      'BaseType' => '140',
                                      'Name' => 'uint8_t[1]',
                                      'Size' => '1',
                                      'Type' => 'Array'
                                    },
                          '1083' => {
                                      'Header' => 'base.h',
                                      'Line' => '283',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'msg_type',
                                                           'offset' => '0',
                                                           'type' => '894'
                                                         },
                                                  '1' => {
                                                           'name' => 'instance',
                                                           'offset' => '4',
                                                           'type' => '140'
                                                         },
                                                  '2' => {
                                                           'name' => 'pldm_type',
                                                           'offset' => '5',
                                                           'type' => '140'
                                                         },
                                                  '3' => {
                                                           'name' => 'command',
                                                           'offset' => '6',
                                                           'type' => '140'
                                                         },
                                                  '4' => {
                                                           'name' => 'completion_code',
                                                           'offset' => '7',
                                                           'type' => '140'
                                                         }
                                                },
                                      'Name' => 'struct pldm_header_info',
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '1163' => {
                                      'BaseType' => '1083',
                                      'Name' => 'struct pldm_header_info const',
                                      'Size' => '8',
                                      'Type' => 'Const'
                                    },
                          '1168' => {
                                      'BaseType' => '353',
                                      'Name' => 'bitfield8_t[8]',
                                      'Size' => '8',
                                      'Type' => 'Array'
                                    },
                          '1259' => {
                                      'Header' => 'control-internal.h',
                                      'Line' => '15',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'versions',
                                                           'offset' => '0',
                                                           'type' => '1330'
                                                         },
                                                  '1' => {
                                                           'name' => 'versions_count',
                                                           'offset' => '8',
                                                           'type' => '140'
                                                         },
                                                  '2' => {
                                                           'name' => 'commands',
                                                           'offset' => '22',
                                                           'type' => '1336'
                                                         },
                                                  '3' => {
                                                           'name' => 'pldm_type',
                                                           'offset' => '36',
                                                           'type' => '140'
                                                         }
                                                },
                                      'Name' => 'struct pldm_type_versions',
                                      'PrivateABI' => 1,
                                      'Size' => '32',
                                      'Type' => 'Struct'
                                    },
                          '1330' => {
                                      'BaseType' => '1335',
                                      'Name' => 'void const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1335' => {
                                      'BaseType' => '1',
                                      'Name' => 'void const',
                                      'Type' => 'Const'
                                    },
                          '1336' => {
                                      'BaseType' => '365',
                                      'Name' => 'bitfield8_t const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1341' => {
                                      'Header' => 'control-internal.h',
                                      'Line' => '28',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'types',
                                                           'offset' => '0',
                                                           'type' => '1368'
                                                         }
                                                },
                                      'Name' => 'struct pldm_control',
                                      'PrivateABI' => 1,
                                      'Size' => '192',
                                      'Type' => 'Struct'
                                    },
                          '1368' => {
                                      'BaseType' => '1259',
                                      'Name' => 'struct pldm_type_versions[6]',
                                      'Size' => '192',
                                      'Type' => 'Array'
                                    },
                          '1511' => {
                                      'BaseType' => '1022',
                                      'Name' => 'struct pldm_msg*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1590' => {
                                      'BaseType' => '1062',
                                      'Name' => 'struct pldm_msg const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1595' => {
                                      'BaseType' => '140',
                                      'Name' => 'uint8_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1600' => {
                                      'BaseType' => '436',
                                      'Name' => 'ver32_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1694' => {
                                      'BaseType' => '448',
                                      'Name' => 'ver32_t const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1741' => {
                                      'BaseType' => '152',
                                      'Name' => 'uint32_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1810' => {
                                      'BaseType' => '1017',
                                      'Name' => 'struct pldm_msg_hdr const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1815' => {
                                      'BaseType' => '1083',
                                      'Name' => 'struct pldm_header_info*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2002' => {
                                      'BaseType' => '1341',
                                      'Name' => 'struct pldm_control*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2770' => {
                                      'BaseType' => '169',
                                      'Name' => 'size_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '3230' => {
                                      'BaseType' => '1163',
                                      'Name' => 'struct pldm_header_info const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4907' => {
                                      'BaseType' => '140',
                                      'Header' => 'base.h',
                                      'Line' => '19',
                                      'Name' => 'pldm_tid_t',
                                      'Size' => '1',
                                      'Type' => 'Typedef'
                                    },
                          '4919' => {
                                      'BaseType' => '140',
                                      'Header' => 'instance-id.h',
                                      'Line' => '13',
                                      'Name' => 'pldm_instance_id_t',
                                      'Size' => '1',
                                      'Type' => 'Typedef'
                                    },
                          '4931' => {
                                      'Header' => 'responder.h',
                                      'Line' => '10',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'tid',
                                                           'offset' => '0',
                                                           'type' => '4907'
                                                         },
                                                  '1' => {
                                                           'name' => 'instance_id',
                                                           'offset' => '1',
                                                           'type' => '4919'
                                                         },
                                                  '2' => {
                                                           'name' => 'type',
                                                           'offset' => '2',
                                                           'type' => '140'
                                                         },
                                                  '3' => {
                                                           'name' => 'command',
                                                           'offset' => '3',
                                                           'type' => '140'
                                                         },
                                                  '4' => {
                                                           'name' => 'next',
                                                           'offset' => '8',
                                                           'type' => '5011'
                                                         }
                                                },
                                      'Name' => 'struct pldm_responder_cookie',
                                      'PrivateABI' => 1,
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '5011' => {
                                      'BaseType' => '4931',
                                      'Name' => 'struct pldm_responder_cookie*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '5016' => {
                                      'Header' => 'pldm.h',
                                      'Line' => '15',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'PLDM_REQUESTER_SUCCESS',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'PLDM_REQUESTER_OPEN_FAIL',
                                                           'value' => '18446744073709551615 (-1)'
                                                         },
                                                  '2' => {
                                                           'name' => 'PLDM_REQUESTER_NOT_PLDM_MSG',
                                                           'value' => '18446744073709551614 (-2)'
                                                         },
                                                  '3' => {
                                                           'name' => 'PLDM_REQUESTER_NOT_RESP_MSG',
                                                           'value' => '18446744073709551613 (-3)'
                                                         },
                                                  '4' => {
                                                           'name' => 'PLDM_REQUESTER_NOT_REQ_MSG',
                                                           'value' => '18446744073709551612 (-4)'
                                                         },
                                                  '5' => {
                                                           'name' => 'PLDM_REQUESTER_RESP_MSG_TOO_SMALL',
                                                           'value' => '18446744073709551611 (-5)'
                                                         },
                                                  '6' => {
                                                           'name' => 'PLDM_REQUESTER_INSTANCE_ID_MISMATCH',
                                                           'value' => '18446744073709551610 (-6)'
                                                         },
                                                  '7' => {
                                                           'name' => 'PLDM_REQUESTER_SEND_FAIL',
                                                           'value' => '18446744073709551609 (-7)'
                                                         },
                                                  '8' => {
                                                           'name' => 'PLDM_REQUESTER_RECV_FAIL',
                                                           'value' => '18446744073709551608 (-8)'
                                                         },
                                                  '9' => {
                                                           'name' => 'PLDM_REQUESTER_INVALID_RECV_LEN',
                                                           'value' => '18446744073709551607 (-9)'
                                                         },
                                                  '10' => {
                                                            'name' => 'PLDM_REQUESTER_SETUP_FAIL',
                                                            'value' => '18446744073709551606 (-10)'
                                                          },
                                                  '11' => {
                                                            'name' => 'PLDM_REQUESTER_INVALID_SETUP',
                                                            'value' => '18446744073709551605 (-11)'
                                                          },
                                                  '12' => {
                                                            'name' => 'PLDM_REQUESTER_POLL_FAIL',
                                                            'value' => '18446744073709551604 (-12)'
                                                          },
                                                  '13' => {
                                                            'name' => 'PLDM_REQUESTER_TRANSPORT_BUSY',
                                                            'value' => '18446744073709551603 (-13)'
                                                          }
                                                },
                                      'Name' => 'enum pldm_requester_error_codes',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '5537' => {
                                      'Name' => '_Bool',
                                      'Size' => '1',
                                      'Type' => 'Intrinsic'
                                    },
                          '5664' => {
                                      'BaseType' => '72',
                                      'Header' => 'types.h',
                                      'Line' => '40',
                                      'Name' => '__uint16_t',
                                      'PrivateABI' => 1,
                                      'Size' => '2',
                                      'Type' => 'Typedef'
                                    },
                          '5702' => {
                                      'BaseType' => '131',
                                      'Header' => 'types.h',
                                      'Line' => '194',
                                      'Name' => '__ssize_t',
                                      'PrivateABI' => 1,
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '5714' => {
                                      'BaseType' => '51',
                                      'Name' => 'char*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '5738' => {
                                      'BaseType' => '140',
                                      'Name' => 'uint8_t const',
                                      'Size' => '1',
                                      'Type' => 'Const'
                                    },
                          '5743' => {
                                      'BaseType' => '5664',
                                      'Header' => 'stdint-uintn.h',
                                      'Line' => '25',
                                      'Name' => 'uint16_t',
                                      'PrivateABI' => 1,
                                      'Size' => '2',
                                      'Type' => 'Typedef'
                                    },
                          '5875' => {
                                      'BaseType' => '5702',
                                      'Header' => 'types.h',
                                      'Line' => '108',
                                      'Name' => 'ssize_t',
                                      'PrivateABI' => 1,
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '5894' => {
                                      'BaseType' => '5738',
                                      'Name' => 'uint8_t const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7645' => {
                                      'BaseType' => '51',
                                      'Name' => 'char const',
                                      'Size' => '1',
                                      'Type' => 'Const'
                                    },
                          '7679' => {
                                      'BaseType' => '5743',
                                      'Name' => 'uint16_t const',
                                      'Size' => '2',
                                      'Type' => 'Const'
                                    },
                          '8023' => {
                                      'Header' => 'utils.h',
                                      'Line' => '20',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ptr',
                                                           'offset' => '0',
                                                           'type' => '5894'
                                                         },
                                                  '1' => {
                                                           'name' => 'length',
                                                           'offset' => '8',
                                                           'type' => '169'
                                                         }
                                                },
                                      'Name' => 'struct variable_field',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '9101' => {
                                      'Header' => 'base.h',
                                      'Line' => '367',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'pldm_type',
                                                           'offset' => '0',
                                                           'type' => '140'
                                                         },
                                                  '1' => {
                                                           'name' => 'transfer_opflag',
                                                           'offset' => '1',
                                                           'type' => '140'
                                                         },
                                                  '2' => {
                                                           'name' => 'transfer_ctx',
                                                           'offset' => '4',
                                                           'type' => '152'
                                                         },
                                                  '3' => {
                                                           'name' => 'transfer_handle',
                                                           'offset' => '8',
                                                           'type' => '152'
                                                         },
                                                  '4' => {
                                                           'name' => 'section_offset',
                                                           'offset' => '18',
                                                           'type' => '152'
                                                         },
                                                  '5' => {
                                                           'name' => 'section_length',
                                                           'offset' => '22',
                                                           'type' => '152'
                                                         }
                                                },
                                      'Name' => 'struct pldm_base_multipart_receive_req',
                                      'Size' => '20',
                                      'Type' => 'Struct'
                                    },
                          '9192' => {
                                      'BaseType' => '9101',
                                      'Name' => 'struct pldm_base_multipart_receive_req const',
                                      'Size' => '20',
                                      'Type' => 'Const'
                                    },
                          '9197' => {
                                      'Header' => 'base.h',
                                      'Line' => '385',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'completion_code',
                                                           'offset' => '0',
                                                           'type' => '140'
                                                         },
                                                  '1' => {
                                                           'name' => 'transfer_flag',
                                                           'offset' => '1',
                                                           'type' => '140'
                                                         },
                                                  '2' => {
                                                           'name' => 'next_transfer_handle',
                                                           'offset' => '4',
                                                           'type' => '152'
                                                         },
                                                  '3' => {
                                                           'name' => 'data',
                                                           'offset' => '8',
                                                           'type' => '8023'
                                                         }
                                                },
                                      'Name' => 'struct pldm_base_multipart_receive_resp',
                                      'Size' => '24',
                                      'Type' => 'Struct'
                                    },
                          '9262' => {
                                      'BaseType' => '9197',
                                      'Name' => 'struct pldm_base_multipart_receive_resp const',
                                      'Size' => '24',
                                      'Type' => 'Const'
                                    },
                          '9267' => {
                                      'Header' => 'base.h',
                                      'Line' => '397',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'requester_part_size',
                                                           'offset' => '0',
                                                           'type' => '5743'
                                                         },
                                                  '1' => {
                                                           'name' => 'requester_protocol_support',
                                                           'offset' => '2',
                                                           'type' => '1168'
                                                         }
                                                },
                                      'Name' => 'struct pldm_base_negotiate_transfer_params_req',
                                      'Size' => '10',
                                      'Type' => 'Struct'
                                    },
                          '9306' => {
                                      'BaseType' => '9267',
                                      'Name' => 'struct pldm_base_negotiate_transfer_params_req const',
                                      'Size' => '10',
                                      'Type' => 'Const'
                                    },
                          '9311' => {
                                      'Header' => 'base.h',
                                      'Line' => '406',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'completion_code',
                                                           'offset' => '0',
                                                           'type' => '140'
                                                         },
                                                  '1' => {
                                                           'name' => 'responder_part_size',
                                                           'offset' => '2',
                                                           'type' => '5743'
                                                         },
                                                  '2' => {
                                                           'name' => 'responder_protocol_support',
                                                           'offset' => '4',
                                                           'type' => '1168'
                                                         }
                                                },
                                      'Name' => 'struct pldm_base_negotiate_transfer_params_resp',
                                      'Size' => '12',
                                      'Type' => 'Struct'
                                    },
                          '9363' => {
                                      'BaseType' => '9311',
                                      'Name' => 'struct pldm_base_negotiate_transfer_params_resp const',
                                      'Size' => '12',
                                      'Type' => 'Const'
                                    },
                          '9400' => {
                                      'BaseType' => '7645',
                                      'Name' => 'char const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '11554' => {
                                       'BaseType' => '9311',
                                       'Name' => 'struct pldm_base_negotiate_transfer_params_resp*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '13208' => {
                                       'BaseType' => '9267',
                                       'Name' => 'struct pldm_base_negotiate_transfer_params_req*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '15271' => {
                                       'BaseType' => '9363',
                                       'Name' => 'struct pldm_base_negotiate_transfer_params_resp const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '17065' => {
                                       'BaseType' => '9306',
                                       'Name' => 'struct pldm_base_negotiate_transfer_params_req const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '21590' => {
                                       'BaseType' => '9262',
                                       'Name' => 'struct pldm_base_multipart_receive_resp const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '24622' => {
                                       'BaseType' => '9197',
                                       'Name' => 'struct pldm_base_multipart_receive_resp*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '27376' => {
                                       'BaseType' => '9192',
                                       'Name' => 'struct pldm_base_multipart_receive_req const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '33227' => {
                                       'BaseType' => '353',
                                       'Name' => 'bitfield8_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '34995' => {
                                       'BaseType' => '906',
                                       'Name' => 'struct pldm_msg_hdr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '39242' => {
                                       'BaseType' => '8023',
                                       'Name' => 'struct variable_field*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '41324' => {
                                       'BaseType' => '5743',
                                       'Name' => 'uint16_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '44574' => {
                                       'BaseType' => '86',
                                       'Header' => 'types.h',
                                       'Line' => '45',
                                       'Name' => '__uint64_t',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '44668' => {
                                       'BaseType' => '44574',
                                       'Header' => 'stdint-uintn.h',
                                       'Line' => '27',
                                       'Name' => 'uint64_t',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '44966' => {
                                       'Header' => 'bios.h',
                                       'Line' => '39',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'PLDM_BIOS_STRING_TABLE',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'PLDM_BIOS_ATTR_TABLE',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'PLDM_BIOS_ATTR_VAL_TABLE',
                                                            'value' => '2'
                                                          }
                                                 },
                                       'Name' => 'enum pldm_bios_table_types',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '45000' => {
                                       'Header' => 'bios.h',
                                       'Line' => '48',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'string_handle',
                                                            'offset' => '0',
                                                            'type' => '5743'
                                                          },
                                                   '1' => {
                                                            'name' => 'string_length',
                                                            'offset' => '2',
                                                            'type' => '5743'
                                                          },
                                                   '2' => {
                                                            'name' => 'name',
                                                            'offset' => '4',
                                                            'type' => '45057'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_string_table_entry',
                                       'Size' => '5',
                                       'Type' => 'Struct'
                                     },
                          '45052' => {
                                       'BaseType' => '45000',
                                       'Name' => 'struct pldm_bios_string_table_entry const',
                                       'Size' => '5',
                                       'Type' => 'Const'
                                     },
                          '45057' => {
                                       'BaseType' => '51',
                                       'Name' => 'char[1]',
                                       'Size' => '1',
                                       'Type' => 'Array'
                                     },
                          '45073' => {
                                       'Header' => 'bios.h',
                                       'Line' => '54',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'attr_handle',
                                                            'offset' => '0',
                                                            'type' => '5743'
                                                          },
                                                   '1' => {
                                                            'name' => 'attr_type',
                                                            'offset' => '2',
                                                            'type' => '140'
                                                          },
                                                   '2' => {
                                                            'name' => 'string_handle',
                                                            'offset' => '3',
                                                            'type' => '5743'
                                                          },
                                                   '3' => {
                                                            'name' => 'metadata',
                                                            'offset' => '5',
                                                            'type' => '1067'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_attr_table_entry',
                                       'Size' => '6',
                                       'Type' => 'Struct'
                                     },
                          '45138' => {
                                       'BaseType' => '45073',
                                       'Name' => 'struct pldm_bios_attr_table_entry const',
                                       'Size' => '6',
                                       'Type' => 'Const'
                                     },
                          '45143' => {
                                       'Header' => 'bios.h',
                                       'Line' => '66',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'attr_handle',
                                                            'offset' => '0',
                                                            'type' => '5743'
                                                          },
                                                   '1' => {
                                                            'name' => 'attr_type',
                                                            'offset' => '2',
                                                            'type' => '140'
                                                          },
                                                   '2' => {
                                                            'name' => 'value',
                                                            'offset' => '3',
                                                            'type' => '1067'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_attr_val_table_entry',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '45195' => {
                                       'BaseType' => '45143',
                                       'Name' => 'struct pldm_bios_attr_val_table_entry const',
                                       'Size' => '4',
                                       'Type' => 'Const'
                                     },
                          '45264' => {
                                       'Header' => 'bios_table.h',
                                       'Line' => '206',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'name_handle',
                                                            'offset' => '0',
                                                            'type' => '5743'
                                                          },
                                                   '1' => {
                                                            'name' => 'read_only',
                                                            'offset' => '2',
                                                            'type' => '5537'
                                                          },
                                                   '2' => {
                                                            'name' => 'pv_num',
                                                            'offset' => '3',
                                                            'type' => '140'
                                                          },
                                                   '3' => {
                                                            'name' => 'pv_handle',
                                                            'offset' => '8',
                                                            'type' => '45367'
                                                          },
                                                   '4' => {
                                                            'name' => 'def_num',
                                                            'offset' => '22',
                                                            'type' => '140'
                                                          },
                                                   '5' => {
                                                            'name' => 'def_index',
                                                            'offset' => '36',
                                                            'type' => '5894'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_table_attr_entry_enum_info',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '45355' => {
                                       'BaseType' => '45264',
                                       'Name' => 'struct pldm_bios_table_attr_entry_enum_info const',
                                       'Size' => '32',
                                       'Type' => 'Const'
                                     },
                          '45367' => {
                                       'BaseType' => '7679',
                                       'Name' => 'uint16_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '45372' => {
                                       'Header' => 'bios_table.h',
                                       'Line' => '294',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'name_handle',
                                                            'offset' => '0',
                                                            'type' => '5743'
                                                          },
                                                   '1' => {
                                                            'name' => 'read_only',
                                                            'offset' => '2',
                                                            'type' => '5537'
                                                          },
                                                   '2' => {
                                                            'name' => 'string_type',
                                                            'offset' => '3',
                                                            'type' => '140'
                                                          },
                                                   '3' => {
                                                            'name' => 'min_length',
                                                            'offset' => '4',
                                                            'type' => '5743'
                                                          },
                                                   '4' => {
                                                            'name' => 'max_length',
                                                            'offset' => '6',
                                                            'type' => '5743'
                                                          },
                                                   '5' => {
                                                            'name' => 'def_length',
                                                            'offset' => '8',
                                                            'type' => '5743'
                                                          },
                                                   '6' => {
                                                            'name' => 'def_string',
                                                            'offset' => '22',
                                                            'type' => '9400'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_table_attr_entry_string_info',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '45484' => {
                                       'BaseType' => '45372',
                                       'Name' => 'struct pldm_bios_table_attr_entry_string_info const',
                                       'Size' => '24',
                                       'Type' => 'Const'
                                     },
                          '45494' => {
                                       'Header' => 'bios_table.h',
                                       'Line' => '384',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'name_handle',
                                                            'offset' => '0',
                                                            'type' => '5743'
                                                          },
                                                   '1' => {
                                                            'name' => 'read_only',
                                                            'offset' => '2',
                                                            'type' => '5537'
                                                          },
                                                   '2' => {
                                                            'name' => 'lower_bound',
                                                            'offset' => '8',
                                                            'type' => '44668'
                                                          },
                                                   '3' => {
                                                            'name' => 'upper_bound',
                                                            'offset' => '22',
                                                            'type' => '44668'
                                                          },
                                                   '4' => {
                                                            'name' => 'scalar_increment',
                                                            'offset' => '36',
                                                            'type' => '152'
                                                          },
                                                   '5' => {
                                                            'name' => 'default_value',
                                                            'offset' => '50',
                                                            'type' => '44668'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_table_attr_entry_integer_info',
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '45592' => {
                                       'BaseType' => '45494',
                                       'Name' => 'struct pldm_bios_table_attr_entry_integer_info const',
                                       'Size' => '40',
                                       'Type' => 'Const'
                                     },
                          '45824' => {
                                       'Name' => 'ssize_t(*)(void const*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '1330'
                                                           }
                                                  },
                                       'Return' => '5875',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '45894' => {
                                       'Line' => '957',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'table_data',
                                                            'offset' => '0',
                                                            'type' => '5894'
                                                          },
                                                   '1' => {
                                                            'name' => 'table_len',
                                                            'offset' => '8',
                                                            'type' => '169'
                                                          },
                                                   '2' => {
                                                            'name' => 'current_pos',
                                                            'offset' => '22',
                                                            'type' => '169'
                                                          },
                                                   '3' => {
                                                            'name' => 'entry_length_handler',
                                                            'offset' => '36',
                                                            'type' => '45824'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_table_iter',
                                       'PrivateABI' => 1,
                                       'Size' => '32',
                                       'Source' => 'bios_table.c',
                                       'Type' => 'Struct'
                                     },
                          '45964' => {
                                       'BaseType' => '45894',
                                       'Name' => 'struct pldm_bios_table_iter const',
                                       'Size' => '32',
                                       'Type' => 'Const'
                                     },
                          '47034' => {
                                       'BaseType' => '45894',
                                       'Name' => 'struct pldm_bios_table_iter*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '47039' => {
                                       'BaseType' => '45195',
                                       'Name' => 'struct pldm_bios_attr_val_table_entry const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '47453' => {
                                       'BaseType' => '45138',
                                       'Name' => 'struct pldm_bios_attr_table_entry const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '48056' => {
                                       'BaseType' => '45052',
                                       'Name' => 'struct pldm_bios_string_table_entry const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '49219' => {
                                       'BaseType' => '45964',
                                       'Name' => 'struct pldm_bios_table_iter const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '53402' => {
                                       'BaseType' => '44668',
                                       'Name' => 'uint64_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '53679' => {
                                       'BaseType' => '45592',
                                       'Name' => 'struct pldm_bios_table_attr_entry_integer_info const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '53946' => {
                                       'BaseType' => '9400',
                                       'Name' => 'char const**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '55075' => {
                                       'BaseType' => '45484',
                                       'Name' => 'struct pldm_bios_table_attr_entry_string_info const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '56529' => {
                                       'BaseType' => '45355',
                                       'Name' => 'struct pldm_bios_table_attr_entry_enum_info const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '58750' => {
                                       'Header' => 'pldm_types.h',
                                       'Line' => '40',
                                       'Name' => 'struct bits16',
                                       'Size' => '2',
                                       'Type' => 'Struct'
                                     },
                          '59020' => {
                                       'Header' => 'pldm_types.h',
                                       'Line' => '58',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'value',
                                                            'offset' => '0',
                                                            'type' => '5743'
                                                          },
                                                   '1' => {
                                                            'name' => 'bits',
                                                            'offset' => '0',
                                                            'type' => '58750'
                                                          }
                                                 },
                                       'Name' => 'union bitfield16_t',
                                       'Size' => '2',
                                       'Type' => 'Union'
                                     },
                          '59804' => {
                                       'Header' => 'file.h',
                                       'Line' => '53',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'file_identifier',
                                                            'offset' => '0',
                                                            'type' => '5743'
                                                          },
                                                   '1' => {
                                                            'name' => 'file_attribute',
                                                            'offset' => '2',
                                                            'type' => '59020'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_file_df_open_req',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '59844' => {
                                       'BaseType' => '59804',
                                       'Name' => 'struct pldm_file_df_open_req const',
                                       'Size' => '4',
                                       'Type' => 'Const'
                                     },
                          '59849' => {
                                       'Header' => 'file.h',
                                       'Line' => '62',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'completion_code',
                                                            'offset' => '0',
                                                            'type' => '140'
                                                          },
                                                   '1' => {
                                                            'name' => 'file_descriptor',
                                                            'offset' => '2',
                                                            'type' => '5743'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_file_df_open_resp',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '59889' => {
                                       'BaseType' => '59849',
                                       'Name' => 'struct pldm_file_df_open_resp const',
                                       'Size' => '4',
                                       'Type' => 'Const'
                                     },
                          '59894' => {
                                       'Header' => 'file.h',
                                       'Line' => '71',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'file_descriptor',
                                                            'offset' => '0',
                                                            'type' => '5743'
                                                          },
                                                   '1' => {
                                                            'name' => 'df_close_options',
                                                            'offset' => '2',
                                                            'type' => '59020'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_file_df_close_req',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '59934' => {
                                       'BaseType' => '59894',
                                       'Name' => 'struct pldm_file_df_close_req const',
                                       'Size' => '4',
                                       'Type' => 'Const'
                                     },
                          '59939' => {
                                       'Header' => 'file.h',
                                       'Line' => '80',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'completion_code',
                                                            'offset' => '0',
                                                            'type' => '140'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_file_df_close_resp',
                                       'Size' => '1',
                                       'Type' => 'Struct'
                                     },
                          '59966' => {
                                       'BaseType' => '59939',
                                       'Name' => 'struct pldm_file_df_close_resp const',
                                       'Size' => '1',
                                       'Type' => 'Const'
                                     },
                          '59971' => {
                                       'Header' => 'file.h',
                                       'Line' => '88',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'file_descriptor',
                                                            'offset' => '0',
                                                            'type' => '5743'
                                                          },
                                                   '1' => {
                                                            'name' => 'requester_max_interval',
                                                            'offset' => '4',
                                                            'type' => '152'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_file_df_heartbeat_req',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '60011' => {
                                       'BaseType' => '59971',
                                       'Name' => 'struct pldm_file_df_heartbeat_req const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '60016' => {
                                       'Header' => 'file.h',
                                       'Line' => '97',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'completion_code',
                                                            'offset' => '0',
                                                            'type' => '140'
                                                          },
                                                   '1' => {
                                                            'name' => 'responder_max_interval',
                                                            'offset' => '4',
                                                            'type' => '152'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_file_df_heartbeat_resp',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '61625' => {
                                       'BaseType' => '60016',
                                       'Name' => 'struct pldm_file_df_heartbeat_resp*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '63204' => {
                                       'BaseType' => '60011',
                                       'Name' => 'struct pldm_file_df_heartbeat_req const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '63345' => {
                                       'BaseType' => '59939',
                                       'Name' => 'struct pldm_file_df_close_resp*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '64594' => {
                                       'BaseType' => '59966',
                                       'Name' => 'struct pldm_file_df_close_resp const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '66083' => {
                                       'BaseType' => '59894',
                                       'Name' => 'struct pldm_file_df_close_req*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '67636' => {
                                       'BaseType' => '59934',
                                       'Name' => 'struct pldm_file_df_close_req const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '69386' => {
                                       'BaseType' => '59849',
                                       'Name' => 'struct pldm_file_df_open_resp*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '70930' => {
                                       'BaseType' => '59889',
                                       'Name' => 'struct pldm_file_df_open_resp const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '72419' => {
                                       'BaseType' => '59804',
                                       'Name' => 'struct pldm_file_df_open_req*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '73972' => {
                                       'BaseType' => '59844',
                                       'Name' => 'struct pldm_file_df_open_req const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '75703' => {
                                       'BaseType' => '140',
                                       'Header' => 'pldm_types.h',
                                       'Line' => '36',
                                       'Name' => 'bool8_t',
                                       'Size' => '1',
                                       'Type' => 'Typedef'
                                     },
                          '75995' => {
                                       'Header' => 'pldm_types.h',
                                       'Line' => '62',
                                       'Name' => 'struct bits32',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '76487' => {
                                       'Header' => 'pldm_types.h',
                                       'Line' => '96',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'value',
                                                            'offset' => '0',
                                                            'type' => '152'
                                                          },
                                                   '1' => {
                                                            'name' => 'bits',
                                                            'offset' => '0',
                                                            'type' => '75995'
                                                          }
                                                 },
                                       'Name' => 'union bitfield32_t',
                                       'Size' => '4',
                                       'Type' => 'Union'
                                     },
                          '76499' => {
                                       'Header' => 'pldm_types.h',
                                       'Line' => '100',
                                       'Name' => 'struct bits64',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '77439' => {
                                       'Header' => 'pldm_types.h',
                                       'Line' => '166',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'value',
                                                            'offset' => '0',
                                                            'type' => '44668'
                                                          },
                                                   '1' => {
                                                            'name' => 'bits',
                                                            'offset' => '0',
                                                            'type' => '76499'
                                                          }
                                                 },
                                       'Name' => 'union bitfield64_t',
                                       'Size' => '8',
                                       'Type' => 'Union'
                                     },
                          '77458' => {
                                       'BaseType' => '77470',
                                       'Header' => 'pldm_types.h',
                                       'Line' => '170',
                                       'Name' => 'pldm_uuid',
                                       'Size' => '16',
                                       'Type' => 'Typedef'
                                     },
                          '77470' => {
                                       'BaseType' => '140',
                                       'Name' => 'uint8_t[16]',
                                       'Size' => '16',
                                       'Type' => 'Array'
                                     },
                          '77486' => {
                                       'BaseType' => '77470',
                                       'Name' => 'uint8_t[16] const',
                                       'Size' => '16',
                                       'Type' => 'Const'
                                     },
                          '77515' => {
                                       'BaseType' => '169',
                                       'Name' => 'size_t const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '77580' => {
                                       'BaseType' => '8023',
                                       'Name' => 'struct variable_field const',
                                       'Size' => '16',
                                       'Type' => 'Const'
                                     },
                          '78636' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '171',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'PLDM_STR_TYPE_UNKNOWN',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'PLDM_STR_TYPE_ASCII',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'PLDM_STR_TYPE_UTF_8',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'PLDM_STR_TYPE_UTF_16',
                                                            'value' => '3'
                                                          },
                                                   '4' => {
                                                            'name' => 'PLDM_STR_TYPE_UTF_16LE',
                                                            'value' => '4'
                                                          },
                                                   '5' => {
                                                            'name' => 'PLDM_STR_TYPE_UTF_16BE',
                                                            'value' => '5'
                                                          }
                                                 },
                                       'Name' => 'enum pldm_firmware_update_string_type',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '78995' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '274',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'PLDM_CRC_COMP_CAN_BE_UPDATED',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'PLDM_CRC_COMP_COMPARISON_STAMP_IDENTICAL',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'PLDM_CRC_COMP_COMPARISON_STAMP_LOWER',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'PLDM_CRC_INVALID_COMP_COMPARISON_STAMP',
                                                            'value' => '3'
                                                          },
                                                   '4' => {
                                                            'name' => 'PLDM_CRC_COMP_CONFLICT',
                                                            'value' => '4'
                                                          },
                                                   '5' => {
                                                            'name' => 'PLDM_CRC_COMP_PREREQUISITES_NOT_MET',
                                                            'value' => '5'
                                                          },
                                                   '6' => {
                                                            'name' => 'PLDM_CRC_COMP_NOT_SUPPORTED',
                                                            'value' => '6'
                                                          },
                                                   '7' => {
                                                            'name' => 'PLDM_CRC_COMP_SECURITY_RESTRICTIONS',
                                                            'value' => '7'
                                                          },
                                                   '8' => {
                                                            'name' => 'PLDM_CRC_INCOMPLETE_COMP_IMAGE_SET',
                                                            'value' => '8'
                                                          },
                                                   '9' => {
                                                            'name' => 'PLDM_CRC_ACTIVE_IMAGE_NOT_UPDATEABLE_SUBSEQUENTLY',
                                                            'value' => '9'
                                                          },
                                                   '10' => {
                                                             'name' => 'PLDM_CRC_COMP_VER_STR_IDENTICAL',
                                                             'value' => '10'
                                                           },
                                                   '11' => {
                                                             'name' => 'PLDM_CRC_COMP_VER_STR_LOWER',
                                                             'value' => '11'
                                                           },
                                                   '12' => {
                                                             'name' => 'PLDM_CRC_VENDOR_COMP_RESP_CODE_RANGE_MIN',
                                                             'value' => '208'
                                                           },
                                                   '13' => {
                                                             'name' => 'PLDM_CRC_VENDOR_COMP_RESP_CODE_RANGE_MAX',
                                                             'value' => '239'
                                                           }
                                                 },
                                       'Name' => 'enum pldm_component_response_codes',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '79303' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '378',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'PLDM_FD_STATE_IDLE',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'PLDM_FD_STATE_LEARN_COMPONENTS',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'PLDM_FD_STATE_READY_XFER',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'PLDM_FD_STATE_DOWNLOAD',
                                                            'value' => '3'
                                                          },
                                                   '4' => {
                                                            'name' => 'PLDM_FD_STATE_VERIFY',
                                                            'value' => '4'
                                                          },
                                                   '5' => {
                                                            'name' => 'PLDM_FD_STATE_APPLY',
                                                            'value' => '5'
                                                          },
                                                   '6' => {
                                                            'name' => 'PLDM_FD_STATE_ACTIVATE',
                                                            'value' => '6'
                                                          }
                                                 },
                                       'Name' => 'enum pldm_firmware_device_states',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '79459' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '411',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'PLDM_FD_INITIALIZATION',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'PLDM_FD_ACTIVATE_FW',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'PLDM_FD_CANCEL_UPDATE',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'PLDM_FD_TIMEOUT_LEARN_COMPONENT',
                                                            'value' => '3'
                                                          },
                                                   '4' => {
                                                            'name' => 'PLDM_FD_TIMEOUT_READY_XFER',
                                                            'value' => '4'
                                                          },
                                                   '5' => {
                                                            'name' => 'PLDM_FD_TIMEOUT_DOWNLOAD',
                                                            'value' => '5'
                                                          },
                                                   '6' => {
                                                            'name' => 'PLDM_FD_TIMEOUT_VERIFY',
                                                            'value' => '6'
                                                          },
                                                   '7' => {
                                                            'name' => 'PLDM_FD_TIMEOUT_APPLY',
                                                            'value' => '7'
                                                          },
                                                   '8' => {
                                                            'name' => 'PLDM_FD_STATUS_VENDOR_DEFINED_MIN',
                                                            'value' => '200'
                                                          },
                                                   '9' => {
                                                            'name' => 'PLDM_FD_STATUS_VENDOR_DEFINED_MAX',
                                                            'value' => '255'
                                                          }
                                                 },
                                       'Name' => 'enum pldm_get_status_reason_code_values',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '79591' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '446',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'str_type',
                                                            'offset' => '0',
                                                            'type' => '78636'
                                                          },
                                                   '1' => {
                                                            'name' => 'str_len',
                                                            'offset' => '4',
                                                            'type' => '140'
                                                          },
                                                   '2' => {
                                                            'name' => 'str_data',
                                                            'offset' => '5',
                                                            'type' => '79648'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_firmware_string',
                                       'Size' => '72',
                                       'Type' => 'Struct'
                                     },
                          '79648' => {
                                       'BaseType' => '140',
                                       'Name' => 'uint8_t[64]',
                                       'Size' => '64',
                                       'Type' => 'Array'
                                     },
                          '79664' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '456',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comparison_stamp',
                                                            'offset' => '0',
                                                            'type' => '152'
                                                          },
                                                   '1' => {
                                                            'name' => 'str',
                                                            'offset' => '4',
                                                            'type' => '79591'
                                                          },
                                                   '2' => {
                                                            'name' => 'date',
                                                            'offset' => '118',
                                                            'type' => '79720'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_firmware_version',
                                       'Size' => '84',
                                       'Type' => 'Struct'
                                     },
                          '79720' => {
                                       'BaseType' => '140',
                                       'Name' => 'uint8_t[8]',
                                       'Size' => '8',
                                       'Type' => 'Array'
                                     },
                          '79736' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '466',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'uuid',
                                                            'offset' => '0',
                                                            'type' => '77470'
                                                          },
                                                   '1' => {
                                                            'name' => 'package_header_format_version',
                                                            'offset' => '22',
                                                            'type' => '140'
                                                          },
                                                   '2' => {
                                                            'name' => 'package_header_size',
                                                            'offset' => '23',
                                                            'type' => '5743'
                                                          },
                                                   '3' => {
                                                            'name' => 'package_release_date_time',
                                                            'offset' => '25',
                                                            'type' => '79849'
                                                          },
                                                   '4' => {
                                                            'name' => 'component_bitmap_bit_length',
                                                            'offset' => '50',
                                                            'type' => '5743'
                                                          },
                                                   '5' => {
                                                            'name' => 'package_version_string_type',
                                                            'offset' => '52',
                                                            'type' => '140'
                                                          },
                                                   '6' => {
                                                            'name' => 'package_version_string_length',
                                                            'offset' => '53',
                                                            'type' => '140'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_package_header_information',
                                       'Size' => '36',
                                       'Type' => 'Struct'
                                     },
                          '79849' => {
                                       'BaseType' => '140',
                                       'Name' => 'uint8_t[13]',
                                       'Size' => '13',
                                       'Type' => 'Array'
                                     },
                          '79865' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '480',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'record_length',
                                                            'offset' => '0',
                                                            'type' => '5743'
                                                          },
                                                   '1' => {
                                                            'name' => 'descriptor_count',
                                                            'offset' => '2',
                                                            'type' => '140'
                                                          },
                                                   '2' => {
                                                            'name' => 'device_update_option_flags',
                                                            'offset' => '3',
                                                            'type' => '76487'
                                                          },
                                                   '3' => {
                                                            'name' => 'comp_image_set_version_string_type',
                                                            'offset' => '7',
                                                            'type' => '140'
                                                          },
                                                   '4' => {
                                                            'name' => 'comp_image_set_version_string_length',
                                                            'offset' => '8',
                                                            'type' => '140'
                                                          },
                                                   '5' => {
                                                            'name' => 'fw_device_pkg_data_length',
                                                            'offset' => '9',
                                                            'type' => '5743'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_firmware_device_id_record',
                                       'Size' => '11',
                                       'Type' => 'Struct'
                                     },
                          '80078' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '514',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_classification',
                                                            'offset' => '0',
                                                            'type' => '5743'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_identifier',
                                                            'offset' => '2',
                                                            'type' => '5743'
                                                          },
                                                   '2' => {
                                                            'name' => 'comp_comparison_stamp',
                                                            'offset' => '4',
                                                            'type' => '152'
                                                          },
                                                   '3' => {
                                                            'name' => 'comp_options',
                                                            'offset' => '8',
                                                            'type' => '59020'
                                                          },
                                                   '4' => {
                                                            'name' => 'requested_comp_activation_method',
                                                            'offset' => '16',
                                                            'type' => '59020'
                                                          },
                                                   '5' => {
                                                            'name' => 'comp_location_offset',
                                                            'offset' => '18',
                                                            'type' => '152'
                                                          },
                                                   '6' => {
                                                            'name' => 'comp_size',
                                                            'offset' => '22',
                                                            'type' => '152'
                                                          },
                                                   '7' => {
                                                            'name' => 'comp_version_string_type',
                                                            'offset' => '32',
                                                            'type' => '140'
                                                          },
                                                   '8' => {
                                                            'name' => 'comp_version_string_length',
                                                            'offset' => '33',
                                                            'type' => '140'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_component_image_information',
                                       'Size' => '22',
                                       'Type' => 'Struct'
                                     },
                          '80276' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '540',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'completion_code',
                                                            'offset' => '0',
                                                            'type' => '140'
                                                          },
                                                   '1' => {
                                                            'name' => 'capabilities_during_update',
                                                            'offset' => '1',
                                                            'type' => '76487'
                                                          },
                                                   '2' => {
                                                            'name' => 'comp_count',
                                                            'offset' => '5',
                                                            'type' => '5743'
                                                          },
                                                   '3' => {
                                                            'name' => 'active_comp_image_set_ver_str_type',
                                                            'offset' => '7',
                                                            'type' => '140'
                                                          },
                                                   '4' => {
                                                            'name' => 'active_comp_image_set_ver_str_len',
                                                            'offset' => '8',
                                                            'type' => '140'
                                                          },
                                                   '5' => {
                                                            'name' => 'pending_comp_image_set_ver_str_type',
                                                            'offset' => '9',
                                                            'type' => '140'
                                                          },
                                                   '6' => {
                                                            'name' => 'pending_comp_image_set_ver_str_len',
                                                            'offset' => '16',
                                                            'type' => '140'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_get_firmware_parameters_resp',
                                       'Size' => '11',
                                       'Type' => 'Struct'
                                     },
                          '80389' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '554',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'completion_code',
                                                            'offset' => '0',
                                                            'type' => '140'
                                                          },
                                                   '1' => {
                                                            'name' => 'capabilities_during_update',
                                                            'offset' => '4',
                                                            'type' => '76487'
                                                          },
                                                   '2' => {
                                                            'name' => 'comp_count',
                                                            'offset' => '8',
                                                            'type' => '5743'
                                                          },
                                                   '3' => {
                                                            'name' => 'active_comp_image_set_ver_str',
                                                            'offset' => '18',
                                                            'type' => '79591'
                                                          },
                                                   '4' => {
                                                            'name' => 'pending_comp_image_set_ver_str',
                                                            'offset' => '132',
                                                            'type' => '79591'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_get_firmware_parameters_resp_full',
                                       'Size' => '156',
                                       'Type' => 'Struct'
                                     },
                          '80474' => {
                                       'BaseType' => '80389',
                                       'Name' => 'struct pldm_get_firmware_parameters_resp_full const',
                                       'Size' => '156',
                                       'Type' => 'Const'
                                     },
                          '80479' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '568',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'completion_code',
                                                            'offset' => '0',
                                                            'type' => '140'
                                                          },
                                                   '1' => {
                                                            'name' => 'downstream_device_update_supported',
                                                            'offset' => '1',
                                                            'type' => '140'
                                                          },
                                                   '2' => {
                                                            'name' => 'number_of_downstream_devices',
                                                            'offset' => '2',
                                                            'type' => '5743'
                                                          },
                                                   '3' => {
                                                            'name' => 'max_number_of_downstream_devices',
                                                            'offset' => '4',
                                                            'type' => '5743'
                                                          },
                                                   '4' => {
                                                            'name' => 'capabilities',
                                                            'offset' => '8',
                                                            'type' => '76487'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_query_downstream_devices_resp',
                                       'Size' => '12',
                                       'Type' => 'Struct'
                                     },
                          '80564' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '580',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_classification',
                                                            'offset' => '0',
                                                            'type' => '5743'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_identifier',
                                                            'offset' => '2',
                                                            'type' => '5743'
                                                          },
                                                   '2' => {
                                                            'name' => 'comp_classification_index',
                                                            'offset' => '4',
                                                            'type' => '140'
                                                          },
                                                   '3' => {
                                                            'name' => 'active_comp_comparison_stamp',
                                                            'offset' => '5',
                                                            'type' => '152'
                                                          },
                                                   '4' => {
                                                            'name' => 'active_comp_ver_str_type',
                                                            'offset' => '9',
                                                            'type' => '140'
                                                          },
                                                   '5' => {
                                                            'name' => 'active_comp_ver_str_len',
                                                            'offset' => '16',
                                                            'type' => '140'
                                                          },
                                                   '6' => {
                                                            'name' => 'active_comp_release_date',
                                                            'offset' => '17',
                                                            'type' => '79720'
                                                          },
                                                   '7' => {
                                                            'name' => 'pending_comp_comparison_stamp',
                                                            'offset' => '25',
                                                            'type' => '152'
                                                          },
                                                   '8' => {
                                                            'name' => 'pending_comp_ver_str_type',
                                                            'offset' => '35',
                                                            'type' => '140'
                                                          },
                                                   '9' => {
                                                            'name' => 'pending_comp_ver_str_len',
                                                            'offset' => '36',
                                                            'type' => '140'
                                                          },
                                                   '10' => {
                                                             'name' => 'pending_comp_release_date',
                                                             'offset' => '37',
                                                             'type' => '79720'
                                                           },
                                                   '11' => {
                                                             'name' => 'comp_activation_methods',
                                                             'offset' => '51',
                                                             'type' => '59020'
                                                           },
                                                   '12' => {
                                                             'name' => 'capabilities_during_update',
                                                             'offset' => '53',
                                                             'type' => '76487'
                                                           }
                                                 },
                                       'Name' => 'struct pldm_component_parameter_entry',
                                       'Size' => '39',
                                       'Type' => 'Struct'
                                     },
                          '80761' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '602',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_classification',
                                                            'offset' => '0',
                                                            'type' => '5743'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_identifier',
                                                            'offset' => '2',
                                                            'type' => '5743'
                                                          },
                                                   '2' => {
                                                            'name' => 'comp_classification_index',
                                                            'offset' => '4',
                                                            'type' => '140'
                                                          },
                                                   '3' => {
                                                            'name' => 'active_ver',
                                                            'offset' => '8',
                                                            'type' => '79664'
                                                          },
                                                   '4' => {
                                                            'name' => 'pending_ver',
                                                            'offset' => '146',
                                                            'type' => '79664'
                                                          },
                                                   '5' => {
                                                            'name' => 'comp_activation_methods',
                                                            'offset' => '374',
                                                            'type' => '59020'
                                                          },
                                                   '6' => {
                                                            'name' => 'capabilities_during_update',
                                                            'offset' => '384',
                                                            'type' => '76487'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_component_parameter_entry_full',
                                       'Size' => '184',
                                       'Type' => 'Struct'
                                     },
                          '80874' => {
                                       'BaseType' => '80761',
                                       'Name' => 'struct pldm_component_parameter_entry_full const',
                                       'Size' => '184',
                                       'Type' => 'Const'
                                     },
                          '80879' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '619',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'data_transfer_handle',
                                                            'offset' => '0',
                                                            'type' => '152'
                                                          },
                                                   '1' => {
                                                            'name' => 'transfer_operation_flag',
                                                            'offset' => '4',
                                                            'type' => '140'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_query_downstream_identifiers_req',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '80922' => {
                                       'BaseType' => '80879',
                                       'Name' => 'struct pldm_query_downstream_identifiers_req const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '80927' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '633',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'completion_code',
                                                            'offset' => '0',
                                                            'type' => '140'
                                                          },
                                                   '1' => {
                                                            'name' => 'next_data_transfer_handle',
                                                            'offset' => '4',
                                                            'type' => '152'
                                                          },
                                                   '2' => {
                                                            'name' => 'transfer_flag',
                                                            'offset' => '8',
                                                            'type' => '140'
                                                          },
                                                   '3' => {
                                                            'name' => 'downstream_devices_length',
                                                            'offset' => '18',
                                                            'type' => '152'
                                                          },
                                                   '4' => {
                                                            'name' => 'number_of_downstream_devices',
                                                            'offset' => '22',
                                                            'type' => '5743'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_query_downstream_identifiers_resp',
                                       'Size' => '20',
                                       'Type' => 'Struct'
                                     },
                          '81012' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '646',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'downstream_device_index',
                                                            'offset' => '0',
                                                            'type' => '5743'
                                                          },
                                                   '1' => {
                                                            'name' => 'downstream_descriptor_count',
                                                            'offset' => '2',
                                                            'type' => '140'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_downstream_device',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '81055' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '652',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'field',
                                                            'offset' => '0',
                                                            'type' => '8023'
                                                          },
                                                   '1' => {
                                                            'name' => 'devs',
                                                            'offset' => '22',
                                                            'type' => '169'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_downstream_device_iter',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '81098' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '726',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'descriptor_type',
                                                            'offset' => '0',
                                                            'type' => '5743'
                                                          },
                                                   '1' => {
                                                            'name' => 'descriptor_length',
                                                            'offset' => '2',
                                                            'type' => '5743'
                                                          },
                                                   '2' => {
                                                            'name' => 'descriptor_data',
                                                            'offset' => '8',
                                                            'type' => '1330'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_descriptor',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '81155' => {
                                       'BaseType' => '81098',
                                       'Name' => 'struct pldm_descriptor const',
                                       'Size' => '16',
                                       'Type' => 'Const'
                                     },
                          '81171' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '732',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'field',
                                                            'offset' => '0',
                                                            'type' => '39242'
                                                          },
                                                   '1' => {
                                                            'name' => 'count',
                                                            'offset' => '8',
                                                            'type' => '169'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_descriptor_iter',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '81219' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '825',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'data_transfer_handle',
                                                            'offset' => '0',
                                                            'type' => '152'
                                                          },
                                                   '1' => {
                                                            'name' => 'transfer_operation_flag',
                                                            'offset' => '4',
                                                            'type' => '140'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_get_downstream_firmware_parameters_req',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '81262' => {
                                       'BaseType' => '81219',
                                       'Name' => 'struct pldm_get_downstream_firmware_parameters_req const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '81267' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '840',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'completion_code',
                                                            'offset' => '0',
                                                            'type' => '140'
                                                          },
                                                   '1' => {
                                                            'name' => 'next_data_transfer_handle',
                                                            'offset' => '4',
                                                            'type' => '152'
                                                          },
                                                   '2' => {
                                                            'name' => 'transfer_flag',
                                                            'offset' => '8',
                                                            'type' => '140'
                                                          },
                                                   '3' => {
                                                            'name' => 'fdp_capabilities_during_update',
                                                            'offset' => '18',
                                                            'type' => '76487'
                                                          },
                                                   '4' => {
                                                            'name' => 'downstream_device_count',
                                                            'offset' => '22',
                                                            'type' => '5743'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_get_downstream_firmware_parameters_resp',
                                       'Size' => '20',
                                       'Type' => 'Struct'
                                     },
                          '81352' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '858',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'downstream_device_index',
                                                            'offset' => '0',
                                                            'type' => '5743'
                                                          },
                                                   '1' => {
                                                            'name' => 'active_comp_comparison_stamp',
                                                            'offset' => '4',
                                                            'type' => '152'
                                                          },
                                                   '2' => {
                                                            'name' => 'active_comp_ver_str_type',
                                                            'offset' => '8',
                                                            'type' => '140'
                                                          },
                                                   '3' => {
                                                            'name' => 'active_comp_ver_str_len',
                                                            'offset' => '9',
                                                            'type' => '140'
                                                          },
                                                   '4' => {
                                                            'name' => 'active_comp_release_date',
                                                            'offset' => '16',
                                                            'type' => '81549'
                                                          },
                                                   '5' => {
                                                            'name' => 'pending_comp_comparison_stamp',
                                                            'offset' => '32',
                                                            'type' => '152'
                                                          },
                                                   '6' => {
                                                            'name' => 'pending_comp_ver_str_type',
                                                            'offset' => '36',
                                                            'type' => '140'
                                                          },
                                                   '7' => {
                                                            'name' => 'pending_comp_ver_str_len',
                                                            'offset' => '37',
                                                            'type' => '140'
                                                          },
                                                   '8' => {
                                                            'name' => 'pending_comp_release_date',
                                                            'offset' => '38',
                                                            'type' => '81549'
                                                          },
                                                   '9' => {
                                                            'name' => 'comp_activation_methods',
                                                            'offset' => '54',
                                                            'type' => '59020'
                                                          },
                                                   '10' => {
                                                             'name' => 'capabilities_during_update',
                                                             'offset' => '64',
                                                             'type' => '76487'
                                                           },
                                                   '11' => {
                                                             'name' => 'active_comp_ver_str',
                                                             'offset' => '72',
                                                             'type' => '1330'
                                                           },
                                                   '12' => {
                                                             'name' => 'pending_comp_ver_str',
                                                             'offset' => '86',
                                                             'type' => '1330'
                                                           }
                                                 },
                                       'Name' => 'struct pldm_downstream_device_parameters_entry',
                                       'Size' => '64',
                                       'Type' => 'Struct'
                                     },
                          '81549' => {
                                       'BaseType' => '51',
                                       'Name' => 'char[9]',
                                       'Size' => '9',
                                       'Type' => 'Array'
                                     },
                          '81664' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '898',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'max_transfer_size',
                                                            'offset' => '0',
                                                            'type' => '152'
                                                          },
                                                   '1' => {
                                                            'name' => 'num_of_comp',
                                                            'offset' => '4',
                                                            'type' => '5743'
                                                          },
                                                   '2' => {
                                                            'name' => 'max_outstanding_transfer_req',
                                                            'offset' => '6',
                                                            'type' => '140'
                                                          },
                                                   '3' => {
                                                            'name' => 'pkg_data_len',
                                                            'offset' => '8',
                                                            'type' => '5743'
                                                          },
                                                   '4' => {
                                                            'name' => 'image_set_ver',
                                                            'offset' => '18',
                                                            'type' => '79591'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_request_update_req_full',
                                       'Size' => '84',
                                       'Type' => 'Struct'
                                     },
                          '81749' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '911',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'completion_code',
                                                            'offset' => '0',
                                                            'type' => '140'
                                                          },
                                                   '1' => {
                                                            'name' => 'fd_meta_data_len',
                                                            'offset' => '1',
                                                            'type' => '5743'
                                                          },
                                                   '2' => {
                                                            'name' => 'fd_will_send_pkg_data',
                                                            'offset' => '3',
                                                            'type' => '140'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_request_update_resp',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '81806' => {
                                       'BaseType' => '81749',
                                       'Name' => 'struct pldm_request_update_resp const',
                                       'Size' => '4',
                                       'Type' => 'Const'
                                     },
                          '81811' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '921',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'maximum_downstream_device_transfer_size',
                                                            'offset' => '0',
                                                            'type' => '152'
                                                          },
                                                   '1' => {
                                                            'name' => 'maximum_outstanding_transfer_requests',
                                                            'offset' => '4',
                                                            'type' => '140'
                                                          },
                                                   '2' => {
                                                            'name' => 'downstream_device_package_data_length',
                                                            'offset' => '6',
                                                            'type' => '5743'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_request_downstream_device_update_req',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '81868' => {
                                       'BaseType' => '81811',
                                       'Name' => 'struct pldm_request_downstream_device_update_req const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '81873' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '932',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'completion_code',
                                                            'offset' => '0',
                                                            'type' => '140'
                                                          },
                                                   '1' => {
                                                            'name' => 'downstream_device_meta_data_length',
                                                            'offset' => '2',
                                                            'type' => '5743'
                                                          },
                                                   '2' => {
                                                            'name' => 'downstream_device_will_send_get_package_data',
                                                            'offset' => '4',
                                                            'type' => '140'
                                                          },
                                                   '3' => {
                                                            'name' => 'get_package_data_maximum_transfer_size',
                                                            'offset' => '6',
                                                            'type' => '5743'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_request_downstream_device_update_resp',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '81944' => {
                                       'BaseType' => '81873',
                                       'Name' => 'struct pldm_request_downstream_device_update_resp const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '82062' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '961',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'transfer_flag',
                                                            'offset' => '0',
                                                            'type' => '140'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_classification',
                                                            'offset' => '2',
                                                            'type' => '5743'
                                                          },
                                                   '2' => {
                                                            'name' => 'comp_identifier',
                                                            'offset' => '4',
                                                            'type' => '5743'
                                                          },
                                                   '3' => {
                                                            'name' => 'comp_classification_index',
                                                            'offset' => '6',
                                                            'type' => '140'
                                                          },
                                                   '4' => {
                                                            'name' => 'comp_comparison_stamp',
                                                            'offset' => '8',
                                                            'type' => '152'
                                                          },
                                                   '5' => {
                                                            'name' => 'version',
                                                            'offset' => '18',
                                                            'type' => '79591'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_pass_component_table_req_full',
                                       'Size' => '84',
                                       'Type' => 'Struct'
                                     },
                          '82161' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '974',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'completion_code',
                                                            'offset' => '0',
                                                            'type' => '140'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_resp',
                                                            'offset' => '1',
                                                            'type' => '140'
                                                          },
                                                   '2' => {
                                                            'name' => 'comp_resp_code',
                                                            'offset' => '2',
                                                            'type' => '140'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_pass_component_table_resp',
                                       'Size' => '3',
                                       'Type' => 'Struct'
                                     },
                          '82218' => {
                                       'BaseType' => '82161',
                                       'Name' => 'struct pldm_pass_component_table_resp const',
                                       'Size' => '3',
                                       'Type' => 'Const'
                                     },
                          '82350' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '1002',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_classification',
                                                            'offset' => '0',
                                                            'type' => '5743'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_identifier',
                                                            'offset' => '2',
                                                            'type' => '5743'
                                                          },
                                                   '2' => {
                                                            'name' => 'comp_classification_index',
                                                            'offset' => '4',
                                                            'type' => '140'
                                                          },
                                                   '3' => {
                                                            'name' => 'comp_comparison_stamp',
                                                            'offset' => '8',
                                                            'type' => '152'
                                                          },
                                                   '4' => {
                                                            'name' => 'version',
                                                            'offset' => '18',
                                                            'type' => '79591'
                                                          },
                                                   '5' => {
                                                            'name' => 'comp_image_size',
                                                            'offset' => '132',
                                                            'type' => '152'
                                                          },
                                                   '6' => {
                                                            'name' => 'update_option_flags',
                                                            'offset' => '136',
                                                            'type' => '76487'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_update_component_req_full',
                                       'Size' => '92',
                                       'Type' => 'Struct'
                                     },
                          '82463' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '1018',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'completion_code',
                                                            'offset' => '0',
                                                            'type' => '140'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_compatibility_resp',
                                                            'offset' => '1',
                                                            'type' => '140'
                                                          },
                                                   '2' => {
                                                            'name' => 'comp_compatibility_resp_code',
                                                            'offset' => '2',
                                                            'type' => '140'
                                                          },
                                                   '3' => {
                                                            'name' => 'update_option_flags_enabled',
                                                            'offset' => '3',
                                                            'type' => '76487'
                                                          },
                                                   '4' => {
                                                            'name' => 'time_before_req_fw_data',
                                                            'offset' => '7',
                                                            'type' => '5743'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_update_component_resp',
                                       'Size' => '9',
                                       'Type' => 'Struct'
                                     },
                          '82548' => {
                                       'BaseType' => '82463',
                                       'Name' => 'struct pldm_update_component_resp const',
                                       'Size' => '9',
                                       'Type' => 'Const'
                                     },
                          '82553' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '1030',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'offset',
                                                            'offset' => '0',
                                                            'type' => '152'
                                                          },
                                                   '1' => {
                                                            'name' => 'length',
                                                            'offset' => '4',
                                                            'type' => '152'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_request_firmware_data_req',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '82596' => {
                                       'BaseType' => '82553',
                                       'Name' => 'struct pldm_request_firmware_data_req const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '82601' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '1039',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'apply_result',
                                                            'offset' => '0',
                                                            'type' => '140'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_activation_methods_modification',
                                                            'offset' => '1',
                                                            'type' => '59020'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_apply_complete_req',
                                       'Size' => '3',
                                       'Type' => 'Struct'
                                     },
                          '82644' => {
                                       'BaseType' => '82601',
                                       'Name' => 'struct pldm_apply_complete_req const',
                                       'Size' => '3',
                                       'Type' => 'Const'
                                     },
                          '82678' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '1056',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'completion_code',
                                                            'offset' => '0',
                                                            'type' => '140'
                                                          },
                                                   '1' => {
                                                            'name' => 'estimated_time_activation',
                                                            'offset' => '1',
                                                            'type' => '5743'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_activate_firmware_resp',
                                       'Size' => '3',
                                       'Type' => 'Struct'
                                     },
                          '82721' => {
                                       'BaseType' => '82678',
                                       'Name' => 'struct pldm_activate_firmware_resp const',
                                       'Size' => '3',
                                       'Type' => 'Const'
                                     },
                          '82726' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '1065',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'completion_code',
                                                            'offset' => '0',
                                                            'type' => '140'
                                                          },
                                                   '1' => {
                                                            'name' => 'current_state',
                                                            'offset' => '1',
                                                            'type' => '140'
                                                          },
                                                   '2' => {
                                                            'name' => 'previous_state',
                                                            'offset' => '2',
                                                            'type' => '140'
                                                          },
                                                   '3' => {
                                                            'name' => 'aux_state',
                                                            'offset' => '3',
                                                            'type' => '140'
                                                          },
                                                   '4' => {
                                                            'name' => 'aux_state_status',
                                                            'offset' => '4',
                                                            'type' => '140'
                                                          },
                                                   '5' => {
                                                            'name' => 'progress_percent',
                                                            'offset' => '5',
                                                            'type' => '140'
                                                          },
                                                   '6' => {
                                                            'name' => 'reason_code',
                                                            'offset' => '6',
                                                            'type' => '140'
                                                          },
                                                   '7' => {
                                                            'name' => 'update_option_flags_enabled',
                                                            'offset' => '7',
                                                            'type' => '76487'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_get_status_resp',
                                       'Size' => '11',
                                       'Type' => 'Struct'
                                     },
                          '82853' => {
                                       'BaseType' => '82726',
                                       'Name' => 'struct pldm_get_status_resp const',
                                       'Size' => '11',
                                       'Type' => 'Const'
                                     },
                          '82858' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '1080',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'completion_code',
                                                            'offset' => '0',
                                                            'type' => '140'
                                                          },
                                                   '1' => {
                                                            'name' => 'non_functioning_component_indication',
                                                            'offset' => '1',
                                                            'type' => '75703'
                                                          },
                                                   '2' => {
                                                            'name' => 'non_functioning_component_bitmap',
                                                            'offset' => '2',
                                                            'type' => '44668'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_cancel_update_resp',
                                       'Size' => '10',
                                       'Type' => 'Struct'
                                     },
                          '82915' => {
                                       'BaseType' => '82858',
                                       'Name' => 'struct pldm_cancel_update_resp const',
                                       'Size' => '10',
                                       'Type' => 'Const'
                                     },
                          '82920' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '1395',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'field',
                                                            'offset' => '0',
                                                            'type' => '8023'
                                                          },
                                                   '1' => {
                                                            'name' => 'entries',
                                                            'offset' => '22',
                                                            'type' => '169'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_downstream_device_parameters_iter',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '82963' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '2249',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'magic',
                                                            'offset' => '0',
                                                            'type' => '164'
                                                          },
                                                   '1' => {
                                                            'name' => 'version',
                                                            'offset' => '4',
                                                            'type' => '5738'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-firmware_update.h-2249',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '83000' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '2268',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'identifier',
                                                            'offset' => '0',
                                                            'type' => '77486'
                                                          },
                                                   '1' => {
                                                            'name' => 'revision',
                                                            'offset' => '22',
                                                            'type' => '5738'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-firmware_update.h-2268',
                                       'Size' => '17',
                                       'Type' => 'Struct'
                                     },
                          '83037' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '2248',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'meta',
                                                            'offset' => '0',
                                                            'type' => '82963'
                                                          },
                                                   '1' => {
                                                            'name' => 'format',
                                                            'offset' => '8',
                                                            'type' => '83000'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_package_format_pin',
                                       'Size' => '28',
                                       'Type' => 'Struct'
                                     },
                          '83080' => {
                                       'BaseType' => '83037',
                                       'Name' => 'struct pldm_package_format_pin const',
                                       'Size' => '28',
                                       'Type' => 'Const'
                                     },
                          '83085' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '2277',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'PLDM_PACKAGE_PARSE_INIT',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'PLDM_PACKAGE_PARSE_COMPLETE',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'PLDM_PACKAGE_PARSE_HEADER',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'PLDM_PACKAGE_PARSE_FIRMWARE_DEVICES',
                                                            'value' => '3'
                                                          },
                                                   '4' => {
                                                            'name' => 'PLDM_PACKAGE_PARSE_DOWNSTREAM_DEVICES',
                                                            'value' => '4'
                                                          },
                                                   '5' => {
                                                            'name' => 'PLDM_PACKAGE_PARSE_COMPONENT_IMAGE_INFORMATION',
                                                            'value' => '5'
                                                          }
                                                 },
                                       'Name' => 'enum pldm_package_parse',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '83137' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '2286',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'field',
                                                            'offset' => '0',
                                                            'type' => '8023'
                                                          },
                                                   '1' => {
                                                            'name' => 'entries',
                                                            'offset' => '22',
                                                            'type' => '169'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_package_iter',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '83180' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '2299',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'package_header_identifier',
                                                            'offset' => '0',
                                                            'type' => '77458'
                                                          },
                                                   '1' => {
                                                            'name' => 'package_header_format_revision',
                                                            'offset' => '22',
                                                            'type' => '140'
                                                          },
                                                   '2' => {
                                                            'name' => 'package_release_date_time',
                                                            'offset' => '23',
                                                            'type' => '79849'
                                                          },
                                                   '3' => {
                                                            'name' => 'component_bitmap_bit_length',
                                                            'offset' => '48',
                                                            'type' => '5743'
                                                          },
                                                   '4' => {
                                                            'name' => 'package_version_string_type',
                                                            'offset' => '50',
                                                            'type' => '140'
                                                          },
                                                   '5' => {
                                                            'name' => 'package_version_string',
                                                            'offset' => '64',
                                                            'type' => '8023'
                                                          }
                                                 },
                                       'Name' => 'struct pldm__package_header_information',
                                       'Size' => '56',
                                       'Type' => 'Struct'
                                     },
                          '83279' => {
                                       'BaseType' => '83180',
                                       'Header' => 'firmware_update.h',
                                       'Line' => '2312',
                                       'Name' => 'pldm_package_header_information_pad',
                                       'Size' => '56',
                                       'Type' => 'Typedef'
                                     },
                          '83292' => {
                                       'BaseType' => '83279',
                                       'Name' => 'pldm_package_header_information_pad const',
                                       'Size' => '56',
                                       'Type' => 'Const'
                                     },
                          '83297' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '2315',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'bitmap',
                                                            'offset' => '0',
                                                            'type' => '8023'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_package_component_bitmap',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '83326' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '2327',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'descriptor_count',
                                                            'offset' => '0',
                                                            'type' => '140'
                                                          },
                                                   '1' => {
                                                            'name' => 'device_update_option_flags',
                                                            'offset' => '4',
                                                            'type' => '76487'
                                                          },
                                                   '2' => {
                                                            'name' => 'component_image_set_version_string_type',
                                                            'offset' => '8',
                                                            'type' => '140'
                                                          },
                                                   '3' => {
                                                            'name' => 'component_image_set_version_string',
                                                            'offset' => '22',
                                                            'type' => '8023'
                                                          },
                                                   '4' => {
                                                            'name' => 'applicable_components',
                                                            'offset' => '50',
                                                            'type' => '83297'
                                                          },
                                                   '5' => {
                                                            'name' => 'record_descriptors',
                                                            'offset' => '72',
                                                            'type' => '8023'
                                                          },
                                                   '6' => {
                                                            'name' => 'firmware_device_package_data',
                                                            'offset' => '100',
                                                            'type' => '8023'
                                                          },
                                                   '7' => {
                                                            'name' => 'reference_manifest_data',
                                                            'offset' => '128',
                                                            'type' => '8023'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_package_firmware_device_id_record',
                                       'Size' => '96',
                                       'Type' => 'Struct'
                                     },
                          '83453' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '2378',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'descriptor_count',
                                                            'offset' => '0',
                                                            'type' => '140'
                                                          },
                                                   '1' => {
                                                            'name' => 'update_option_flags',
                                                            'offset' => '4',
                                                            'type' => '76487'
                                                          },
                                                   '2' => {
                                                            'name' => 'self_contained_activation_min_version_string_type',
                                                            'offset' => '8',
                                                            'type' => '140'
                                                          },
                                                   '3' => {
                                                            'name' => 'self_contained_activation_min_version_string',
                                                            'offset' => '22',
                                                            'type' => '8023'
                                                          },
                                                   '4' => {
                                                            'name' => 'self_contained_activation_min_version_comparison_stamp',
                                                            'offset' => '50',
                                                            'type' => '152'
                                                          },
                                                   '5' => {
                                                            'name' => 'applicable_components',
                                                            'offset' => '64',
                                                            'type' => '83297'
                                                          },
                                                   '6' => {
                                                            'name' => 'record_descriptors',
                                                            'offset' => '86',
                                                            'type' => '8023'
                                                          },
                                                   '7' => {
                                                            'name' => 'package_data',
                                                            'offset' => '114',
                                                            'type' => '8023'
                                                          },
                                                   '8' => {
                                                            'name' => 'reference_manifest_data',
                                                            'offset' => '136',
                                                            'type' => '8023'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_package_downstream_device_id_record',
                                       'Size' => '104',
                                       'Type' => 'Struct'
                                     },
                          '83594' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '2428',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'component_classification',
                                                            'offset' => '0',
                                                            'type' => '5743'
                                                          },
                                                   '1' => {
                                                            'name' => 'component_identifier',
                                                            'offset' => '2',
                                                            'type' => '5743'
                                                          },
                                                   '2' => {
                                                            'name' => 'component_comparison_stamp',
                                                            'offset' => '4',
                                                            'type' => '152'
                                                          },
                                                   '3' => {
                                                            'name' => 'component_options',
                                                            'offset' => '8',
                                                            'type' => '59020'
                                                          },
                                                   '4' => {
                                                            'name' => 'requested_component_activation_method',
                                                            'offset' => '16',
                                                            'type' => '59020'
                                                          },
                                                   '5' => {
                                                            'name' => 'component_image',
                                                            'offset' => '22',
                                                            'type' => '8023'
                                                          },
                                                   '6' => {
                                                            'name' => 'component_version_string_type',
                                                            'offset' => '50',
                                                            'type' => '140'
                                                          },
                                                   '7' => {
                                                            'name' => 'component_version_string',
                                                            'offset' => '64',
                                                            'type' => '8023'
                                                          },
                                                   '8' => {
                                                            'name' => 'component_opaque_data',
                                                            'offset' => '86',
                                                            'type' => '8023'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_package_component_image_information',
                                       'Size' => '72',
                                       'Type' => 'Struct'
                                     },
                          '83735' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '2469',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'pin',
                                                            'offset' => '0',
                                                            'type' => '83846'
                                                          },
                                                   '1' => {
                                                            'name' => 'hdr',
                                                            'offset' => '8',
                                                            'type' => '83851'
                                                          },
                                                   '2' => {
                                                            'name' => 'state',
                                                            'offset' => '22',
                                                            'type' => '83085'
                                                          },
                                                   '3' => {
                                                            'name' => 'flags',
                                                            'offset' => '32',
                                                            'type' => '152'
                                                          },
                                                   '4' => {
                                                            'name' => 'package',
                                                            'offset' => '36',
                                                            'type' => '8023'
                                                          },
                                                   '5' => {
                                                            'name' => 'areas',
                                                            'offset' => '64',
                                                            'type' => '8023'
                                                          },
                                                   '6' => {
                                                            'name' => 'iter',
                                                            'offset' => '86',
                                                            'type' => '83137'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_package',
                                       'Size' => '80',
                                       'Type' => 'Struct'
                                     },
                          '83846' => {
                                       'BaseType' => '83080',
                                       'Name' => 'struct pldm_package_format_pin const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '83851' => {
                                       'BaseType' => '83292',
                                       'Name' => 'pldm_package_header_information_pad const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '90731' => {
                                       'BaseType' => '83735',
                                       'Name' => 'struct pldm_package*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '90736' => {
                                       'BaseType' => '83594',
                                       'Name' => 'struct pldm_package_component_image_information*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '98825' => {
                                       'BaseType' => '83453',
                                       'Name' => 'struct pldm_package_downstream_device_id_record*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '100478' => {
                                        'BaseType' => '83326',
                                        'Name' => 'struct pldm_package_firmware_device_id_record*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '102230' => {
                                        'BaseType' => '83279',
                                        'Name' => 'pldm_package_header_information_pad*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '104109' => {
                                        'BaseType' => '82915',
                                        'Name' => 'struct pldm_cancel_update_resp const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '104306' => {
                                        'BaseType' => '75703',
                                        'Name' => 'bool8_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '104311' => {
                                        'BaseType' => '77439',
                                        'Name' => 'bitfield64_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '108040' => {
                                        'BaseType' => '82853',
                                        'Name' => 'struct pldm_get_status_resp const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '108372' => {
                                        'BaseType' => '76487',
                                        'Name' => 'bitfield32_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '110143' => {
                                        'BaseType' => '82721',
                                        'Name' => 'struct pldm_activate_firmware_resp const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '111584' => {
                                        'BaseType' => '5537',
                                        'Name' => '_Bool*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '113369' => {
                                        'BaseType' => '82644',
                                        'Name' => 'struct pldm_apply_complete_req const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '113484' => {
                                        'BaseType' => '59020',
                                        'Name' => 'bitfield16_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '118392' => {
                                        'BaseType' => '82596',
                                        'Name' => 'struct pldm_request_firmware_data_req const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '120969' => {
                                        'BaseType' => '82548',
                                        'Name' => 'struct pldm_update_component_resp const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '125719' => {
                                        'BaseType' => '82350',
                                        'Name' => 'struct pldm_update_component_req_full*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '126193' => {
                                        'BaseType' => '77580',
                                        'Name' => 'struct variable_field const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '128069' => {
                                        'BaseType' => '82218',
                                        'Name' => 'struct pldm_pass_component_table_resp const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '132326' => {
                                        'BaseType' => '82062',
                                        'Name' => 'struct pldm_pass_component_table_req_full*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '134688' => {
                                        'BaseType' => '81806',
                                        'Name' => 'struct pldm_request_update_resp const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '138510' => {
                                        'BaseType' => '81664',
                                        'Name' => 'struct pldm_request_update_req_full*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '141129' => {
                                        'BaseType' => '81873',
                                        'Name' => 'struct pldm_request_downstream_device_update_resp*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '143302' => {
                                        'BaseType' => '81944',
                                        'Name' => 'struct pldm_request_downstream_device_update_resp const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '145123' => {
                                        'BaseType' => '81811',
                                        'Name' => 'struct pldm_request_downstream_device_update_req*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '147011' => {
                                        'BaseType' => '81868',
                                        'Name' => 'struct pldm_request_downstream_device_update_req const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '153066' => {
                                        'BaseType' => '82920',
                                        'Name' => 'struct pldm_downstream_device_parameters_iter*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '153071' => {
                                        'BaseType' => '81352',
                                        'Name' => 'struct pldm_downstream_device_parameters_entry*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '156535' => {
                                        'BaseType' => '81267',
                                        'Name' => 'struct pldm_get_downstream_firmware_parameters_resp*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '157984' => {
                                        'BaseType' => '81262',
                                        'Name' => 'struct pldm_get_downstream_firmware_parameters_req const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '159550' => {
                                        'BaseType' => '81055',
                                        'Name' => 'struct pldm_downstream_device_iter*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '159555' => {
                                        'BaseType' => '81012',
                                        'Name' => 'struct pldm_downstream_device*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '163016' => {
                                        'BaseType' => '80927',
                                        'Name' => 'struct pldm_query_downstream_identifiers_resp*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '164465' => {
                                        'BaseType' => '80922',
                                        'Name' => 'struct pldm_query_downstream_identifiers_req const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '167838' => {
                                        'BaseType' => '80479',
                                        'Name' => 'struct pldm_query_downstream_devices_resp*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '168285' => {
                                        'BaseType' => '80564',
                                        'Name' => 'struct pldm_component_parameter_entry*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '174336' => {
                                        'BaseType' => '80874',
                                        'Name' => 'struct pldm_component_parameter_entry_full const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '178404' => {
                                        'BaseType' => '80474',
                                        'Name' => 'struct pldm_get_firmware_parameters_resp_full const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '178629' => {
                                        'BaseType' => '80276',
                                        'Name' => 'struct pldm_get_firmware_parameters_resp*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '182094' => {
                                        'BaseType' => '81155',
                                        'Name' => 'struct pldm_descriptor const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '182255' => {
                                        'BaseType' => '1595',
                                        'Name' => 'uint8_t**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '182597' => {
                                        'BaseType' => '80078',
                                        'Name' => 'struct pldm_component_image_information*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '185575' => {
                                        'BaseType' => '81171',
                                        'Name' => 'struct pldm_descriptor_iter*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '185580' => {
                                        'BaseType' => '81098',
                                        'Name' => 'struct pldm_descriptor*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '185964' => {
                                        'BaseType' => '79865',
                                        'Name' => 'struct pldm_firmware_device_id_record*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '194727' => {
                                        'BaseType' => '138',
                                        'Name' => 'void**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '195228' => {
                                        'BaseType' => '79736',
                                        'Name' => 'struct pldm_package_header_information*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '212542' => {
                                        'BaseType' => '212559',
                                        'Header' => 'pdr.h',
                                        'Line' => '16',
                                        'Name' => 'pldm_pdr',
                                        'PrivateABI' => 1,
                                        'Size' => '24',
                                        'Type' => 'Typedef'
                                      },
                          '212554' => {
                                        'BaseType' => '212542',
                                        'Name' => 'pldm_pdr const',
                                        'Size' => '24',
                                        'Type' => 'Const'
                                      },
                          '212559' => {
                                        'Line' => '31',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'record_count',
                                                             'offset' => '0',
                                                             'type' => '152'
                                                           },
                                                    '1' => {
                                                             'name' => 'size',
                                                             'offset' => '4',
                                                             'type' => '152'
                                                           },
                                                    '2' => {
                                                             'name' => 'first',
                                                             'offset' => '8',
                                                             'type' => '214023'
                                                           },
                                                    '3' => {
                                                             'name' => 'last',
                                                             'offset' => '22',
                                                             'type' => '214023'
                                                           }
                                                  },
                                        'Name' => 'struct pldm_pdr',
                                        'PrivateABI' => 1,
                                        'Size' => '24',
                                        'Source' => 'pdr.c',
                                        'Type' => 'Struct'
                                      },
                          '212625' => {
                                        'BaseType' => '212642',
                                        'Header' => 'pdr.h',
                                        'Line' => '21',
                                        'Name' => 'pldm_pdr_record',
                                        'PrivateABI' => 1,
                                        'Size' => '32',
                                        'Type' => 'Typedef'
                                      },
                          '212637' => {
                                        'BaseType' => '212625',
                                        'Name' => 'pldm_pdr_record const',
                                        'Size' => '32',
                                        'Type' => 'Const'
                                      },
                          '212642' => {
                                        'Line' => '22',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'record_handle',
                                                             'offset' => '0',
                                                             'type' => '152'
                                                           },
                                                    '1' => {
                                                             'name' => 'size',
                                                             'offset' => '4',
                                                             'type' => '152'
                                                           },
                                                    '2' => {
                                                             'name' => 'data',
                                                             'offset' => '8',
                                                             'type' => '1595'
                                                           },
                                                    '3' => {
                                                             'name' => 'next',
                                                             'offset' => '22',
                                                             'type' => '214011'
                                                           },
                                                    '4' => {
                                                             'name' => 'is_remote',
                                                             'offset' => '36',
                                                             'type' => '5537'
                                                           },
                                                    '5' => {
                                                             'name' => 'terminus_handle',
                                                             'offset' => '38',
                                                             'type' => '5743'
                                                           }
                                                  },
                                        'Name' => 'struct pldm_pdr_record',
                                        'PrivateABI' => 1,
                                        'Size' => '32',
                                        'Source' => 'pdr.c',
                                        'Type' => 'Struct'
                                      },
                          '212734' => {
                                        'Header' => 'pdr.h',
                                        'Line' => '327',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'entity_type',
                                                             'offset' => '0',
                                                             'type' => '5743'
                                                           },
                                                    '1' => {
                                                             'name' => 'entity_instance_num',
                                                             'offset' => '2',
                                                             'type' => '5743'
                                                           },
                                                    '2' => {
                                                             'name' => 'entity_container_id',
                                                             'offset' => '4',
                                                             'type' => '5743'
                                                           }
                                                  },
                                        'Name' => 'struct pldm_entity',
                                        'Size' => '6',
                                        'Type' => 'Struct'
                                      },
                          '212796' => {
                                        'BaseType' => '212734',
                                        'Header' => 'pdr.h',
                                        'Line' => '331',
                                        'Name' => 'pldm_entity',
                                        'Size' => '6',
                                        'Type' => 'Typedef'
                                      },
                          '212808' => {
                                        'BaseType' => '212796',
                                        'Name' => 'pldm_entity const',
                                        'Size' => '6',
                                        'Type' => 'Const'
                                      },
                          '212842' => {
                                        'BaseType' => '212854',
                                        'Header' => 'pdr.h',
                                        'Line' => '341',
                                        'Name' => 'pldm_entity_association_tree',
                                        'PrivateABI' => 1,
                                        'Size' => '16',
                                        'Type' => 'Typedef'
                                      },
                          '212854' => {
                                        'Line' => '648',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'root',
                                                             'offset' => '0',
                                                             'type' => '214028'
                                                           },
                                                    '1' => {
                                                             'name' => 'last_used_container_id',
                                                             'offset' => '8',
                                                             'type' => '5743'
                                                           }
                                                  },
                                        'Name' => 'struct pldm_entity_association_tree',
                                        'PrivateABI' => 1,
                                        'Size' => '16',
                                        'Source' => 'pdr.c',
                                        'Type' => 'Struct'
                                      },
                          '212897' => {
                                        'BaseType' => '212914',
                                        'Header' => 'pdr.h',
                                        'Line' => '346',
                                        'Name' => 'pldm_entity_node',
                                        'PrivateABI' => 1,
                                        'Size' => '40',
                                        'Type' => 'Typedef'
                                      },
                          '212909' => {
                                        'BaseType' => '212897',
                                        'Name' => 'pldm_entity_node const',
                                        'Size' => '40',
                                        'Type' => 'Const'
                                      },
                          '212914' => {
                                        'Line' => '653',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'entity',
                                                             'offset' => '0',
                                                             'type' => '212796'
                                                           },
                                                    '1' => {
                                                             'name' => 'parent',
                                                             'offset' => '6',
                                                             'type' => '212796'
                                                           },
                                                    '2' => {
                                                             'name' => 'remote_container_id',
                                                             'offset' => '18',
                                                             'type' => '5743'
                                                           },
                                                    '3' => {
                                                             'name' => 'first_child',
                                                             'offset' => '22',
                                                             'type' => '214028'
                                                           },
                                                    '4' => {
                                                             'name' => 'next_sibling',
                                                             'offset' => '36',
                                                             'type' => '214028'
                                                           },
                                                    '5' => {
                                                             'name' => 'association_type',
                                                             'offset' => '50',
                                                             'type' => '140'
                                                           }
                                                  },
                                        'Name' => 'struct pldm_entity_node',
                                        'PrivateABI' => 1,
                                        'Size' => '40',
                                        'Source' => 'pdr.c',
                                        'Type' => 'Struct'
                                      },
                          '213229' => {
                                        'Header' => 'platform.h',
                                        'Line' => '576',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'record_handle',
                                                             'offset' => '0',
                                                             'type' => '152'
                                                           },
                                                    '1' => {
                                                             'name' => 'version',
                                                             'offset' => '4',
                                                             'type' => '140'
                                                           },
                                                    '2' => {
                                                             'name' => 'type',
                                                             'offset' => '5',
                                                             'type' => '140'
                                                           },
                                                    '3' => {
                                                             'name' => 'record_change_num',
                                                             'offset' => '6',
                                                             'type' => '5743'
                                                           },
                                                    '4' => {
                                                             'name' => 'length',
                                                             'offset' => '8',
                                                             'type' => '5743'
                                                           }
                                                  },
                                        'Name' => 'struct pldm_pdr_hdr',
                                        'Size' => '10',
                                        'Type' => 'Struct'
                                      },
                          '213678' => {
                                        'Header' => 'platform.h',
                                        'Line' => '651',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'hdr',
                                                             'offset' => '0',
                                                             'type' => '213229'
                                                           },
                                                    '1' => {
                                                             'name' => 'terminus_handle',
                                                             'offset' => '16',
                                                             'type' => '5743'
                                                           },
                                                    '2' => {
                                                             'name' => 'sensor_id',
                                                             'offset' => '18',
                                                             'type' => '5743'
                                                           },
                                                    '3' => {
                                                             'name' => 'entity_type',
                                                             'offset' => '20',
                                                             'type' => '5743'
                                                           },
                                                    '4' => {
                                                             'name' => 'entity_instance',
                                                             'offset' => '22',
                                                             'type' => '5743'
                                                           },
                                                    '5' => {
                                                             'name' => 'container_id',
                                                             'offset' => '24',
                                                             'type' => '5743'
                                                           },
                                                    '6' => {
                                                             'name' => 'sensor_init',
                                                             'offset' => '32',
                                                             'type' => '140'
                                                           },
                                                    '7' => {
                                                             'name' => 'sensor_auxiliary_names_pdr',
                                                             'offset' => '33',
                                                             'type' => '75703'
                                                           },
                                                    '8' => {
                                                             'name' => 'composite_sensor_count',
                                                             'offset' => '34',
                                                             'type' => '140'
                                                           },
                                                    '9' => {
                                                             'name' => 'possible_states',
                                                             'offset' => '35',
                                                             'type' => '1067'
                                                           }
                                                  },
                                        'Name' => 'struct pldm_state_sensor_pdr',
                                        'Size' => '24',
                                        'Type' => 'Struct'
                                      },
                          '213832' => {
                                        'Header' => 'platform.h',
                                        'Line' => '678',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'hdr',
                                                             'offset' => '0',
                                                             'type' => '213229'
                                                           },
                                                    '1' => {
                                                             'name' => 'terminus_handle',
                                                             'offset' => '16',
                                                             'type' => '5743'
                                                           },
                                                    '2' => {
                                                             'name' => 'effecter_id',
                                                             'offset' => '18',
                                                             'type' => '5743'
                                                           },
                                                    '3' => {
                                                             'name' => 'entity_type',
                                                             'offset' => '20',
                                                             'type' => '5743'
                                                           },
                                                    '4' => {
                                                             'name' => 'entity_instance',
                                                             'offset' => '22',
                                                             'type' => '5743'
                                                           },
                                                    '5' => {
                                                             'name' => 'container_id',
                                                             'offset' => '24',
                                                             'type' => '5743'
                                                           },
                                                    '6' => {
                                                             'name' => 'effecter_semantic_id',
                                                             'offset' => '32',
                                                             'type' => '5743'
                                                           },
                                                    '7' => {
                                                             'name' => 'effecter_init',
                                                             'offset' => '34',
                                                             'type' => '140'
                                                           },
                                                    '8' => {
                                                             'name' => 'has_description_pdr',
                                                             'offset' => '35',
                                                             'type' => '75703'
                                                           },
                                                    '9' => {
                                                             'name' => 'composite_effecter_count',
                                                             'offset' => '36',
                                                             'type' => '140'
                                                           },
                                                    '10' => {
                                                              'name' => 'possible_states',
                                                              'offset' => '37',
                                                              'type' => '1067'
                                                            }
                                                  },
                                        'Name' => 'struct pldm_state_effecter_pdr',
                                        'Size' => '26',
                                        'Type' => 'Struct'
                                      },
                          '214011' => {
                                        'BaseType' => '212642',
                                        'Name' => 'struct pldm_pdr_record*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '214023' => {
                                        'BaseType' => '212625',
                                        'Name' => 'pldm_pdr_record*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '214028' => {
                                        'BaseType' => '212897',
                                        'Name' => 'pldm_entity_node*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '214395' => {
                                        'BaseType' => '212842',
                                        'Name' => 'pldm_entity_association_tree*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '214400' => {
                                        'BaseType' => '212808',
                                        'Name' => 'pldm_entity const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '215884' => {
                                        'BaseType' => '212542',
                                        'Name' => 'pldm_pdr*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '217539' => {
                                        'BaseType' => '212637',
                                        'Name' => 'pldm_pdr_record const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '226258' => {
                                        'BaseType' => '212796',
                                        'Name' => 'pldm_entity*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '246135' => {
                                        'BaseType' => '226258',
                                        'Name' => 'pldm_entity**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '246782' => {
                                        'BaseType' => '214028',
                                        'Name' => 'pldm_entity_node**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '247571' => {
                                        'BaseType' => '212554',
                                        'Name' => 'pldm_pdr const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '253044' => {
                                        'BaseType' => '212909',
                                        'Name' => 'pldm_entity_node const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '259889' => {
                                        'BaseType' => '213832',
                                        'Name' => 'struct pldm_state_effecter_pdr*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '265580' => {
                                        'BaseType' => '213678',
                                        'Name' => 'struct pldm_state_sensor_pdr*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '270800' => {
                                        'BaseType' => '93',
                                        'Header' => 'types.h',
                                        'Line' => '37',
                                        'Name' => '__int8_t',
                                        'PrivateABI' => 1,
                                        'Size' => '1',
                                        'Type' => 'Typedef'
                                      },
                          '270831' => {
                                        'BaseType' => '112',
                                        'Header' => 'types.h',
                                        'Line' => '39',
                                        'Name' => '__int16_t',
                                        'PrivateABI' => 1,
                                        'Size' => '2',
                                        'Type' => 'Typedef'
                                      },
                          '270862' => {
                                        'BaseType' => '58',
                                        'Header' => 'types.h',
                                        'Line' => '41',
                                        'Name' => '__int32_t',
                                        'PrivateABI' => 1,
                                        'Size' => '4',
                                        'Type' => 'Typedef'
                                      },
                          '270900' => {
                                        'BaseType' => '5664',
                                        'Header' => 'types.h',
                                        'Line' => '55',
                                        'Name' => '__uint_least16_t',
                                        'PrivateABI' => 1,
                                        'Size' => '2',
                                        'Type' => 'Typedef'
                                      },
                          '270953' => {
                                        'BaseType' => '270800',
                                        'Header' => 'stdint-intn.h',
                                        'Line' => '24',
                                        'Name' => 'int8_t',
                                        'PrivateABI' => 1,
                                        'Size' => '1',
                                        'Type' => 'Typedef'
                                      },
                          '270965' => {
                                        'BaseType' => '270831',
                                        'Header' => 'stdint-intn.h',
                                        'Line' => '25',
                                        'Name' => 'int16_t',
                                        'PrivateABI' => 1,
                                        'Size' => '2',
                                        'Type' => 'Typedef'
                                      },
                          '270977' => {
                                        'BaseType' => '270862',
                                        'Header' => 'stdint-intn.h',
                                        'Line' => '26',
                                        'Name' => 'int32_t',
                                        'PrivateABI' => 1,
                                        'Size' => '4',
                                        'Type' => 'Typedef'
                                      },
                          '271602' => {
                                        'BaseType' => '453',
                                        'Header' => 'pldm_types.h',
                                        'Line' => '168',
                                        'Name' => 'real32_t',
                                        'Size' => '4',
                                        'Type' => 'Typedef'
                                      },
                          '272405' => {
                                        'BaseType' => '270900',
                                        'Header' => 'uchar.h',
                                        'Line' => '51',
                                        'Name' => 'char16_t',
                                        'PrivateABI' => 1,
                                        'Size' => '2',
                                        'Type' => 'Typedef'
                                      },
                          '272720' => {
                                        'Header' => 'platform.h',
                                        'Line' => '203',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'PLDM_NO_EVENT_GENERATION',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'PLDM_EVENTS_DISABLED',
                                                             'value' => '1'
                                                           },
                                                    '2' => {
                                                             'name' => 'PLDM_EVENTS_ENABLED',
                                                             'value' => '2'
                                                           },
                                                    '3' => {
                                                             'name' => 'PLDM_OP_EVENTS_ONLY_ENABLED',
                                                             'value' => '3'
                                                           },
                                                    '4' => {
                                                             'name' => 'PLDM_STATE_EVENTS_ONLY_ENABLED',
                                                             'value' => '4'
                                                           }
                                                  },
                                        'Name' => 'enum pldm_sensor_event_message_enable',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '273322' => {
                                        'Header' => 'platform.h',
                                        'Line' => '345',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'PLDM_SENSOR_OP_STATE',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'PLDM_STATE_SENSOR_STATE',
                                                             'value' => '1'
                                                           },
                                                    '2' => {
                                                             'name' => 'PLDM_NUMERIC_SENSOR_STATE',
                                                             'value' => '2'
                                                           }
                                                  },
                                        'Name' => 'enum sensor_event_class_states',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '273356' => {
                                        'BaseType' => '273322',
                                        'Name' => 'enum sensor_event_class_states const',
                                        'Size' => '4',
                                        'Type' => 'Const'
                                      },
                          '273361' => {
                                        'Header' => 'platform.h',
                                        'Line' => '367',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'PLDM_SET_SENSOR_ENABLED',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'PLDM_SET_SENSOR_DISABLED',
                                                             'value' => '1'
                                                           },
                                                    '2' => {
                                                             'name' => 'PLDM_SET_SENSOR_UNAVAILABLE',
                                                             'value' => '2'
                                                           }
                                                  },
                                        'Name' => 'enum pldm_set_sensor_operational_state',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '273852' => {
                                        'Header' => 'platform.h',
                                        'Line' => '668',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'state_set_id',
                                                             'offset' => '0',
                                                             'type' => '5743'
                                                           },
                                                    '1' => {
                                                             'name' => 'possible_states_size',
                                                             'offset' => '2',
                                                             'type' => '140'
                                                           },
                                                    '2' => {
                                                             'name' => 'states',
                                                             'offset' => '3',
                                                             'type' => '273914'
                                                           }
                                                  },
                                        'Name' => 'struct state_sensor_possible_states',
                                        'Size' => '4',
                                        'Type' => 'Struct'
                                      },
                          '273909' => {
                                        'BaseType' => '273852',
                                        'Name' => 'struct state_sensor_possible_states const',
                                        'Size' => '4',
                                        'Type' => 'Const'
                                      },
                          '273914' => {
                                        'BaseType' => '353',
                                        'Name' => 'bitfield8_t[1]',
                                        'Size' => '1',
                                        'Type' => 'Array'
                                      },
                          '274180' => {
                                        'Header' => 'platform.h',
                                        'Line' => '753',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'value_u8',
                                                             'offset' => '0',
                                                             'type' => '140'
                                                           },
                                                    '1' => {
                                                             'name' => 'value_s8',
                                                             'offset' => '0',
                                                             'type' => '270953'
                                                           },
                                                    '2' => {
                                                             'name' => 'value_u16',
                                                             'offset' => '0',
                                                             'type' => '5743'
                                                           },
                                                    '3' => {
                                                             'name' => 'value_s16',
                                                             'offset' => '0',
                                                             'type' => '270965'
                                                           },
                                                    '4' => {
                                                             'name' => 'value_u32',
                                                             'offset' => '0',
                                                             'type' => '152'
                                                           },
                                                    '5' => {
                                                             'name' => 'value_s32',
                                                             'offset' => '0',
                                                             'type' => '270977'
                                                           }
                                                  },
                                        'Name' => 'union union_effecter_data_size',
                                        'Size' => '4',
                                        'Type' => 'Union'
                                      },
                          '274287' => {
                                        'Header' => 'platform.h',
                                        'Line' => '769',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'value_u8',
                                                             'offset' => '0',
                                                             'type' => '140'
                                                           },
                                                    '1' => {
                                                             'name' => 'value_s8',
                                                             'offset' => '0',
                                                             'type' => '270953'
                                                           },
                                                    '2' => {
                                                             'name' => 'value_u16',
                                                             'offset' => '0',
                                                             'type' => '5743'
                                                           },
                                                    '3' => {
                                                             'name' => 'value_s16',
                                                             'offset' => '0',
                                                             'type' => '270965'
                                                           },
                                                    '4' => {
                                                             'name' => 'value_u32',
                                                             'offset' => '0',
                                                             'type' => '152'
                                                           },
                                                    '5' => {
                                                             'name' => 'value_s32',
                                                             'offset' => '0',
                                                             'type' => '270977'
                                                           },
                                                    '6' => {
                                                             'name' => 'value_f32',
                                                             'offset' => '0',
                                                             'type' => '271602'
                                                           }
                                                  },
                                        'Name' => 'union union_range_field_format',
                                        'Size' => '4',
                                        'Type' => 'Union'
                                      },
                          '274300' => {
                                        'Header' => 'platform.h',
                                        'Line' => '775',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'hdr',
                                                             'offset' => '0',
                                                             'type' => '213229'
                                                           },
                                                    '1' => {
                                                             'name' => 'terminus_handle',
                                                             'offset' => '16',
                                                             'type' => '5743'
                                                           },
                                                    '2' => {
                                                             'name' => 'effecter_id',
                                                             'offset' => '18',
                                                             'type' => '5743'
                                                           },
                                                    '3' => {
                                                             'name' => 'entity_type',
                                                             'offset' => '20',
                                                             'type' => '5743'
                                                           },
                                                    '4' => {
                                                             'name' => 'entity_instance',
                                                             'offset' => '22',
                                                             'type' => '5743'
                                                           },
                                                    '5' => {
                                                             'name' => 'container_id',
                                                             'offset' => '24',
                                                             'type' => '5743'
                                                           },
                                                    '6' => {
                                                             'name' => 'effecter_semantic_id',
                                                             'offset' => '32',
                                                             'type' => '5743'
                                                           },
                                                    '7' => {
                                                             'name' => 'effecter_init',
                                                             'offset' => '34',
                                                             'type' => '140'
                                                           },
                                                    '8' => {
                                                             'name' => 'effecter_auxiliary_names',
                                                             'offset' => '35',
                                                             'type' => '75703'
                                                           },
                                                    '9' => {
                                                             'name' => 'base_unit',
                                                             'offset' => '36',
                                                             'type' => '140'
                                                           },
                                                    '10' => {
                                                              'name' => 'unit_modifier',
                                                              'offset' => '37',
                                                              'type' => '270953'
                                                            },
                                                    '11' => {
                                                              'name' => 'rate_unit',
                                                              'offset' => '38',
                                                              'type' => '140'
                                                            },
                                                    '12' => {
                                                              'name' => 'base_oem_unit_handle',
                                                              'offset' => '39',
                                                              'type' => '140'
                                                            },
                                                    '13' => {
                                                              'name' => 'aux_unit',
                                                              'offset' => '40',
                                                              'type' => '140'
                                                            },
                                                    '14' => {
                                                              'name' => 'aux_unit_modifier',
                                                              'offset' => '41',
                                                              'type' => '270953'
                                                            },
                                                    '15' => {
                                                              'name' => 'aux_rate_unit',
                                                              'offset' => '48',
                                                              'type' => '140'
                                                            },
                                                    '16' => {
                                                              'name' => 'aux_oem_unit_handle',
                                                              'offset' => '49',
                                                              'type' => '140'
                                                            },
                                                    '17' => {
                                                              'name' => 'is_linear',
                                                              'offset' => '50',
                                                              'type' => '75703'
                                                            },
                                                    '18' => {
                                                              'name' => 'effecter_data_size',
                                                              'offset' => '51',
                                                              'type' => '140'
                                                            },
                                                    '19' => {
                                                              'name' => 'resolution',
                                                              'offset' => '52',
                                                              'type' => '271602'
                                                            },
                                                    '20' => {
                                                              'name' => 'offset',
                                                              'offset' => '56',
                                                              'type' => '271602'
                                                            },
                                                    '21' => {
                                                              'name' => 'accuracy',
                                                              'offset' => '66',
                                                              'type' => '5743'
                                                            },
                                                    '22' => {
                                                              'name' => 'plus_tolerance',
                                                              'offset' => '68',
                                                              'type' => '140'
                                                            },
                                                    '23' => {
                                                              'name' => 'minus_tolerance',
                                                              'offset' => '69',
                                                              'type' => '140'
                                                            },
                                                    '24' => {
                                                              'name' => 'state_transition_interval',
                                                              'offset' => '70',
                                                              'type' => '271602'
                                                            },
                                                    '25' => {
                                                              'name' => 'transition_interval',
                                                              'offset' => '80',
                                                              'type' => '271602'
                                                            },
                                                    '26' => {
                                                              'name' => 'max_settable',
                                                              'offset' => '84',
                                                              'type' => '274180'
                                                            },
                                                    '27' => {
                                                              'name' => 'min_settable',
                                                              'offset' => '88',
                                                              'type' => '274180'
                                                            },
                                                    '28' => {
                                                              'name' => 'range_field_format',
                                                              'offset' => '98',
                                                              'type' => '140'
                                                            },
                                                    '29' => {
                                                              'name' => 'range_field_support',
                                                              'offset' => '99',
                                                              'type' => '353'
                                                            },
                                                    '30' => {
                                                              'name' => 'nominal_value',
                                                              'offset' => '100',
                                                              'type' => '274287'
                                                            },
                                                    '31' => {
                                                              'name' => 'normal_max',
                                                              'offset' => '104',
                                                              'type' => '274287'
                                                            },
                                                    '32' => {
                                                              'name' => 'normal_min',
                                                              'offset' => '114',
                                                              'type' => '274287'
                                                            },
                                                    '33' => {
                                                              'name' => 'rated_max',
                                                              'offset' => '118',
                                                              'type' => '274287'
                                                            },
                                                    '34' => {
                                                              'name' => 'rated_min',
                                                              'offset' => '128',
                                                              'type' => '274287'
                                                            }
                                                  },
                                        'Name' => 'struct pldm_numeric_effecter_value_pdr',
                                        'Size' => '84',
                                        'Type' => 'Struct'
                                      },
                          '274886' => {
                                        'Header' => 'platform.h',
                                        'Line' => '826',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'value_u8',
                                                             'offset' => '0',
                                                             'type' => '140'
                                                           },
                                                    '1' => {
                                                             'name' => 'value_s8',
                                                             'offset' => '0',
                                                             'type' => '270953'
                                                           },
                                                    '2' => {
                                                             'name' => 'value_u16',
                                                             'offset' => '0',
                                                             'type' => '5743'
                                                           },
                                                    '3' => {
                                                             'name' => 'value_s16',
                                                             'offset' => '0',
                                                             'type' => '270965'
                                                           },
                                                    '4' => {
                                                             'name' => 'value_u32',
                                                             'offset' => '0',
