$VAR1 = {
          'ABI_DUMPER_VERSION' => '1.2',
          'ABI_DUMP_VERSION' => '3.5',
          'Arch' => 'x86_64',
          'GccVersion' => '12.3.0',
          'Headers' => {
                         'af-mctp.h' => 1,
                         'base.h' => 1,
                         'bios.h' => 1,
                         'bios_table.h' => 1,
                         'file_io.h' => 1,
                         'firmware_update.h' => 1,
                         'fru.h' => 1,
                         'host.h' => 1,
                         'instance-id.h' => 1,
                         'mctp-demux.h' => 1,
                         'pdr.h' => 1,
                         'platform.h' => 1,
                         'platform_oem_ibm.h' => 1,
                         'pldm.h' => 1,
                         'pldm_types.h' => 1,
                         'transport.h' => 1,
                         'utils.h' => 1
                       },
          'Language' => 'C',
          'LibraryName' => 'libpldm.so.0.7.0',
          'LibraryVersion' => '0.7.0',
          'NameSpaces' => {},
          'Needed' => {
                        'libc.so.6' => 1
                      },
          'PublicABI' => '1',
          'Sources' => {
                         'af-mctp.c' => 1,
                         'base.c' => 1,
                         'bios.c' => 1,
                         'bios_table.c' => 1,
                         'file_io.c' => 1,

                                                 'pldm_pdr_find_record' => 1,
                                                 'pldm_pdr_find_record_by_type' => 1,
                                                 'pldm_pdr_fru_record_set_find_by_rsi' => 1,
                                                 'pldm_pdr_get_next_record' => 1,
                                                 'pldm_pdr_get_record_count' => 1,
                                                 'pldm_pdr_get_record_handle' => 1,
                                                 'pldm_pdr_get_repo_size' => 1,
                                                 'pldm_pdr_init' => 1,
                                                 'pldm_pdr_record_is_remote' => 1,
                                                 'pldm_pdr_remove_pdrs_by_terminus_handle' => 1,
                                                 'pldm_pdr_remove_remote_pdrs' => 1,
                                                 'pldm_pdr_update_TL_pdr' => 1,
                                                 'pldm_recv' => 1,
                                                 'pldm_recv_any' => 1,
                                                 'pldm_send' => 1,
                                                 'pldm_send_recv' => 1,
                                                 'pldm_transport_af_mctp_bind' => 1,
                                                 'pldm_transport_af_mctp_core' => 1,
                                                 'pldm_transport_af_mctp_destroy' => 1,
                                                 'pldm_transport_af_mctp_init' => 1,
                                                 'pldm_transport_af_mctp_init_pollfd' => 1,
                                                 'pldm_transport_af_mctp_map_tid' => 1,
                                                 'pldm_transport_af_mctp_unmap_tid' => 1,
                                                 'pldm_transport_mctp_demux_core' => 1,
                                                 'pldm_transport_mctp_demux_destroy' => 1,
                                                 'pldm_transport_mctp_demux_init' => 1,
                                                 'pldm_transport_mctp_demux_init_pollfd' => 1,
                                                 'pldm_transport_mctp_demux_map_tid' => 1,
                                                 'pldm_transport_mctp_demux_unmap_tid' => 1,
                                                 'pldm_transport_poll' => 1,
                                                 'pldm_transport_recv_msg' => 1,
                                                 'pldm_transport_send_msg' => 1,
                                                 'pldm_transport_send_recv_msg' => 1,
                                                 'unpack_pldm_header' => 1,
                                                 'ver2str' => 1
                                               }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '102' => {
                                     'Name' => 'unsigned long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '109' => {
                                     'Name' => 'long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '116' => {
                                     'Name' => 'char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '11890' => {
                                       'BaseType' => '116',
                                       'Name' => 'char*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11907' => {
                                       'BaseType' => '116',
                                       'Name' => 'char const',
                                       'Size' => '1',
                                       'Type' => 'Const'
                                     },
                          '11938' => {
                                       'BaseType' => '137',
                                       'Name' => 'size_t const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '11950' => {
                                       'BaseType' => '46',
                                       'Header' => 'types.h',
                                       'Line' => '37',
                                       'Name' => '__int8_t',
                                       'PrivateABI' => 1,
                                       'Size' => '1',
                                       'Type' => 'Typedef'
                                     },
                          '11974' => {
                                       'BaseType' => '60',
                                       'Header' => 'types.h',
                                       'Line' => '39',
                                       'Name' => '__int16_t',
                                       'PrivateABI' => 1,
                                       'Size' => '2',
                                       'Type' => 'Typedef'
                                     },
                          '11998' => {
                                       'BaseType' => '74',
                                       'Header' => 'types.h',
                                       'Line' => '41',
                                       'Name' => '__int32_t',
                                       'PrivateABI' => 1,
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '12024' => {
                                       'BaseType' => '109',
                                       'Header' => 'types.h',
                                       'Line' => '194',
                                       'Name' => '__ssize_t',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '12036' => {
                                       'BaseType' => '11950',
                                       'Header' => 'stdint-intn.h',
                                       'Line' => '24',
                                       'Name' => 'int8_t',
                                       'PrivateABI' => 1,
                                       'Size' => '1',
                                       'Type' => 'Typedef'
                                     },
                          '12048' => {
                                       'BaseType' => '11974',
                                       'Header' => 'stdint-intn.h',
                                       'Line' => '25',
                                       'Name' => 'int16_t',
                                       'PrivateABI' => 1,
                                       'Size' => '2',
                                       'Type' => 'Typedef'
                                     },
                          '12060' => {
                                       'BaseType' => '11998',
                                       'Header' => 'stdint-intn.h',
                                       'Line' => '26',
                                       'Name' => 'int32_t',
                                       'PrivateABI' => 1,
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '12101' => {
                                       'BaseType' => '5303',
                                       'Name' => 'uint16_t const',
                                       'Size' => '2',
                                       'Type' => 'Const'
                                     },
                          '12118' => {
                                       'BaseType' => '194',
                                       'Name' => 'uint32_t const',
                                       'Size' => '4',
                                       'Type' => 'Const'
                                     },
                          '12289' => {
                                       'BaseType' => '182',
                                       'Header' => 'pldm_types.h',
                                       'Line' => '32',
                                       'Name' => 'bool8_t',
                                       'Size' => '1',
                                       'Type' => 'Typedef'
                                     },
                          '12301' => {
                                       'BaseType' => '460',
                                       'Header' => 'pldm_types.h',
                                       'Line' => '164',
                                       'Name' => 'real32_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '12854' => {
                                       'BaseType' => '11907',
                                       'Name' => 'char const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '12859' => {
                                       'BaseType' => '12024',
                                       'Header' => 'types.h',
                                       'Line' => '108',
                                       'Name' => 'ssize_t',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '13395' => {
                                       'Header' => 'platform.h',
                                       'Line' => '238',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'PLDM_SENSOR_OP_STATE',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'PLDM_STATE_SENSOR_STATE',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'PLDM_NUMERIC_SENSOR_STATE',
                                                            'value' => '2'
                                                          }
                                                 },
                                       'Name' => 'enum sensor_event_class_states',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '13429' => {
                                       'BaseType' => '13395',
                                       'Name' => 'enum sensor_event_class_states const',
                                       'Size' => '4',
                                       'Type' => 'Const'
                                     },
                          '13652' => {
                                       'Header' => 'platform.h',
                                       'Line' => '455',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'record_handle',
                                                            'offset' => '0',
                                                            'type' => '194'
                                                          },
                                                   '1' => {
                                                            'name' => 'version',
                                                            'offset' => '4',
                                                            'type' => '182'
                                                          },
                                                   '2' => {
                                                            'name' => 'type',
                                                            'offset' => '5',
                                                            'type' => '182'
                                                          },
                                                   '3' => {
                                                            'name' => 'record_change_num',
                                                            'offset' => '6',
                                                            'type' => '5303'
                                                          },
                                                   '4' => {
                                                            'name' => 'length',
                                                            'offset' => '8',
                                                            'type' => '5303'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_pdr_hdr',
                                       'Size' => '10',
                                       'Type' => 'Struct'
                                     },
                          '137' => {
                                     'BaseType' => '102',
                                     'Header' => 'stddef.h',
                                     'Line' => '214',
                                     'Name' => 'size_t',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '13731' => {
                                       'Header' => 'platform.h',
                                       'Line' => '530',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '13652'
                                                          },
                                                   '1' => {
                                                            'name' => 'terminus_handle',
                                                            'offset' => '16',
                                                            'type' => '5303'
                                                          },
                                                   '2' => {
                                                            'name' => 'sensor_id',
                                                            'offset' => '18',
                                                            'type' => '5303'
                                                          },
                                                   '3' => {
                                                            'name' => 'entity_type',
                                                            'offset' => '20',
                                                            'type' => '5303'
                                                          },
                                                   '4' => {
                                                            'name' => 'entity_instance',
                                                            'offset' => '22',
                                                            'type' => '5303'
                                                          },
                                                   '5' => {
                                                            'name' => 'container_id',
                                                            'offset' => '24',
                                                            'type' => '5303'
                                                          },
                                                   '6' => {
                                                            'name' => 'sensor_init',
                                                            'offset' => '32',
                                                            'type' => '182'
                                                          },
                                                   '7' => {
                                                            'name' => 'sensor_auxiliary_names_pdr',
                                                            'offset' => '33',
                                                            'type' => '12289'
                                                          },
                                                   '8' => {
                                                            'name' => 'composite_sensor_count',
                                                            'offset' => '34',
                                                            'type' => '182'
                                                          },
                                                   '9' => {
                                                            'name' => 'possible_states',
                                                            'offset' => '35',
                                                            'type' => '899'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_state_sensor_pdr',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '13875' => {
                                       'Header' => 'platform.h',
                                       'Line' => '547',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'state_set_id',
                                                            'offset' => '0',
                                                            'type' => '5303'
                                                          },
                                                   '1' => {
                                                            'name' => 'possible_states_size',
                                                            'offset' => '2',
                                                            'type' => '182'
                                                          },
                                                   '2' => {
                                                            'name' => 'states',
                                                            'offset' => '3',
                                                            'type' => '13933'
                                                          }
                                                 },
                                       'Name' => 'struct state_sensor_possible_states',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '13928' => {
                                       'BaseType' => '13875',
                                       'Name' => 'struct state_sensor_possible_states const',
                                       'Size' => '4',
                                       'Type' => 'Const'
                                     },
                          '13933' => {
                                       'BaseType' => '360',
                                       'Name' => 'bitfield8_t[1]',
                                       'Size' => '1',
                                       'Type' => 'Array'
                                     },
                          '13949' => {
                                       'Header' => 'platform.h',
                                       'Line' => '557',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '13652'
                                                          },
                                                   '1' => {
                                                            'name' => 'terminus_handle',
                                                            'offset' => '16',
                                                            'type' => '5303'
                                                          },
                                                   '10' => {
                                                             'name' => 'possible_states',
                                                             'offset' => '37',
                                                             'type' => '899'
                                                           },
                                                   '2' => {
                                                            'name' => 'effecter_id',
                                                            'offset' => '18',
                                                            'type' => '5303'
                                                          },
                                                   '3' => {
                                                            'name' => 'entity_type',
                                                            'offset' => '20',
                                                            'type' => '5303'
                                                          },
                                                   '4' => {
                                                            'name' => 'entity_instance',
                                                            'offset' => '22',
                                                            'type' => '5303'
                                                          },
                                                   '5' => {
                                                            'name' => 'container_id',
                                                            'offset' => '24',
                                                            'type' => '5303'
                                                          },
                                                   '6' => {
                                                            'name' => 'effecter_semantic_id',
                                                            'offset' => '32',
                                                            'type' => '5303'
                                                          },
                                                   '7' => {
                                                            'name' => 'effecter_init',
                                                            'offset' => '34',
                                                            'type' => '182'
                                                          },
                                                   '8' => {
                                                            'name' => 'has_description_pdr',
                                                            'offset' => '35',
                                                            'type' => '12289'
                                                          },
                                                   '9' => {
                                                            'name' => 'composite_effecter_count',
                                                            'offset' => '36',
                                                            'type' => '182'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_state_effecter_pdr',
                                       'Size' => '26',
                                       'Type' => 'Struct'
                                     },
                          '14200' => {
                                       'Header' => 'platform.h',
                                       'Line' => '648',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'value_u8',
                                                            'offset' => '0',
                                                            'type' => '182'
                                                          },
                                                   '1' => {
                                                            'name' => 'value_s8',
                                                            'offset' => '0',
                                                            'type' => '12036'
                                                          },
                                                   '2' => {
                                                            'name' => 'value_u16',
                                                            'offset' => '0',
                                                            'type' => '5303'
                                                          },
                                                   '3' => {
                                                            'name' => 'value_s16',
                                                            'offset' => '0',
                                                            'type' => '12048'
                                                          },
                                                   '4' => {
                                                            'name' => 'value_u32',
                                                            'offset' => '0',
                                                            'type' => '194'
                                                          },
                                                   '5' => {
                                                            'name' => 'value_s32',
                                                            'offset' => '0',
                                                            'type' => '12060'
                                                          },
                                                   '6' => {
                                                            'name' => 'value_f32',
                                                            'offset' => '0',
                                                            'type' => '12301'
                                                          }
                                                 },
                                       'Name' => 'union union_range_field_format',
                                       'Size' => '4',
                                       'Type' => 'Union'
                                     },
                          '14294' => {
                                       'Header' => 'platform.h',
                                       'Line' => '705',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'value_u8',
                                                            'offset' => '0',
                                                            'type' => '182'
                                                          },
                                                   '1' => {
                                                            'name' => 'value_s8',
                                                            'offset' => '0',
                                                            'type' => '12036'
                                                          },
                                                   '2' => {
                                                            'name' => 'value_u16',
                                                            'offset' => '0',
                                                            'type' => '5303'
                                                          },
                                                   '3' => {
                                                            'name' => 'value_s16',
                                                            'offset' => '0',
                                                            'type' => '12048'
                                                          },
                                                   '4' => {
                                                            'name' => 'value_u32',
                                                            'offset' => '0',
                                                            'type' => '194'
                                                          },
                                                   '5' => {
                                                            'name' => 'value_s32',
                                                            'offset' => '0',
                                                            'type' => '12060'
                                                          }
                                                 },
                                       'Name' => 'union union_sensor_data_size',
                                       'Size' => '4',
                                       'Type' => 'Union'
                                     },
                          '14306' => {
                                       'Header' => 'platform.h',
                                       'Line' => '712',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'record_handle',
                                                            'offset' => '0',
                                                            'type' => '194'
                                                          },
                                                   '1' => {
                                                            'name' => 'version',
                                                            'offset' => '4',
                                                            'type' => '182'
                                                          },
                                                   '2' => {
                                                            'name' => 'type',
                                                            'offset' => '5',
                                                            'type' => '182'
                                                          },
                                                   '3' => {
                                                            'name' => 'record_change_num',
                                                            'offset' => '6',
                                                            'type' => '5303'
                                                          },
                                                   '4' => {
                                                            'name' => 'length',
                                                            'offset' => '8',
                                                            'type' => '5303'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_value_pdr_hdr',
                                       'Size' => '12',
                                       'Type' => 'Struct'
                                     },
                          '14385' => {
                                       'Header' => 'platform.h',
                                       'Line' => '730',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'entity_instance_num',
                                                            'offset' => '0',
                                                            'type' => '5303'
                                                          },
                                                   '1' => {
                                                            'name' => 'entity_instance',
                                                            'offset' => '0',
                                                            'type' => '5303'
                                                          }
                                                 },
                                       'Name' => 'anon-union-platform.h-730',
                                       'Size' => '2',
                                       'Type' => 'Union'
                                     },
                          '14419' => {
                                       'Header' => 'platform.h',
                                       'Line' => '725',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '14306'
                                                          },
                                                   '1' => {
                                                            'name' => 'terminus_handle',
                                                            'offset' => '18',
                                                            'type' => '5303'
                                                          },
                                                   '10' => {
                                                             'name' => 'rate_unit',
                                                             'offset' => '38',
                                                             'type' => '182'
                                                           },
                                                   '11' => {
                                                             'name' => 'base_oem_unit_handle',
                                                             'offset' => '39',
                                                             'type' => '182'
                                                           },
                                                   '12' => {
                                                             'name' => 'aux_unit',
                                                             'offset' => '40',
                                                             'type' => '182'
                                                           },
                                                   '13' => {
                                                             'name' => 'aux_unit_modifier',
                                                             'offset' => '41',
                                                             'type' => '12036'
                                                           },
                                                   '14' => {
                                                             'name' => 'aux_rate_unit',
                                                             'offset' => '48',
                                                             'type' => '182'
                                                           },
                                                   '15' => {
                                                             'name' => 'rel',
                                                             'offset' => '49',
                                                             'type' => '182'
                                                           },
                                                   '16' => {
                                                             'name' => 'aux_oem_unit_handle',
                                                             'offset' => '50',
                                                             'type' => '182'
                                                           },
                                                   '17' => {
                                                             'name' => 'is_linear',
                                                             'offset' => '51',
                                                             'type' => '12289'
                                                           },
                                                   '18' => {
                                                             'name' => 'sensor_data_size',
                                                             'offset' => '52',
                                                             'type' => '182'
                                                           },
                                                   '19' => {
                                                             'name' => 'resolution',
                                                             'offset' => '54',
                                                             'type' => '12301'
                                                           },
                                                   '2' => {
                                                            'name' => 'sensor_id',
                                                            'offset' => '20',
                                                            'type' => '5303'
                                                          },
                                                   '20' => {
                                                             'name' => 'offset',
                                                             'offset' => '64',
                                                             'type' => '12301'
                                                           },
                                                   '21' => {
                                                             'name' => 'accuracy',
                                                             'offset' => '68',
                                                             'type' => '5303'
                                                           },
                                                   '22' => {
                                                             'name' => 'plus_tolerance',
                                                             'offset' => '70',
                                                             'type' => '182'
                                                           },
                                                   '23' => {
                                                             'name' => 'minus_tolerance',
                                                             'offset' => '71',
                                                             'type' => '182'
                                                           },
                                                   '24' => {
                                                             'name' => 'hysteresis',
                                                             'offset' => '72',
                                                             'type' => '14294'
                                                           },
                                                   '25' => {
                                                             'name' => 'supported_thresholds',
                                                             'offset' => '82',
                                                             'type' => '360'
                                                           },
                                                   '26' => {
                                                             'name' => 'threshold_and_hysteresis_volatility',
                                                             'offset' => '83',
                                                             'type' => '360'
                                                           },
                                                   '27' => {
                                                             'name' => 'state_transition_interval',
                                                             'offset' => '86',
                                                             'type' => '12301'
                                                           },
                                                   '28' => {
                                                             'name' => 'update_interval',
                                                             'offset' => '96',
                                                             'type' => '12301'
                                                           },
                                                   '29' => {
                                                             'name' => 'max_readable',
                                                             'offset' => '100',
                                                             'type' => '14294'
                                                           },
                                                   '3' => {
                                                            'name' => 'entity_type',
                                                            'offset' => '22',
                                                            'type' => '5303'
                                                          },
                                                   '30' => {
                                                             'name' => 'min_readable',
                                                             'offset' => '104',
                                                             'type' => '14294'
                                                           },
                                                   '31' => {
                                                             'name' => 'range_field_format',
                                                             'offset' => '114',
                                                             'type' => '182'
                                                           },
                                                   '32' => {
                                                             'name' => 'range_field_support',
                                                             'offset' => '115',
                                                             'type' => '360'
                                                           },
                                                   '33' => {
                                                             'name' => 'nominal_value',
                                                             'offset' => '118',
                                                             'type' => '14200'
                                                           },
                                                   '34' => {
                                                             'name' => 'normal_max',
                                                             'offset' => '128',
                                                             'type' => '14200'
                                                           },
                                                   '35' => {
                                                             'name' => 'normal_min',
                                                             'offset' => '132',
                                                             'type' => '14200'
                                                           },
                                                   '36' => {
                                                             'name' => 'warning_high',
                                                             'offset' => '136',
                                                             'type' => '14200'
                                                           },
                                                   '37' => {
                                                             'name' => 'warning_low',
                                                             'offset' => '146',
                                                             'type' => '14200'
                                                           },
                                                   '38' => {
                                                             'name' => 'critical_high',
                                                             'offset' => '150',
                                                             'type' => '14200'
                                                           },
                                                   '39' => {
                                                             'name' => 'critical_low',
                                                             'offset' => '256',
                                                             'type' => '14200'
                                                           },
                                                   '4' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '24',
                                                            'type' => '14385'
                                                          },
                                                   '40' => {
                                                             'name' => 'fatal_high',
                                                             'offset' => '260',
                                                             'type' => '14200'
                                                           },
                                                   '41' => {
                                                             'name' => 'fatal_low',
                                                             'offset' => '264',
                                                             'type' => '14200'
                                                           },
                                                   '5' => {
                                                            'name' => 'container_id',
                                                            'offset' => '32',
                                                            'type' => '5303'
                                                          },
                                                   '6' => {
                                                            'name' => 'sensor_init',
                                                            'offset' => '34',
                                                            'type' => '182'
                                                          },
                                                   '7' => {
                                                            'name' => 'sensor_auxiliary_names_pdr',
                                                            'offset' => '35',
                                                            'type' => '12289'
                                                          },
                                                   '8' => {
                                                            'name' => 'base_unit',
                                                            'offset' => '36',
                                                            'type' => '182'
                                                          },
                                                   '9' => {
                                                            'name' => 'unit_modifier',
                                                            'offset' => '37',
                                                            'type' => '12036'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_numeric_sensor_value_pdr',
                                       'Size' => '112',
                                       'Type' => 'Struct'
                                     },
                          '1451' => {
                                      'Name' => '_Bool',
                                      'Size' => '1',
                                      'Type' => 'Intrinsic'
                                    },
                          '1490' => {
                                      'BaseType' => '1495',
                                      'Name' => 'void const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1495' => {
                                      'BaseType' => '1',
                                      'Name' => 'void const',
                                      'Type' => 'Const'
                                    },
                          '14972' => {
                                       'Header' => 'platform.h',
                                       'Line' => '777',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'state_set_id',
                                                            'offset' => '0',
                                                            'type' => '5303'
                                                          },
                                                   '1' => {
                                                            'name' => 'possible_states_size',
                                                            'offset' => '2',
                                                            'type' => '182'
                                                          },
                                                   '2' => {
                                                            'name' => 'states',
                                                            'offset' => '3',
                                                            'type' => '13933'
                                                          }
                                                 },
                                       'Name' => 'struct state_effecter_possible_states',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '15025' => {
                                       'BaseType' => '14972',
                                       'Name' => 'struct state_effecter_possible_states const',
                                       'Size' => '4',
                                       'Type' => 'Const'
                                     },
                          '15030' => {
                                       'Header' => 'platform.h',
                                       'Line' => '825',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'set_request',
                                                            'offset' => '0',
                                                            'type' => '182'
                                                          },
                                                   '1' => {
                                                            'name' => 'effecter_state',
                                                            'offset' => '1',
                                                            'type' => '182'
                                                          }
                                                 },
                                       'Name' => 'struct state_field_for_state_effecter_set',
                                       'Size' => '2',
                                       'Type' => 'Struct'
                                     },
                          '15070' => {
                                       'BaseType' => '15030',
                                       'Header' => 'platform.h',
                                       'Line' => '828',
                                       'Name' => 'set_effecter_state_field',
                                       'Size' => '2',
                                       'Type' => 'Typedef'
                                     },
                          '15082' => {
                                       'Header' => 'platform.h',
                                       'Line' => '834',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'sensor_op_state',
                                                            'offset' => '0',
                                                            'type' => '182'
                                                          },
                                                   '1' => {
                                                            'name' => 'present_state',
                                                            'offset' => '1',
                                                            'type' => '182'
                                                          },
                                                   '2' => {
                                                            'name' => 'previous_state',
                                                            'offset' => '2',
                                                            'type' => '182'
                                                          },
                                                   '3' => {
                                                            'name' => 'event_state',
                                                            'offset' => '3',
                                                            'type' => '182'
                                                          }
                                                 },
                                       'Name' => 'struct state_field_for_get_state_sensor_readings',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '15148' => {
                                       'BaseType' => '15082',
                                       'Header' => 'platform.h',
                                       'Line' => '842',
                                       'Name' => 'get_sensor_state_field',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '15347' => {
                                       'BaseType' => '182',
                                       'Name' => 'uint8_t[13]',
                                       'Size' => '13',
                                       'Type' => 'Array'
                                     },
                          '156' => {
                                     'BaseType' => '53',
                                     'Header' => 'types.h',
                                     'Line' => '38',
                                     'Name' => '__uint8_t',
                                     'PrivateABI' => 1,
                                     'Size' => '1',
                                     'Type' => 'Typedef'
                                   },
                          '15829' => {
                                       'Header' => 'platform.h',
                                       'Line' => '979',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'sensor_id',
                                                            'offset' => '0',
                                                            'type' => '5303'
                                                          },
                                                   '1' => {
                                                            'name' => 'sensor_event_class_type',
                                                            'offset' => '2',
                                                            'type' => '182'
                                                          },
                                                   '2' => {
                                                            'name' => 'event_class',
                                                            'offset' => '3',
                                                            'type' => '899'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_sensor_event_data',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '16041' => {
                                       'Header' => 'platform.h',
                                       'Line' => '1060',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'event_data_format',
                                                            'offset' => '0',
                                                            'type' => '182'
                                                          },
                                                   '1' => {
                                                            'name' => 'number_of_change_records',
                                                            'offset' => '1',
                                                            'type' => '182'
                                                          },
                                                   '2' => {
                                                            'name' => 'change_records',
                                                            'offset' => '2',
                                                            'type' => '899'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_pdr_repository_chg_event_data',
                                       'Size' => '3',
                                       'Type' => 'Struct'
                                     },
                          '168' => {
                                     'BaseType' => '81',
                                     'Header' => 'types.h',
                                     'Line' => '42',
                                     'Name' => '__uint32_t',
                                     'PrivateABI' => 1,
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '1688' => {
                                      'BaseType' => '856',
                                      'Name' => 'struct pldm_msg*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '17266' => {
                                       'BaseType' => '180',
                                       'Name' => 'void**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '180' => {
                                     'BaseType' => '1',
                                     'Name' => 'void*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '182' => {
                                     'BaseType' => '156',
                                     'Header' => 'stdint-uintn.h',
                                     'Line' => '24',
                                     'Name' => 'uint8_t',
                                     'PrivateABI' => 1,
                                     'Size' => '1',
                                     'Type' => 'Typedef'
                                   },
                          '194' => {
                                     'BaseType' => '168',
                                     'Header' => 'stdint-uintn.h',
                                     'Line' => '26',
                                     'Name' => 'uint32_t',
                                     'PrivateABI' => 1,
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '206' => {
                                     'Header' => 'pldm_types.h',
                                     'Line' => '9',
                                     'Name' => 'anon-struct-pldm_types.h-9',
                                     'Size' => '1',
                                     'Type' => 'Struct'
                                   },
                          '2133' => {
                                      'BaseType' => '894',
                                      'Name' => 'struct pldm_msg const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2138' => {
                                      'BaseType' => '182',
                                      'Name' => 'uint8_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '21428' => {
                                       'BaseType' => '9360',
                                       'Name' => 'size_t*const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '2143' => {
                                      'BaseType' => '194',
                                      'Name' => 'uint32_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '23041' => {
                                       'BaseType' => '23051',
                                       'Name' => 'uint32_t const*const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '23046' => {
                                       'BaseType' => '12118',
                                       'Name' => 'uint32_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '23051' => {
                                       'BaseType' => '23046',
                                       'Name' => 'uint32_t const*const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '23056' => {
                                       'BaseType' => '16041',
                                       'Name' => 'struct pldm_pdr_repository_chg_event_data*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '29466' => {
                                       'BaseType' => '14419',
                                       'Name' => 'struct pldm_numeric_sensor_value_pdr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '2990' => {
                                      'BaseType' => '443',
                                      'Name' => 'ver32_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '3504' => {
                                      'BaseType' => '455',
                                      'Name' => 'ver32_t const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '360' => {
                                     'Header' => 'pldm_types.h',
                                     'Line' => '19',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'byte',
                                                          'offset' => '0',
                                                          'type' => '182'
                                                        },
                                                 '1' => {
                                                          'name' => 'bits',
                                                          'offset' => '0',
                                                          'type' => '206'
                                                        }
                                               },
                                     'Name' => 'union bitfield8_t',
                                     'Size' => '1',
                                     'Type' => 'Union'
                                   },
                          '36033' => {
                                       'BaseType' => '15829',
                                       'Name' => 'struct pldm_sensor_event_data*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '36038' => {
                                       'BaseType' => '36033',
                                       'Name' => 'struct pldm_sensor_event_data*const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '37042' => {
                                       'BaseType' => '15148',
                                       'Name' => 'get_sensor_state_field*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '372' => {
                                     'BaseType' => '360',
                                     'Name' => 'bitfield8_t const',
                                     'Size' => '1',
                                     'Type' => 'Const'
                                   },
                          '377' => {
                                     'Header' => 'pldm_types.h',
                                     'Line' => '25',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'alpha',
                                                          'offset' => '0',
                                                          'type' => '182'
                                                        },
                                                 '1' => {
                                                          'name' => 'update',
                                                          'offset' => '1',
                                                          'type' => '182'
                                                        },
                                                 '2' => {
                                                          'name' => 'minor',
                                                          'offset' => '2',
                                                          'type' => '182'
                                                        },
                                                 '3' => {
                                                          'name' => 'major',
                                                          'offset' => '3',
                                                          'type' => '182'
                                                        }
                                               },
                                     'Name' => 'struct pldm_version',
                                     'Size' => '4',
                                     'Type' => 'Struct'
                                   },
                          '3867' => {
                                      'BaseType' => '360',
                                      'Name' => 'bitfield8_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4189' => {
                                      'BaseType' => '372',
                                      'Name' => 'bitfield8_t const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '42197' => {
                                       'BaseType' => '15070',
                                       'Name' => 'set_effecter_state_field*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '43024' => {
                                       'BaseType' => '13731',
                                       'Name' => 'struct pldm_state_sensor_pdr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '43029' => {
                                       'BaseType' => '43024',
                                       'Name' => 'struct pldm_state_sensor_pdr*const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '43034' => {
                                       'BaseType' => '13928',
                                       'Name' => 'struct state_sensor_possible_states const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '43039' => {
                                       'BaseType' => '43034',
                                       'Name' => 'struct state_sensor_possible_states const*const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '43356' => {
                                       'BaseType' => '13949',
                                       'Name' => 'struct pldm_state_effecter_pdr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '43361' => {
                                       'BaseType' => '43356',
                                       'Name' => 'struct pldm_state_effecter_pdr*const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '43366' => {
                                       'BaseType' => '15025',
                                       'Name' => 'struct state_effecter_possible_states const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '43371' => {
                                       'BaseType' => '43366',
                                       'Name' => 'struct state_effecter_possible_states const*const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '443' => {
                                     'BaseType' => '377',
                                     'Header' => 'pldm_types.h',
                                     'Line' => '30',
                                     'Name' => 'ver32_t',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '455' => {
                                     'BaseType' => '443',
                                     'Name' => 'ver32_t const',
                                     'Size' => '4',
                                     'Type' => 'Const'
                                   },
                          '46' => {
                                    'Name' => 'signed char',
                                    'Size' => '1',
                                    'Type' => 'Intrinsic'
                                  },
                          '460' => {
                                     'Name' => 'float',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '46885' => {
                                       'BaseType' => '102',
                                       'Header' => 'types.h',
                                       'Line' => '45',
                                       'Name' => '__uint64_t',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '46974' => {
                                       'BaseType' => '46885',
                                       'Header' => 'stdint-uintn.h',
                                       'Line' => '27',
                                       'Name' => 'uint64_t',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '46986' => {
                                       'Header' => 'bios.h',
                                       'Line' => '39',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'PLDM_BIOS_STRING_TABLE',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'PLDM_BIOS_ATTR_TABLE',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'PLDM_BIOS_ATTR_VAL_TABLE',
                                                            'value' => '2'
                                                          }
                                                 },
                                       'Name' => 'enum pldm_bios_table_types',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '47020' => {
                                       'Header' => 'bios.h',
                                       'Line' => '48',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'string_handle',
                                                            'offset' => '0',
                                                            'type' => '5303'
                                                          },
                                                   '1' => {
                                                            'name' => 'string_length',
                                                            'offset' => '2',
                                                            'type' => '5303'
                                                          },
                                                   '2' => {
                                                            'name' => 'name',
                                                            'offset' => '4',
                                                            'type' => '47077'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_string_table_entry',
                                       'Size' => '5',
                                       'Type' => 'Struct'
                                     },
                          '47072' => {
                                       'BaseType' => '47020',
                                       'Name' => 'struct pldm_bios_string_table_entry const',
                                       'Size' => '5',
                                       'Type' => 'Const'
                                     },
                          '47077' => {
                                       'BaseType' => '116',
                                       'Name' => 'char[1]',
                                       'Size' => '1',
                                       'Type' => 'Array'
                                     },
                          '47093' => {
                                       'Header' => 'bios.h',
                                       'Line' => '54',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'attr_handle',
                                                            'offset' => '0',
                                                            'type' => '5303'
                                                          },
                                                   '1' => {
                                                            'name' => 'attr_type',
                                                            'offset' => '2',
                                                            'type' => '182'
                                                          },
                                                   '2' => {
                                                            'name' => 'string_handle',
                                                            'offset' => '3',
                                                            'type' => '5303'
                                                          },
                                                   '3' => {
                                                            'name' => 'metadata',
                                                            'offset' => '5',
                                                            'type' => '899'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_attr_table_entry',
                                       'Size' => '6',
                                       'Type' => 'Struct'
                                     },
                          '47158' => {
                                       'BaseType' => '47093',
                                       'Name' => 'struct pldm_bios_attr_table_entry const',
                                       'Size' => '6',
                                       'Type' => 'Const'
                                     },
                          '47179' => {
                                       'Header' => 'bios.h',
                                       'Line' => '66',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'attr_handle',
                                                            'offset' => '0',
                                                            'type' => '5303'
                                                          },
                                                   '1' => {
                                                            'name' => 'attr_type',
                                                            'offset' => '2',
                                                            'type' => '182'
                                                          },
                                                   '2' => {
                                                            'name' => 'value',
                                                            'offset' => '3',
                                                            'type' => '899'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_attr_val_table_entry',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '47231' => {
                                       'BaseType' => '47179',
                                       'Name' => 'struct pldm_bios_attr_val_table_entry const',
                                       'Size' => '4',
                                       'Type' => 'Const'
                                     },
                          '47300' => {
                                       'Header' => 'bios_table.h',
                                       'Line' => '205',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'name_handle',
                                                            'offset' => '0',
                                                            'type' => '5303'
                                                          },
                                                   '1' => {
                                                            'name' => 'read_only',
                                                            'offset' => '2',
                                                            'type' => '1451'
                                                          },
                                                   '2' => {
                                                            'name' => 'pv_num',
                                                            'offset' => '3',
                                                            'type' => '182'
                                                          },
                                                   '3' => {
                                                            'name' => 'pv_handle',
                                                            'offset' => '8',
                                                            'type' => '47403'
                                                          },
                                                   '4' => {
                                                            'name' => 'def_num',
                                                            'offset' => '22',
                                                            'type' => '182'
                                                          },
                                                   '5' => {
                                                            'name' => 'def_index',
                                                            'offset' => '36',
                                                            'type' => '6521'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_table_attr_entry_enum_info',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '47391' => {
                                       'BaseType' => '47300',
                                       'Name' => 'struct pldm_bios_table_attr_entry_enum_info const',
                                       'Size' => '32',
                                       'Type' => 'Const'
                                     },
                          '47403' => {
                                       'BaseType' => '12101',
                                       'Name' => 'uint16_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '47413' => {
                                       'Header' => 'bios_table.h',
                                       'Line' => '293',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'name_handle',
                                                            'offset' => '0',
                                                            'type' => '5303'
                                                          },
                                                   '1' => {
                                                            'name' => 'read_only',
                                                            'offset' => '2',
                                                            'type' => '1451'
                                                          },
                                                   '2' => {
                                                            'name' => 'string_type',
                                                            'offset' => '3',
                                                            'type' => '182'
                                                          },
                                                   '3' => {
                                                            'name' => 'min_length',
                                                            'offset' => '4',
                                                            'type' => '5303'
                                                          },
                                                   '4' => {
                                                            'name' => 'max_length',
                                                            'offset' => '6',
                                                            'type' => '5303'
                                                          },
                                                   '5' => {
                                                            'name' => 'def_length',
                                                            'offset' => '8',
                                                            'type' => '5303'
                                                          },
                                                   '6' => {
                                                            'name' => 'def_string',
                                                            'offset' => '22',
                                                            'type' => '12854'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_table_attr_entry_string_info',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '47525' => {
                                       'BaseType' => '47413',
                                       'Name' => 'struct pldm_bios_table_attr_entry_string_info const',
                                       'Size' => '24',
                                       'Type' => 'Const'
                                     },
                          '47535' => {
                                       'Header' => 'bios_table.h',
                                       'Line' => '383',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'name_handle',
                                                            'offset' => '0',
                                                            'type' => '5303'
                                                          },
                                                   '1' => {
                                                            'name' => 'read_only',
                                                            'offset' => '2',
                                                            'type' => '1451'
                                                          },
                                                   '2' => {
                                                            'name' => 'lower_bound',
                                                            'offset' => '8',
                                                            'type' => '46974'
                                                          },
                                                   '3' => {
                                                            'name' => 'upper_bound',
                                                            'offset' => '22',
                                                            'type' => '46974'
                                                          },
                                                   '4' => {
                                                            'name' => 'scalar_increment',
                                                            'offset' => '36',
                                                            'type' => '194'
                                                          },
                                                   '5' => {
                                                            'name' => 'default_value',
                                                            'offset' => '50',
                                                            'type' => '46974'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_table_attr_entry_integer_info',
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '47633' => {
                                       'BaseType' => '47535',
                                       'Name' => 'struct pldm_bios_table_attr_entry_integer_info const',
                                       'Size' => '40',
                                       'Type' => 'Const'
                                     },
                          '48003' => {
                                       'Name' => 'ssize_t(*)(void const*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '1490'
                                                           }
                                                  },
                                       'Return' => '12859',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '48073' => {
                                       'Line' => '936',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'table_data',
                                                            'offset' => '0',
                                                            'type' => '6521'
                                                          },
                                                   '1' => {
                                                            'name' => 'table_len',
                                                            'offset' => '8',
                                                            'type' => '137'
                                                          },
                                                   '2' => {
                                                            'name' => 'current_pos',
                                                            'offset' => '22',
                                                            'type' => '137'
                                                          },
                                                   '3' => {
                                                            'name' => 'entry_length_handler',
                                                            'offset' => '36',
                                                            'type' => '48003'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_table_iter',
                                       'PrivateABI' => 1,
                                       'Size' => '32',
                                       'Source' => 'bios_table.c',
                                       'Type' => 'Struct'
                                     },
                          '48143' => {
                                       'BaseType' => '48073',
                                       'Name' => 'struct pldm_bios_table_iter const',
                                       'Size' => '32',
                                       'Type' => 'Const'
                                     },
                          '4897' => {
                                      'BaseType' => '851',
                                      'Name' => 'struct pldm_msg_hdr const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '49173' => {
                                       'BaseType' => '48073',
                                       'Name' => 'struct pldm_bios_table_iter*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '49178' => {
                                       'BaseType' => '47231',
                                       'Name' => 'struct pldm_bios_attr_val_table_entry const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '49593' => {
                                       'BaseType' => '47158',
                                       'Name' => 'struct pldm_bios_attr_table_entry const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '4962' => {
                                      'BaseType' => '915',
                                      'Name' => 'struct pldm_header_info*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '50199' => {
                                       'BaseType' => '47072',
                                       'Name' => 'struct pldm_bios_string_table_entry const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '5052' => {
                                      'BaseType' => '994',
                                      'Name' => 'struct pldm_header_info const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '5057' => {
                                      'BaseType' => '740',
                                      'Name' => 'struct pldm_msg_hdr*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '51366' => {
                                       'BaseType' => '48143',
                                       'Name' => 'struct pldm_bios_table_iter const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '5253' => {
                                      'BaseType' => '67',
                                      'Header' => 'types.h',
                                      'Line' => '40',
                                      'Name' => '__uint16_t',
                                      'PrivateABI' => 1,
                                      'Size' => '2',
                                      'Type' => 'Typedef'
                                    },
                          '5298' => {
                                      'BaseType' => '182',
                                      'Name' => 'uint8_t const',
                                      'Size' => '1',
                                      'Type' => 'Const'
                                    },
                          '53' => {
                                    'Name' => 'unsigned char',
                                    'Size' => '1',
                                    'Type' => 'Intrinsic'
                                  },
                          '5303' => {
                                      'BaseType' => '5253',
                                      'Header' => 'stdint-uintn.h',
                                      'Line' => '25',
                                      'Name' => 'uint16_t',
                                      'PrivateABI' => 1,
                                      'Size' => '2',
                                      'Type' => 'Typedef'
                                    },
                          '55072' => {
                                       'BaseType' => '46974',
                                       'Name' => 'uint64_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '55349' => {
                                       'BaseType' => '47633',
                                       'Name' => 'struct pldm_bios_table_attr_entry_integer_info const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '55658' => {
                                       'BaseType' => '12854',
                                       'Name' => 'char const**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '56684' => {
                                       'BaseType' => '47525',
                                       'Name' => 'struct pldm_bios_table_attr_entry_string_info const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '58038' => {
                                       'BaseType' => '47391',
                                       'Name' => 'struct pldm_bios_table_attr_entry_enum_info const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '60' => {
                                    'Name' => 'short',
                                    'Size' => '2',
                                    'Type' => 'Intrinsic'
                                  },
                          '60062' => {
                                       'Header' => 'pldm_types.h',
                                       'Line' => '36',
                                       'Name' => 'anon-struct-pldm_types.h-36',
                                       'Size' => '2',
                                       'Type' => 'Struct'
                                     },
                          '60324' => {
                                       'Header' => 'pldm_types.h',
                                       'Line' => '54',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'value',
                                                            'offset' => '0',
                                                            'type' => '5303'
                                                          },
                                                   '1' => {
                                                            'name' => 'bits',
                                                            'offset' => '0',
                                                            'type' => '60062'
                                                          }
                                                 },
                                       'Name' => 'union bitfield16_t',
                                       'Size' => '2',
                                       'Type' => 'Union'
                                     },
                          '60336' => {
                                       'Header' => 'pldm_types.h',
                                       'Line' => '58',
                                       'Name' => 'anon-struct-pldm_types.h-58',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '60822' => {
                                       'Header' => 'pldm_types.h',
                                       'Line' => '92',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'value',
                                                            'offset' => '0',
                                                            'type' => '194'
                                                          },
                                                   '1' => {
                                                            'name' => 'bits',
                                                            'offset' => '0',
                                                            'type' => '60336'
                                                          }
                                                 },
                                       'Name' => 'union bitfield32_t',
                                       'Size' => '4',
                                       'Type' => 'Union'
                                     },
                          '60834' => {
                                       'Header' => 'pldm_types.h',
                                       'Line' => '96',
                                       'Name' => 'anon-struct-pldm_types.h-96',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '61768' => {
                                       'Header' => 'pldm_types.h',
                                       'Line' => '162',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'value',
                                                            'offset' => '0',
                                                            'type' => '46974'
                                                          },
                                                   '1' => {
                                                            'name' => 'bits',
                                                            'offset' => '0',
                                                            'type' => '60834'
                                                          }
                                                 },
                                       'Name' => 'union bitfield64_t',
                                       'Size' => '8',
                                       'Type' => 'Union'
                                     },
                          '63331' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '330',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'uuid',
                                                            'offset' => '0',
                                                            'type' => '63435'
                                                          },
                                                   '1' => {
                                                            'name' => 'package_header_format_version',
                                                            'offset' => '22',
                                                            'type' => '182'
                                                          },
                                                   '2' => {
                                                            'name' => 'package_header_size',
                                                            'offset' => '23',
                                                            'type' => '5303'
                                                          },
                                                   '3' => {
                                                            'name' => 'package_release_date_time',
                                                            'offset' => '25',
                                                            'type' => '15347'
                                                          },
                                                   '4' => {
                                                            'name' => 'component_bitmap_bit_length',
                                                            'offset' => '50',
                                                            'type' => '5303'
                                                          },
                                                   '5' => {
                                                            'name' => 'package_version_string_type',
                                                            'offset' => '52',
                                                            'type' => '182'
                                                          },
                                                   '6' => {
                                                            'name' => 'package_version_string_length',
                                                            'offset' => '53',
                                                            'type' => '182'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_package_header_information',
                                       'Size' => '36',
                                       'Type' => 'Struct'
                                     },
                          '63435' => {
                                       'BaseType' => '182',
                                       'Name' => 'uint8_t[16]',
                                       'Size' => '16',
                                       'Type' => 'Array'
                                     },
                          '63467' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '344',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'record_length',
                                                            'offset' => '0',
                                                            'type' => '5303'
                                                          },
                                                   '1' => {
                                                            'name' => 'descriptor_count',
                                                            'offset' => '2',
                                                            'type' => '182'
                                                          },
                                                   '2' => {
                                                            'name' => 'device_update_option_flags',
                                                            'offset' => '3',
                                                            'type' => '60822'
                                                          },
                                                   '3' => {
                                                            'name' => 'comp_image_set_version_string_type',
                                                            'offset' => '7',
                                                            'type' => '182'
                                                          },
                                                   '4' => {
                                                            'name' => 'comp_image_set_version_string_length',
                                                            'offset' => '8',
                                                            'type' => '182'
                                                          },
                                                   '5' => {
                                                            'name' => 'fw_device_pkg_data_length',
                                                            'offset' => '9',
                                                            'type' => '5303'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_firmware_device_id_record',
                                       'Size' => '11',
                                       'Type' => 'Struct'
                                     },
                          '63662' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '378',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_classification',
                                                            'offset' => '0',
                                                            'type' => '5303'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_identifier',
                                                            'offset' => '2',
                                                            'type' => '5303'
                                                          },
                                                   '2' => {
                                                            'name' => 'comp_comparison_stamp',
                                                            'offset' => '4',
                                                            'type' => '194'
                                                          },
                                                   '3' => {
                                                            'name' => 'comp_options',
                                                            'offset' => '8',
                                                            'type' => '60324'
                                                          },
                                                   '4' => {
                                                            'name' => 'requested_comp_activation_method',
                                                            'offset' => '16',
                                                            'type' => '60324'
                                                          },
                                                   '5' => {
                                                            'name' => 'comp_location_offset',
                                                            'offset' => '18',
                                                            'type' => '194'
                                                          },
                                                   '6' => {
                                                            'name' => 'comp_size',
                                                            'offset' => '22',
                                                            'type' => '194'
                                                          },
                                                   '7' => {
                                                            'name' => 'comp_version_string_type',
                                                            'offset' => '32',
                                                            'type' => '182'
                                                          },
                                                   '8' => {
                                                            'name' => 'comp_version_string_length',
                                                            'offset' => '33',
                                                            'type' => '182'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_component_image_information',
                                       'Size' => '22',
                                       'Type' => 'Struct'
                                     },
                          '63844' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '404',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'completion_code',
                                                            'offset' => '0',
                                                            'type' => '182'
                                                          },
                                                   '1' => {
                                                            'name' => 'capabilities_during_update',
                                                            'offset' => '1',
                                                            'type' => '60822'
                                                          },
                                                   '2' => {
                                                            'name' => 'comp_count',
                                                            'offset' => '5',
                                                            'type' => '5303'
                                                          },
                                                   '3' => {
                                                            'name' => 'active_comp_image_set_ver_str_type',
                                                            'offset' => '7',
                                                            'type' => '182'
                                                          },
                                                   '4' => {
                                                            'name' => 'active_comp_image_set_ver_str_len',
                                                            'offset' => '8',
                                                            'type' => '182'
                                                          },
                                                   '5' => {
                                                            'name' => 'pending_comp_image_set_ver_str_type',
                                                            'offset' => '9',
                                                            'type' => '182'
                                                          },
                                                   '6' => {
                                                            'name' => 'pending_comp_image_set_ver_str_len',
                                                            'offset' => '16',
                                                            'type' => '182'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_get_firmware_parameters_resp',
                                       'Size' => '11',
                                       'Type' => 'Struct'
                                     },
                          '63948' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '418',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_classification',
                                                            'offset' => '0',
                                                            'type' => '5303'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_identifier',
                                                            'offset' => '2',
                                                            'type' => '5303'
                                                          },
                                                   '10' => {
                                                             'name' => 'pending_comp_release_date',
                                                             'offset' => '37',
                                                             'type' => '64130'
                                                           },
                                                   '11' => {
                                                             'name' => 'comp_activation_methods',
                                                             'offset' => '51',
                                                             'type' => '60324'
                                                           },
                                                   '12' => {
                                                             'name' => 'capabilities_during_update',
                                                             'offset' => '53',
                                                             'type' => '60822'
                                                           },
                                                   '2' => {
                                                            'name' => 'comp_classification_index',
                                                            'offset' => '4',
                                                            'type' => '182'
                                                          },
                                                   '3' => {
                                                            'name' => 'active_comp_comparison_stamp',
                                                            'offset' => '5',
                                                            'type' => '194'
                                                          },
                                                   '4' => {
                                                            'name' => 'active_comp_ver_str_type',
                                                            'offset' => '9',
                                                            'type' => '182'
                                                          },
                                                   '5' => {
                                                            'name' => 'active_comp_ver_str_len',
                                                            'offset' => '16',
                                                            'type' => '182'
                                                          },
                                                   '6' => {
                                                            'name' => 'active_comp_release_date',
                                                            'offset' => '17',
                                                            'type' => '64130'
                                                          },
                                                   '7' => {
                                                            'name' => 'pending_comp_comparison_stamp',
                                                            'offset' => '25',
                                                            'type' => '194'
                                                          },
                                                   '8' => {
                                                            'name' => 'pending_comp_ver_str_type',
                                                            'offset' => '35',
                                                            'type' => '182'
                                                          },
                                                   '9' => {
                                                            'name' => 'pending_comp_ver_str_len',
                                                            'offset' => '36',
                                                            'type' => '182'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_component_parameter_entry',
                                       'Size' => '39',
                                       'Type' => 'Struct'
                                     },
                          '64130' => {
                                       'BaseType' => '182',
                                       'Name' => 'uint8_t[8]',
                                       'Size' => '8',
                                       'Type' => 'Array'
                                     },
                          '6482' => {
                                      'Header' => 'utils.h',
                                      'Line' => '19',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ptr',
                                                           'offset' => '0',
                                                           'type' => '6521'
                                                         },
                                                  '1' => {
                                                           'name' => 'length',
                                                           'offset' => '8',
                                                           'type' => '137'
                                                         }
                                                },
                                      'Name' => 'struct variable_field',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '64990' => {
                                       'BaseType' => '6482',
                                       'Name' => 'struct variable_field const',
                                       'Size' => '16',
                                       'Type' => 'Const'
                                     },
                          '6521' => {
                                      'BaseType' => '5298',
                                      'Name' => 'uint8_t const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '65338' => {
                                       'BaseType' => '12289',
                                       'Name' => 'bool8_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '65343' => {
                                       'BaseType' => '61768',
                                       'Name' => 'bitfield64_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '66096' => {
                                       'BaseType' => '60822',
                                       'Name' => 'bitfield32_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '66943' => {
                                       'BaseType' => '60324',
                                       'Name' => 'bitfield16_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '67' => {
                                    'Name' => 'unsigned short',
                                    'Size' => '2',
                                    'Type' => 'Intrinsic'
                                  },
                          '68418' => {
                                       'BaseType' => '64990',
                                       'Name' => 'struct variable_field const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '6921' => {
                                      'BaseType' => '6482',
                                      'Name' => 'struct variable_field*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '69720' => {
                                       'BaseType' => '63948',
                                       'Name' => 'struct pldm_component_parameter_entry*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '69950' => {
                                       'BaseType' => '63844',
                                       'Name' => 'struct pldm_get_firmware_parameters_resp*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '70251' => {
                                       'BaseType' => '2138',
                                       'Name' => 'uint8_t**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '70548' => {
                                       'BaseType' => '63662',
                                       'Name' => 'struct pldm_component_image_information*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '71164' => {
                                       'BaseType' => '63467',
                                       'Name' => 'struct pldm_firmware_device_id_record*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '71316' => {
                                       'BaseType' => '63331',
                                       'Name' => 'struct pldm_package_header_information*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '728' => {
                                     'Header' => 'base.h',
                                     'Line' => '92',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'PLDM_RESPONSE',
                                                          'value' => '0'
                                                        },
                                                 '1' => {
                                                          'name' => 'PLDM_REQUEST',
                                                          'value' => '1'
                                                        },
                                                 '2' => {
                                                          'name' => 'PLDM_RESERVED',
                                                          'value' => '2'
                                                        },
                                                 '3' => {
                                                          'name' => 'PLDM_ASYNC_REQUEST_NOTIFY',
                                                          'value' => '3'
                                                        }
                                               },
                                     'Name' => 'enum MessageType',
                                     'Size' => '4',
                                     'Type' => 'Enum'
                                   },
                          '74' => {
                                    'Name' => 'int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  },
                          '740' => {
                                     'Header' => 'base.h',
                                     'Line' => '121',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'command',
                                                          'offset' => '2',
                                                          'type' => '182'
                                                        }
                                               },
                                     'Name' => 'struct pldm_msg_hdr',
                                     'Size' => '3',
                                     'Type' => 'Struct'
                                   },
                          '77590' => {
                                       'BaseType' => '77607',
                                       'Header' => 'pdr.h',
                                       'Line' => '16',
                                       'Name' => 'pldm_pdr',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '77602' => {
                                       'BaseType' => '77590',
                                       'Name' => 'pldm_pdr const',
                                       'Size' => '24',
                                       'Type' => 'Const'
                                     },
                          '77607' => {
                                       'Line' => '19',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'record_count',
                                                            'offset' => '0',
                                                            'type' => '194'
                                                          },
                                                   '1' => {
                                                            'name' => 'size',
                                                            'offset' => '4',
                                                            'type' => '194'
                                                          },
                                                   '2' => {
                                                            'name' => 'first',
                                                            'offset' => '8',
                                                            'type' => '78718'
                                                          },
                                                   '3' => {
                                                            'name' => 'last',
                                                            'offset' => '22',
                                                            'type' => '78718'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_pdr',
                                       'PrivateABI' => 1,
                                       'Size' => '24',
                                       'Source' => 'pdr.c',
                                       'Type' => 'Struct'
                                     },
                          '77667' => {
                                       'BaseType' => '77684',
                                       'Header' => 'pdr.h',
                                       'Line' => '21',
                                       'Name' => 'pldm_pdr_record',
                                       'Size' => '32',
                                       'Type' => 'Typedef'
                                     },
                          '77679' => {
                                       'BaseType' => '77667',
                                       'Name' => 'pldm_pdr_record const',
                                       'Size' => '32',
                                       'Type' => 'Const'
                                     },
                          '77684' => {
                                       'Line' => '10',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'record_handle',
                                                            'offset' => '0',
                                                            'type' => '194'
                                                          },
                                                   '1' => {
                                                            'name' => 'size',
                                                            'offset' => '4',
                                                            'type' => '194'
                                                          },
                                                   '2' => {
                                                            'name' => 'data',
                                                            'offset' => '8',
                                                            'type' => '2138'
                                                          },
                                                   '3' => {
                                                            'name' => 'next',
                                                            'offset' => '22',
                                                            'type' => '78706'
                                                          },
                                                   '4' => {
                                                            'name' => 'is_remote',
                                                            'offset' => '36',
                                                            'type' => '1451'
                                                          },
                                                   '5' => {
                                                            'name' => 'terminus_handle',
                                                            'offset' => '38',
                                                            'type' => '5303'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_pdr_record',
                                       'PrivateABI' => 1,
                                       'Size' => '32',
                                       'Source' => 'pdr.c',
                                       'Type' => 'Struct'
                                     },
                          '77768' => {
                                       'Header' => 'pdr.h',
                                       'Line' => '275',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'entity_type',
                                                            'offset' => '0',
                                                            'type' => '5303'
                                                          },
                                                   '1' => {
                                                            'name' => 'entity_instance_num',
                                                            'offset' => '2',
                                                            'type' => '5303'
                                                          },
                                                   '2' => {
                                                            'name' => 'entity_container_id',
                                                            'offset' => '4',
                                                            'type' => '5303'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_entity',
                                       'Size' => '6',
                                       'Type' => 'Struct'
                                     },
                          '77825' => {
                                       'BaseType' => '77768',
                                       'Header' => 'pdr.h',
                                       'Line' => '279',
                                       'Name' => 'pldm_entity',
                                       'Size' => '6',
                                       'Type' => 'Typedef'
                                     },
                          '77869' => {
                                       'BaseType' => '77881',
                                       'Header' => 'pdr.h',
                                       'Line' => '289',
                                       'Name' => 'pldm_entity_association_tree',
                                       'Size' => '16',
                                       'Type' => 'Typedef'
                                     },
                          '77881' => {
                                       'Line' => '434',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'root',
                                                            'offset' => '0',
                                                            'type' => '78723'
                                                          },
                                                   '1' => {
                                                            'name' => 'last_used_container_id',
                                                            'offset' => '8',
                                                            'type' => '5303'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_entity_association_tree',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Source' => 'pdr.c',
                                       'Type' => 'Struct'
                                     },
                          '77924' => {
                                       'BaseType' => '77941',
                                       'Header' => 'pdr.h',
                                       'Line' => '294',
                                       'Name' => 'pldm_entity_node',
                                       'Size' => '40',
                                       'Type' => 'Typedef'
                                     },
                          '77936' => {
                                       'BaseType' => '77924',
                                       'Name' => 'pldm_entity_node const',
                                       'Size' => '40',
                                       'Type' => 'Const'
                                     },
                          '77941' => {
                                       'Line' => '439',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'entity',
                                                            'offset' => '0',
                                                            'type' => '77825'
                                                          },
                                                   '1' => {
                                                            'name' => 'parent',
                                                            'offset' => '6',
                                                            'type' => '77825'
                                                          },
                                                   '2' => {
                                                            'name' => 'remote_container_id',
                                                            'offset' => '18',
                                                            'type' => '5303'
                                                          },
                                                   '3' => {
                                                            'name' => 'first_child',
                                                            'offset' => '22',
                                                            'type' => '78723'
                                                          },
                                                   '4' => {
                                                            'name' => 'next_sibling',
                                                            'offset' => '36',
                                                            'type' => '78723'
                                                          },
                                                   '5' => {
                                                            'name' => 'association_type',
                                                            'offset' => '50',
                                                            'type' => '182'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_entity_node',
                                       'PrivateABI' => 1,
                                       'Size' => '40',
                                       'Source' => 'pdr.c',
                                       'Type' => 'Struct'
                                     },
                          '78706' => {
                                       'BaseType' => '77684',
                                       'Name' => 'struct pldm_pdr_record*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '78718' => {
                                       'BaseType' => '77667',
                                       'Name' => 'pldm_pdr_record*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '78723' => {
                                       'BaseType' => '77924',
                                       'Name' => 'pldm_entity_node*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '79148' => {
                                       'BaseType' => '79153',
                                       'Name' => 'pldm_entity**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '79153' => {
                                       'BaseType' => '77825',
                                       'Name' => 'pldm_entity*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '79217' => {
                                       'BaseType' => '77869',
                                       'Name' => 'pldm_entity_association_tree*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '79496' => {
                                       'BaseType' => '78723',
                                       'Name' => 'pldm_entity_node**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '80286' => {
                                       'BaseType' => '77602',
                                       'Name' => 'pldm_pdr const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '80540' => {
                                       'BaseType' => '77590',
                                       'Name' => 'pldm_pdr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '81' => {
                                    'Name' => 'unsigned int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  },
                          '851' => {
                                     'BaseType' => '740',
                                     'Name' => 'struct pldm_msg_hdr const',
                                     'Size' => '3',
                                     'Type' => 'Const'
                                   },
                          '856' => {
                                     'Header' => 'base.h',
                                     'Line' => '154',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'hdr',
                                                          'offset' => '0',
                                                          'type' => '740'
                                                        },
                                                 '1' => {
                                                          'name' => 'payload',
                                                          'offset' => '3',
                                                          'type' => '899'
                                                        }
                                               },
                                     'Name' => 'struct pldm_msg',
                                     'Size' => '4',
                                     'Type' => 'Struct'
                                   },
                          '85645' => {
                                       'BaseType' => '77936',
                                       'Name' => 'pldm_entity_node const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '86811' => {
                                       'BaseType' => '77679',
                                       'Name' => 'pldm_pdr_record const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '8797' => {
                                      'BaseType' => '5303',
                                      'Name' => 'uint16_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '894' => {
                                     'BaseType' => '856',
                                     'Name' => 'struct pldm_msg const',
                                     'Size' => '4',
                                     'Type' => 'Const'
                                   },
                          '89765' => {
                                       'BaseType' => '182',
                                       'Header' => 'base.h',
                                       'Line' => '16',
                                       'Name' => 'pldm_tid_t',
                                       'Size' => '1',
                                       'Type' => 'Typedef'
                                     },
                          '89777' => {
                                       'BaseType' => '182',
                                       'Header' => 'instance-id.h',
                                       'Line' => '12',
                                       'Name' => 'pldm_instance_id_t',
                                       'Size' => '1',
                                       'Type' => 'Typedef'
                                     },
                          '89789' => {
                                       'Header' => 'responder.h',
                                       'Line' => '10',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tid',
                                                            'offset' => '0',
                                                            'type' => '89765'
                                                          },
                                                   '1' => {
                                                            'name' => 'instance_id',
                                                            'offset' => '1',
                                                            'type' => '89777'
                                                          },
                                                   '2' => {
                                                            'name' => 'type',
                                                            'offset' => '2',
                                                            'type' => '182'
                                                          },
                                                   '3' => {
                                                            'name' => 'command',
                                                            'offset' => '3',
                                                            'type' => '182'
                                                          },
                                                   '4' => {
                                                            'name' => 'next',
                                                            'offset' => '8',
                                                            'type' => '89869'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_responder_cookie',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '89869' => {
                                       'BaseType' => '89789',
                                       'Name' => 'struct pldm_responder_cookie*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '89874' => {
                                       'Header' => 'pldm.h',
                                       'Line' => '15',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'PLDM_REQUESTER_SUCCESS',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'PLDM_REQUESTER_OPEN_FAIL',
                                                            'value' => '18446744073709551615 (-1)'
                                                          },
                                                   '10' => {
                                                             'name' => 'PLDM_REQUESTER_SETUP_FAIL',
                                                             'value' => '18446744073709551606 (-10)'
                                                           },
                                                   '11' => {
                                                             'name' => 'PLDM_REQUESTER_INVALID_SETUP',
                                                             'value' => '18446744073709551605 (-11)'
                                                           },
                                                   '12' => {
                                                             'name' => 'PLDM_REQUESTER_POLL_FAIL',
                                                             'value' => '18446744073709551604 (-12)'
                                                           },
                                                   '13' => {
                                                             'name' => 'PLDM_REQUESTER_TRANSPORT_BUSY',
                                                             'value' => '18446744073709551603 (-13)'
                                                           },
                                                   '2' => {
                                                            'name' => 'PLDM_REQUESTER_NOT_PLDM_MSG',
                                                            'value' => '18446744073709551614 (-2)'
                                                          },
                                                   '3' => {
                                                            'name' => 'PLDM_REQUESTER_NOT_RESP_MSG',
                                                            'value' => '18446744073709551613 (-3)'
                                                          },
                                                   '4' => {
                                                            'name' => 'PLDM_REQUESTER_NOT_REQ_MSG',
                                                            'value' => '18446744073709551612 (-4)'
                                                          },
                                                   '5' => {
                                                            'name' => 'PLDM_REQUESTER_RESP_MSG_TOO_SMALL',
                                                            'value' => '18446744073709551611 (-5)'
                                                          },
                                                   '6' => {
                                                            'name' => 'PLDM_REQUESTER_INSTANCE_ID_MISMATCH',
                                                            'value' => '18446744073709551610 (-6)'
                                                          },
                                                   '7' => {
                                                            'name' => 'PLDM_REQUESTER_SEND_FAIL',
                                                            'value' => '18446744073709551609 (-7)'
                                                          },
                                                   '8' => {
                                                            'name' => 'PLDM_REQUESTER_RECV_FAIL',
                                                            'value' => '18446744073709551608 (-8)'
                                                          },
                                                   '9' => {
                                                            'name' => 'PLDM_REQUESTER_INVALID_RECV_LEN',
                                                            'value' => '18446744073709551607 (-9)'
                                                          }
                                                 },
                                       'Name' => 'enum pldm_requester_error_codes',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '899' => {
                                     'BaseType' => '182',
                                     'Name' => 'uint8_t[1]',
                                     'Size' => '1',
                                     'Type' => 'Array'
                                   },
                          '915' => {
                                     'Header' => 'base.h',
                                     'Line' => '180',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'msg_type',
                                                          'offset' => '0',
                                                          'type' => '728'
                                                        },
                                                 '1' => {
                                                          'name' => 'instance',
                                                          'offset' => '4',
                                                          'type' => '182'
                                                        },
                                                 '2' => {
                                                          'name' => 'pldm_type',
                                                          'offset' => '5',
                                                          'type' => '182'
                                                        },
                                                 '3' => {
                                                          'name' => 'command',
                                                          'offset' => '6',
                                                          'type' => '182'
                                                        },
                                                 '4' => {
                                                          'name' => 'completion_code',
                                                          'offset' => '7',
                                                          'type' => '182'
                                                        }
                                               },
                                     'Name' => 'struct pldm_header_info',
                                     'Size' => '8',
                                     'Type' => 'Struct'
                                   },
                          '92782' => {
                                       'Line' => '19',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'prev',
                                                            'offset' => '0',
                                                            'type' => '89777'
                                                          },
                                                   '1' => {
                                                            'name' => 'allocations',
                                                            'offset' => '4',
                                                            'type' => '194'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_tid_state',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Source' => 'instance-id.c',
                                       'Type' => 'Struct'
                                     },
                          '92821' => {
                                       'Line' => '24',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'state',
                                                            'offset' => '0',
                                                            'type' => '92863'
                                                          },
                                                   '1' => {
                                                            'name' => 'lock_db_fd',
                                                            'offset' => '8264',
                                                            'type' => '74'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_instance_db',
                                       'PrivateABI' => 1,
                                       'Size' => '2052',
                                       'Source' => 'instance-id.c',
                                       'Type' => 'Struct'
                                     },
                          '92863' => {
                                       'BaseType' => '92782',
                                       'Name' => 'struct pldm_tid_state[256]',
                                       'Size' => '2048',
                                       'Type' => 'Array'
                                     },
                          '93291' => {
                                       'BaseType' => '92821',
                                       'Name' => 'struct pldm_instance_db*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '9360' => {
                                      'BaseType' => '137',
                                      'Name' => 'size_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '93717' => {
                                       'BaseType' => '89777',
                                       'Name' => 'pldm_instance_id_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '93893' => {
                                       'BaseType' => '93291',
                                       'Name' => 'struct pldm_instance_db**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '94409' => {
                                       'BaseType' => '182',
                                       'Header' => 'pldm.h',
                                       'Line' => '13',
                                       'Name' => 'mctp_eid_t',
                                       'Size' => '1',
                                       'Type' => 'Typedef'
                                     },
                          '94524' => {
                                       'BaseType' => '89874',
                                       'Header' => 'pldm.h',
                                       'Line' => '30',
                                       'Name' => 'pldm_requester_rc_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '94681' => {
                                       'Line' => '24',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'transport',
                                                            'offset' => '0',
                                                            'type' => '94754'
                                                          },
                                                   '1' => {
                                                            'name' => 'socket',
                                                            'offset' => '64',
                                                            'type' => '74'
                                                          },
                                                   '2' => {
                                                            'name' => 'tid_eid_map',
                                                            'offset' => '68',
                                                            'type' => '98386'
                                                          },
                                                   '3' => {
                                                            'name' => 'socket_send_buf',
                                                            'offset' => '768',
                                                            'type' => '97461'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_transport_mctp_demux',
                                       'PrivateABI' => 1,
                                       'Size' => '312',
                                       'Source' => 'mctp-demux.c',
                                       'Type' => 'Struct'
                                     },
                          '94707' => {
                                       'BaseType' => '94681',
                                       'Name' => 'struct pldm_transport_mctp_demux*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '94749' => {
                                       'BaseType' => '94754',
                                       'Name' => 'struct pldm_transport*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '94754' => {
                                       'Header' => 'transport.h',
                                       'Line' => '18',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'name',
                                                            'offset' => '0',
                                                            'type' => '12854'
                                                          },
                                                   '1' => {
                                                            'name' => 'version',
                                                            'offset' => '8',
                                                            'type' => '182'
                                                          },
                                                   '2' => {
                                                            'name' => 'recv',
                                                            'offset' => '22',
                                                            'type' => '97646'
                                                          },
                                                   '3' => {
                                                            'name' => 'send',
                                                            'offset' => '36',
                                                            'type' => '97687'
                                                          },
                                                   '4' => {
                                                            'name' => 'init_pollfd',
                                                            'offset' => '50',
                                                            'type' => '97767'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_transport',
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '94890' => {
                                       'BaseType' => '89765',
                                       'Name' => 'pldm_tid_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '94993' => {
                                       'BaseType' => '94707',
                                       'Name' => 'struct pldm_transport_mctp_demux**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '96932' => {
                                       'BaseType' => '53',
                                       'Header' => 'int-ll64.h',
                                       'Line' => '21',
                                       'Name' => '__u8',
                                       'PrivateABI' => 1,
                                       'Size' => '1',
                                       'Type' => 'Typedef'
                                     },
                          '96958' => {
                                       'BaseType' => '67',
                                       'Header' => 'int-ll64.h',
                                       'Line' => '24',
                                       'Name' => '__u16',
                                       'PrivateABI' => 1,
                                       'Size' => '2',
                                       'Type' => 'Typedef'
                                     },
                          '97461' => {
                                       'Header' => 'socket.h',
                                       'Line' => '5',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'size',
                                                            'offset' => '0',
                                                            'type' => '74'
                                                          },
                                                   '1' => {
                                                            'name' => 'socket',
                                                            'offset' => '4',
                                                            'type' => '74'
                                                          },
                                                   '2' => {
                                                            'name' => 'max_size',
                                                            'offset' => '8',
                                                            'type' => '74'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_socket_sndbuf',
                                       'PrivateABI' => 1,
                                       'Size' => '12',
                                       'Type' => 'Struct'
                                     },
                          '97646' => {
                                       'Name' => 'pldm_requester_rc_t(*)(struct pldm_transport*, pldm_tid_t*, void**, size_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '94749'
                                                           },
                                                    '1' => {
                                                             'type' => '94890'
                                                           },
                                                    '2' => {
                                                             'type' => '17266'
                                                           },
                                                    '3' => {
                                                             'type' => '9360'
                                                           }
                                                  },
                                       'Return' => '94524',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '97687' => {
                                       'Name' => 'pldm_requester_rc_t(*)(struct pldm_transport*, pldm_tid_t, void const*, size_t)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '94749'
                                                           },
                                                    '1' => {
                                                             'type' => '89765'
                                                           },
                                                    '2' => {
                                                             'type' => '1490'
                                                           },
                                                    '3' => {
                                                             'type' => '137'
                                                           }
                                                  },
                                       'Return' => '94524',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '97712' => {
                                       'BaseType' => '97717',
                                       'Name' => 'struct pollfd*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '97717' => {
                                       'Header' => 'poll.h',
                                       'Line' => '36',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'fd',
                                                            'offset' => '0',
                                                            'type' => '74'
                                                          },
                                                   '1' => {
                                                            'name' => 'events',
                                                            'offset' => '4',
                                                            'type' => '60'
                                                          },
                                                   '2' => {
                                                            'name' => 'revents',
                                                            'offset' => '6',
                                                            'type' => '60'
                                                          }
                                                 },
                                       'Name' => 'struct pollfd',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '97767' => {
                                       'Name' => 'int(*)(struct pldm_transport*, struct pollfd*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '94749'
                                                           },
                                                    '1' => {
                                                             'type' => '97712'
                                                           }
                                                  },
                                       'Return' => '74',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '97772' => {
                                       'BaseType' => '67',
                                       'Header' => 'socket.h',
                                       'Line' => '10',
                                       'Name' => '__kernel_sa_family_t',
                                       'PrivateABI' => 1,
                                       'Size' => '2',
                                       'Type' => 'Typedef'
                                     },
                          '98120' => {
                                       'Header' => 'mctp.h',
                                       'Line' => '18',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 's_addr',
                                                            'offset' => '0',
                                                            'type' => '94409'
                                                          }
                                                 },
                                       'Name' => 'struct mctp_addr',
                                       'PrivateABI' => 1,
                                       'Size' => '1',
                                       'Type' => 'Struct'
                                     },
                          '98146' => {
                                       'Header' => 'mctp.h',
                                       'Line' => '22',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'smctp_family',
                                                            'offset' => '0',
                                                            'type' => '97772'
                                                          },
                                                   '1' => {
                                                            'name' => '__smctp_pad0',
                                                            'offset' => '2',
                                                            'type' => '96958'
                                                          },
                                                   '2' => {
                                                            'name' => 'smctp_network',
                                                            'offset' => '4',
                                                            'type' => '81'
                                                          },
                                                   '3' => {
                                                            'name' => 'smctp_addr',
                                                            'offset' => '8',
                                                            'type' => '98120'
                                                          },
                                                   '4' => {
                                                            'name' => 'smctp_type',
                                                            'offset' => '9',
                                                            'type' => '96932'
                                                          },
                                                   '5' => {
                                                            'name' => 'smctp_tag',
                                                            'offset' => '16',
                                                            'type' => '96932'
                                                          },
                                                   '6' => {
                                                            'name' => '__smctp_pad1',
                                                            'offset' => '17',
                                                            'type' => '96932'
                                                          }
                                                 },
                                       'Name' => 'struct sockaddr_mctp',
                                       'PrivateABI' => 1,
                                       'Size' => '12',
                                       'Type' => 'Struct'
                                     },
                          '98250' => {
                                       'BaseType' => '98146',
                                       'Name' => 'struct sockaddr_mctp const',
                                       'Size' => '12',
                                       'Type' => 'Const'
                                     },
                          '98293' => {
                                       'Line' => '33',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'transport',
                                                            'offset' => '0',
                                                            'type' => '94754'
                                                          },
                                                   '1' => {
                                                            'name' => 'socket',
                                                            'offset' => '64',
                                                            'type' => '74'
                                                          },
                                                   '2' => {
                                                            'name' => 'tid_eid_map',
                                                            'offset' => '68',
                                                            'type' => '98386'
                                                          },
                                                   '3' => {
                                                            'name' => 'socket_send_buf',
                                                            'offset' => '768',
                                                            'type' => '97461'
                                                          },
                                                   '4' => {
                                                            'name' => 'bound',
                                                            'offset' => '786',
                                                            'type' => '1451'
                                                          },
                                                   '5' => {
                                                            'name' => 'cookie_jar',
                                                            'offset' => '800',
                                                            'type' => '89789'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_transport_af_mctp',
                                       'PrivateABI' => 1,
                                       'Size' => '336',
                                       'Source' => 'af-mctp.c',
                                       'Type' => 'Struct'
                                     },
                          '98386' => {
                                       'BaseType' => '89765',
                                       'Name' => 'pldm_tid_t[256]',
                                       'Size' => '256',
                                       'Type' => 'Array'
                                     },
                          '99008' => {
                                       'BaseType' => '98293',
                                       'Name' => 'struct pldm_transport_af_mctp*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '99013' => {
                                       'BaseType' => '98250',
                                       'Name' => 'struct sockaddr_mctp const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '99327' => {
                                       'BaseType' => '99008',
                                       'Name' => 'struct pldm_transport_af_mctp**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '994' => {
                                     'BaseType' => '915',
                                     'Name' => 'struct pldm_header_info const',
                                     'Size' => '8',
                                     'Type' => 'Const'
                                   }
                        },
          'UndefinedSymbols' => {
                                  'libpldm.so.0.7.0' => {
                                                          '_ITM_deregisterTMCloneTable' => 0,
                                                          '_ITM_registerTMCloneTable' => 0,
                                                          '__assert_fail@GLIBC_2.2.5' => 0,
                                                          '__cxa_finalize@GLIBC_2.2.5' => 0,
                                                          '__errno_location@GLIBC_2.2.5' => 0,
                                                          '__gmon_start__' => 0,
                                                          '__stack_chk_fail@GLIBC_2.4' => 0,
                                                          'bind@GLIBC_2.2.5' => 0,
                                                          'calloc@GLIBC_2.2.5' => 0,
                                                          'clock_gettime@GLIBC_2.17' => 0,
                                                          'close@GLIBC_2.2.5' => 0,
                                                          'connect@GLIBC_2.2.5' => 0,
                                                          'dup@GLIBC_2.2.5' => 0,
                                                          'fclose@GLIBC_2.2.5' => 0,
                                                          'fcntl64@GLIBC_2.28' => 0,
                                                          'fgets@GLIBC_2.2.5' => 0,
                                                          'fopen64@GLIBC_2.2.5' => 0,
                                                          'free@GLIBC_2.2.5' => 0,
                                                          'getsockopt@GLIBC_2.2.5' => 0,
                                                          'malloc@GLIBC_2.2.5' => 0,
                                                          'memcmp@GLIBC_2.2.5' => 0,
                                                          'memcpy@GLIBC_2.14' => 0,
                                                          'open64@GLIBC_2.2.5' => 0,
                                                          'poll@GLIBC_2.2.5' => 0,
                                                          'ppoll@GLIBC_2.4' => 0,
                                                          'recv@GLIBC_2.2.5' => 0,
                                                          'recvfrom@GLIBC_2.2.5' => 0,
                                                          'recvmsg@GLIBC_2.2.5' => 0,
                                                          'sendmsg@GLIBC_2.2.5' => 0,
                                                          'sendto@GLIBC_2.2.5' => 0,
                                                          'setsockopt@GLIBC_2.2.5' => 0,
                                                          'socket@GLIBC_2.2.5' => 0,
                                                          'stat64@GLIBC_2.33' => 0,
                                                          'strlen@GLIBC_2.2.5' => 0,
                                                          'strtol@GLIBC_2.2.5' => 0,
                                                          'timerfd_create@GLIBC_2.8' => 0,
                                                          'timerfd_settime@GLIBC_2.8' => 0,
                                                          'write@GLIBC_2.2.5' => 0
                                                        }
                                },
          'WordSize' => '8'
        };
