$VAR1 = {
  'ABI_DUMPER_VERSION' => '1.2',
  'ABI_DUMP_VERSION' => '3.5',
  'Arch' => 'x86_64',
  'GccVersion' => '13.2.0',
  'Headers' => {
    'af-mctp.h' => 1,
    'base.h' => 1,
    'bios.h' => 1,
    'bios_table.h' => 1,
    'file_io.h' => 1,
    'firmware_update.h' => 1,
    'fru.h' => 1,
    'host.h' => 1,
    'instance-id.h' => 1,
    'mctp-demux.h' => 1,
    'pdr.h' => 1,
    'platform.h' => 1,
    'pldm.h' => 1,
    'pldm_types.h' => 1,
    'transport.h' => 1,
    'utils.h' => 1
  },
  'Language' => 'C',
  'LibraryName' => 'libpldm.so.0.9.1',
  'LibraryVersion' => '0.9.1',
  'NameSpaces' => {},
  'Needed' => {
    'libc.so.6' => 1
  },
  'PublicABI' => '1',
  'Sources' => {
    'af-mctp.c' => 1,
    'bios_table.c' => 1,
    'instance-id.c' => 1,
    'mctp-demux.c' => 1,
    'pdr.c' => 1
  },
  'SymbolInfo' => {
    '1303' => {
      'Header' => 'utils.h',
      'Line' => '108',
      'Param' => {
        '0' => {
          'name' => 'transfer_flag',
          'type' => '121'
        }
      },
      'Return' => '805',
      'ShortName' => 'is_transfer_flag_valid'
    },
    '1363' => {
      'Header' => 'utils.h',
      'Line' => '99',
      'Param' => {
        '0' => {
          'name' => 'seconds',
          'type' => '121'
        },
        '1' => {
          'name' => 'minutes',
          'type' => '121'
        },
        '2' => {
          'name' => 'hours',
          'type' => '121'
        },
        '3' => {
          'name' => 'day',

      'pldm_entity_association_pdr_add_from_node' => 1,
      'pldm_entity_association_pdr_add_from_node_with_record_handle' => 1,
      'pldm_entity_association_pdr_extract' => 1,
      'pldm_entity_association_tree_add' => 1,
      'pldm_entity_association_tree_add_entity' => 1,
      'pldm_entity_association_tree_copy_root' => 1,
      'pldm_entity_association_tree_destroy' => 1,
      'pldm_entity_association_tree_destroy_root' => 1,
      'pldm_entity_association_tree_find' => 1,
      'pldm_entity_association_tree_find_with_locality' => 1,
      'pldm_entity_association_tree_init' => 1,
      'pldm_entity_association_tree_visit' => 1,
      'pldm_entity_extract' => 1,
      'pldm_entity_get_num_children' => 1,
      'pldm_entity_get_parent' => 1,
      'pldm_entity_is_exist_parent' => 1,
      'pldm_entity_is_node_parent' => 1,
      'pldm_entity_node_get_remote_container_id' => 1,
      'pldm_find_entity_ref_in_tree' => 1,
      'pldm_instance_db_destroy' => 1,
      'pldm_instance_db_init' => 1,
      'pldm_instance_db_init_default' => 1,
      'pldm_instance_id_alloc' => 1,
      'pldm_instance_id_free' => 1,
      'pldm_is_current_parent_child' => 1,
      'pldm_is_empty_entity_assoc_tree' => 1,
      'pldm_msg_hdr_correlate_response' => 1,
      'pldm_oem_meta_file_io_read_resp_data' => 1,
      'pldm_oem_meta_file_io_write_req_data' => 1,
      'pldm_open' => 1,
      'pldm_pdr_add' => 1,
      'pldm_pdr_add_fru_record_set' => 1,
      'pldm_pdr_destroy' => 1,
      'pldm_pdr_find_last_in_range' => 1,
      'pldm_pdr_find_record' => 1,
      'pldm_pdr_find_record_by_type' => 1,
      'pldm_pdr_fru_record_set_find_by_rsi' => 1,
      'pldm_pdr_get_next_record' => 1,
      'pldm_pdr_get_record_count' => 1,
      'pldm_pdr_get_record_handle' => 1,
      'pldm_pdr_get_repo_size' => 1,
      'pldm_pdr_init' => 1,
      'pldm_pdr_record_is_remote' => 1,
      'pldm_pdr_remove_pdrs_by_terminus_handle' => 1,
      'pldm_pdr_remove_remote_pdrs' => 1,
      'pldm_pdr_update_TL_pdr' => 1,
      'pldm_platform_cper_event_event_data' => 1,
      'pldm_recv' => 1,
      'pldm_recv_any' => 1,
      'pldm_send' => 1,
      'pldm_send_recv' => 1,
      'pldm_transport_af_mctp_bind' => 1,
      'pldm_transport_af_mctp_core' => 1,
      'pldm_transport_af_mctp_destroy' => 1,
      'pldm_transport_af_mctp_init' => 1,
      'pldm_transport_af_mctp_init_pollfd' => 1,
      'pldm_transport_af_mctp_map_tid' => 1,
      'pldm_transport_af_mctp_unmap_tid' => 1,
      'pldm_transport_mctp_demux_core' => 1,
      'pldm_transport_mctp_demux_destroy' => 1,
      'pldm_transport_mctp_demux_init' => 1,
      'pldm_transport_mctp_demux_init_pollfd' => 1,
      'pldm_transport_mctp_demux_map_tid' => 1,
      'pldm_transport_mctp_demux_unmap_tid' => 1,
      'pldm_transport_poll' => 1,
      'pldm_transport_recv_msg' => 1,
      'pldm_transport_send_msg' => 1,
      'pldm_transport_send_recv_msg' => 1,
      'unpack_pldm_header' => 1,
      'ver2str' => 1
    }
  },
  'Target' => 'unix',
  'TypeInfo' => {
    '1' => {
      'Name' => 'void',
      'Type' => 'Intrinsic'
    },
    '46' => {
      'Name' => 'unsigned char',
      'Size' => '1',
      'Type' => 'Intrinsic'
    },
    '53' => {
      'Name' => 'unsigned short',
      'Size' => '2',
      'Type' => 'Intrinsic'
    },
    '60' => {
      'Name' => 'unsigned int',
      'Size' => '4',
      'Type' => 'Intrinsic'
    },
    '67' => {
      'Name' => 'unsigned long',
      'Size' => '8',
      'Type' => 'Intrinsic'
    },
    '74' => {
      'Name' => 'signed char',
      'Size' => '1',
      'Type' => 'Intrinsic'
    },
    '81' => {
      'BaseType' => '46',
      'Header' => 'types.h',
      'Line' => '38',
      'Name' => '__uint8_t',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '93' => {
      'Name' => 'short',
      'Size' => '2',
      'Type' => 'Intrinsic'
    },
    '100' => {
      'Name' => 'int',
      'Size' => '4',
      'Type' => 'Intrinsic'
    },
    '107' => {
      'Name' => 'long',
      'Size' => '8',
      'Type' => 'Intrinsic'
    },
    '114' => {
      'Name' => 'char',
      'Size' => '1',
      'Type' => 'Intrinsic'
    },
    '121' => {
      'BaseType' => '81',
      'Header' => 'stdint-uintn.h',
      'Line' => '24',
      'Name' => 'uint8_t',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '133' => {
      'Name' => 'float',
      'Size' => '4',
      'Type' => 'Intrinsic'
    },
    '175' => {
      'BaseType' => '121',
      'Header' => 'base.h',
      'Line' => '17',
      'Name' => 'pldm_tid_t',
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '187' => {
      'BaseType' => '121',
      'Header' => 'instance-id.h',
      'Line' => '13',
      'Name' => 'pldm_instance_id_t',
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '199' => {
      'Header' => 'responder.h',
      'Line' => '10',
      'Memb' => {
        '0' => {
          'name' => 'tid',
          'offset' => '0',
          'type' => '175'
        },
        '1' => {
          'name' => 'instance_id',
          'offset' => '1',
          'type' => '187'
        },
        '2' => {
          'name' => 'type',
          'offset' => '2',
          'type' => '121'
        },
        '3' => {
          'name' => 'command',
          'offset' => '3',
          'type' => '121'
        },
        '4' => {
          'name' => 'next',
          'offset' => '8',
          'type' => '279'
        }
      },
      'Name' => 'struct pldm_responder_cookie',
      'PrivateABI' => 1,
      'Size' => '16',
      'Type' => 'Struct'
    },
    '279' => {
      'BaseType' => '199',
      'Name' => 'struct pldm_responder_cookie*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '284' => {
      'Header' => 'pldm.h',
      'Line' => '15',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_REQUESTER_SUCCESS',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_REQUESTER_OPEN_FAIL',
          'value' => '18446744073709551615 (-1)'
        },
        '2' => {
          'name' => 'PLDM_REQUESTER_NOT_PLDM_MSG',
          'value' => '18446744073709551614 (-2)'
        },
        '3' => {
          'name' => 'PLDM_REQUESTER_NOT_RESP_MSG',
          'value' => '18446744073709551613 (-3)'
        },
        '4' => {
          'name' => 'PLDM_REQUESTER_NOT_REQ_MSG',
          'value' => '18446744073709551612 (-4)'
        },
        '5' => {
          'name' => 'PLDM_REQUESTER_RESP_MSG_TOO_SMALL',
          'value' => '18446744073709551611 (-5)'
        },
        '6' => {
          'name' => 'PLDM_REQUESTER_INSTANCE_ID_MISMATCH',
          'value' => '18446744073709551610 (-6)'
        },
        '7' => {
          'name' => 'PLDM_REQUESTER_SEND_FAIL',
          'value' => '18446744073709551609 (-7)'
        },
        '8' => {
          'name' => 'PLDM_REQUESTER_RECV_FAIL',
          'value' => '18446744073709551608 (-8)'
        },
        '9' => {
          'name' => 'PLDM_REQUESTER_INVALID_RECV_LEN',
          'value' => '18446744073709551607 (-9)'
        },
        '10' => {
          'name' => 'PLDM_REQUESTER_SETUP_FAIL',
          'value' => '18446744073709551606 (-10)'
        },
        '11' => {
          'name' => 'PLDM_REQUESTER_INVALID_SETUP',
          'value' => '18446744073709551605 (-11)'
        },
        '12' => {
          'name' => 'PLDM_REQUESTER_POLL_FAIL',
          'value' => '18446744073709551604 (-12)'
        },
        '13' => {
          'name' => 'PLDM_REQUESTER_TRANSPORT_BUSY',
          'value' => '18446744073709551603 (-13)'
        }
      },
      'Name' => 'enum pldm_requester_error_codes',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '805' => {
      'Name' => '_Bool',
      'Size' => '1',
      'Type' => 'Intrinsic'
    },
    '927' => {
      'BaseType' => '53',
      'Header' => 'types.h',
      'Line' => '40',
      'Name' => '__uint16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '951' => {
      'BaseType' => '60',
      'Header' => 'types.h',
      'Line' => '42',
      'Name' => '__uint32_t',
      'PrivateABI' => 1,
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '970' => {
      'BaseType' => '107',
      'Header' => 'types.h',
      'Line' => '194',
      'Name' => '__ssize_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '982' => {
      'BaseType' => '114',
      'Name' => 'char*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '1006' => {
      'BaseType' => '121',
      'Name' => 'uint8_t const',
      'Size' => '1',
      'Type' => 'Const'
    },
    '1011' => {
      'BaseType' => '927',
      'Header' => 'stdint-uintn.h',
      'Line' => '25',
      'Name' => 'uint16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '1023' => {
      'BaseType' => '951',
      'Header' => 'stdint-uintn.h',
      'Line' => '26',
      'Name' => 'uint32_t',
      'PrivateABI' => 1,
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '1035' => {
      'Header' => 'pldm_types.h',
      'Line' => '25',
      'Memb' => {
        '0' => {
          'name' => 'alpha',
          'offset' => '0',
          'type' => '121'
        },
        '1' => {
          'name' => 'update',
          'offset' => '1',
          'type' => '121'
        },
        '2' => {
          'name' => 'minor',
          'offset' => '2',
          'type' => '121'
        },
        '3' => {
          'name' => 'major',
          'offset' => '3',
          'type' => '121'
        }
      },
      'Name' => 'struct pldm_version',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '1093' => {
      'BaseType' => '1035',
      'Header' => 'pldm_types.h',
      'Line' => '30',
      'Name' => 'ver32_t',
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '1105' => {
      'BaseType' => '1093',
      'Name' => 'ver32_t const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '1145' => {
      'BaseType' => '67',
      'Header' => 'stddef.h',
      'Line' => '214',
      'Name' => 'size_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '1207' => {
      'BaseType' => '970',
      'Header' => 'types.h',
      'Line' => '108',
      'Name' => 'ssize_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '1219' => {
      'BaseType' => '1006',
      'Name' => 'uint8_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2228' => {
      'BaseType' => '1105',
      'Name' => 'ver32_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2341' => {
      'BaseType' => '2346',
      'Name' => 'void const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2346' => {
      'BaseType' => '1',
      'Name' => 'void const',
      'Type' => 'Const'
    },
    '2579' => {
      'BaseType' => '1',
      'Name' => 'void*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2593' => {
      'BaseType' => '114',
      'Name' => 'char const',
      'Size' => '1',
      'Type' => 'Const'
    },
    '2622' => {
      'Header' => 'pldm_types.h',
      'Line' => '9',
      'Name' => 'anon-struct-pldm_types.h-9',
      'Size' => '1',
      'Type' => 'Struct'
    },
    '2776' => {
      'Header' => 'pldm_types.h',
      'Line' => '19',
      'Memb' => {
        '0' => {
          'name' => 'byte',
          'offset' => '0',
          'type' => '121'
        },
        '1' => {
          'name' => 'bits',
          'offset' => '0',
          'type' => '2622'
        }
      },
      'Name' => 'union bitfield8_t',
      'Size' => '1',
      'Type' => 'Union'
    },
    '2788' => {
      'BaseType' => '2776',
      'Name' => 'bitfield8_t const',
      'Size' => '1',
      'Type' => 'Const'
    },
    '3191' => {
      'Header' => 'base.h',
      'Line' => '93',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_RESPONSE',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_REQUEST',
          'value' => '1'
        },
        '2' => {
          'name' => 'PLDM_RESERVED',
          'value' => '2'
        },
        '3' => {
          'name' => 'PLDM_ASYNC_REQUEST_NOTIFY',
          'value' => '3'
        }
      },
      'Name' => 'enum MessageType',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '3203' => {
      'Header' => 'base.h',
      'Line' => '139',
      'Memb' => {
        '0' => {
          'name' => 'command',
          'offset' => '2',
          'type' => '121'
        }
      },
      'Name' => 'struct pldm_msg_hdr',
      'Size' => '3',
      'Type' => 'Struct'
    },
    '3314' => {
      'BaseType' => '3203',
      'Name' => 'struct pldm_msg_hdr const',
      'Size' => '3',
      'Type' => 'Const'
    },
    '3319' => {
      'Header' => 'base.h',
      'Line' => '172',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '3203'
        },
        '1' => {
          'name' => 'payload',
          'offset' => '3',
          'type' => '3364'
        }
      },
      'Name' => 'struct pldm_msg',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '3359' => {
      'BaseType' => '3319',
      'Name' => 'struct pldm_msg const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '3364' => {
      'BaseType' => '121',
      'Name' => 'uint8_t[1]',
      'Size' => '1',
      'Type' => 'Array'
    },
    '3380' => {
      'Header' => 'base.h',
      'Line' => '239',
      'Memb' => {
        '0' => {
          'name' => 'msg_type',
          'offset' => '0',
          'type' => '3191'
        },
        '1' => {
          'name' => 'instance',
          'offset' => '4',
          'type' => '121'
        },
        '2' => {
          'name' => 'pldm_type',
          'offset' => '5',
          'type' => '121'
        },
        '3' => {
          'name' => 'command',
          'offset' => '6',
          'type' => '121'
        },
        '4' => {
          'name' => 'completion_code',
          'offset' => '7',
          'type' => '121'
        }
      },
      'Name' => 'struct pldm_header_info',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '3459' => {
      'BaseType' => '3380',
      'Name' => 'struct pldm_header_info const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '3920' => {
      'BaseType' => '2593',
      'Name' => 'char const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '4151' => {
      'BaseType' => '3319',
      'Name' => 'struct pldm_msg*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '4598' => {
      'BaseType' => '3359',
      'Name' => 'struct pldm_msg const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '4603' => {
      'BaseType' => '121',
      'Name' => 'uint8_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '4608' => {
      'BaseType' => '1023',
      'Name' => 'uint32_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '5501' => {
      'BaseType' => '1093',
      'Name' => 'ver32_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '6424' => {
      'BaseType' => '2776',
      'Name' => 'bitfield8_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '6886' => {
      'BaseType' => '2788',
      'Name' => 'bitfield8_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '7674' => {
      'BaseType' => '3314',
      'Name' => 'struct pldm_msg_hdr const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '7913' => {
      'BaseType' => '3380',
      'Name' => 'struct pldm_header_info*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '8173' => {
      'BaseType' => '3459',
      'Name' => 'struct pldm_header_info const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '8178' => {
      'BaseType' => '3203',
      'Name' => 'struct pldm_msg_hdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '10048' => {
      'Header' => 'utils.h',
      'Line' => '20',
      'Memb' => {
        '0' => {
          'name' => 'ptr',
          'offset' => '0',
          'type' => '1219'
        },
        '1' => {
          'name' => 'length',
          'offset' => '8',
          'type' => '1145'
        }
      },
      'Name' => 'struct variable_field',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '10444' => {
      'BaseType' => '10048',
      'Name' => 'struct variable_field*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '12526' => {
      'BaseType' => '1011',
      'Name' => 'uint16_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '13089' => {
      'BaseType' => '1145',
      'Name' => 'size_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '15765' => {
      'BaseType' => '67',
      'Header' => 'types.h',
      'Line' => '45',
      'Name' => '__uint64_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '15842' => {
      'BaseType' => '1011',
      'Name' => 'uint16_t const',
      'Size' => '2',
      'Type' => 'Const'
    },
    '15859' => {
      'BaseType' => '15765',
      'Header' => 'stdint-uintn.h',
      'Line' => '27',
      'Name' => 'uint64_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '16017' => {
      'Header' => 'bios.h',
      'Line' => '39',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_BIOS_STRING_TABLE',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_BIOS_ATTR_TABLE',
          'value' => '1'
        },
        '2' => {
          'name' => 'PLDM_BIOS_ATTR_VAL_TABLE',
          'value' => '2'
        }
      },
      'Name' => 'enum pldm_bios_table_types',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '16051' => {
      'Header' => 'bios.h',
      'Line' => '48',
      'Memb' => {
        '0' => {
          'name' => 'string_handle',
          'offset' => '0',
          'type' => '1011'
        },
        '1' => {
          'name' => 'string_length',
          'offset' => '2',
          'type' => '1011'
        },
        '2' => {
          'name' => 'name',
          'offset' => '4',
          'type' => '16108'
        }
      },
      'Name' => 'struct pldm_bios_string_table_entry',
      'Size' => '5',
      'Type' => 'Struct'
    },
    '16103' => {
      'BaseType' => '16051',
      'Name' => 'struct pldm_bios_string_table_entry const',
      'Size' => '5',
      'Type' => 'Const'
    },
    '16108' => {
      'BaseType' => '114',
      'Name' => 'char[1]',
      'Size' => '1',
      'Type' => 'Array'
    },
    '16124' => {
      'Header' => 'bios.h',
      'Line' => '54',
      'Memb' => {
        '0' => {
          'name' => 'attr_handle',
          'offset' => '0',
          'type' => '1011'
        },
        '1' => {
          'name' => 'attr_type',
          'offset' => '2',
          'type' => '121'
        },
        '2' => {
          'name' => 'string_handle',
          'offset' => '3',
          'type' => '1011'
        },
        '3' => {
          'name' => 'metadata',
          'offset' => '5',
          'type' => '3364'
        }
      },
      'Name' => 'struct pldm_bios_attr_table_entry',
      'Size' => '6',
      'Type' => 'Struct'
    },
    '16189' => {
      'BaseType' => '16124',
      'Name' => 'struct pldm_bios_attr_table_entry const',
      'Size' => '6',
      'Type' => 'Const'
    },
    '16194' => {
      'Header' => 'bios.h',
      'Line' => '66',
      'Memb' => {
        '0' => {
          'name' => 'attr_handle',
          'offset' => '0',
          'type' => '1011'
        },
        '1' => {
          'name' => 'attr_type',
          'offset' => '2',
          'type' => '121'
        },
        '2' => {
          'name' => 'value',
          'offset' => '3',
          'type' => '3364'
        }
      },
      'Name' => 'struct pldm_bios_attr_val_table_entry',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '16246' => {
      'BaseType' => '16194',
      'Name' => 'struct pldm_bios_attr_val_table_entry const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '16315' => {
      'Header' => 'bios_table.h',
      'Line' => '206',
      'Memb' => {
        '0' => {
          'name' => 'name_handle',
          'offset' => '0',
          'type' => '1011'
        },
        '1' => {
          'name' => 'read_only',
          'offset' => '2',
          'type' => '805'
        },
        '2' => {
          'name' => 'pv_num',
          'offset' => '3',
          'type' => '121'
        },
        '3' => {
          'name' => 'pv_handle',
          'offset' => '8',
          'type' => '16418'
        },
        '4' => {
          'name' => 'def_num',
          'offset' => '22',
          'type' => '121'
        },
        '5' => {
          'name' => 'def_index',
          'offset' => '36',
          'type' => '1219'
        }
      },
      'Name' => 'struct pldm_bios_table_attr_entry_enum_info',
      'Size' => '32',
      'Type' => 'Struct'
    },
    '16406' => {
      'BaseType' => '16315',
      'Name' => 'struct pldm_bios_table_attr_entry_enum_info const',
      'Size' => '32',
      'Type' => 'Const'
    },
    '16418' => {
      'BaseType' => '15842',
      'Name' => 'uint16_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '16428' => {
      'Header' => 'bios_table.h',
      'Line' => '294',
      'Memb' => {
        '0' => {
          'name' => 'name_handle',
          'offset' => '0',
          'type' => '1011'
        },
        '1' => {
          'name' => 'read_only',
          'offset' => '2',
          'type' => '805'
        },
        '2' => {
          'name' => 'string_type',
          'offset' => '3',
          'type' => '121'
        },
        '3' => {
          'name' => 'min_length',
          'offset' => '4',
          'type' => '1011'
        },
        '4' => {
          'name' => 'max_length',
          'offset' => '6',
          'type' => '1011'
        },
        '5' => {
          'name' => 'def_length',
          'offset' => '8',
          'type' => '1011'
        },
        '6' => {
          'name' => 'def_string',
          'offset' => '22',
          'type' => '3920'
        }
      },
      'Name' => 'struct pldm_bios_table_attr_entry_string_info',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '16540' => {
      'BaseType' => '16428',
      'Name' => 'struct pldm_bios_table_attr_entry_string_info const',
      'Size' => '24',
      'Type' => 'Const'
    },
    '16550' => {
      'Header' => 'bios_table.h',
      'Line' => '384',
      'Memb' => {
        '0' => {
          'name' => 'name_handle',
          'offset' => '0',
          'type' => '1011'
        },
        '1' => {
          'name' => 'read_only',
          'offset' => '2',
          'type' => '805'
        },
        '2' => {
          'name' => 'lower_bound',
          'offset' => '8',
          'type' => '15859'
        },
        '3' => {
          'name' => 'upper_bound',
          'offset' => '22',
          'type' => '15859'
        },
        '4' => {
          'name' => 'scalar_increment',
          'offset' => '36',
          'type' => '1023'
        },
        '5' => {
          'name' => 'default_value',
          'offset' => '50',
          'type' => '15859'
        }
      },
      'Name' => 'struct pldm_bios_table_attr_entry_integer_info',
      'Size' => '40',
      'Type' => 'Struct'
    },
    '16648' => {
      'BaseType' => '16550',
      'Name' => 'struct pldm_bios_table_attr_entry_integer_info const',
      'Size' => '40',
      'Type' => 'Const'
    },
    '16931' => {
      'Name' => 'ssize_t(*)(void const*)',
      'Param' => {
        '0' => {
          'type' => '2341'
        }
      },
      'Return' => '1207',
      'Size' => '8',
      'Type' => 'FuncPtr'
    },
    '17001' => {
      'Line' => '952',
      'Memb' => {
        '0' => {
          'name' => 'table_data',
          'offset' => '0',
          'type' => '1219'
        },
        '1' => {
          'name' => 'table_len',
          'offset' => '8',
          'type' => '1145'
        },
        '2' => {
          'name' => 'current_pos',
          'offset' => '22',
          'type' => '1145'
        },
        '3' => {
          'name' => 'entry_length_handler',
          'offset' => '36',
          'type' => '16931'
        }
      },
      'Name' => 'struct pldm_bios_table_iter',
      'PrivateABI' => 1,
      'Size' => '32',
      'Source' => 'bios_table.c',
      'Type' => 'Struct'
    },
    '17071' => {
      'BaseType' => '17001',
      'Name' => 'struct pldm_bios_table_iter const',
      'Size' => '32',
      'Type' => 'Const'
    },
    '18141' => {
      'BaseType' => '17001',
      'Name' => 'struct pldm_bios_table_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '18146' => {
      'BaseType' => '16246',
      'Name' => 'struct pldm_bios_attr_val_table_entry const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '18560' => {
      'BaseType' => '16189',
      'Name' => 'struct pldm_bios_attr_table_entry const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '19163' => {
      'BaseType' => '16103',
      'Name' => 'struct pldm_bios_string_table_entry const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '20326' => {
      'BaseType' => '17071',
      'Name' => 'struct pldm_bios_table_iter const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '24509' => {
      'BaseType' => '15859',
      'Name' => 'uint64_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '24786' => {
      'BaseType' => '16648',
      'Name' => 'struct pldm_bios_table_attr_entry_integer_info const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '25095' => {
      'BaseType' => '3920',
      'Name' => 'char const**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '26224' => {
      'BaseType' => '16540',
      'Name' => 'struct pldm_bios_table_attr_entry_string_info const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '27678' => {
      'BaseType' => '16406',
      'Name' => 'struct pldm_bios_table_attr_entry_enum_info const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '29848' => {
      'BaseType' => '1023',
      'Name' => 'uint32_t const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '29889' => {
      'BaseType' => '121',
      'Header' => 'pldm_types.h',
      'Line' => '32',
      'Name' => 'bool8_t',
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '29901' => {
      'Header' => 'pldm_types.h',
      'Line' => '36',
      'Name' => 'anon-struct-pldm_types.h-36',
      'Size' => '2',
      'Type' => 'Struct'
    },
    '30165' => {
      'Header' => 'pldm_types.h',
      'Line' => '54',
      'Memb' => {
        '0' => {
          'name' => 'value',
          'offset' => '0',
          'type' => '1011'
        },
        '1' => {
          'name' => 'bits',
          'offset' => '0',
          'type' => '29901'
        }
      },
      'Name' => 'union bitfield16_t',
      'Size' => '2',
      'Type' => 'Union'
    },
    '30177' => {
      'Header' => 'pldm_types.h',
      'Line' => '58',
      'Name' => 'anon-struct-pldm_types.h-58',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '30665' => {
      'Header' => 'pldm_types.h',
      'Line' => '92',
      'Memb' => {
        '0' => {
          'name' => 'value',
          'offset' => '0',
          'type' => '1023'
        },
        '1' => {
          'name' => 'bits',
          'offset' => '0',
          'type' => '30177'
        }
      },
      'Name' => 'union bitfield32_t',
      'Size' => '4',
      'Type' => 'Union'
    },
    '30677' => {
      'Header' => 'pldm_types.h',
      'Line' => '96',
      'Name' => 'anon-struct-pldm_types.h-96',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '31613' => {
      'Header' => 'pldm_types.h',
      'Line' => '162',
      'Memb' => {
        '0' => {
          'name' => 'value',
          'offset' => '0',
          'type' => '15859'
        },
        '1' => {
          'name' => 'bits',
          'offset' => '0',
          'type' => '30677'
        }
      },
      'Name' => 'union bitfield64_t',
      'Size' => '8',
      'Type' => 'Union'
    },
    '31672' => {
      'BaseType' => '1145',
      'Name' => 'size_t const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '33427' => {
      'Header' => 'firmware_update.h',
      'Line' => '417',
      'Memb' => {
        '0' => {
          'name' => 'uuid',
          'offset' => '0',
          'type' => '33531'
        },
        '1' => {
          'name' => 'package_header_format_version',
          'offset' => '22',
          'type' => '121'
        },
        '2' => {
          'name' => 'package_header_size',
          'offset' => '23',
          'type' => '1011'
        },
        '3' => {
          'name' => 'package_release_date_time',
          'offset' => '25',
          'type' => '33547'
        },
        '4' => {
          'name' => 'component_bitmap_bit_length',
          'offset' => '50',
          'type' => '1011'
        },
        '5' => {
          'name' => 'package_version_string_type',
          'offset' => '52',
          'type' => '121'
        },
        '6' => {
          'name' => 'package_version_string_length',
          'offset' => '53',
          'type' => '121'
        }
      },
      'Name' => 'struct pldm_package_header_information',
      'Size' => '36',
      'Type' => 'Struct'
    },
    '33531' => {
      'BaseType' => '121',
      'Name' => 'uint8_t[16]',
      'Size' => '16',
      'Type' => 'Array'
    },
    '33547' => {
      'BaseType' => '121',
      'Name' => 'uint8_t[13]',
      'Size' => '13',
      'Type' => 'Array'
    },
    '33563' => {
      'Header' => 'firmware_update.h',
      'Line' => '431',
      'Memb' => {
        '0' => {
          'name' => 'record_length',
          'offset' => '0',
          'type' => '1011'
        },
        '1' => {
          'name' => 'descriptor_count',
          'offset' => '2',
          'type' => '121'
        },
        '2' => {
          'name' => 'device_update_option_flags',
          'offset' => '3',
          'type' => '30665'
        },
        '3' => {
          'name' => 'comp_image_set_version_string_type',
          'offset' => '7',
          'type' => '121'
        },
        '4' => {
          'name' => 'comp_image_set_version_string_length',
          'offset' => '8',
          'type' => '121'
        },
        '5' => {
          'name' => 'fw_device_pkg_data_length',
          'offset' => '9',
          'type' => '1011'
        }
      },
      'Name' => 'struct pldm_firmware_device_id_record',
      'Size' => '11',
      'Type' => 'Struct'
    },
    '33758' => {
      'Header' => 'firmware_update.h',
      'Line' => '465',
      'Memb' => {
        '0' => {
          'name' => 'comp_classification',
          'offset' => '0',
          'type' => '1011'
        },
        '1' => {
          'name' => 'comp_identifier',
          'offset' => '2',
          'type' => '1011'
        },
        '2' => {
          'name' => 'comp_comparison_stamp',
          'offset' => '4',
          'type' => '1023'
        },
        '3' => {
          'name' => 'comp_options',
          'offset' => '8',
          'type' => '30165'
        },
        '4' => {
          'name' => 'requested_comp_activation_method',
          'offset' => '16',
          'type' => '30165'
        },
        '5' => {
          'name' => 'comp_location_offset',
          'offset' => '18',
          'type' => '1023'
        },
        '6' => {
          'name' => 'comp_size',
          'offset' => '22',
          'type' => '1023'
        },
        '7' => {
          'name' => 'comp_version_string_type',
          'offset' => '32',
          'type' => '121'
        },
        '8' => {
          'name' => 'comp_version_string_length',
          'offset' => '33',
          'type' => '121'
        }
      },
      'Name' => 'struct pldm_component_image_information',
      'Size' => '22',
      'Type' => 'Struct'
    },
    '33940' => {
      'Header' => 'firmware_update.h',
      'Line' => '491',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '121'
        },
        '1' => {
          'name' => 'capabilities_during_update',
          'offset' => '1',
          'type' => '30665'
        },
        '2' => {
          'name' => 'comp_count',
          'offset' => '5',
          'type' => '1011'
        },
        '3' => {
          'name' => 'active_comp_image_set_ver_str_type',
          'offset' => '7',
          'type' => '121'
        },
        '4' => {
          'name' => 'active_comp_image_set_ver_str_len',
          'offset' => '8',
          'type' => '121'
        },
        '5' => {
          'name' => 'pending_comp_image_set_ver_str_type',
          'offset' => '9',
          'type' => '121'
        },
        '6' => {
          'name' => 'pending_comp_image_set_ver_str_len',
          'offset' => '16',
          'type' => '121'
        }
      },
      'Name' => 'struct pldm_get_firmware_parameters_resp',
      'Size' => '11',
      'Type' => 'Struct'
    },
    '34122' => {
      'Header' => 'firmware_update.h',
      'Line' => '519',
      'Memb' => {
        '0' => {
          'name' => 'comp_classification',
          'offset' => '0',
          'type' => '1011'
        },
        '1' => {
          'name' => 'comp_identifier',
          'offset' => '2',
          'type' => '1011'
        },
        '2' => {
          'name' => 'comp_classification_index',
          'offset' => '4',
          'type' => '121'
        },
        '3' => {
          'name' => 'active_comp_comparison_stamp',
          'offset' => '5',
          'type' => '1023'
        },
        '4' => {
          'name' => 'active_comp_ver_str_type',
          'offset' => '9',
          'type' => '121'
        },
        '5' => {
          'name' => 'active_comp_ver_str_len',
          'offset' => '16',
          'type' => '121'
        },
        '6' => {
          'name' => 'active_comp_release_date',
          'offset' => '17',
          'type' => '34304'
        },
        '7' => {
          'name' => 'pending_comp_comparison_stamp',
          'offset' => '25',
          'type' => '1023'
        },
        '8' => {
          'name' => 'pending_comp_ver_str_type',
          'offset' => '35',
          'type' => '121'
        },
        '9' => {
          'name' => 'pending_comp_ver_str_len',
          'offset' => '36',
          'type' => '121'
        },
        '10' => {
          'name' => 'pending_comp_release_date',
          'offset' => '37',
          'type' => '34304'
        },
        '11' => {
          'name' => 'comp_activation_methods',
          'offset' => '51',
          'type' => '30165'
        },
        '12' => {
          'name' => 'capabilities_during_update',
          'offset' => '53',
          'type' => '30665'
        }
      },
      'Name' => 'struct pldm_component_parameter_entry',
      'Size' => '39',
      'Type' => 'Struct'
    },
    '34304' => {
      'BaseType' => '121',
      'Name' => 'uint8_t[8]',
      'Size' => '8',
      'Type' => 'Array'
    },
    '35518' => {
      'BaseType' => '10048',
      'Name' => 'struct variable_field const',
      'Size' => '16',
      'Type' => 'Const'
    },
    '35883' => {
      'BaseType' => '29889',
      'Name' => 'bool8_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '35888' => {
      'BaseType' => '31613',
      'Name' => 'bitfield64_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '36643' => {
      'BaseType' => '30665',
      'Name' => 'bitfield32_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '37492' => {
      'BaseType' => '30165',
      'Name' => 'bitfield16_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '39046' => {
      'BaseType' => '35518',
      'Name' => 'struct variable_field const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '50110' => {
      'BaseType' => '34122',
      'Name' => 'struct pldm_component_parameter_entry*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '50335' => {
      'BaseType' => '33940',
      'Name' => 'struct pldm_get_firmware_parameters_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '50636' => {
      'BaseType' => '4603',
      'Name' => 'uint8_t**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '50933' => {
      'BaseType' => '33758',
      'Name' => 'struct pldm_component_image_information*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '51549' => {
      'BaseType' => '33563',
      'Name' => 'struct pldm_firmware_device_id_record*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '51859' => {
      'BaseType' => '33427',
      'Name' => 'struct pldm_package_header_information*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '52619' => {
      'BaseType' => '2579',
      'Name' => 'void**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '59875' => {
      'BaseType' => '59892',
      'Header' => 'pdr.h',
      'Line' => '16',
      'Name' => 'pldm_pdr',
      'PrivateABI' => 1,
      'Size' => '24',
      'Type' => 'Typedef'
    },
    '59887' => {
      'BaseType' => '59875',
      'Name' => 'pldm_pdr const',
      'Size' => '24',
      'Type' => 'Const'
    },
    '59892' => {
      'Line' => '30',
      'Memb' => {
        '0' => {
          'name' => 'record_count',
          'offset' => '0',
          'type' => '1023'
        },
        '1' => {
          'name' => 'size',
          'offset' => '4',
          'type' => '1023'
        },
        '2' => {
          'name' => 'first',
          'offset' => '8',
          'type' => '60991'
        },
        '3' => {
          'name' => 'last',
          'offset' => '22',
          'type' => '60991'
        }
      },
      'Name' => 'struct pldm_pdr',
      'PrivateABI' => 1,
      'Size' => '24',
      'Source' => 'pdr.c',
      'Type' => 'Struct'
    },
    '59958' => {
      'BaseType' => '59975',
      'Header' => 'pdr.h',
      'Line' => '21',
      'Name' => 'pldm_pdr_record',
      'PrivateABI' => 1,
      'Size' => '32',
      'Type' => 'Typedef'
    },
    '59970' => {
      'BaseType' => '59958',
      'Name' => 'pldm_pdr_record const',
      'Size' => '32',
      'Type' => 'Const'
    },
    '59975' => {
      'Line' => '21',
      'Memb' => {
        '0' => {
          'name' => 'record_handle',
          'offset' => '0',
          'type' => '1023'
        },
        '1' => {
          'name' => 'size',
          'offset' => '4',
          'type' => '1023'
        },
        '2' => {
          'name' => 'data',
          'offset' => '8',
          'type' => '4603'
        },
        '3' => {
          'name' => 'next',
          'offset' => '22',
          'type' => '60979'
        },
        '4' => {
          'name' => 'is_remote',
          'offset' => '36',
          'type' => '805'
        },
        '5' => {
          'name' => 'terminus_handle',
          'offset' => '38',
          'type' => '1011'
        }
      },
      'Name' => 'struct pldm_pdr_record',
      'PrivateABI' => 1,
      'Size' => '32',
      'Source' => 'pdr.c',
      'Type' => 'Struct'
    },
    '60067' => {
      'Header' => 'pdr.h',
      'Line' => '288',
      'Memb' => {
        '0' => {
          'name' => 'entity_type',
          'offset' => '0',
          'type' => '1011'
        },
        '1' => {
          'name' => 'entity_instance_num',
          'offset' => '2',
          'type' => '1011'
        },
        '2' => {
          'name' => 'entity_container_id',
          'offset' => '4',
          'type' => '1011'
        }
      },
      'Name' => 'struct pldm_entity',
      'Size' => '6',
      'Type' => 'Struct'
    },
    '60129' => {
      'BaseType' => '60067',
      'Header' => 'pdr.h',
      'Line' => '292',
      'Name' => 'pldm_entity',
      'Size' => '6',
      'Type' => 'Typedef'
    },
    '60173' => {
      'BaseType' => '60185',
      'Header' => 'pdr.h',
      'Line' => '302',
      'Name' => 'pldm_entity_association_tree',
      'PrivateABI' => 1,
      'Size' => '16',
      'Type' => 'Typedef'
    },
    '60185' => {
      'Line' => '451',
      'Memb' => {
        '0' => {
          'name' => 'root',
          'offset' => '0',
          'type' => '60996'
        },
        '1' => {
          'name' => 'last_used_container_id',
          'offset' => '8',
          'type' => '1011'
        }
      },
      'Name' => 'struct pldm_entity_association_tree',
      'PrivateABI' => 1,
      'Size' => '16',
      'Source' => 'pdr.c',
      'Type' => 'Struct'
    },
    '60228' => {
      'BaseType' => '60245',
      'Header' => 'pdr.h',
      'Line' => '307',
      'Name' => 'pldm_entity_node',
      'PrivateABI' => 1,
      'Size' => '40',
      'Type' => 'Typedef'
    },
    '60240' => {
      'BaseType' => '60228',
      'Name' => 'pldm_entity_node const',
      'Size' => '40',
      'Type' => 'Const'
    },
    '60245' => {
      'Line' => '456',
      'Memb' => {
        '0' => {
          'name' => 'entity',
          'offset' => '0',
          'type' => '60129'
        },
        '1' => {
          'name' => 'parent',
          'offset' => '6',
          'type' => '60129'
        },
        '2' => {
          'name' => 'remote_container_id',
          'offset' => '18',
          'type' => '1011'
        },
        '3' => {
          'name' => 'first_child',
          'offset' => '22',
          'type' => '60996'
        },
        '4' => {
          'name' => 'next_sibling',
          'offset' => '36',
          'type' => '60996'
        },
        '5' => {
          'name' => 'association_type',
          'offset' => '50',
          'type' => '121'
        }
      },
      'Name' => 'struct pldm_entity_node',
      'PrivateABI' => 1,
      'Size' => '40',
      'Source' => 'pdr.c',
      'Type' => 'Struct'
    },
    '60519' => {
      'Header' => 'platform.h',
      'Line' => '522',
      'Memb' => {
        '0' => {
          'name' => 'record_handle',
          'offset' => '0',
          'type' => '1023'
        },
        '1' => {
          'name' => 'version',
          'offset' => '4',
          'type' => '121'
        },
        '2' => {
          'name' => 'type',
          'offset' => '5',
          'type' => '121'
        },
        '3' => {
          'name' => 'record_change_num',
          'offset' => '6',
          'type' => '1011'
        },
        '4' => {
          'name' => 'length',
          'offset' => '8',
          'type' => '1011'
        }
      },
      'Name' => 'struct pldm_pdr_hdr',
      'Size' => '10',
      'Type' => 'Struct'
    },
    '60979' => {
      'BaseType' => '59975',
      'Name' => 'struct pldm_pdr_record*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '60991' => {
      'BaseType' => '59958',
      'Name' => 'pldm_pdr_record*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '60996' => {
      'BaseType' => '60228',
      'Name' => 'pldm_entity_node*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '61872' => {
      'BaseType' => '59875',
      'Name' => 'pldm_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '62895' => {
      'BaseType' => '59970',
      'Name' => 'pldm_pdr_record const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '67463' => {
      'BaseType' => '60129',
      'Name' => 'pldm_entity*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '77418' => {
      'BaseType' => '67463',
      'Name' => 'pldm_entity**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '77482' => {
      'BaseType' => '60173',
      'Name' => 'pldm_entity_association_tree*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '78070' => {
      'BaseType' => '60996',
      'Name' => 'pldm_entity_node**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '78859' => {
      'BaseType' => '59887',
      'Name' => 'pldm_pdr const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '84093' => {
      'BaseType' => '60240',
      'Name' => 'pldm_entity_node const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '88928' => {
      'BaseType' => '74',
      'Header' => 'types.h',
      'Line' => '37',
      'Name' => '__int8_t',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '88959' => {
      'BaseType' => '93',
      'Header' => 'types.h',
      'Line' => '39',
      'Name' => '__int16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '88990' => {
      'BaseType' => '100',
      'Header' => 'types.h',
      'Line' => '41',
      'Name' => '__int32_t',
      'PrivateABI' => 1,
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '89028' => {
      'BaseType' => '927',
      'Header' => 'types.h',
      'Line' => '55',
      'Name' => '__uint_least16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '89081' => {
      'BaseType' => '88928',
      'Header' => 'stdint-intn.h',
      'Line' => '24',
      'Name' => 'int8_t',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '89093' => {
      'BaseType' => '88959',
      'Header' => 'stdint-intn.h',
      'Line' => '25',
      'Name' => 'int16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '89105' => {
      'BaseType' => '88990',
      'Header' => 'stdint-intn.h',
      'Line' => '26',
      'Name' => 'int32_t',
      'PrivateABI' => 1,
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '89370' => {
      'BaseType' => '133',
      'Header' => 'pldm_types.h',
      'Line' => '164',
      'Name' => 'real32_t',
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '90027' => {
      'BaseType' => '89028',
      'Header' => 'uchar.h',
      'Line' => '51',
      'Name' => 'char16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '90703' => {
      'Header' => 'platform.h',
      'Line' => '300',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_SENSOR_OP_STATE',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_STATE_SENSOR_STATE',
          'value' => '1'
        },
        '2' => {
          'name' => 'PLDM_NUMERIC_SENSOR_STATE',
          'value' => '2'
        }
      },
      'Name' => 'enum sensor_event_class_states',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '90737' => {
      'BaseType' => '90703',
      'Name' => 'enum sensor_event_class_states const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '91045' => {
      'Header' => 'platform.h',
      'Line' => '597',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '60519'
        },
        '1' => {
          'name' => 'terminus_handle',
          'offset' => '16',
          'type' => '1011'
        },
        '2' => {
          'name' => 'sensor_id',
          'offset' => '18',
          'type' => '1011'
        },
        '3' => {
          'name' => 'entity_type',
          'offset' => '20',
          'type' => '1011'
        },
        '4' => {
          'name' => 'entity_instance',
          'offset' => '22',
          'type' => '1011'
        },
        '5' => {
          'name' => 'container_id',
          'offset' => '24',
          'type' => '1011'
        },
        '6' => {
          'name' => 'sensor_init',
          'offset' => '32',
          'type' => '121'
        },
        '7' => {
          'name' => 'sensor_auxiliary_names_pdr',
          'offset' => '33',
          'type' => '29889'
        },
        '8' => {
          'name' => 'composite_sensor_count',
          'offset' => '34',
          'type' => '121'
        },
        '9' => {
          'name' => 'possible_states',
          'offset' => '35',
          'type' => '3364'
        }
      },
      'Name' => 'struct pldm_state_sensor_pdr',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '91199' => {
      'Header' => 'platform.h',
      'Line' => '614',
      'Memb' => {
        '0' => {
          'name' => 'state_set_id',
          'offset' => '0',
          'type' => '1011'
        },
        '1' => {
          'name' => 'possible_states_size',
          'offset' => '2',
          'type' => '121'
        },
        '2' => {
          'name' => 'states',
          'offset' => '3',
          'type' => '91261'
        }
      },
      'Name' => 'struct state_sensor_possible_states',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '91256' => {
      'BaseType' => '91199',
      'Name' => 'struct state_sensor_possible_states const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '91261' => {
      'BaseType' => '2776',
      'Name' => 'bitfield8_t[1]',
      'Size' => '1',
      'Type' => 'Array'
    },
    '91277' => {
      'Header' => 'platform.h',
      'Line' => '624',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '60519'
        },
        '1' => {
          'name' => 'terminus_handle',
          'offset' => '16',
          'type' => '1011'
        },
        '2' => {
          'name' => 'effecter_id',
          'offset' => '18',
          'type' => '1011'
        },
        '3' => {
          'name' => 'entity_type',
          'offset' => '20',
          'type' => '1011'
        },
        '4' => {
          'name' => 'entity_instance',
          'offset' => '22',
          'type' => '1011'
        },
        '5' => {
          'name' => 'container_id',
          'offset' => '24',
          'type' => '1011'
        },
        '6' => {
          'name' => 'effecter_semantic_id',
          'offset' => '32',
          'type' => '1011'
        },
        '7' => {
          'name' => 'effecter_init',
          'offset' => '34',
          'type' => '121'
        },
        '8' => {
          'name' => 'has_description_pdr',
          'offset' => '35',
          'type' => '29889'
        },
        '9' => {
          'name' => 'composite_effecter_count',
          'offset' => '36',
          'type' => '121'
        },
        '10' => {
          'name' => 'possible_states',
          'offset' => '37',
          'type' => '3364'
        }
      },
      'Name' => 'struct pldm_state_effecter_pdr',
      'Size' => '26',
      'Type' => 'Struct'
    },
    '91634' => {
      'Header' => 'platform.h',
      'Line' => '715',
      'Memb' => {
        '0' => {
          'name' => 'value_u8',
          'offset' => '0',
          'type' => '121'
        },
        '1' => {
          'name' => 'value_s8',
          'offset' => '0',
          'type' => '89081'
        },
        '2' => {
          'name' => 'value_u16',
          'offset' => '0',
          'type' => '1011'
        },
        '3' => {
          'name' => 'value_s16',
          'offset' => '0',
          'type' => '89093'
        },
        '4' => {
          'name' => 'value_u32',
          'offset' => '0',
          'type' => '1023'
        },
        '5' => {
          'name' => 'value_s32',
          'offset' => '0',
          'type' => '89105'
        },
        '6' => {
          'name' => 'value_f32',
          'offset' => '0',
          'type' => '89370'
        }
      },
      'Name' => 'union union_range_field_format',
      'Size' => '4',
      'Type' => 'Union'
    },
    '92233' => {
      'Header' => 'platform.h',
      'Line' => '772',
      'Memb' => {
        '0' => {
          'name' => 'value_u8',
          'offset' => '0',
          'type' => '121'
        },
        '1' => {
          'name' => 'value_s8',
          'offset' => '0',
          'type' => '89081'
        },
        '2' => {
          'name' => 'value_u16',
          'offset' => '0',
          'type' => '1011'
        },
        '3' => {
          'name' => 'value_s16',
          'offset' => '0',
          'type' => '89093'
        },
        '4' => {
          'name' => 'value_u32',
          'offset' => '0',
          'type' => '1023'
        },
        '5' => {
          'name' => 'value_s32',
          'offset' => '0',
          'type' => '89105'
        }
      },
      'Name' => 'union union_sensor_data_size',
      'Size' => '4',
      'Type' => 'Union'
    },
    '92246' => {
      'Header' => 'platform.h',
      'Line' => '779',
      'Memb' => {
        '0' => {
          'name' => 'record_handle',
          'offset' => '0',
          'type' => '1023'
        },
        '1' => {
          'name' => 'version',
          'offset' => '4',
          'type' => '121'
        },
        '2' => {
          'name' => 'type',
          'offset' => '5',
          'type' => '121'
        },
        '3' => {
          'name' => 'record_change_num',
          'offset' => '6',
          'type' => '1011'
        },
        '4' => {
          'name' => 'length',
          'offset' => '8',
          'type' => '1011'
        }
      },
      'Name' => 'struct pldm_value_pdr_hdr',
      'Size' => '12',
      'Type' => 'Struct'
    },
    '92331' => {
      'Header' => 'platform.h',
      'Line' => '797',
      'Memb' => {
        '0' => {
          'name' => 'entity_instance_num',
          'offset' => '0',
          'type' => '1011'
        },
        '1' => {
          'name' => 'entity_instance',
          'offset' => '0',
          'type' => '1011'
        }
      },
      'Name' => 'anon-union-platform.h-797',
      'Size' => '2',
      'Type' => 'Union'
    },
    '92365' => {
      'Header' => 'platform.h',
      'Line' => '792',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '92246'
        },
        '1' => {
          'name' => 'terminus_handle',
          'offset' => '18',
          'type' => '1011'
        },
        '2' => {
          'name' => 'sensor_id',
          'offset' => '20',
          'type' => '1011'
        },
        '3' => {
          'name' => 'entity_type',
          'offset' => '22',
          'type' => '1011'
        },
        '4' => {
          'name' => 'unnamed0',
          'offset' => '24',
          'type' => '92331'
        },
        '5' => {
          'name' => 'container_id',
          'offset' => '32',
          'type' => '1011'
        },
        '6' => {
          'name' => 'sensor_init',
          'offset' => '34',
          'type' => '121'
        },
        '7' => {
          'name' => 'sensor_auxiliary_names_pdr',
          'offset' => '35',
          'type' => '29889'
        },
        '8' => {
          'name' => 'base_unit',
          'offset' => '36',
          'type' => '121'
        },
        '9' => {
          'name' => 'unit_modifier',
          'offset' => '37',
          'type' => '89081'
        },
        '10' => {
          'name' => 'rate_unit',
          'offset' => '38',
          'type' => '121'
        },
        '11' => {
          'name' => 'base_oem_unit_handle',
          'offset' => '39',
          'type' => '121'
        },
        '12' => {
          'name' => 'aux_unit',
          'offset' => '40',
          'type' => '121'
        },
        '13' => {
          'name' => 'aux_unit_modifier',
          'offset' => '41',
          'type' => '89081'
        },
        '14' => {
          'name' => 'aux_rate_unit',
          'offset' => '48',
          'type' => '121'
        },
        '15' => {
          'name' => 'rel',
          'offset' => '49',
          'type' => '121'
        },
        '16' => {
          'name' => 'aux_oem_unit_handle',
          'offset' => '50',
          'type' => '121'
        },
        '17' => {
          'name' => 'is_linear',
          'offset' => '51',
          'type' => '29889'
        },
        '18' => {
          'name' => 'sensor_data_size',
          'offset' => '52',
          'type' => '121'
        },
        '19' => {
          'name' => 'resolution',
          'offset' => '54',
          'type' => '89370'
        },
        '20' => {
          'name' => 'offset',
          'offset' => '64',
          'type' => '89370'
        },
        '21' => {
          'name' => 'accuracy',
          'offset' => '68',
          'type' => '1011'
        },
        '22' => {
          'name' => 'plus_tolerance',
          'offset' => '70',
          'type' => '121'
        },
        '23' => {
          'name' => 'minus_tolerance',
          'offset' => '71',
          'type' => '121'
        },
        '24' => {
          'name' => 'hysteresis',
          'offset' => '72',
          'type' => '92233'
        },
        '25' => {
          'name' => 'supported_thresholds',
          'offset' => '82',
          'type' => '2776'
        },
        '26' => {
          'name' => 'threshold_and_hysteresis_volatility',
          'offset' => '83',
          'type' => '2776'
        },
        '27' => {
          'name' => 'state_transition_interval',
          'offset' => '86',
          'type' => '89370'
        },
        '28' => {
          'name' => 'update_interval',
          'offset' => '96',
          'type' => '89370'
        },
        '29' => {
          'name' => 'max_readable',
          'offset' => '100',
          'type' => '92233'
        },
        '30' => {
          'name' => 'min_readable',
          'offset' => '104',
          'type' => '92233'
        },
        '31' => {
          'name' => 'range_field_format',
          'offset' => '114',
          'type' => '121'
        },
        '32' => {
          'name' => 'range_field_support',
          'offset' => '115',
          'type' => '2776'
        },
        '33' => {
          'name' => 'nominal_value',
          'offset' => '118',
          'type' => '91634'
        },
        '34' => {
          'name' => 'normal_max',
          'offset' => '128',
          'type' => '91634'
        },
        '35' => {
          'name' => 'normal_min',
          'offset' => '132',
          'type' => '91634'
        },
        '36' => {
          'name' => 'warning_high',
          'offset' => '136',
          'type' => '91634'
        },
        '37' => {
          'name' => 'warning_low',
          'offset' => '146',
          'type' => '91634'
        },
        '38' => {
          'name' => 'critical_high',
          'offset' => '150',
          'type' => '91634'
        },
        '39' => {
          'name' => 'critical_low',
          'offset' => '256',
          'type' => '91634'
        },
        '40' => {
          'name' => 'fatal_high',
          'offset' => '260',
          'type' => '91634'
        },
        '41' => {
          'name' => 'fatal_low',
          'offset' => '264',
          'type' => '91634'
        }
      },
      'Name' => 'struct pldm_numeric_sensor_value_pdr',
      'Size' => '112',
      'Type' => 'Struct'
    },
    '92958' => {
      'BaseType' => '90027',
      'Header' => 'platform.h',
      'Line' => '840',
      'Name' => 'pldm_utf16be',
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '92971' => {
      'Header' => 'platform.h',
      'Line' => '842',
      'Memb' => {
        '0' => {
          'name' => 'tag',
          'offset' => '0',
          'type' => '982'
        },
        '1' => {
          'name' => 'name',
          'offset' => '8',
          'type' => '93013'
        }
      },
      'Name' => 'struct pldm_entity_auxiliary_name',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '93013' => {
      'BaseType' => '92958',
      'Name' => 'pldm_utf16be*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '93018' => {
      'Header' => 'platform.h',
      'Line' => '852',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '92246'
        },
        '1' => {
          'name' => 'container',
          'offset' => '18',
          'type' => '60129'
        },
        '2' => {
          'name' => 'shared_name_count',
          'offset' => '24',
          'type' => '121'
        },
        '3' => {
          'name' => 'name_string_count',
          'offset' => '25',
          'type' => '121'
        },
        '4' => {
          'name' => 'names',
          'offset' => '36',
          'type' => '93132'
        },
        '5' => {
          'name' => 'auxiliary_name_data_size',
          'offset' => '50',
          'type' => '1145'
        },
        '6' => {
          'name' => 'auxiliary_name_data',
          'offset' => '64',
          'type' => '93137'
        }
      },
      'Name' => 'struct pldm_entity_auxiliary_names_pdr',
      'Size' => '40',
      'Type' => 'Struct'
    },
    '93132' => {
      'BaseType' => '92971',
      'Name' => 'struct pldm_entity_auxiliary_name*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '93137' => {
      'BaseType' => '114',
      'Name' => 'char[]',
      'Size' => '8',
      'Type' => 'Array'
    },
    '93152' => {
      'Header' => 'platform.h',
      'Line' => '882',
      'Memb' => {
        '0' => {
          'name' => 'state_set_id',
          'offset' => '0',
          'type' => '1011'
        },
        '1' => {
          'name' => 'possible_states_size',
          'offset' => '2',
          'type' => '121'
        },
        '2' => {
          'name' => 'states',
          'offset' => '3',
          'type' => '91261'
        }
      },
      'Name' => 'struct state_effecter_possible_states',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '93209' => {
      'BaseType' => '93152',
      'Name' => 'struct state_effecter_possible_states const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '93214' => {
      'Header' => 'platform.h',
      'Line' => '930',
      'Memb' => {
        '0' => {
          'name' => 'set_request',
          'offset' => '0',
          'type' => '121'
        },
        '1' => {
          'name' => 'effecter_state',
          'offset' => '1',
          'type' => '121'
        }
      },
      'Name' => 'struct state_field_for_state_effecter_set',
      'Size' => '2',
      'Type' => 'Struct'
    },
    '93257' => {
      'BaseType' => '93214',
      'Header' => 'platform.h',
      'Line' => '933',
      'Name' => 'set_effecter_state_field',
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '93270' => {
      'Header' => 'platform.h',
      'Line' => '939',
      'Memb' => {
        '0' => {
          'name' => 'sensor_op_state',
          'offset' => '0',
          'type' => '121'
        },
        '1' => {
          'name' => 'present_state',
          'offset' => '1',
          'type' => '121'
        },
        '2' => {
          'name' => 'previous_state',
          'offset' => '2',
          'type' => '121'
        },
        '3' => {
          'name' => 'event_state',
          'offset' => '3',
          'type' => '121'
        }
      },
      'Name' => 'struct state_field_for_get_state_sensor_readings',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '93341' => {
      'BaseType' => '93270',
      'Header' => 'platform.h',
      'Line' => '947',
      'Name' => 'get_sensor_state_field',
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '93354' => {
      'Header' => 'platform.h',
      'Line' => '953',
      'Memb' => {
        '0' => {
          'name' => 'effecter_op_state',
          'offset' => '0',
          'type' => '121'
        },
        '1' => {
          'name' => 'pending_state',
          'offset' => '1',
          'type' => '121'
        },
        '2' => {
          'name' => 'present_state',
          'offset' => '2',
          'type' => '121'
        }
      },
      'Name' => 'struct state_field_for_get_state_effecter_states',
      'Size' => '3',
      'Type' => 'Struct'
    },
    '93411' => {
      'BaseType' => '93354',
      'Header' => 'platform.h',
      'Line' => '957',
      'Name' => 'get_effecter_state_field',
      'Size' => '3',
      'Type' => 'Typedef'
    },
    '94140' => {
      'Header' => 'platform.h',
      'Line' => '1102',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '121'
        },
        '1' => {
          'name' => 'comp_effecter_count',
          'offset' => '1',
          'type' => '121'
        },
        '2' => {
          'name' => 'field',
          'offset' => '2',
          'type' => '94197'
        }
      },
      'Name' => 'struct pldm_get_state_effecter_states_resp',
      'Size' => '26',
      'Type' => 'Struct'
    },
    '94197' => {
      'BaseType' => '93411',
      'Name' => 'get_effecter_state_field[8]',
      'Size' => '24',
      'Type' => 'Array'
    },
    '94213' => {
      'Header' => 'platform.h',
      'Line' => '1112',
      'Memb' => {
        '0' => {
          'name' => 'sensor_id',
          'offset' => '0',
          'type' => '1011'
        },
        '1' => {
          'name' => 'sensor_event_class_type',
          'offset' => '2',
          'type' => '121'
        },
        '2' => {
          'name' => 'event_class',
          'offset' => '3',
          'type' => '3364'
        }
      },
      'Name' => 'struct pldm_sensor_event_data',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '94327' => {
      'Header' => 'platform.h',
      'Line' => '1152',
      'Memb' => {
        '0' => {
          'name' => 'format_version',
          'offset' => '0',
          'type' => '121'
        },
        '1' => {
          'name' => 'event_id',
          'offset' => '2',
          'type' => '1011'
        },
        '2' => {
          'name' => 'data_transfer_handle',
          'offset' => '4',
          'type' => '1023'
        }
      },
      'Name' => 'struct pldm_message_poll_event',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '94389' => {
      'Header' => 'platform.h',
      'Line' => '1162',
      'Memb' => {
        '0' => {
          'name' => 'format_version',
          'offset' => '0',
          'type' => '121'
        },
        '1' => {
          'name' => 'format_type',
          'offset' => '1',
          'type' => '121'
        },
        '2' => {
          'name' => 'event_data_length',
          'offset' => '2',
          'type' => '1011'
        },
        '3' => {
          'name' => 'event_data',
          'offset' => '4',
          'type' => '94460'
        }
      },
      'Name' => 'struct pldm_platform_cper_event',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '94460' => {
      'BaseType' => '121',
      'Name' => 'uint8_t[]',
      'Size' => '8',
      'Type' => 'Array'
    },
    '94616' => {
      'Header' => 'platform.h',
      'Line' => '1222',
      'Memb' => {
        '0' => {
          'name' => 'event_data_format',
          'offset' => '0',
          'type' => '121'
        },
        '1' => {
          'name' => 'number_of_change_records',
          'offset' => '1',
          'type' => '121'
        },
        '2' => {
          'name' => 'change_records',
          'offset' => '2',
          'type' => '3364'
        }
      },
      'Name' => 'struct pldm_pdr_repository_chg_event_data',
      'Size' => '3',
      'Type' => 'Struct'
    },
    '95240' => {
      'BaseType' => '94389',
      'Name' => 'struct pldm_platform_cper_event*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '97040' => {
      'BaseType' => '93018',
      'Name' => 'struct pldm_entity_auxiliary_names_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '102768' => {
      'BaseType' => '94140',
      'Name' => 'struct pldm_get_state_effecter_states_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '132501' => {
      'BaseType' => '13089',
      'Name' => 'size_t*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '134291' => {
      'BaseType' => '94327',
      'Name' => 'struct pldm_message_poll_event*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '135292' => {
      'BaseType' => '135302',
      'Name' => 'uint32_t const*const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '135297' => {
      'BaseType' => '29848',
      'Name' => 'uint32_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '135302' => {
      'BaseType' => '135297',
      'Name' => 'uint32_t const*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '135307' => {
      'BaseType' => '94616',
      'Name' => 'struct pldm_pdr_repository_chg_event_data*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '165523' => {
      'BaseType' => '92365',
      'Name' => 'struct pldm_numeric_sensor_value_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '178224' => {
      'BaseType' => '94213',
      'Name' => 'struct pldm_sensor_event_data*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '178229' => {
      'BaseType' => '178224',
      'Name' => 'struct pldm_sensor_event_data*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '180457' => {
      'BaseType' => '93341',
      'Name' => 'get_sensor_state_field*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '195689' => {
      'BaseType' => '93257',
      'Name' => 'set_effecter_state_field*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '196665' => {
      'BaseType' => '91045',
      'Name' => 'struct pldm_state_sensor_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '196670' => {
      'BaseType' => '196665',
      'Name' => 'struct pldm_state_sensor_pdr*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '196675' => {
      'BaseType' => '91256',
      'Name' => 'struct state_sensor_possible_states const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '196680' => {
      'BaseType' => '196675',
      'Name' => 'struct state_sensor_possible_states const*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '196855' => {
      'BaseType' => '91277',
      'Name' => 'struct pldm_state_effecter_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '196860' => {
      'BaseType' => '196855',
      'Name' => 'struct pldm_state_effecter_pdr*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '196865' => {
      'BaseType' => '93209',
      'Name' => 'struct state_effecter_possible_states const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '196870' => {
      'BaseType' => '196865',
      'Name' => 'struct state_effecter_possible_states const*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '199848' => {
      'Line' => '19',
      'Memb' => {
        '0' => {
          'name' => 'prev',
          'offset' => '0',
          'type' => '187'
        },
        '1' => {
          'name' => 'allocations',
          'offset' => '4',
          'type' => '1023'
        }
      },
      'Name' => 'struct pldm_tid_state',
      'PrivateABI' => 1,
      'Size' => '8',
      'Source' => 'instance-id.c',
      'Type' => 'Struct'
    },
    '199887' => {
      'Line' => '24',
      'Memb' => {
        '0' => {
          'name' => 'state',
          'offset' => '0',
          'type' => '199929'
        },
        '1' => {
          'name' => 'lock_db_fd',
          'offset' => '8264',
          'type' => '100'
        }
      },
      'Name' => 'struct pldm_instance_db',
      'PrivateABI' => 1,
      'Size' => '2052',
      'Source' => 'instance-id.c',
      'Type' => 'Struct'
    },
    '199929' => {
      'BaseType' => '199848',
      'Name' => 'struct pldm_tid_state[256]',
      'Size' => '2048',
      'Type' => 'Array'
    },
    '200485' => {
      'BaseType' => '199887',
      'Name' => 'struct pldm_instance_db*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '200872' => {
      'BaseType' => '187',
      'Name' => 'pldm_instance_id_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '201048' => {
      'BaseType' => '200485',
      'Name' => 'struct pldm_instance_db**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '201840' => {
      'BaseType' => '121',
      'Header' => 'pldm.h',
      'Line' => '13',
      'Name' => 'mctp_eid_t',
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '201955' => {
      'BaseType' => '284',
      'Header' => 'pldm.h',
      'Line' => '30',
      'Name' => 'pldm_requester_rc_t',
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '201973' => {
      'Line' => '26',
      'Memb' => {
        '0' => {
          'name' => 'transport',
          'offset' => '0',
          'type' => '202046'
        },
        '1' => {
          'name' => 'socket',
          'offset' => '64',
          'type' => '100'
        },
        '2' => {
          'name' => 'tid_eid_map',
          'offset' => '68',
          'type' => '205742'
        },
        '3' => {
          'name' => 'socket_send_buf',
          'offset' => '768',
          'type' => '204662'
        }
      },
      'Name' => 'struct pldm_transport_mctp_demux',
      'PrivateABI' => 1,
      'Size' => '312',
      'Source' => 'mctp-demux.c',
      'Type' => 'Struct'
    },
    '201999' => {
      'BaseType' => '201973',
      'Name' => 'struct pldm_transport_mctp_demux*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '202041' => {
      'BaseType' => '202046',
      'Name' => 'struct pldm_transport*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '202046' => {
      'Header' => 'transport.h',
      'Line' => '18',
      'Memb' => {
        '0' => {
          'name' => 'name',
          'offset' => '0',
          'type' => '3920'
        },
        '1' => {
          'name' => 'version',
          'offset' => '8',
          'type' => '121'
        },
        '2' => {
          'name' => 'recv',
          'offset' => '22',
          'type' => '204973'
        },
        '3' => {
          'name' => 'send',
          'offset' => '36',
          'type' => '205014'
        },
        '4' => {
          'name' => 'init_pollfd',
          'offset' => '50',
          'type' => '205094'
        }
      },
      'Name' => 'struct pldm_transport',
      'PrivateABI' => 1,
      'Size' => '40',
      'Type' => 'Struct'
    },
    '202182' => {
      'BaseType' => '175',
      'Name' => 'pldm_tid_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '202285' => {
      'BaseType' => '201999',
      'Name' => 'struct pldm_transport_mctp_demux**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '204382' => {
      'BaseType' => '46',
      'Header' => 'int-ll64.h',
      'Line' => '21',
      'Name' => '__u8',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '204394' => {
      'BaseType' => '53',
      'Header' => 'int-ll64.h',
      'Line' => '24',
      'Name' => '__u16',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '204662' => {
      'Header' => 'socket.h',
      'Line' => '5',
      'Memb' => {
        '0' => {
          'name' => 'size',
          'offset' => '0',
          'type' => '100'
        },
        '1' => {
          'name' => 'socket',
          'offset' => '4',
          'type' => '100'
        },
        '2' => {
          'name' => 'max_size',
          'offset' => '8',
          'type' => '100'
        }
      },
      'Name' => 'struct pldm_socket_sndbuf',
      'PrivateABI' => 1,
      'Size' => '12',
      'Type' => 'Struct'
    },
    '204973' => {
      'Name' => 'pldm_requester_rc_t(*)(struct pldm_transport*, pldm_tid_t*, void**, size_t*)',
      'Param' => {
        '0' => {
          'type' => '202041'
        },
        '1' => {
          'type' => '202182'
        },
        '2' => {
          'type' => '52619'
        },
        '3' => {
          'type' => '13089'
        }
      },
      'Return' => '201955',
      'Size' => '8',
      'Type' => 'FuncPtr'
    },
    '205014' => {
      'Name' => 'pldm_requester_rc_t(*)(struct pldm_transport*, pldm_tid_t, void const*, size_t)',
      'Param' => {
        '0' => {
          'type' => '202041'
        },
        '1' => {
          'type' => '175'
        },
        '2' => {
          'type' => '2341'
        },
        '3' => {
          'type' => '1145'
        }
      },
      'Return' => '201955',
      'Size' => '8',
      'Type' => 'FuncPtr'
    },
    '205039' => {
      'BaseType' => '205044',
      'Name' => 'struct pollfd*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '205044' => {
      'Header' => 'poll.h',
      'Line' => '36',
      'Memb' => {
        '0' => {
          'name' => 'fd',
          'offset' => '0',
          'type' => '100'
        },
        '1' => {
          'name' => 'events',
          'offset' => '4',
          'type' => '93'
        },
        '2' => {
          'name' => 'revents',
          'offset' => '6',
          'type' => '93'
        }
      },
      'Name' => 'struct pollfd',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Struct'
    },
    '205094' => {
      'Name' => 'int(*)(struct pldm_transport*, struct pollfd*)',
      'Param' => {
        '0' => {
          'type' => '202041'
        },
        '1' => {
          'type' => '205039'
        }
      },
      'Return' => '100',
      'Size' => '8',
      'Type' => 'FuncPtr'
    },
    '205099' => {
      'BaseType' => '53',
      'Header' => 'socket.h',
      'Line' => '10',
      'Name' => '__kernel_sa_family_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '205476' => {
      'Header' => 'mctp.h',
      'Line' => '18',
      'Memb' => {
        '0' => {
          'name' => 's_addr',
          'offset' => '0',
          'type' => '201840'
        }
      },
      'Name' => 'struct mctp_addr',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Struct'
    },
    '205502' => {
      'Header' => 'mctp.h',
      'Line' => '22',
      'Memb' => {
        '0' => {
          'name' => 'smctp_family',
          'offset' => '0',
          'type' => '205099'
        },
        '1' => {
          'name' => '__smctp_pad0',
          'offset' => '2',
          'type' => '204394'
        },
        '2' => {
          'name' => 'smctp_network',
          'offset' => '4',
          'type' => '60'
        },
        '3' => {
          'name' => 'smctp_addr',
          'offset' => '8',
          'type' => '205476'
        },
        '4' => {
          'name' => 'smctp_type',
          'offset' => '9',
          'type' => '204382'
        },
        '5' => {
          'name' => 'smctp_tag',
          'offset' => '16',
          'type' => '204382'
        },
        '6' => {
          'name' => '__smctp_pad1',
          'offset' => '17',
          'type' => '204382'
        }
      },
      'Name' => 'struct sockaddr_mctp',
      'PrivateABI' => 1,
      'Size' => '12',
      'Type' => 'Struct'
    },
    '205606' => {
      'BaseType' => '205502',
      'Name' => 'struct sockaddr_mctp const',
      'Size' => '12',
      'Type' => 'Const'
    },
    '205649' => {
      'Line' => '35',
      'Memb' => {
        '0' => {
          'name' => 'transport',
          'offset' => '0',
          'type' => '202046'
        },
        '1' => {
          'name' => 'socket',
          'offset' => '64',
          'type' => '100'
        },
        '2' => {
          'name' => 'tid_eid_map',
          'offset' => '68',
          'type' => '205742'
        },
        '3' => {
          'name' => 'socket_send_buf',
          'offset' => '768',
          'type' => '204662'
        },
        '4' => {
          'name' => 'bound',
          'offset' => '786',
          'type' => '805'
        },
        '5' => {
          'name' => 'cookie_jar',
          'offset' => '800',
          'type' => '199'
        }
      },
      'Name' => 'struct pldm_transport_af_mctp',
      'PrivateABI' => 1,
      'Size' => '336',
      'Source' => 'af-mctp.c',
      'Type' => 'Struct'
    },
    '205742' => {
      'BaseType' => '175',
      'Name' => 'pldm_tid_t[256]',
      'Size' => '256',
      'Type' => 'Array'
    },
    '206543' => {
      'BaseType' => '205649',
      'Name' => 'struct pldm_transport_af_mctp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '206548' => {
      'BaseType' => '205606',
      'Name' => 'struct sockaddr_mctp const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '206861' => {
      'BaseType' => '206543',
      'Name' => 'struct pldm_transport_af_mctp**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '233358' => {
      'Header' => 'file_io.h',
      'Line' => '32',
      'Memb' => {
        '0' => {
          'name' => 'handle',
          'offset' => '0',
          'type' => '121'
        },
        '1' => {
          'name' => 'length',
          'offset' => '4',
          'type' => '1023'
        },
        '2' => {
          'name' => 'data',
          'offset' => '8',
          'type' => '94460'
        }
      },
      'Name' => 'struct pldm_oem_meta_file_io_write_req',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '233425' => {
      'Header' => 'file_io.h',
      'Line' => '45',
      'Memb' => {
        '0' => {
          'name' => 'transferFlag',
          'offset' => '0',
          'type' => '121'
        },
        '1' => {
          'name' => 'offset',
          'offset' => '2',
          'type' => '1011'
        }
      },
      'Name' => 'struct pldm_oem_meta_file_io_read_data_info',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '233464' => {
      'Header' => 'file_io.h',
      'Line' => '55',
      'Memb' => {
        '0' => {
          'name' => 'size',
          'offset' => '0',
          'type' => '1011'
        },
        '1' => {
          'name' => 'crc32',
          'offset' => '4',
          'type' => '1023'
        }
      },
      'Name' => 'struct pldm_oem_meta_file_io_read_attr_info',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '233503' => {
      'Header' => 'file_io.h',
      'Line' => '70',
      'Memb' => {
        '0' => {
          'name' => 'data',
          'offset' => '0',
          'type' => '233425'
        }
      },
      'Name' => 'anon-union-file_io.h-70',
      'Size' => '4',
      'Type' => 'Union'
    },
    '233521' => {
      'Header' => 'file_io.h',
      'Line' => '65',
      'Memb' => {
        '0' => {
          'name' => 'version',
          'offset' => '0',
          'type' => '1145'
        },
        '1' => {
          'name' => 'handle',
          'offset' => '8',
          'type' => '121'
        },
        '2' => {
          'name' => 'option',
          'offset' => '9',
          'type' => '121'
        },
        '3' => {
          'name' => 'length',
          'offset' => '16',
          'type' => '121'
        },
        '4' => {
          'name' => 'info',
          'offset' => '18',
          'type' => '233503'
        }
      },
      'Name' => 'struct pldm_oem_meta_file_io_read_req',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '233599' => {
      'Header' => 'file_io.h',
      'Line' => '86',
      'Memb' => {
        '0' => {
          'name' => 'attr',
          'offset' => '0',
          'type' => '233464'
        },
        '1' => {
          'name' => 'data',
          'offset' => '0',
          'type' => '233425'
        }
      },
      'Name' => 'anon-union-file_io.h-86',
      'Size' => '8',
      'Type' => 'Union'
    },
    '233627' => {
      'Header' => 'file_io.h',
      'Line' => '80',
      'Memb' => {
        '0' => {
          'name' => 'version',
          'offset' => '0',
          'type' => '1145'
        },
        '1' => {
          'name' => 'completion_code',
          'offset' => '8',
          'type' => '121'
        },
        '2' => {
          'name' => 'handle',
          'offset' => '9',
          'type' => '121'
        },
        '3' => {
          'name' => 'option',
          'offset' => '16',
          'type' => '121'
        },
        '4' => {
          'name' => 'length',
          'offset' => '17',
          'type' => '121'
        },
        '5' => {
          'name' => 'info',
          'offset' => '18',
          'type' => '233599'
        },
        '6' => {
          'name' => 'data',
          'offset' => '32',
          'type' => '94460'
        }
      },
      'Name' => 'struct pldm_oem_meta_file_io_read_resp',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '236136' => {
      'BaseType' => '233627',
      'Name' => 'struct pldm_oem_meta_file_io_read_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '237319' => {
      'BaseType' => '233521',
      'Name' => 'struct pldm_oem_meta_file_io_read_req*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '237753' => {
      'BaseType' => '233358',
      'Name' => 'struct pldm_oem_meta_file_io_write_req*',
      'Size' => '8',
      'Type' => 'Pointer'
    }
  },
  'UndefinedSymbols' => {
    'libpldm.so.0.9.1' => {
      '_ITM_deregisterTMCloneTable' => 0,
      '_ITM_registerTMCloneTable' => 0,
      '__assert_fail@GLIBC_2.2.5' => 0,
      '__cxa_finalize@GLIBC_2.2.5' => 0,
      '__errno_location@GLIBC_2.2.5' => 0,
      '__gmon_start__' => 0,
      '__isoc23_strtol@GLIBC_2.38' => 0,
      '__memcpy_chk@GLIBC_2.3.4' => 0,
      '__recv_chk@GLIBC_2.4' => 0,
      '__recvfrom_chk@GLIBC_2.4' => 0,
      '__stack_chk_fail@GLIBC_2.4' => 0,
      'bind@GLIBC_2.2.5' => 0,
      'calloc@GLIBC_2.2.5' => 0,
      'clock_gettime@GLIBC_2.17' => 0,
      'close@GLIBC_2.2.5' => 0,
      'connect@GLIBC_2.2.5' => 0,
      'dup@GLIBC_2.2.5' => 0,
      'fclose@GLIBC_2.2.5' => 0,
      'fcntl64@GLIBC_2.28' => 0,
      'fgets@GLIBC_2.2.5' => 0,
      'fopen64@GLIBC_2.2.5' => 0,
      'free@GLIBC_2.2.5' => 0,
      'getsockopt@GLIBC_2.2.5' => 0,
      'malloc@GLIBC_2.2.5' => 0,
      'memcmp@GLIBC_2.2.5' => 0,
      'memcpy@GLIBC_2.14' => 0,
      'memmem@GLIBC_2.2.5' => 0,
      'open64@GLIBC_2.2.5' => 0,
      'poll@GLIBC_2.2.5' => 0,
      'ppoll@GLIBC_2.4' => 0,
      'recv@GLIBC_2.2.5' => 0,
      'recvmsg@GLIBC_2.2.5' => 0,
      'sendmsg@GLIBC_2.2.5' => 0,
      'sendto@GLIBC_2.2.5' => 0,
      'setsockopt@GLIBC_2.2.5' => 0,
      'socket@GLIBC_2.2.5' => 0,
      'stat64@GLIBC_2.33' => 0,
      'strlen@GLIBC_2.2.5' => 0,
      'strnlen@GLIBC_2.2.5' => 0,
      'timerfd_create@GLIBC_2.8' => 0,
      'timerfd_settime@GLIBC_2.8' => 0,
      'write@GLIBC_2.2.5' => 0
    }
  },
  'WordSize' => '8'
};
