$VAR1 = {
  'ABI_DUMPER_VERSION' => '1.4',
  'ABI_DUMP_VERSION' => '3.5',
  'Arch' => 'x86_64',
  'GccVersion' => '15.0.1',
  'Headers' => {
    'af-mctp.h' => 1,
    'base.h' => 1,
    'bios.h' => 1,
    'bios_table.h' => 1,
    'file.h' => 1,
    'file_io.h' => 1,
    'firmware_update.h' => 1,
    'fru.h' => 1,
    'host.h' => 1,
    'instance-id.h' => 1,
    'mctp-demux.h' => 1,
    'pdr.h' => 1,
    'platform.h' => 1,
    'transport.h' => 1,
    'utils.h' => 1
  },
  'Language' => 'C',
  'LibraryName' => 'libpldm.so.0.14.0',
  'LibraryVersion' => '0.14.0',
  'NameSpaces' => {},
  'Needed' => {
    'libc.so.6' => 1
  },
  'PublicABI' => '1',
  'Sources' => {},
  'SymbolInfo' => {
    '1450' => {
      'Header' => 'base.h',
      'Param' => {
        '0' => {
          'name' => 'instance_id',
          'type' => '135'
        },
        '1' => {
          'name' => 'type',
          'type' => '135'
        },
        '2' => {
          'name' => 'command',
          'type' => '135'
        },
        '3' => {
          'name' => 'cc',
          'type' => '135'
        },
        '4' => {
          'name' => 'msg',
          'type' => '1492'
        }
      },
      'Return' => '53',
      'ShortName' => 'encode_cc_only_resp'
    },
    '1497' => {
      'Header' => 'base.h',
      'Param' => {
        '0' => {
          'name' => 'instance_id',
          'type' => '135'
        },
        '1' => {
          'name' => 'completion_code',
          'type' => '135'
        },

      'pldm_entity_association_pdr_extract' => 1,
      'pldm_entity_association_tree_add' => 1,
      'pldm_entity_association_tree_add_entity' => 1,
      'pldm_entity_association_tree_copy_root' => 1,
      'pldm_entity_association_tree_destroy' => 1,
      'pldm_entity_association_tree_destroy_root' => 1,
      'pldm_entity_association_tree_find' => 1,
      'pldm_entity_association_tree_find_with_locality' => 1,
      'pldm_entity_association_tree_init' => 1,
      'pldm_entity_association_tree_visit' => 1,
      'pldm_entity_extract' => 1,
      'pldm_entity_get_num_children' => 1,
      'pldm_entity_get_parent' => 1,
      'pldm_entity_is_exist_parent' => 1,
      'pldm_entity_is_node_parent' => 1,
      'pldm_entity_node_get_remote_container_id' => 1,
      'pldm_find_entity_ref_in_tree' => 1,
      'pldm_instance_db_destroy' => 1,
      'pldm_instance_db_init' => 1,
      'pldm_instance_db_init_default' => 1,
      'pldm_instance_id_alloc' => 1,
      'pldm_instance_id_free' => 1,
      'pldm_is_current_parent_child' => 1,
      'pldm_is_empty_entity_assoc_tree' => 1,
      'pldm_msg_hdr_correlate_response' => 1,
      'pldm_oem_meta_file_io_read_resp_data' => 1,
      'pldm_oem_meta_file_io_write_req_data' => 1,
      'pldm_package_component_image_information_iter_init' => 1,
      'pldm_package_downstream_device_id_record_iter_init' => 1,
      'pldm_package_firmware_device_id_record_iter_init' => 1,
      'pldm_pdr_add' => 1,
      'pldm_pdr_add_fru_record_set' => 1,
      'pldm_pdr_delete_by_record_handle' => 1,
      'pldm_pdr_destroy' => 1,
      'pldm_pdr_find_last_in_range' => 1,
      'pldm_pdr_find_record' => 1,
      'pldm_pdr_find_record_by_type' => 1,
      'pldm_pdr_fru_record_set_find_by_rsi' => 1,
      'pldm_pdr_get_next_record' => 1,
      'pldm_pdr_get_record_count' => 1,
      'pldm_pdr_get_record_handle' => 1,
      'pldm_pdr_get_repo_size' => 1,
      'pldm_pdr_init' => 1,
      'pldm_pdr_record_is_remote' => 1,
      'pldm_pdr_remove_pdrs_by_terminus_handle' => 1,
      'pldm_pdr_remove_remote_pdrs' => 1,
      'pldm_pdr_update_TL_pdr' => 1,
      'pldm_platform_cper_event_event_data' => 1,
      'pldm_transport_af_mctp_bind' => 1,
      'pldm_transport_af_mctp_core' => 1,
      'pldm_transport_af_mctp_destroy' => 1,
      'pldm_transport_af_mctp_init' => 1,
      'pldm_transport_af_mctp_init_pollfd' => 1,
      'pldm_transport_af_mctp_map_tid' => 1,
      'pldm_transport_af_mctp_unmap_tid' => 1,
      'pldm_transport_mctp_demux_core' => 1,
      'pldm_transport_mctp_demux_destroy' => 1,
      'pldm_transport_mctp_demux_init' => 1,
      'pldm_transport_mctp_demux_init_pollfd' => 1,
      'pldm_transport_mctp_demux_map_tid' => 1,
      'pldm_transport_mctp_demux_unmap_tid' => 1,
      'pldm_transport_poll' => 1,
      'pldm_transport_recv_msg' => 1,
      'pldm_transport_send_msg' => 1,
      'pldm_transport_send_recv_msg' => 1,
      'unpack_pldm_header' => 1,
      'ver2str' => 1
    }
  },
  'Target' => 'unix',
  'TypeInfo' => {
    '1' => {
      'Name' => 'void',
      'Type' => 'Intrinsic'
    },
    '46' => {
      'Name' => 'char',
      'Size' => '1',
      'Type' => 'Intrinsic'
    },
    '53' => {
      'Name' => 'int',
      'Size' => '4',
      'Type' => 'Intrinsic'
    },
    '60' => {
      'Name' => 'unsigned char',
      'Size' => '1',
      'Type' => 'Intrinsic'
    },
    '67' => {
      'Name' => 'unsigned short',
      'Size' => '2',
      'Type' => 'Intrinsic'
    },
    '74' => {
      'Name' => 'unsigned int',
      'Size' => '4',
      'Type' => 'Intrinsic'
    },
    '81' => {
      'Name' => 'unsigned long',
      'Size' => '8',
      'Type' => 'Intrinsic'
    },
    '88' => {
      'Name' => 'signed char',
      'Size' => '1',
      'Type' => 'Intrinsic'
    },
    '95' => {
      'BaseType' => '60',
      'Header' => undef,
      'Line' => '38',
      'Name' => '__uint8_t',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '107' => {
      'Name' => 'short',
      'Size' => '2',
      'Type' => 'Intrinsic'
    },
    '114' => {
      'BaseType' => '74',
      'Header' => undef,
      'Line' => '42',
      'Name' => '__uint32_t',
      'PrivateABI' => 1,
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '126' => {
      'Name' => 'long',
      'Size' => '8',
      'Type' => 'Intrinsic'
    },
    '133' => {
      'BaseType' => '1',
      'Name' => 'void*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '135' => {
      'BaseType' => '95',
      'Header' => undef,
      'Line' => '24',
      'Name' => 'uint8_t',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '147' => {
      'BaseType' => '114',
      'Header' => undef,
      'Line' => '26',
      'Name' => 'uint32_t',
      'PrivateABI' => 1,
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '159' => {
      'BaseType' => '147',
      'Name' => 'uint32_t const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '164' => {
      'BaseType' => '81',
      'Header' => undef,
      'Line' => '209',
      'Name' => 'size_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '365' => {
      'Header' => 'pldm_types.h',
      'Line' => '29',
      'Memb' => {
        '0' => {
          'name' => 'alpha',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'update',
          'offset' => '1',
          'type' => '135'
        },
        '2' => {
          'name' => 'minor',
          'offset' => '2',
          'type' => '135'
        },
        '3' => {
          'name' => 'major',
          'offset' => '3',
          'type' => '135'
        }
      },
      'Name' => 'struct pldm_version',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '431' => {
      'BaseType' => '365',
      'Header' => 'pldm_types.h',
      'Line' => '34',
      'Name' => 'ver32_t',
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '443' => {
      'BaseType' => '431',
      'Name' => 'ver32_t const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '448' => {
      'Name' => 'float',
      'Size' => '4',
      'Type' => 'Intrinsic'
    },
    '887' => {
      'Header' => 'base.h',
      'Line' => '183',
      'Memb' => {
        '0' => {
          'name' => 'command',
          'offset' => '2',
          'type' => '135'
        }
      },
      'Name' => 'struct pldm_msg_hdr',
      'Size' => '3',
      'Type' => 'Struct'
    },
    '998' => {
      'BaseType' => '887',
      'Name' => 'struct pldm_msg_hdr const',
      'Size' => '3',
      'Type' => 'Const'
    },
    '1003' => {
      'Header' => 'base.h',
      'Line' => '216',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '887'
        },
        '1' => {
          'name' => 'payload',
          'offset' => '3',
          'type' => '1048'
        }
      },
      'Name' => 'struct pldm_msg',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '1043' => {
      'BaseType' => '1003',
      'Name' => 'struct pldm_msg const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '1048' => {
      'BaseType' => '135',
      'Name' => 'uint8_t[1]',
      'Size' => '1',
      'Type' => 'Array'
    },
    '1064' => {
      'Header' => 'base.h',
      'Line' => '283',
      'Memb' => {
        '0' => {
          'name' => 'msg_type',
          'offset' => '0',
          'type' => '875'
        },
        '1' => {
          'name' => 'instance',
          'offset' => '4',
          'type' => '135'
        },
        '2' => {
          'name' => 'pldm_type',
          'offset' => '5',
          'type' => '135'
        },
        '3' => {
          'name' => 'command',
          'offset' => '6',
          'type' => '135'
        },
        '4' => {
          'name' => 'completion_code',
          'offset' => '7',
          'type' => '135'
        }
      },
      'Name' => 'struct pldm_header_info',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '1144' => {
      'BaseType' => '1064',
      'Name' => 'struct pldm_header_info const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '1311' => {
      'BaseType' => '1316',
      'Name' => 'void const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '1316' => {
      'BaseType' => '1',
      'Name' => 'void const',
      'Type' => 'Const'
    },
    '1492' => {
      'BaseType' => '1003',
      'Name' => 'struct pldm_msg*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '1571' => {
      'BaseType' => '1043',
      'Name' => 'struct pldm_msg const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '1576' => {
      'BaseType' => '135',
      'Name' => 'uint8_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '1581' => {
      'BaseType' => '431',
      'Name' => 'ver32_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '1675' => {
      'BaseType' => '443',
      'Name' => 'ver32_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '1722' => {
      'BaseType' => '147',
      'Name' => 'uint32_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '1791' => {
      'BaseType' => '998',
      'Name' => 'struct pldm_msg_hdr const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '1796' => {
      'BaseType' => '1064',
      'Name' => 'struct pldm_header_info*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2751' => {
      'BaseType' => '164',
      'Name' => 'size_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '3211' => {
      'BaseType' => '1144',
      'Name' => 'struct pldm_header_info const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '4869' => {
      'BaseType' => '135',
      'Header' => 'base.h',
      'Line' => '19',
      'Name' => 'pldm_tid_t',
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '4881' => {
      'BaseType' => '135',
      'Header' => 'instance-id.h',
      'Line' => '13',
      'Name' => 'pldm_instance_id_t',
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '4893' => {
      'Header' => undef,
      'Line' => '10',
      'Memb' => {
        '0' => {
          'name' => 'tid',
          'offset' => '0',
          'type' => '4869'
        },
        '1' => {
          'name' => 'instance_id',
          'offset' => '1',
          'type' => '4881'
        },
        '2' => {
          'name' => 'type',
          'offset' => '2',
          'type' => '135'
        },
        '3' => {
          'name' => 'command',
          'offset' => '3',
          'type' => '135'
        },
        '4' => {
          'name' => 'next',
          'offset' => '8',
          'type' => '4973'
        }
      },
      'Name' => 'struct pldm_responder_cookie',
      'PrivateABI' => 1,
      'Size' => '16',
      'Type' => 'Struct'
    },
    '4973' => {
      'BaseType' => '4893',
      'Name' => 'struct pldm_responder_cookie*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '4978' => {
      'Header' => 'pldm.h',
      'Line' => '15',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_REQUESTER_SUCCESS',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_REQUESTER_OPEN_FAIL',
          'value' => '18446744073709551615 (-1)'
        },
        '2' => {
          'name' => 'PLDM_REQUESTER_NOT_PLDM_MSG',
          'value' => '18446744073709551614 (-2)'
        },
        '3' => {
          'name' => 'PLDM_REQUESTER_NOT_RESP_MSG',
          'value' => '18446744073709551613 (-3)'
        },
        '4' => {
          'name' => 'PLDM_REQUESTER_NOT_REQ_MSG',
          'value' => '18446744073709551612 (-4)'
        },
        '5' => {
          'name' => 'PLDM_REQUESTER_RESP_MSG_TOO_SMALL',
          'value' => '18446744073709551611 (-5)'
        },
        '6' => {
          'name' => 'PLDM_REQUESTER_INSTANCE_ID_MISMATCH',
          'value' => '18446744073709551610 (-6)'
        },
        '7' => {
          'name' => 'PLDM_REQUESTER_SEND_FAIL',
          'value' => '18446744073709551609 (-7)'
        },
        '8' => {
          'name' => 'PLDM_REQUESTER_RECV_FAIL',
          'value' => '18446744073709551608 (-8)'
        },
        '9' => {
          'name' => 'PLDM_REQUESTER_INVALID_RECV_LEN',
          'value' => '18446744073709551607 (-9)'
        },
        '10' => {
          'name' => 'PLDM_REQUESTER_SETUP_FAIL',
          'value' => '18446744073709551606 (-10)'
        },
        '11' => {
          'name' => 'PLDM_REQUESTER_INVALID_SETUP',
          'value' => '18446744073709551605 (-11)'
        },
        '12' => {
          'name' => 'PLDM_REQUESTER_POLL_FAIL',
          'value' => '18446744073709551604 (-12)'
        },
        '13' => {
          'name' => 'PLDM_REQUESTER_TRANSPORT_BUSY',
          'value' => '18446744073709551603 (-13)'
        }
      },
      'Name' => 'enum pldm_requester_error_codes',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '5499' => {
      'Name' => '_Bool',
      'Size' => '1',
      'Type' => 'Intrinsic'
    },
    '5621' => {
      'BaseType' => '67',
      'Header' => undef,
      'Line' => '40',
      'Name' => '__uint16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '5659' => {
      'BaseType' => '126',
      'Header' => undef,
      'Line' => '194',
      'Name' => '__ssize_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '5671' => {
      'BaseType' => '46',
      'Name' => 'char*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '5695' => {
      'BaseType' => '135',
      'Name' => 'uint8_t const',
      'Size' => '1',
      'Type' => 'Const'
    },
    '5700' => {
      'BaseType' => '5621',
      'Header' => undef,
      'Line' => '25',
      'Name' => 'uint16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '5832' => {
      'BaseType' => '5659',
      'Header' => undef,
      'Line' => '108',
      'Name' => 'ssize_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '5851' => {
      'BaseType' => '5695',
      'Name' => 'uint8_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '7591' => {
      'BaseType' => '46',
      'Name' => 'char const',
      'Size' => '1',
      'Type' => 'Const'
    },
    '7625' => {
      'BaseType' => '5700',
      'Name' => 'uint16_t const',
      'Size' => '2',
      'Type' => 'Const'
    },
    '7969' => {
      'Header' => 'utils.h',
      'Line' => '20',
      'Memb' => {
        '0' => {
          'name' => 'ptr',
          'offset' => '0',
          'type' => '5851'
        },
        '1' => {
          'name' => 'length',
          'offset' => '8',
          'type' => '164'
        }
      },
      'Name' => 'struct variable_field',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '9033' => {
      'Header' => 'base.h',
      'Line' => '367',
      'Memb' => {
        '0' => {
          'name' => 'pldm_type',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'transfer_opflag',
          'offset' => '1',
          'type' => '135'
        },
        '2' => {
          'name' => 'transfer_ctx',
          'offset' => '4',
          'type' => '147'
        },
        '3' => {
          'name' => 'transfer_handle',
          'offset' => '8',
          'type' => '147'
        },
        '4' => {
          'name' => 'section_offset',
          'offset' => '18',
          'type' => '147'
        },
        '5' => {
          'name' => 'section_length',
          'offset' => '22',
          'type' => '147'
        }
      },
      'Name' => 'struct pldm_base_multipart_receive_req',
      'Size' => '20',
      'Type' => 'Struct'
    },
    '9124' => {
      'BaseType' => '9033',
      'Name' => 'struct pldm_base_multipart_receive_req const',
      'Size' => '20',
      'Type' => 'Const'
    },
    '9129' => {
      'Header' => 'base.h',
      'Line' => '385',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'transfer_flag',
          'offset' => '1',
          'type' => '135'
        },
        '2' => {
          'name' => 'next_transfer_handle',
          'offset' => '4',
          'type' => '147'
        },
        '3' => {
          'name' => 'data',
          'offset' => '8',
          'type' => '7969'
        }
      },
      'Name' => 'struct pldm_base_multipart_receive_resp',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '9199' => {
      'Header' => 'base.h',
      'Line' => '397',
      'Memb' => {
        '0' => {
          'name' => 'requester_part_size',
          'offset' => '0',
          'type' => '5700'
        },
        '1' => {
          'name' => 'requester_protocol_support',
          'offset' => '2',
          'type' => '8743'
        }
      },
      'Name' => 'struct pldm_base_negotiate_transfer_params_req',
      'Size' => '10',
      'Type' => 'Struct'
    },
    '9238' => {
      'BaseType' => '9199',
      'Name' => 'struct pldm_base_negotiate_transfer_params_req const',
      'Size' => '10',
      'Type' => 'Const'
    },
    '9243' => {
      'Header' => 'base.h',
      'Line' => '406',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'responder_part_size',
          'offset' => '2',
          'type' => '5700'
        },
        '2' => {
          'name' => 'responder_protocol_support',
          'offset' => '4',
          'type' => '8743'
        }
      },
      'Name' => 'struct pldm_base_negotiate_transfer_params_resp',
      'Size' => '12',
      'Type' => 'Struct'
    },
    '9332' => {
      'BaseType' => '7591',
      'Name' => 'char const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '11447' => {
      'BaseType' => '9243',
      'Name' => 'struct pldm_base_negotiate_transfer_params_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '16983' => {
      'BaseType' => '9238',
      'Name' => 'struct pldm_base_negotiate_transfer_params_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '24627' => {
      'BaseType' => '9129',
      'Name' => 'struct pldm_base_multipart_receive_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '27469' => {
      'BaseType' => '9124',
      'Name' => 'struct pldm_base_multipart_receive_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '35233' => {
      'BaseType' => '887',
      'Name' => 'struct pldm_msg_hdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '39304' => {
      'BaseType' => '7969',
      'Name' => 'struct variable_field*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '41386' => {
      'BaseType' => '5700',
      'Name' => 'uint16_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '44625' => {
      'BaseType' => '81',
      'Header' => undef,
      'Line' => '45',
      'Name' => '__uint64_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '44719' => {
      'BaseType' => '44625',
      'Header' => undef,
      'Line' => '27',
      'Name' => 'uint64_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '45003' => {
      'Header' => 'bios.h',
      'Line' => '39',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_BIOS_STRING_TABLE',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_BIOS_ATTR_TABLE',
          'value' => '1'
        },
        '2' => {
          'name' => 'PLDM_BIOS_ATTR_VAL_TABLE',
          'value' => '2'
        }
      },
      'Name' => 'enum pldm_bios_table_types',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '45037' => {
      'Header' => 'bios.h',
      'Line' => '48',
      'Memb' => {
        '0' => {
          'name' => 'string_handle',
          'offset' => '0',
          'type' => '5700'
        },
        '1' => {
          'name' => 'string_length',
          'offset' => '2',
          'type' => '5700'
        },
        '2' => {
          'name' => 'name',
          'offset' => '4',
          'type' => '45094'
        }
      },
      'Name' => 'struct pldm_bios_string_table_entry',
      'Size' => '5',
      'Type' => 'Struct'
    },
    '45089' => {
      'BaseType' => '45037',
      'Name' => 'struct pldm_bios_string_table_entry const',
      'Size' => '5',
      'Type' => 'Const'
    },
    '45094' => {
      'BaseType' => '46',
      'Name' => 'char[1]',
      'Size' => '1',
      'Type' => 'Array'
    },
    '45110' => {
      'Header' => 'bios.h',
      'Line' => '54',
      'Memb' => {
        '0' => {
          'name' => 'attr_handle',
          'offset' => '0',
          'type' => '5700'
        },
        '1' => {
          'name' => 'attr_type',
          'offset' => '2',
          'type' => '135'
        },
        '2' => {
          'name' => 'string_handle',
          'offset' => '3',
          'type' => '5700'
        },
        '3' => {
          'name' => 'metadata',
          'offset' => '5',
          'type' => '1048'
        }
      },
      'Name' => 'struct pldm_bios_attr_table_entry',
      'Size' => '6',
      'Type' => 'Struct'
    },
    '45175' => {
      'BaseType' => '45110',
      'Name' => 'struct pldm_bios_attr_table_entry const',
      'Size' => '6',
      'Type' => 'Const'
    },
    '45180' => {
      'Header' => 'bios.h',
      'Line' => '66',
      'Memb' => {
        '0' => {
          'name' => 'attr_handle',
          'offset' => '0',
          'type' => '5700'
        },
        '1' => {
          'name' => 'attr_type',
          'offset' => '2',
          'type' => '135'
        },
        '2' => {
          'name' => 'value',
          'offset' => '3',
          'type' => '1048'
        }
      },
      'Name' => 'struct pldm_bios_attr_val_table_entry',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '45232' => {
      'BaseType' => '45180',
      'Name' => 'struct pldm_bios_attr_val_table_entry const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '45301' => {
      'Header' => 'bios_table.h',
      'Line' => '206',
      'Memb' => {
        '0' => {
          'name' => 'name_handle',
          'offset' => '0',
          'type' => '5700'
        },
        '1' => {
          'name' => 'read_only',
          'offset' => '2',
          'type' => '5499'
        },
        '2' => {
          'name' => 'pv_num',
          'offset' => '3',
          'type' => '135'
        },
        '3' => {
          'name' => 'pv_handle',
          'offset' => '8',
          'type' => '45404'
        },
        '4' => {
          'name' => 'def_num',
          'offset' => '22',
          'type' => '135'
        },
        '5' => {
          'name' => 'def_index',
          'offset' => '36',
          'type' => '5851'
        }
      },
      'Name' => 'struct pldm_bios_table_attr_entry_enum_info',
      'Size' => '32',
      'Type' => 'Struct'
    },
    '45392' => {
      'BaseType' => '45301',
      'Name' => 'struct pldm_bios_table_attr_entry_enum_info const',
      'Size' => '32',
      'Type' => 'Const'
    },
    '45404' => {
      'BaseType' => '7625',
      'Name' => 'uint16_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '45409' => {
      'Header' => 'bios_table.h',
      'Line' => '294',
      'Memb' => {
        '0' => {
          'name' => 'name_handle',
          'offset' => '0',
          'type' => '5700'
        },
        '1' => {
          'name' => 'read_only',
          'offset' => '2',
          'type' => '5499'
        },
        '2' => {
          'name' => 'string_type',
          'offset' => '3',
          'type' => '135'
        },
        '3' => {
          'name' => 'min_length',
          'offset' => '4',
          'type' => '5700'
        },
        '4' => {
          'name' => 'max_length',
          'offset' => '6',
          'type' => '5700'
        },
        '5' => {
          'name' => 'def_length',
          'offset' => '8',
          'type' => '5700'
        },
        '6' => {
          'name' => 'def_string',
          'offset' => '22',
          'type' => '9332'
        }
      },
      'Name' => 'struct pldm_bios_table_attr_entry_string_info',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '45521' => {
      'BaseType' => '45409',
      'Name' => 'struct pldm_bios_table_attr_entry_string_info const',
      'Size' => '24',
      'Type' => 'Const'
    },
    '45531' => {
      'Header' => 'bios_table.h',
      'Line' => '384',
      'Memb' => {
        '0' => {
          'name' => 'name_handle',
          'offset' => '0',
          'type' => '5700'
        },
        '1' => {
          'name' => 'read_only',
          'offset' => '2',
          'type' => '5499'
        },
        '2' => {
          'name' => 'lower_bound',
          'offset' => '8',
          'type' => '44719'
        },
        '3' => {
          'name' => 'upper_bound',
          'offset' => '22',
          'type' => '44719'
        },
        '4' => {
          'name' => 'scalar_increment',
          'offset' => '36',
          'type' => '147'
        },
        '5' => {
          'name' => 'default_value',
          'offset' => '50',
          'type' => '44719'
        }
      },
      'Name' => 'struct pldm_bios_table_attr_entry_integer_info',
      'Size' => '40',
      'Type' => 'Struct'
    },
    '45629' => {
      'BaseType' => '45531',
      'Name' => 'struct pldm_bios_table_attr_entry_integer_info const',
      'Size' => '40',
      'Type' => 'Const'
    },
    '45861' => {
      'Name' => 'ssize_t(*)(void const*)',
      'Param' => {
        '0' => {
          'type' => '1311'
        }
      },
      'Return' => '5832',
      'Size' => '8',
      'Type' => 'FuncPtr'
    },
    '45931' => {
      'Header' => undef,
      'Line' => '957',
      'Memb' => {
        '0' => {
          'name' => 'table_data',
          'offset' => '0',
          'type' => '5851'
        },
        '1' => {
          'name' => 'table_len',
          'offset' => '8',
          'type' => '164'
        },
        '2' => {
          'name' => 'current_pos',
          'offset' => '22',
          'type' => '164'
        },
        '3' => {
          'name' => 'entry_length_handler',
          'offset' => '36',
          'type' => '45861'
        }
      },
      'Name' => 'struct pldm_bios_table_iter',
      'PrivateABI' => 1,
      'Size' => '32',
      'Type' => 'Struct'
    },
    '46001' => {
      'BaseType' => '45931',
      'Name' => 'struct pldm_bios_table_iter const',
      'Size' => '32',
      'Type' => 'Const'
    },
    '47073' => {
      'BaseType' => '45931',
      'Name' => 'struct pldm_bios_table_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '47078' => {
      'BaseType' => '45232',
      'Name' => 'struct pldm_bios_attr_val_table_entry const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '47492' => {
      'BaseType' => '45175',
      'Name' => 'struct pldm_bios_attr_table_entry const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '48095' => {
      'BaseType' => '45089',
      'Name' => 'struct pldm_bios_string_table_entry const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '49258' => {
      'BaseType' => '46001',
      'Name' => 'struct pldm_bios_table_iter const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '53297' => {
      'BaseType' => '44719',
      'Name' => 'uint64_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '53574' => {
      'BaseType' => '45629',
      'Name' => 'struct pldm_bios_table_attr_entry_integer_info const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '53883' => {
      'BaseType' => '9332',
      'Name' => 'char const**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '55012' => {
      'BaseType' => '45521',
      'Name' => 'struct pldm_bios_table_attr_entry_string_info const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '56466' => {
      'BaseType' => '45392',
      'Name' => 'struct pldm_bios_table_attr_entry_enum_info const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '59721' => {
      'Header' => 'file.h',
      'Line' => '53',
      'Memb' => {
        '0' => {
          'name' => 'file_identifier',
          'offset' => '0',
          'type' => '5700'
        },
        '1' => {
          'name' => 'file_attribute',
          'offset' => '2',
          'type' => '58952'
        }
      },
      'Name' => 'struct pldm_file_df_open_req',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '59761' => {
      'BaseType' => '59721',
      'Name' => 'struct pldm_file_df_open_req const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '59766' => {
      'Header' => 'file.h',
      'Line' => '62',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'file_descriptor',
          'offset' => '2',
          'type' => '5700'
        }
      },
      'Name' => 'struct pldm_file_df_open_resp',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '59811' => {
      'Header' => 'file.h',
      'Line' => '71',
      'Memb' => {
        '0' => {
          'name' => 'file_descriptor',
          'offset' => '0',
          'type' => '5700'
        },
        '1' => {
          'name' => 'df_close_options',
          'offset' => '2',
          'type' => '58952'
        }
      },
      'Name' => 'struct pldm_file_df_close_req',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '59851' => {
      'BaseType' => '59811',
      'Name' => 'struct pldm_file_df_close_req const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '59856' => {
      'Header' => 'file.h',
      'Line' => '80',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '135'
        }
      },
      'Name' => 'struct pldm_file_df_close_resp',
      'Size' => '1',
      'Type' => 'Struct'
    },
    '59888' => {
      'Header' => 'file.h',
      'Line' => '88',
      'Memb' => {
        '0' => {
          'name' => 'file_descriptor',
          'offset' => '0',
          'type' => '5700'
        },
        '1' => {
          'name' => 'requester_max_interval',
          'offset' => '4',
          'type' => '147'
        }
      },
      'Name' => 'struct pldm_file_df_heartbeat_req',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '59928' => {
      'BaseType' => '59888',
      'Name' => 'struct pldm_file_df_heartbeat_req const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '59933' => {
      'Header' => 'file.h',
      'Line' => '97',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'responder_max_interval',
          'offset' => '4',
          'type' => '147'
        }
      },
      'Name' => 'struct pldm_file_df_heartbeat_resp',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '61500' => {
      'BaseType' => '59933',
      'Name' => 'struct pldm_file_df_heartbeat_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '63118' => {
      'BaseType' => '59928',
      'Name' => 'struct pldm_file_df_heartbeat_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '63271' => {
      'BaseType' => '59856',
      'Name' => 'struct pldm_file_df_close_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '67515' => {
      'BaseType' => '59851',
      'Name' => 'struct pldm_file_df_close_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '69233' => {
      'BaseType' => '59766',
      'Name' => 'struct pldm_file_df_open_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '73780' => {
      'BaseType' => '59761',
      'Name' => 'struct pldm_file_df_open_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '75502' => {
      'BaseType' => '135',
      'Header' => 'pldm_types.h',
      'Line' => '36',
      'Name' => 'bool8_t',
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '77257' => {
      'BaseType' => '77269',
      'Header' => 'pldm_types.h',
      'Line' => '170',
      'Name' => 'pldm_uuid',
      'Size' => '16',
      'Type' => 'Typedef'
    },
    '77269' => {
      'BaseType' => '135',
      'Name' => 'uint8_t[16]',
      'Size' => '16',
      'Type' => 'Array'
    },
    '77285' => {
      'BaseType' => '77269',
      'Name' => 'uint8_t[16] const',
      'Size' => '16',
      'Type' => 'Const'
    },
    '77314' => {
      'BaseType' => '164',
      'Name' => 'size_t const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '77379' => {
      'BaseType' => '7969',
      'Name' => 'struct variable_field const',
      'Size' => '16',
      'Type' => 'Const'
    },
    '79505' => {
      'BaseType' => '135',
      'Name' => 'uint8_t[8]',
      'Size' => '8',
      'Type' => 'Array'
    },
    '79521' => {
      'Header' => 'firmware_update.h',
      'Line' => '466',
      'Memb' => {
        '0' => {
          'name' => 'uuid',
          'offset' => '0',
          'type' => '77269'
        },
        '1' => {
          'name' => 'package_header_format_version',
          'offset' => '22',
          'type' => '135'
        },
        '2' => {
          'name' => 'package_header_size',
          'offset' => '23',
          'type' => '5700'
        },
        '3' => {
          'name' => 'package_release_date_time',
          'offset' => '25',
          'type' => '79634'
        },
        '4' => {
          'name' => 'component_bitmap_bit_length',
          'offset' => '50',
          'type' => '5700'
        },
        '5' => {
          'name' => 'package_version_string_type',
          'offset' => '52',
          'type' => '135'
        },
        '6' => {
          'name' => 'package_version_string_length',
          'offset' => '53',
          'type' => '135'
        }
      },
      'Name' => 'struct pldm_package_header_information',
      'Size' => '36',
      'Type' => 'Struct'
    },
    '79634' => {
      'BaseType' => '135',
      'Name' => 'uint8_t[13]',
      'Size' => '13',
      'Type' => 'Array'
    },
    '79650' => {
      'Header' => 'firmware_update.h',
      'Line' => '480',
      'Memb' => {
        '0' => {
          'name' => 'record_length',
          'offset' => '0',
          'type' => '5700'
        },
        '1' => {
          'name' => 'descriptor_count',
          'offset' => '2',
          'type' => '135'
        },
        '2' => {
          'name' => 'device_update_option_flags',
          'offset' => '3',
          'type' => '76286'
        },
        '3' => {
          'name' => 'comp_image_set_version_string_type',
          'offset' => '7',
          'type' => '135'
        },
        '4' => {
          'name' => 'comp_image_set_version_string_length',
          'offset' => '8',
          'type' => '135'
        },
        '5' => {
          'name' => 'fw_device_pkg_data_length',
          'offset' => '9',
          'type' => '5700'
        }
      },
      'Name' => 'struct pldm_firmware_device_id_record',
      'Size' => '11',
      'Type' => 'Struct'
    },
    '79863' => {
      'Header' => 'firmware_update.h',
      'Line' => '514',
      'Memb' => {
        '0' => {
          'name' => 'comp_classification',
          'offset' => '0',
          'type' => '5700'
        },
        '1' => {
          'name' => 'comp_identifier',
          'offset' => '2',
          'type' => '5700'
        },
        '2' => {
          'name' => 'comp_comparison_stamp',
          'offset' => '4',
          'type' => '147'
        },
        '3' => {
          'name' => 'comp_options',
          'offset' => '8',
          'type' => '75782'
        },
        '4' => {
          'name' => 'requested_comp_activation_method',
          'offset' => '16',
          'type' => '75782'
        },
        '5' => {
          'name' => 'comp_location_offset',
          'offset' => '18',
          'type' => '147'
        },
        '6' => {
          'name' => 'comp_size',
          'offset' => '22',
          'type' => '147'
        },
        '7' => {
          'name' => 'comp_version_string_type',
          'offset' => '32',
          'type' => '135'
        },
        '8' => {
          'name' => 'comp_version_string_length',
          'offset' => '33',
          'type' => '135'
        }
      },
      'Name' => 'struct pldm_component_image_information',
      'Size' => '22',
      'Type' => 'Struct'
    },
    '80061' => {
      'Header' => 'firmware_update.h',
      'Line' => '540',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'capabilities_during_update',
          'offset' => '1',
          'type' => '76286'
        },
        '2' => {
          'name' => 'comp_count',
          'offset' => '5',
          'type' => '5700'
        },
        '3' => {
          'name' => 'active_comp_image_set_ver_str_type',
          'offset' => '7',
          'type' => '135'
        },
        '4' => {
          'name' => 'active_comp_image_set_ver_str_len',
          'offset' => '8',
          'type' => '135'
        },
        '5' => {
          'name' => 'pending_comp_image_set_ver_str_type',
          'offset' => '9',
          'type' => '135'
        },
        '6' => {
          'name' => 'pending_comp_image_set_ver_str_len',
          'offset' => '16',
          'type' => '135'
        }
      },
      'Name' => 'struct pldm_get_firmware_parameters_resp',
      'Size' => '11',
      'Type' => 'Struct'
    },
    '80264' => {
      'Header' => 'firmware_update.h',
      'Line' => '568',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'downstream_device_update_supported',
          'offset' => '1',
          'type' => '135'
        },
        '2' => {
          'name' => 'number_of_downstream_devices',
          'offset' => '2',
          'type' => '5700'
        },
        '3' => {
          'name' => 'max_number_of_downstream_devices',
          'offset' => '4',
          'type' => '5700'
        },
        '4' => {
          'name' => 'capabilities',
          'offset' => '8',
          'type' => '76286'
        }
      },
      'Name' => 'struct pldm_query_downstream_devices_resp',
      'Size' => '12',
      'Type' => 'Struct'
    },
    '80349' => {
      'Header' => 'firmware_update.h',
      'Line' => '580',
      'Memb' => {
        '0' => {
          'name' => 'comp_classification',
          'offset' => '0',
          'type' => '5700'
        },
        '1' => {
          'name' => 'comp_identifier',
          'offset' => '2',
          'type' => '5700'
        },
        '2' => {
          'name' => 'comp_classification_index',
          'offset' => '4',
          'type' => '135'
        },
        '3' => {
          'name' => 'active_comp_comparison_stamp',
          'offset' => '5',
          'type' => '147'
        },
        '4' => {
          'name' => 'active_comp_ver_str_type',
          'offset' => '9',
          'type' => '135'
        },
        '5' => {
          'name' => 'active_comp_ver_str_len',
          'offset' => '16',
          'type' => '135'
        },
        '6' => {
          'name' => 'active_comp_release_date',
          'offset' => '17',
          'type' => '79505'
        },
        '7' => {
          'name' => 'pending_comp_comparison_stamp',
          'offset' => '25',
          'type' => '147'
        },
        '8' => {
          'name' => 'pending_comp_ver_str_type',
          'offset' => '35',
          'type' => '135'
        },
        '9' => {
          'name' => 'pending_comp_ver_str_len',
          'offset' => '36',
          'type' => '135'
        },
        '10' => {
          'name' => 'pending_comp_release_date',
          'offset' => '37',
          'type' => '79505'
        },
        '11' => {
          'name' => 'comp_activation_methods',
          'offset' => '51',
          'type' => '75782'
        },
        '12' => {
          'name' => 'capabilities_during_update',
          'offset' => '53',
          'type' => '76286'
        }
      },
      'Name' => 'struct pldm_component_parameter_entry',
      'Size' => '39',
      'Type' => 'Struct'
    },
    '80664' => {
      'Header' => 'firmware_update.h',
      'Line' => '619',
      'Memb' => {
        '0' => {
          'name' => 'data_transfer_handle',
          'offset' => '0',
          'type' => '147'
        },
        '1' => {
          'name' => 'transfer_operation_flag',
          'offset' => '4',
          'type' => '135'
        }
      },
      'Name' => 'struct pldm_query_downstream_identifiers_req',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '80707' => {
      'BaseType' => '80664',
      'Name' => 'struct pldm_query_downstream_identifiers_req const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '80712' => {
      'Header' => 'firmware_update.h',
      'Line' => '633',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'next_data_transfer_handle',
          'offset' => '4',
          'type' => '147'
        },
        '2' => {
          'name' => 'transfer_flag',
          'offset' => '8',
          'type' => '135'
        },
        '3' => {
          'name' => 'downstream_devices_length',
          'offset' => '18',
          'type' => '147'
        },
        '4' => {
          'name' => 'number_of_downstream_devices',
          'offset' => '22',
          'type' => '5700'
        }
      },
      'Name' => 'struct pldm_query_downstream_identifiers_resp',
      'Size' => '20',
      'Type' => 'Struct'
    },
    '80797' => {
      'Header' => 'firmware_update.h',
      'Line' => '646',
      'Memb' => {
        '0' => {
          'name' => 'downstream_device_index',
          'offset' => '0',
          'type' => '5700'
        },
        '1' => {
          'name' => 'downstream_descriptor_count',
          'offset' => '2',
          'type' => '135'
        }
      },
      'Name' => 'struct pldm_downstream_device',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '80840' => {
      'Header' => 'firmware_update.h',
      'Line' => '652',
      'Memb' => {
        '0' => {
          'name' => 'field',
          'offset' => '0',
          'type' => '7969'
        },
        '1' => {
          'name' => 'devs',
          'offset' => '22',
          'type' => '164'
        }
      },
      'Name' => 'struct pldm_downstream_device_iter',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '80883' => {
      'Header' => 'firmware_update.h',
      'Line' => '726',
      'Memb' => {
        '0' => {
          'name' => 'descriptor_type',
          'offset' => '0',
          'type' => '5700'
        },
        '1' => {
          'name' => 'descriptor_length',
          'offset' => '2',
          'type' => '5700'
        },
        '2' => {
          'name' => 'descriptor_data',
          'offset' => '8',
          'type' => '1311'
        }
      },
      'Name' => 'struct pldm_descriptor',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '80956' => {
      'Header' => 'firmware_update.h',
      'Line' => '732',
      'Memb' => {
        '0' => {
          'name' => 'field',
          'offset' => '0',
          'type' => '39304'
        },
        '1' => {
          'name' => 'count',
          'offset' => '8',
          'type' => '164'
        }
      },
      'Name' => 'struct pldm_descriptor_iter',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '81004' => {
      'Header' => 'firmware_update.h',
      'Line' => '825',
      'Memb' => {
        '0' => {
          'name' => 'data_transfer_handle',
          'offset' => '0',
          'type' => '147'
        },
        '1' => {
          'name' => 'transfer_operation_flag',
          'offset' => '4',
          'type' => '135'
        }
      },
      'Name' => 'struct pldm_get_downstream_firmware_parameters_req',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '81047' => {
      'BaseType' => '81004',
      'Name' => 'struct pldm_get_downstream_firmware_parameters_req const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '81052' => {
      'Header' => 'firmware_update.h',
      'Line' => '840',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'next_data_transfer_handle',
          'offset' => '4',
          'type' => '147'
        },
        '2' => {
          'name' => 'transfer_flag',
          'offset' => '8',
          'type' => '135'
        },
        '3' => {
          'name' => 'fdp_capabilities_during_update',
          'offset' => '18',
          'type' => '76286'
        },
        '4' => {
          'name' => 'downstream_device_count',
          'offset' => '22',
          'type' => '5700'
        }
      },
      'Name' => 'struct pldm_get_downstream_firmware_parameters_resp',
      'Size' => '20',
      'Type' => 'Struct'
    },
    '81137' => {
      'Header' => 'firmware_update.h',
      'Line' => '858',
      'Memb' => {
        '0' => {
          'name' => 'downstream_device_index',
          'offset' => '0',
          'type' => '5700'
        },
        '1' => {
          'name' => 'active_comp_comparison_stamp',
          'offset' => '4',
          'type' => '147'
        },
        '2' => {
          'name' => 'active_comp_ver_str_type',
          'offset' => '8',
          'type' => '135'
        },
        '3' => {
          'name' => 'active_comp_ver_str_len',
          'offset' => '9',
          'type' => '135'
        },
        '4' => {
          'name' => 'active_comp_release_date',
          'offset' => '16',
          'type' => '81334'
        },
        '5' => {
          'name' => 'pending_comp_comparison_stamp',
          'offset' => '32',
          'type' => '147'
        },
        '6' => {
          'name' => 'pending_comp_ver_str_type',
          'offset' => '36',
          'type' => '135'
        },
        '7' => {
          'name' => 'pending_comp_ver_str_len',
          'offset' => '37',
          'type' => '135'
        },
        '8' => {
          'name' => 'pending_comp_release_date',
          'offset' => '38',
          'type' => '81334'
        },
        '9' => {
          'name' => 'comp_activation_methods',
          'offset' => '54',
          'type' => '75782'
        },
        '10' => {
          'name' => 'capabilities_during_update',
          'offset' => '64',
          'type' => '76286'
        },
        '11' => {
          'name' => 'active_comp_ver_str',
          'offset' => '72',
          'type' => '1311'
        },
        '12' => {
          'name' => 'pending_comp_ver_str',
          'offset' => '86',
          'type' => '1311'
        }
      },
      'Name' => 'struct pldm_downstream_device_parameters_entry',
      'Size' => '64',
      'Type' => 'Struct'
    },
    '81334' => {
      'BaseType' => '46',
      'Name' => 'char[9]',
      'Size' => '9',
      'Type' => 'Array'
    },
    '82705' => {
      'Header' => 'firmware_update.h',
      'Line' => '1395',
      'Memb' => {
        '0' => {
          'name' => 'field',
          'offset' => '0',
          'type' => '7969'
        },
        '1' => {
          'name' => 'entries',
          'offset' => '22',
          'type' => '164'
        }
      },
      'Name' => 'struct pldm_downstream_device_parameters_iter',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '82748' => {
      'Header' => undef,
      'Line' => '2249',
      'Memb' => {
        '0' => {
          'name' => 'magic',
          'offset' => '0',
          'type' => '159'
        },
        '1' => {
          'name' => 'version',
          'offset' => '4',
          'type' => '5695'
        }
      },
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Struct'
    },
    '82785' => {
      'Header' => undef,
      'Line' => '2268',
      'Memb' => {
        '0' => {
          'name' => 'identifier',
          'offset' => '0',
          'type' => '77285'
        },
        '1' => {
          'name' => 'revision',
          'offset' => '22',
          'type' => '5695'
        }
      },
      'PrivateABI' => 1,
      'Size' => '17',
      'Type' => 'Struct'
    },
    '82822' => {
      'Header' => 'firmware_update.h',
      'Line' => '2248',
      'Memb' => {
        '0' => {
          'name' => 'meta',
          'offset' => '0',
          'type' => '82748'
        },
        '1' => {
          'name' => 'format',
          'offset' => '8',
          'type' => '82785'
        }
      },
      'Name' => 'struct pldm_package_format_pin',
      'Size' => '28',
      'Type' => 'Struct'
    },
    '82865' => {
      'BaseType' => '82822',
      'Name' => 'struct pldm_package_format_pin const',
      'Size' => '28',
      'Type' => 'Const'
    },
    '82870' => {
      'Header' => 'firmware_update.h',
      'Line' => '2277',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_PACKAGE_PARSE_INIT',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_PACKAGE_PARSE_COMPLETE',
          'value' => '1'
        },
        '2' => {
          'name' => 'PLDM_PACKAGE_PARSE_HEADER',
          'value' => '2'
        },
        '3' => {
          'name' => 'PLDM_PACKAGE_PARSE_FIRMWARE_DEVICES',
          'value' => '3'
        },
        '4' => {
          'name' => 'PLDM_PACKAGE_PARSE_DOWNSTREAM_DEVICES',
          'value' => '4'
        },
        '5' => {
          'name' => 'PLDM_PACKAGE_PARSE_COMPONENT_IMAGE_INFORMATION',
          'value' => '5'
        }
      },
      'Name' => 'enum pldm_package_parse',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '82922' => {
      'Header' => 'firmware_update.h',
      'Line' => '2286',
      'Memb' => {
        '0' => {
          'name' => 'field',
          'offset' => '0',
          'type' => '7969'
        },
        '1' => {
          'name' => 'entries',
          'offset' => '22',
          'type' => '164'
        }
      },
      'Name' => 'struct pldm_package_iter',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '82965' => {
      'Header' => 'firmware_update.h',
      'Line' => '2299',
      'Memb' => {
        '0' => {
          'name' => 'package_header_identifier',
          'offset' => '0',
          'type' => '77257'
        },
        '1' => {
          'name' => 'package_header_format_revision',
          'offset' => '22',
          'type' => '135'
        },
        '2' => {
          'name' => 'package_release_date_time',
          'offset' => '23',
          'type' => '79634'
        },
        '3' => {
          'name' => 'component_bitmap_bit_length',
          'offset' => '48',
          'type' => '5700'
        },
        '4' => {
          'name' => 'package_version_string_type',
          'offset' => '50',
          'type' => '135'
        },
        '5' => {
          'name' => 'package_version_string',
          'offset' => '64',
          'type' => '7969'
        }
      },
      'Name' => 'struct pldm__package_header_information',
      'Size' => '56',
      'Type' => 'Struct'
    },
    '83064' => {
      'BaseType' => '82965',
      'Header' => 'firmware_update.h',
      'Line' => '2312',
      'Name' => 'pldm_package_header_information_pad',
      'Size' => '56',
      'Type' => 'Typedef'
    },
    '83077' => {
      'BaseType' => '83064',
      'Name' => 'pldm_package_header_information_pad const',
      'Size' => '56',
      'Type' => 'Const'
    },
    '83082' => {
      'Header' => 'firmware_update.h',
      'Line' => '2315',
      'Memb' => {
        '0' => {
          'name' => 'bitmap',
          'offset' => '0',
          'type' => '7969'
        }
      },
      'Name' => 'struct pldm_package_component_bitmap',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '83111' => {
      'Header' => 'firmware_update.h',
      'Line' => '2327',
      'Memb' => {
        '0' => {
          'name' => 'descriptor_count',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'device_update_option_flags',
          'offset' => '4',
          'type' => '76286'
        },
        '2' => {
          'name' => 'component_image_set_version_string_type',
          'offset' => '8',
          'type' => '135'
        },
        '3' => {
          'name' => 'component_image_set_version_string',
          'offset' => '22',
          'type' => '7969'
        },
        '4' => {
          'name' => 'applicable_components',
          'offset' => '50',
          'type' => '83082'
        },
        '5' => {
          'name' => 'record_descriptors',
          'offset' => '72',
          'type' => '7969'
        },
        '6' => {
          'name' => 'firmware_device_package_data',
          'offset' => '100',
          'type' => '7969'
        },
        '7' => {
          'name' => 'reference_manifest_data',
          'offset' => '128',
          'type' => '7969'
        }
      },
      'Name' => 'struct pldm_package_firmware_device_id_record',
      'Size' => '96',
      'Type' => 'Struct'
    },
    '83238' => {
      'Header' => 'firmware_update.h',
      'Line' => '2378',
      'Memb' => {
        '0' => {
          'name' => 'descriptor_count',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'update_option_flags',
          'offset' => '4',
          'type' => '76286'
        },
        '2' => {
          'name' => 'self_contained_activation_min_version_string_type',
          'offset' => '8',
          'type' => '135'
        },
        '3' => {
          'name' => 'self_contained_activation_min_version_string',
          'offset' => '22',
          'type' => '7969'
        },
        '4' => {
          'name' => 'self_contained_activation_min_version_comparison_stamp',
          'offset' => '50',
          'type' => '147'
        },
        '5' => {
          'name' => 'applicable_components',
          'offset' => '64',
          'type' => '83082'
        },
        '6' => {
          'name' => 'record_descriptors',
          'offset' => '86',
          'type' => '7969'
        },
        '7' => {
          'name' => 'package_data',
          'offset' => '114',
          'type' => '7969'
        },
        '8' => {
          'name' => 'reference_manifest_data',
          'offset' => '136',
          'type' => '7969'
        }
      },
      'Name' => 'struct pldm_package_downstream_device_id_record',
      'Size' => '104',
      'Type' => 'Struct'
    },
    '83379' => {
      'Header' => 'firmware_update.h',
      'Line' => '2428',
      'Memb' => {
        '0' => {
          'name' => 'component_classification',
          'offset' => '0',
          'type' => '5700'
        },
        '1' => {
          'name' => 'component_identifier',
          'offset' => '2',
          'type' => '5700'
        },
        '2' => {
          'name' => 'component_comparison_stamp',
          'offset' => '4',
          'type' => '147'
        },
        '3' => {
          'name' => 'component_options',
          'offset' => '8',
          'type' => '75782'
        },
        '4' => {
          'name' => 'requested_component_activation_method',
          'offset' => '16',
          'type' => '75782'
        },
        '5' => {
          'name' => 'component_image',
          'offset' => '22',
          'type' => '7969'
        },
        '6' => {
          'name' => 'component_version_string_type',
          'offset' => '50',
          'type' => '135'
        },
        '7' => {
          'name' => 'component_version_string',
          'offset' => '64',
          'type' => '7969'
        },
        '8' => {
          'name' => 'component_opaque_data',
          'offset' => '86',
          'type' => '7969'
        }
      },
      'Name' => 'struct pldm_package_component_image_information',
      'Size' => '72',
      'Type' => 'Struct'
    },
    '83520' => {
      'Header' => 'firmware_update.h',
      'Line' => '2469',
      'Memb' => {
        '0' => {
          'name' => 'pin',
          'offset' => '0',
          'type' => '83631'
        },
        '1' => {
          'name' => 'hdr',
          'offset' => '8',
          'type' => '83636'
        },
        '2' => {
          'name' => 'state',
          'offset' => '22',
          'type' => '82870'
        },
        '3' => {
          'name' => 'flags',
          'offset' => '32',
          'type' => '147'
        },
        '4' => {
          'name' => 'package',
          'offset' => '36',
          'type' => '7969'
        },
        '5' => {
          'name' => 'areas',
          'offset' => '64',
          'type' => '7969'
        },
        '6' => {
          'name' => 'iter',
          'offset' => '86',
          'type' => '82922'
        }
      },
      'Name' => 'struct pldm_package',
      'Size' => '80',
      'Type' => 'Struct'
    },
    '83631' => {
      'BaseType' => '82865',
      'Name' => 'struct pldm_package_format_pin const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '83636' => {
      'BaseType' => '83077',
      'Name' => 'pldm_package_header_information_pad const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '89968' => {
      'BaseType' => '83520',
      'Name' => 'struct pldm_package*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '89973' => {
      'BaseType' => '83379',
      'Name' => 'struct pldm_package_component_image_information*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '97701' => {
      'BaseType' => '83238',
      'Name' => 'struct pldm_package_downstream_device_id_record*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '99306' => {
      'BaseType' => '83111',
      'Name' => 'struct pldm_package_firmware_device_id_record*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '101010' => {
      'BaseType' => '83064',
      'Name' => 'pldm_package_header_information_pad*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '103131' => {
      'BaseType' => '75502',
      'Name' => 'bool8_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '125042' => {
      'BaseType' => '77379',
      'Name' => 'struct variable_field const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '151270' => {
      'BaseType' => '82705',
      'Name' => 'struct pldm_downstream_device_parameters_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '151275' => {
      'BaseType' => '81137',
      'Name' => 'struct pldm_downstream_device_parameters_entry*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '154631' => {
      'BaseType' => '81052',
      'Name' => 'struct pldm_get_downstream_firmware_parameters_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '156113' => {
      'BaseType' => '81047',
      'Name' => 'struct pldm_get_downstream_firmware_parameters_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '157639' => {
      'BaseType' => '80840',
      'Name' => 'struct pldm_downstream_device_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '157644' => {
      'BaseType' => '80797',
      'Name' => 'struct pldm_downstream_device*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '160933' => {
      'BaseType' => '80712',
      'Name' => 'struct pldm_query_downstream_identifiers_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '162415' => {
      'BaseType' => '80707',
      'Name' => 'struct pldm_query_downstream_identifiers_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '165607' => {
      'BaseType' => '80264',
      'Name' => 'struct pldm_query_downstream_devices_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '166054' => {
      'BaseType' => '80349',
      'Name' => 'struct pldm_component_parameter_entry*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '176798' => {
      'BaseType' => '80061',
      'Name' => 'struct pldm_get_firmware_parameters_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '180517' => {
      'BaseType' => '1576',
      'Name' => 'uint8_t**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '181017' => {
      'BaseType' => '79863',
      'Name' => 'struct pldm_component_image_information*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '184198' => {
      'BaseType' => '80956',
      'Name' => 'struct pldm_descriptor_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '184203' => {
      'BaseType' => '80883',
      'Name' => 'struct pldm_descriptor*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '184749' => {
      'BaseType' => '79650',
      'Name' => 'struct pldm_firmware_device_id_record*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '193225' => {
      'BaseType' => '133',
      'Name' => 'void**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '193888' => {
      'BaseType' => '79521',
      'Name' => 'struct pldm_package_header_information*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '210715' => {
      'BaseType' => '210732',
      'Header' => undef,
      'Line' => '16',
      'Name' => 'pldm_pdr',
      'PrivateABI' => 1,
      'Size' => '24',
      'Type' => 'Typedef'
    },
    '210727' => {
      'BaseType' => '210715',
      'Name' => 'pldm_pdr const',
      'Size' => '24',
      'Type' => 'Const'
    },
    '210732' => {
      'Header' => undef,
      'Line' => '31',
      'Memb' => {
        '0' => {
          'name' => 'record_count',
          'offset' => '0',
          'type' => '147'
        },
        '1' => {
          'name' => 'size',
          'offset' => '4',
          'type' => '147'
        },
        '2' => {
          'name' => 'first',
          'offset' => '8',
          'type' => '212182'
        },
        '3' => {
          'name' => 'last',
          'offset' => '22',
          'type' => '212182'
        }
      },
      'Name' => 'struct pldm_pdr',
      'PrivateABI' => 1,
      'Size' => '24',
      'Type' => 'Struct'
    },
    '210798' => {
      'BaseType' => '210815',
      'Header' => undef,
      'Line' => '21',
      'Name' => 'pldm_pdr_record',
      'PrivateABI' => 1,
      'Size' => '32',
      'Type' => 'Typedef'
    },
    '210810' => {
      'BaseType' => '210798',
      'Name' => 'pldm_pdr_record const',
      'Size' => '32',
      'Type' => 'Const'
    },
    '210815' => {
      'Header' => undef,
      'Line' => '22',
      'Memb' => {
        '0' => {
          'name' => 'record_handle',
          'offset' => '0',
          'type' => '147'
        },
        '1' => {
          'name' => 'size',
          'offset' => '4',
          'type' => '147'
        },
        '2' => {
          'name' => 'data',
          'offset' => '8',
          'type' => '1576'
        },
        '3' => {
          'name' => 'next',
          'offset' => '22',
          'type' => '212170'
        },
        '4' => {
          'name' => 'is_remote',
          'offset' => '36',
          'type' => '5499'
        },
        '5' => {
          'name' => 'terminus_handle',
          'offset' => '38',
          'type' => '5700'
        }
      },
      'Name' => 'struct pldm_pdr_record',
      'PrivateABI' => 1,
      'Size' => '32',
      'Type' => 'Struct'
    },
    '210907' => {
      'Header' => 'pdr.h',
      'Line' => '327',
      'Memb' => {
        '0' => {
          'name' => 'entity_type',
          'offset' => '0',
          'type' => '5700'
        },
        '1' => {
          'name' => 'entity_instance_num',
          'offset' => '2',
          'type' => '5700'
        },
        '2' => {
          'name' => 'entity_container_id',
          'offset' => '4',
          'type' => '5700'
        }
      },
      'Name' => 'struct pldm_entity',
      'Size' => '6',
      'Type' => 'Struct'
    },
    '210969' => {
      'BaseType' => '210907',
      'Header' => 'pdr.h',
      'Line' => '331',
      'Name' => 'pldm_entity',
      'Size' => '6',
      'Type' => 'Typedef'
    },
    '211015' => {
      'BaseType' => '211027',
      'Header' => undef,
      'Line' => '341',
      'Name' => 'pldm_entity_association_tree',
      'PrivateABI' => 1,
      'Size' => '16',
      'Type' => 'Typedef'
    },
    '211027' => {
      'Header' => undef,
      'Line' => '648',
      'Memb' => {
        '0' => {
          'name' => 'root',
          'offset' => '0',
          'type' => '212187'
        },
        '1' => {
          'name' => 'last_used_container_id',
          'offset' => '8',
          'type' => '5700'
        }
      },
      'Name' => 'struct pldm_entity_association_tree',
      'PrivateABI' => 1,
      'Size' => '16',
      'Type' => 'Struct'
    },
    '211070' => {
      'BaseType' => '211087',
      'Header' => undef,
      'Line' => '346',
      'Name' => 'pldm_entity_node',
      'PrivateABI' => 1,
      'Size' => '40',
      'Type' => 'Typedef'
    },
    '211082' => {
      'BaseType' => '211070',
      'Name' => 'pldm_entity_node const',
      'Size' => '40',
      'Type' => 'Const'
    },
    '211087' => {
      'Header' => undef,
      'Line' => '653',
      'Memb' => {
        '0' => {
          'name' => 'entity',
          'offset' => '0',
          'type' => '210969'
        },
        '1' => {
          'name' => 'parent',
          'offset' => '6',
          'type' => '210969'
        },
        '2' => {
          'name' => 'remote_container_id',
          'offset' => '18',
          'type' => '5700'
        },
        '3' => {
          'name' => 'first_child',
          'offset' => '22',
          'type' => '212187'
        },
        '4' => {
          'name' => 'next_sibling',
          'offset' => '36',
          'type' => '212187'
        },
        '5' => {
          'name' => 'association_type',
          'offset' => '50',
          'type' => '135'
        }
      },
      'Name' => 'struct pldm_entity_node',
      'PrivateABI' => 1,
      'Size' => '40',
      'Type' => 'Struct'
    },
    '211388' => {
      'Header' => 'platform.h',
      'Line' => '581',
      'Memb' => {
        '0' => {
          'name' => 'record_handle',
          'offset' => '0',
          'type' => '147'
        },
        '1' => {
          'name' => 'version',
          'offset' => '4',
          'type' => '135'
        },
        '2' => {
          'name' => 'type',
          'offset' => '5',
          'type' => '135'
        },
        '3' => {
          'name' => 'record_change_num',
          'offset' => '6',
          'type' => '5700'
        },
        '4' => {
          'name' => 'length',
          'offset' => '8',
          'type' => '5700'
        }
      },
      'Name' => 'struct pldm_pdr_hdr',
      'Size' => '10',
      'Type' => 'Struct'
    },
    '211837' => {
      'Header' => 'platform.h',
      'Line' => '656',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '211388'
        },
        '1' => {
          'name' => 'terminus_handle',
          'offset' => '16',
          'type' => '5700'
        },
        '2' => {
          'name' => 'sensor_id',
          'offset' => '18',
          'type' => '5700'
        },
        '3' => {
          'name' => 'entity_type',
          'offset' => '20',
          'type' => '5700'
        },
        '4' => {
          'name' => 'entity_instance',
          'offset' => '22',
          'type' => '5700'
        },
        '5' => {
          'name' => 'container_id',
          'offset' => '24',
          'type' => '5700'
        },
        '6' => {
          'name' => 'sensor_init',
          'offset' => '32',
          'type' => '135'
        },
        '7' => {
          'name' => 'sensor_auxiliary_names_pdr',
          'offset' => '33',
          'type' => '75502'
        },
        '8' => {
          'name' => 'composite_sensor_count',
          'offset' => '34',
          'type' => '135'
        },
        '9' => {
          'name' => 'possible_states',
          'offset' => '35',
          'type' => '1048'
        }
      },
      'Name' => 'struct pldm_state_sensor_pdr',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '211991' => {
      'Header' => 'platform.h',
      'Line' => '683',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '211388'
        },
        '1' => {
          'name' => 'terminus_handle',
          'offset' => '16',
          'type' => '5700'
        },
        '2' => {
          'name' => 'effecter_id',
          'offset' => '18',
          'type' => '5700'
        },
        '3' => {
          'name' => 'entity_type',
          'offset' => '20',
          'type' => '5700'
        },
        '4' => {
          'name' => 'entity_instance',
          'offset' => '22',
          'type' => '5700'
        },
        '5' => {
          'name' => 'container_id',
          'offset' => '24',
          'type' => '5700'
        },
        '6' => {
          'name' => 'effecter_semantic_id',
          'offset' => '32',
          'type' => '5700'
        },
        '7' => {
          'name' => 'effecter_init',
          'offset' => '34',
          'type' => '135'
        },
        '8' => {
          'name' => 'has_description_pdr',
          'offset' => '35',
          'type' => '75502'
        },
        '9' => {
          'name' => 'composite_effecter_count',
          'offset' => '36',
          'type' => '135'
        },
        '10' => {
          'name' => 'possible_states',
          'offset' => '37',
          'type' => '1048'
        }
      },
      'Name' => 'struct pldm_state_effecter_pdr',
      'Size' => '26',
      'Type' => 'Struct'
    },
    '212170' => {
      'BaseType' => '210815',
      'Name' => 'struct pldm_pdr_record*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '212182' => {
      'BaseType' => '210798',
      'Name' => 'pldm_pdr_record*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '212187' => {
      'BaseType' => '211070',
      'Name' => 'pldm_entity_node*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '212554' => {
      'BaseType' => '211015',
      'Name' => 'pldm_entity_association_tree*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '214078' => {
      'BaseType' => '210715',
      'Name' => 'pldm_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '215689' => {
      'BaseType' => '210810',
      'Name' => 'pldm_pdr_record const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '224306' => {
      'BaseType' => '210969',
      'Name' => 'pldm_entity*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '244102' => {
      'BaseType' => '224306',
      'Name' => 'pldm_entity**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '244749' => {
      'BaseType' => '212187',
      'Name' => 'pldm_entity_node**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '245538' => {
      'BaseType' => '210727',
      'Name' => 'pldm_pdr const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '251014' => {
      'BaseType' => '211082',
      'Name' => 'pldm_entity_node const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '257266' => {
      'BaseType' => '211991',
      'Name' => 'struct pldm_state_effecter_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '262502' => {
      'BaseType' => '211837',
      'Name' => 'struct pldm_state_sensor_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '267702' => {
      'BaseType' => '88',
      'Header' => undef,
      'Line' => '37',
      'Name' => '__int8_t',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '267826' => {
      'BaseType' => '5621',
      'Header' => undef,
      'Line' => '55',
      'Name' => '__uint_least16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '267879' => {
      'BaseType' => '267702',
      'Header' => undef,
      'Line' => '24',
      'Name' => 'int8_t',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '268552' => {
      'BaseType' => '448',
      'Header' => 'pldm_types.h',
      'Line' => '168',
      'Name' => 'real32_t',
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '269341' => {
      'BaseType' => '267826',
      'Header' => undef,
      'Line' => '36',
      'Name' => 'char16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '270270' => {
      'Header' => 'platform.h',
      'Line' => '347',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_SENSOR_OP_STATE',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_STATE_SENSOR_STATE',
          'value' => '1'
        },
        '2' => {
          'name' => 'PLDM_NUMERIC_SENSOR_STATE',
          'value' => '2'
        }
      },
      'Name' => 'enum sensor_event_class_states',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '270304' => {
      'BaseType' => '270270',
      'Name' => 'enum sensor_event_class_states const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '270812' => {
      'Header' => 'platform.h',
      'Line' => '673',
      'Memb' => {
        '0' => {
          'name' => 'state_set_id',
          'offset' => '0',
          'type' => '5700'
        },
        '1' => {
          'name' => 'possible_states_size',
          'offset' => '2',
          'type' => '135'
        },
        '2' => {
          'name' => 'states',
          'offset' => '3',
          'type' => '270874'
        }
      },
      'Name' => 'struct state_sensor_possible_states',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '270869' => {
      'BaseType' => '270812',
      'Name' => 'struct state_sensor_possible_states const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '271907' => {
      'Header' => 'platform.h',
      'Line' => '844',
      'Memb' => {
        '0' => {
          'name' => 'record_handle',
          'offset' => '0',
          'type' => '147'
        },
        '1' => {
          'name' => 'version',
          'offset' => '4',
          'type' => '135'
        },
        '2' => {
          'name' => 'type',
          'offset' => '5',
          'type' => '135'
        },
        '3' => {
          'name' => 'record_change_num',
          'offset' => '6',
          'type' => '5700'
        },
        '4' => {
          'name' => 'length',
          'offset' => '8',
          'type' => '5700'
        }
      },
      'Name' => 'struct pldm_value_pdr_hdr',
      'Size' => '12',
      'Type' => 'Struct'
    },
    '271992' => {
      'Header' => undef,
      'Line' => '862',
      'Memb' => {
        '0' => {
          'name' => 'entity_instance_num',
          'offset' => '0',
          'type' => '5700'
        },
        '1' => {
          'name' => 'entity_instance',
          'offset' => '0',
          'type' => '5700'
        }
      },
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Union'
    },
    '272026' => {
      'Header' => 'platform.h',
      'Line' => '857',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '271907'
        },
        '1' => {
          'name' => 'terminus_handle',
          'offset' => '18',
          'type' => '5700'
        },
        '2' => {
          'name' => 'sensor_id',
          'offset' => '20',
          'type' => '5700'
        },
        '3' => {
          'name' => 'entity_type',
          'offset' => '22',
          'type' => '5700'
        },
        '4' => {
          'name' => 'unnamed0',
          'offset' => '24',
          'type' => '271992'
        },
        '5' => {
          'name' => 'container_id',
          'offset' => '32',
          'type' => '5700'
        },
        '6' => {
          'name' => 'sensor_init',
          'offset' => '34',
          'type' => '135'
        },
        '7' => {
          'name' => 'sensor_auxiliary_names_pdr',
          'offset' => '35',
          'type' => '75502'
        },
        '8' => {
          'name' => 'base_unit',
          'offset' => '36',
          'type' => '135'
        },
        '9' => {
          'name' => 'unit_modifier',
          'offset' => '37',
          'type' => '267879'
        },
        '10' => {
          'name' => 'rate_unit',
          'offset' => '38',
          'type' => '135'
        },
        '11' => {
          'name' => 'base_oem_unit_handle',
          'offset' => '39',
          'type' => '135'
        },
        '12' => {
          'name' => 'aux_unit',
          'offset' => '40',
          'type' => '135'
        },
        '13' => {
          'name' => 'aux_unit_modifier',
          'offset' => '41',
          'type' => '267879'
        },
        '14' => {
          'name' => 'aux_rate_unit',
          'offset' => '48',
          'type' => '135'
        },
        '15' => {
          'name' => 'rel',
          'offset' => '49',
          'type' => '135'
        },
        '16' => {
          'name' => 'aux_oem_unit_handle',
          'offset' => '50',
          'type' => '135'
        },
        '17' => {
          'name' => 'is_linear',
          'offset' => '51',
          'type' => '75502'
        },
        '18' => {
          'name' => 'sensor_data_size',
          'offset' => '52',
          'type' => '135'
        },
        '19' => {
          'name' => 'resolution',
          'offset' => '54',
          'type' => '268552'
        },
        '20' => {
          'name' => 'offset',
          'offset' => '64',
          'type' => '268552'
        },
        '21' => {
          'name' => 'accuracy',
          'offset' => '68',
          'type' => '5700'
        },
        '22' => {
          'name' => 'plus_tolerance',
          'offset' => '70',
          'type' => '135'
        },
        '23' => {
          'name' => 'minus_tolerance',
          'offset' => '71',
          'type' => '135'
        },
        '24' => {
          'name' => 'hysteresis',
          'offset' => '72',
          'type' => '271894'
        },
        '25' => {
          'name' => 'supported_thresholds',
          'offset' => '86',
          'type' => '268170'
        },
        '26' => {
          'name' => 'threshold_and_hysteresis_volatility',
          'offset' => '87',
          'type' => '268170'
        },
        '27' => {
          'name' => 'state_transition_interval',
          'offset' => '96',
          'type' => '268552'
        },
        '28' => {
          'name' => 'update_interval',
          'offset' => '100',
          'type' => '268552'
        },
        '29' => {
          'name' => 'max_readable',
          'offset' => '114',
          'type' => '271894'
        },
        '30' => {
          'name' => 'min_readable',
          'offset' => '128',
          'type' => '271894'
        },
        '31' => {
          'name' => 'range_field_format',
          'offset' => '136',
          'type' => '135'
        },
        '32' => {
          'name' => 'range_field_support',
          'offset' => '137',
          'type' => '268170'
        },
        '33' => {
          'name' => 'nominal_value',
          'offset' => '150',
          'type' => '271271'
        },
        '34' => {
          'name' => 'normal_max',
          'offset' => '260',
          'type' => '271271'
        },
        '35' => {
          'name' => 'normal_min',
          'offset' => '274',
          'type' => '271271'
        },
        '36' => {
          'name' => 'warning_high',
          'offset' => '288',
          'type' => '271271'
        },
        '37' => {
          'name' => 'warning_low',
          'offset' => '296',
          'type' => '271271'
        },
        '38' => {
          'name' => 'critical_high',
          'offset' => '310',
          'type' => '271271'
        },
        '39' => {
          'name' => 'critical_low',
          'offset' => '324',
          'type' => '271271'
        },
        '40' => {
          'name' => 'fatal_high',
          'offset' => '338',
          'type' => '271271'
        },
        '41' => {
          'name' => 'fatal_low',
          'offset' => '352',
          'type' => '271271'
        }
      },
      'Name' => 'struct pldm_numeric_sensor_value_pdr',
      'Size' => '168',
      'Type' => 'Struct'
    },
    '272619' => {
      'BaseType' => '269341',
      'Header' => 'platform.h',
      'Line' => '905',
      'Name' => 'pldm_utf16be',
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '272632' => {
      'Header' => 'platform.h',
      'Line' => '907',
      'Memb' => {
        '0' => {
          'name' => 'tag',
          'offset' => '0',
          'type' => '5671'
        },
        '1' => {
          'name' => 'name',
          'offset' => '8',
          'type' => '272674'
        }
      },
      'Name' => 'struct pldm_entity_auxiliary_name',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '272674' => {
      'BaseType' => '272619',
      'Name' => 'pldm_utf16be*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '272679' => {
      'Header' => 'platform.h',
      'Line' => '917',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '271907'
        },
        '1' => {
          'name' => 'container',
          'offset' => '18',
          'type' => '210969'
        },
        '2' => {
          'name' => 'shared_name_count',
          'offset' => '24',
          'type' => '135'
        },
        '3' => {
          'name' => 'name_string_count',
          'offset' => '25',
          'type' => '135'
        },
        '4' => {
          'name' => 'names',
          'offset' => '36',
          'type' => '272793'
        },
        '5' => {
          'name' => 'auxiliary_name_data_size',
          'offset' => '50',
          'type' => '164'
        },
        '6' => {
          'name' => 'auxiliary_name_data',
          'offset' => '64',
          'type' => '272798'
        }
      },
      'Name' => 'struct pldm_entity_auxiliary_names_pdr',
      'Size' => '40',
      'Type' => 'Struct'
    },
    '272793' => {
      'BaseType' => '272632',
      'Name' => 'struct pldm_entity_auxiliary_name*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '272798' => {
      'BaseType' => '46',
      'Name' => 'char[]',
      'Size' => '8',
      'Type' => 'Array'
    },
    '272813' => {
      'Header' => 'platform.h',
      'Line' => '947',
      'Memb' => {
        '0' => {
          'name' => 'state_set_id',
          'offset' => '0',
          'type' => '5700'
        },
        '1' => {
          'name' => 'possible_states_size',
          'offset' => '2',
          'type' => '135'
        },
        '2' => {
          'name' => 'states',
          'offset' => '3',
          'type' => '270874'
        }
      },
      'Name' => 'struct state_effecter_possible_states',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '272870' => {
      'BaseType' => '272813',
      'Name' => 'struct state_effecter_possible_states const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '272875' => {
      'Header' => 'platform.h',
      'Line' => '971',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '271907'
        },
        '1' => {
          'name' => 'terminus_handle',
          'offset' => '18',
          'type' => '5700'
        },
        '2' => {
          'name' => 'file_identifier',
          'offset' => '20',
          'type' => '5700'
        },
        '3' => {
          'name' => 'container',
          'offset' => '22',
          'type' => '210969'
        },
        '4' => {
          'name' => 'superior_directory_file_identifier',
          'offset' => '34',
          'type' => '5700'
        },
        '5' => {
          'name' => 'file_classification',
          'offset' => '36',
          'type' => '135'
        },
        '6' => {
          'name' => 'oem_file_classification',
          'offset' => '37',
          'type' => '135'
        },
        '7' => {
          'name' => 'file_capabilities',
          'offset' => '38',
          'type' => '268540'
        },
        '8' => {
          'name' => 'file_version',
          'offset' => '40',
          'type' => '431'
        },
        '9' => {
          'name' => 'file_maximum_size',
          'offset' => '50',
          'type' => '147'
        },
        '10' => {
          'name' => 'file_maximum_file_descriptor_count',
          'offset' => '54',
          'type' => '135'
        },
        '11' => {
          'name' => 'file_name',
          'offset' => '64',
          'type' => '7969'
        },
        '12' => {
          'name' => 'oem_file_classification_name',
          'offset' => '86',
          'type' => '7969'
        }
      },
      'Name' => 'struct pldm_platform_file_descriptor_pdr',
      'Size' => '72',
      'Type' => 'Struct'
    },
    '273076' => {
      'Header' => 'platform.h',
      'Line' => '1017',
      'Memb' => {
        '0' => {
          'name' => 'set_request',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'effecter_state',
          'offset' => '1',
          'type' => '135'
        }
      },
      'Name' => 'struct state_field_for_state_effecter_set',
      'Size' => '2',
      'Type' => 'Struct'
    },
    '273119' => {
      'BaseType' => '273076',
      'Header' => 'platform.h',
      'Line' => '1020',
      'Name' => 'set_effecter_state_field',
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '273132' => {
      'Header' => 'platform.h',
      'Line' => '1026',
      'Memb' => {
        '0' => {
          'name' => 'sensor_op_state',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'present_state',
          'offset' => '1',
          'type' => '135'
        },
        '2' => {
          'name' => 'previous_state',
          'offset' => '2',
          'type' => '135'
        },
        '3' => {
          'name' => 'event_state',
          'offset' => '3',
          'type' => '135'
        }
      },
      'Name' => 'struct state_field_for_get_state_sensor_readings',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '273203' => {
      'BaseType' => '273132',
      'Header' => 'platform.h',
      'Line' => '1034',
      'Name' => 'get_sensor_state_field',
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '273216' => {
      'Header' => 'platform.h',
      'Line' => '1040',
      'Memb' => {
        '0' => {
          'name' => 'effecter_op_state',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'pending_state',
          'offset' => '1',
          'type' => '135'
        },
        '2' => {
          'name' => 'present_state',
          'offset' => '2',
          'type' => '135'
        }
      },
      'Name' => 'struct state_field_for_get_state_effecter_states',
      'Size' => '3',
      'Type' => 'Struct'
    },
    '273273' => {
      'BaseType' => '273216',
      'Header' => 'platform.h',
      'Line' => '1044',
      'Name' => 'get_effecter_state_field',
      'Size' => '3',
      'Type' => 'Typedef'
    },
    '273757' => {
      'Header' => undef,
      'Line' => '1117',
      'Memb' => {
        '0' => {
          'name' => 'mctp_eid',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'vendor_specific',
          'offset' => '0',
          'type' => '7969'
        }
      },
      'PrivateABI' => 1,
      'Size' => '16',
      'Type' => 'Union'
    },
    '273791' => {
      'Header' => 'platform.h',
      'Line' => '1114',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'transport_protocol_type',
          'offset' => '1',
          'type' => '135'
        },
        '2' => {
          'name' => 'event_receiver_address',
          'offset' => '8',
          'type' => '273757'
        }
      },
      'Name' => 'struct pldm_get_event_receiver_resp',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '274093' => {
      'Header' => 'platform.h',
      'Line' => '1202',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'comp_effecter_count',
          'offset' => '1',
          'type' => '135'
        },
        '2' => {
          'name' => 'field',
          'offset' => '2',
          'type' => '274150'
        }
      },
      'Name' => 'struct pldm_get_state_effecter_states_resp',
      'Size' => '26',
      'Type' => 'Struct'
    },
    '274150' => {
      'BaseType' => '273273',
      'Name' => 'get_effecter_state_field[8]',
      'Size' => '24',
      'Type' => 'Array'
    },
    '274166' => {
      'Header' => 'platform.h',
      'Line' => '1212',
      'Memb' => {
        '0' => {
          'name' => 'sensor_id',
          'offset' => '0',
          'type' => '5700'
        },
        '1' => {
          'name' => 'sensor_event_class_type',
          'offset' => '2',
          'type' => '135'
        },
        '2' => {
          'name' => 'event_class',
          'offset' => '3',
          'type' => '1048'
        }
      },
      'Name' => 'struct pldm_sensor_event_data',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '274280' => {
      'Header' => 'platform.h',
      'Line' => '1252',
      'Memb' => {
        '0' => {
          'name' => 'format_version',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'event_id',
          'offset' => '2',
          'type' => '5700'
        },
        '2' => {
          'name' => 'data_transfer_handle',
          'offset' => '4',
          'type' => '147'
        }
      },
      'Name' => 'struct pldm_message_poll_event',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '274342' => {
      'Header' => 'platform.h',
      'Line' => '1262',
      'Memb' => {
        '0' => {
          'name' => 'format_version',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'format_type',
          'offset' => '1',
          'type' => '135'
        },
        '2' => {
          'name' => 'event_data_length',
          'offset' => '2',
          'type' => '5700'
        },
        '3' => {
          'name' => 'event_data',
          'offset' => '4',
          'type' => '274413'
        }
      },
      'Name' => 'struct pldm_platform_cper_event',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '274413' => {
      'BaseType' => '135',
      'Name' => 'uint8_t[]',
      'Size' => '8',
      'Type' => 'Array'
    },
    '274569' => {
      'Header' => 'platform.h',
      'Line' => '1322',
      'Memb' => {
        '0' => {
          'name' => 'event_data_format',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'number_of_change_records',
          'offset' => '1',
          'type' => '135'
        },
        '2' => {
          'name' => 'change_records',
          'offset' => '2',
          'type' => '1048'
        }
      },
      'Name' => 'struct pldm_pdr_repository_chg_event_data',
      'Size' => '3',
      'Type' => 'Struct'
    },
    '283268' => {
      'BaseType' => '2751',
      'Name' => 'size_t*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '291644' => {
      'BaseType' => '272875',
      'Name' => 'struct pldm_platform_file_descriptor_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '291703' => {
      'BaseType' => '274342',
      'Name' => 'struct pldm_platform_cper_event*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '296158' => {
      'BaseType' => '272679',
      'Name' => 'struct pldm_entity_auxiliary_names_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '308151' => {
      'BaseType' => '274093',
      'Name' => 'struct pldm_get_state_effecter_states_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '357723' => {
      'BaseType' => '273791',
      'Name' => 'struct pldm_get_event_receiver_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '378115' => {
      'BaseType' => '274280',
      'Name' => 'struct pldm_message_poll_event*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '380055' => {
      'BaseType' => '380065',
      'Name' => 'uint32_t const*const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '380060' => {
      'BaseType' => '159',
      'Name' => 'uint32_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '380065' => {
      'BaseType' => '380060',
      'Name' => 'uint32_t const*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '380070' => {
      'BaseType' => '274569',
      'Name' => 'struct pldm_pdr_repository_chg_event_data*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '433686' => {
      'BaseType' => '272026',
      'Name' => 'struct pldm_numeric_sensor_value_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '463533' => {
      'BaseType' => '274166',
      'Name' => 'struct pldm_sensor_event_data*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '463538' => {
      'BaseType' => '463533',
      'Name' => 'struct pldm_sensor_event_data*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '468887' => {
      'BaseType' => '273203',
      'Name' => 'get_sensor_state_field*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '496257' => {
      'BaseType' => '273119',
      'Name' => 'set_effecter_state_field*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '497236' => {
      'BaseType' => '262502',
      'Name' => 'struct pldm_state_sensor_pdr*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '497241' => {
      'BaseType' => '270869',
      'Name' => 'struct state_sensor_possible_states const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '497246' => {
      'BaseType' => '497241',
      'Name' => 'struct state_sensor_possible_states const*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '497646' => {
      'BaseType' => '257266',
      'Name' => 'struct pldm_state_effecter_pdr*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '497651' => {
      'BaseType' => '272870',
      'Name' => 'struct state_effecter_possible_states const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '497656' => {
      'BaseType' => '497651',
      'Name' => 'struct state_effecter_possible_states const*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '501993' => {
      'Header' => undef,
      'Line' => '19',
      'Memb' => {
        '0' => {
          'name' => 'prev',
          'offset' => '0',
          'type' => '4881'
        },
        '1' => {
          'name' => 'allocations',
          'offset' => '4',
          'type' => '147'
        }
      },
      'Name' => 'struct pldm_tid_state',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Struct'
    },
    '502032' => {
      'Header' => undef,
      'Line' => '24',
      'Memb' => {
        '0' => {
          'name' => 'state',
          'offset' => '0',
          'type' => '502074'
        },
        '1' => {
          'name' => 'lock_db_fd',
          'offset' => '8264',
          'type' => '53'
        }
      },
      'Name' => 'struct pldm_instance_db',
      'PrivateABI' => 1,
      'Size' => '2052',
      'Type' => 'Struct'
    },
    '502074' => {
      'BaseType' => '501993',
      'Name' => 'struct pldm_tid_state[256]',
      'Size' => '2048',
      'Type' => 'Array'
    },
    '502630' => {
      'BaseType' => '502032',
      'Name' => 'struct pldm_instance_db*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '503017' => {
      'BaseType' => '4881',
      'Name' => 'pldm_instance_id_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '503193' => {
      'BaseType' => '502630',
      'Name' => 'struct pldm_instance_db**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '503901' => {
      'BaseType' => '60',
      'Header' => undef,
      'Line' => '21',
      'Name' => '__u8',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '503913' => {
      'BaseType' => '67',
      'Header' => undef,
      'Line' => '24',
      'Name' => '__u16',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '504134' => {
      'Header' => undef,
      'Line' => '5',
      'Memb' => {
        '0' => {
          'name' => 'size',
          'offset' => '0',
          'type' => '53'
        },
        '1' => {
          'name' => 'socket',
          'offset' => '4',
          'type' => '53'
        },
        '2' => {
          'name' => 'max_size',
          'offset' => '8',
          'type' => '53'
        }
      },
      'Name' => 'struct pldm_socket_sndbuf',
      'PrivateABI' => 1,
      'Size' => '12',
      'Type' => 'Struct'
    },
    '504186' => {
      'BaseType' => '135',
      'Header' => 'pldm.h',
      'Line' => '13',
      'Name' => 'mctp_eid_t',
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '504300' => {
      'BaseType' => '4978',
      'Header' => 'pldm.h',
      'Line' => '30',
      'Name' => 'pldm_requester_rc_t',
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '504312' => {
      'Header' => undef,
      'Line' => '18',
      'Memb' => {
        '0' => {
          'name' => 'name',
          'offset' => '0',
          'type' => '9332'
        },
        '1' => {
          'name' => 'version',
          'offset' => '8',
          'type' => '135'
        },
        '2' => {
          'name' => 'recv',
          'offset' => '22',
          'type' => '504445'
        },
        '3' => {
          'name' => 'send',
          'offset' => '36',
          'type' => '504486'
        },
        '4' => {
          'name' => 'init_pollfd',
          'offset' => '50',
          'type' => '504566'
        }
      },
      'Name' => 'struct pldm_transport',
      'PrivateABI' => 1,
      'Size' => '40',
      'Type' => 'Struct'
    },
    '504425' => {
      'BaseType' => '504312',
      'Name' => 'struct pldm_transport*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '504430' => {
      'BaseType' => '4869',
      'Name' => 'pldm_tid_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '504445' => {
      'Name' => 'pldm_requester_rc_t(*)(struct pldm_transport*, pldm_tid_t*, void**, size_t*)',
      'Param' => {
        '0' => {
          'type' => '504425'
        },
        '1' => {
          'type' => '504430'
        },
        '2' => {
          'type' => '193225'
        },
        '3' => {
          'type' => '2751'
        }
      },
      'Return' => '504300',
      'Size' => '8',
      'Type' => 'FuncPtr'
    },
    '504486' => {
      'Name' => 'pldm_requester_rc_t(*)(struct pldm_transport*, pldm_tid_t, void const*, size_t)',
      'Param' => {
        '0' => {
          'type' => '504425'
        },
        '1' => {
          'type' => '4869'
        },
        '2' => {
          'type' => '1311'
        },
        '3' => {
          'type' => '164'
        }
      },
      'Return' => '504300',
      'Size' => '8',
      'Type' => 'FuncPtr'
    },
    '504511' => {
      'BaseType' => '504516',
      'Name' => 'struct pollfd*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '504516' => {
      'Header' => undef,
      'Line' => '36',
      'Memb' => {
        '0' => {
          'name' => 'fd',
          'offset' => '0',
          'type' => '53'
        },
        '1' => {
          'name' => 'events',
          'offset' => '4',
          'type' => '107'
        },
        '2' => {
          'name' => 'revents',
          'offset' => '6',
          'type' => '107'
        }
      },
      'Name' => 'struct pollfd',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Struct'
    },
    '504566' => {
      'Name' => 'int(*)(struct pldm_transport*, struct pollfd*)',
      'Param' => {
        '0' => {
          'type' => '504425'
        },
        '1' => {
          'type' => '504511'
        }
      },
      'Return' => '53',
      'Size' => '8',
      'Type' => 'FuncPtr'
    },
    '504571' => {
      'BaseType' => '67',
      'Header' => undef,
      'Line' => '10',
      'Name' => '__kernel_sa_family_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '504583' => {
      'Header' => undef,
      'Line' => '17',
      'Memb' => {
        '0' => {
          'name' => 's_addr',
          'offset' => '0',
          'type' => '504186'
        }
      },
      'Name' => 'struct mctp_addr',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Struct'
    },
    '504609' => {
      'Header' => undef,
      'Line' => '21',
      'Memb' => {
        '0' => {
          'name' => 'smctp_family',
          'offset' => '0',
          'type' => '504571'
        },
        '1' => {
          'name' => '__smctp_pad0',
          'offset' => '2',
          'type' => '503913'
        },
        '2' => {
          'name' => 'smctp_network',
          'offset' => '4',
          'type' => '74'
        },
        '3' => {
          'name' => 'smctp_addr',
          'offset' => '8',
          'type' => '504583'
        },
        '4' => {
          'name' => 'smctp_type',
          'offset' => '9',
          'type' => '503901'
        },
        '5' => {
          'name' => 'smctp_tag',
          'offset' => '16',
          'type' => '503901'
        },
        '6' => {
          'name' => '__smctp_pad1',
          'offset' => '17',
          'type' => '503901'
        }
      },
      'Name' => 'struct sockaddr_mctp',
      'PrivateABI' => 1,
      'Size' => '12',
      'Type' => 'Struct'
    },
    '504713' => {
      'BaseType' => '504609',
      'Name' => 'struct sockaddr_mctp const',
      'Size' => '12',
      'Type' => 'Const'
    },
    '505544' => {
      'Header' => undef,
      'Line' => '35',
      'Memb' => {
        '0' => {
          'name' => 'transport',
          'offset' => '0',
          'type' => '504312'
        },
        '1' => {
          'name' => 'socket',
          'offset' => '64',
          'type' => '53'
        },
        '2' => {
          'name' => 'tid_eid_map',
          'offset' => '68',
          'type' => '505637'
        },
        '3' => {
          'name' => 'socket_send_buf',
          'offset' => '768',
          'type' => '504134'
        },
        '4' => {
          'name' => 'bound',
          'offset' => '786',
          'type' => '5499'
        },
        '5' => {
          'name' => 'cookie_jar',
          'offset' => '800',
          'type' => '4893'
        }
      },
      'Name' => 'struct pldm_transport_af_mctp',
      'PrivateABI' => 1,
      'Size' => '336',
      'Type' => 'Struct'
    },
    '505637' => {
      'BaseType' => '4869',
      'Name' => 'pldm_tid_t[256]',
      'Size' => '256',
      'Type' => 'Array'
    },
    '506438' => {
      'BaseType' => '505544',
      'Name' => 'struct pldm_transport_af_mctp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '506443' => {
      'BaseType' => '504713',
      'Name' => 'struct sockaddr_mctp const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '506756' => {
      'BaseType' => '506438',
      'Name' => 'struct pldm_transport_af_mctp**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '510220' => {
      'Header' => undef,
      'Line' => '26',
      'Memb' => {
        '0' => {
          'name' => 'transport',
          'offset' => '0',
          'type' => '504312'
        },
        '1' => {
          'name' => 'socket',
          'offset' => '64',
          'type' => '53'
        },
        '2' => {
          'name' => 'tid_eid_map',
          'offset' => '68',
          'type' => '505637'
        },
        '3' => {
          'name' => 'socket_send_buf',
          'offset' => '768',
          'type' => '504134'
        }
      },
      'Name' => 'struct pldm_transport_mctp_demux',
      'PrivateABI' => 1,
      'Size' => '312',
      'Type' => 'Struct'
    },
    '510825' => {
      'BaseType' => '510220',
      'Name' => 'struct pldm_transport_mctp_demux*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '511331' => {
      'BaseType' => '510825',
      'Name' => 'struct pldm_transport_mctp_demux**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '534485' => {
      'Header' => 'file_io.h',
      'Line' => '32',
      'Memb' => {
        '0' => {
          'name' => 'handle',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'length',
          'offset' => '4',
          'type' => '147'
        },
        '2' => {
          'name' => 'data',
          'offset' => '8',
          'type' => '274413'
        }
      },
      'Name' => 'struct pldm_oem_meta_file_io_write_req',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '534552' => {
      'Header' => 'file_io.h',
      'Line' => '45',
      'Memb' => {
        '0' => {
          'name' => 'transferFlag',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'offset',
          'offset' => '2',
          'type' => '5700'
        }
      },
      'Name' => 'struct pldm_oem_meta_file_io_read_data_info',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '534591' => {
      'Header' => 'file_io.h',
      'Line' => '55',
      'Memb' => {
        '0' => {
          'name' => 'size',
          'offset' => '0',
          'type' => '5700'
        },
        '1' => {
          'name' => 'crc32',
          'offset' => '4',
          'type' => '147'
        }
      },
      'Name' => 'struct pldm_oem_meta_file_io_read_attr_info',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '534630' => {
      'Header' => undef,
      'Line' => '70',
      'Memb' => {
        '0' => {
          'name' => 'data',
          'offset' => '0',
          'type' => '534552'
        }
      },
      'PrivateABI' => 1,
      'Size' => '4',
      'Type' => 'Union'
    },
    '534648' => {
      'Header' => 'file_io.h',
      'Line' => '65',
      'Memb' => {
        '0' => {
          'name' => 'version',
          'offset' => '0',
          'type' => '164'
        },
        '1' => {
          'name' => 'handle',
          'offset' => '8',
          'type' => '135'
        },
        '2' => {
          'name' => 'option',
          'offset' => '9',
          'type' => '135'
        },
        '3' => {
          'name' => 'length',
          'offset' => '16',
          'type' => '135'
        },
        '4' => {
          'name' => 'info',
          'offset' => '18',
          'type' => '534630'
        }
      },
      'Name' => 'struct pldm_oem_meta_file_io_read_req',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '534726' => {
      'Header' => undef,
      'Line' => '86',
      'Memb' => {
        '0' => {
          'name' => 'attr',
          'offset' => '0',
          'type' => '534591'
        },
        '1' => {
          'name' => 'data',
          'offset' => '0',
          'type' => '534552'
        }
      },
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Union'
    },
    '534754' => {
      'Header' => 'file_io.h',
      'Line' => '80',
      'Memb' => {
        '0' => {
          'name' => 'version',
          'offset' => '0',
          'type' => '164'
        },
        '1' => {
          'name' => 'completion_code',
          'offset' => '8',
          'type' => '135'
        },
        '2' => {
          'name' => 'handle',
          'offset' => '9',
          'type' => '135'
        },
        '3' => {
          'name' => 'option',
          'offset' => '16',
          'type' => '135'
        },
        '4' => {
          'name' => 'length',
          'offset' => '17',
          'type' => '135'
        },
        '5' => {
          'name' => 'info',
          'offset' => '18',
          'type' => '534726'
        },
        '6' => {
          'name' => 'data',
          'offset' => '32',
          'type' => '274413'
        }
      },
      'Name' => 'struct pldm_oem_meta_file_io_read_resp',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '539702' => {
      'BaseType' => '534754',
      'Name' => 'struct pldm_oem_meta_file_io_read_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '542569' => {
      'BaseType' => '534648',
      'Name' => 'struct pldm_oem_meta_file_io_read_req*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '543159' => {
      'BaseType' => '534485',
      'Name' => 'struct pldm_oem_meta_file_io_write_req*',
      'Size' => '8',
      'Type' => 'Pointer'
    }
  },
  'UndefinedSymbols' => {
    'libpldm.so.0.14.0' => {
      '_ITM_deregisterTMCloneTable' => 0,
      '_ITM_registerTMCloneTable' => 0,
      '__assert_fail@GLIBC_2.2.5' => 0,
      '__cxa_finalize@GLIBC_2.2.5' => 0,
      '__errno_location@GLIBC_2.2.5' => 0,
      '__gmon_start__' => 0,
      '__recv_chk@GLIBC_2.4' => 0,
      '__recvfrom_chk@GLIBC_2.4' => 0,
      '__stack_chk_fail@GLIBC_2.4' => 0,
      'bind@GLIBC_2.2.5' => 0,
      'calloc@GLIBC_2.2.5' => 0,
      'clock_gettime@GLIBC_2.17' => 0,
      'close@GLIBC_2.2.5' => 0,
      'connect@GLIBC_2.2.5' => 0,
      'dup@GLIBC_2.2.5' => 0,
      'fclose@GLIBC_2.2.5' => 0,
      'fcntl64@GLIBC_2.28' => 0,
      'fgets@GLIBC_2.2.5' => 0,
      'fopen64@GLIBC_2.2.5' => 0,
      'free@GLIBC_2.2.5' => 0,
      'getsockopt@GLIBC_2.2.5' => 0,
      'malloc@GLIBC_2.2.5' => 0,
      'memcmp@GLIBC_2.2.5' => 0,
      'memcpy@GLIBC_2.14' => 0,
      'memmem@GLIBC_2.2.5' => 0,
      'open64@GLIBC_2.2.5' => 0,
      'poll@GLIBC_2.2.5' => 0,
      'ppoll@GLIBC_2.4' => 0,
      'recv@GLIBC_2.2.5' => 0,
      'recvmsg@GLIBC_2.2.5' => 0,
      'sendmsg@GLIBC_2.2.5' => 0,
      'sendto@GLIBC_2.2.5' => 0,
      'setsockopt@GLIBC_2.2.5' => 0,
      'socket@GLIBC_2.2.5' => 0,
      'stat64@GLIBC_2.33' => 0,
      'strlen@GLIBC_2.2.5' => 0,
      'strnlen@GLIBC_2.2.5' => 0,
      'strtol@GLIBC_2.2.5' => 0,
      'timerfd_create@GLIBC_2.8' => 0,
      'timerfd_settime@GLIBC_2.8' => 0,
      'write@GLIBC_2.2.5' => 0
    }
  },
  'WordSize' => '8'
};
