$VAR1 = {
  'ABI_DUMPER_VERSION' => '1.4',
  'ABI_DUMP_VERSION' => '3.5',
  'Arch' => 'x86_64',
  'GccVersion' => '15.0.1',
  'Headers' => {
    'af-mctp.h' => 1,
    'base.h' => 1,
    'bios.h' => 1,
    'bios_table.h' => 1,
    'file.h' => 1,
    'file_io.h' => 1,
    'firmware_update.h' => 1,
    'fru.h' => 1,
    'host.h' => 1,
    'instance-id.h' => 1,
    'mctp-demux.h' => 1,
    'pdr.h' => 1,
    'platform.h' => 1,
    'pldm.h' => 1,
    'pldm_types.h' => 1,
    'transport.h' => 1,
    'utils.h' => 1
  },
  'Language' => 'C',
  'LibraryName' => 'libpldm.so.0.14.0',
  'LibraryVersion' => '0.14.0',
  'NameSpaces' => {},
  'Needed' => {
    'libc.so.6' => 1
  },
  'PublicABI' => '1',
  'Sources' => {
    'af-mctp.c' => 1,
    'bios_table.c' => 1,
    'instance-id.c' => 1,
    'mctp-demux.c' => 1,
    'pdr.c' => 1
  },
  'SymbolInfo' => {
    '1459' => {
      'Header' => 'base.h',
      'Line' => '783',
      'Param' => {
        '0' => {
          'name' => 'instance_id',
          'type' => '140'
        },
        '1' => {
          'name' => 'type',
          'type' => '140'
        },
        '2' => {
          'name' => 'command',
          'type' => '140'
        },
        '3' => {
          'name' => 'cc',
          'type' => '140'
        },
        '4' => {
          'name' => 'msg',
          'type' => '1501'
        }
      },
      'Return' => '58',
      'ShortName' => 'encode_cc_only_resp'
    },
    '1506' => {
      'Header' => 'base.h',

      'pldm_edac_crc8' => 1,
      'pldm_entity_association_pdr_add' => 1,
      'pldm_entity_association_pdr_add_from_node' => 1,
      'pldm_entity_association_pdr_add_from_node_with_record_handle' => 1,
      'pldm_entity_association_pdr_extract' => 1,
      'pldm_entity_association_tree_add' => 1,
      'pldm_entity_association_tree_add_entity' => 1,
      'pldm_entity_association_tree_copy_root' => 1,
      'pldm_entity_association_tree_destroy' => 1,
      'pldm_entity_association_tree_destroy_root' => 1,
      'pldm_entity_association_tree_find' => 1,
      'pldm_entity_association_tree_find_with_locality' => 1,
      'pldm_entity_association_tree_init' => 1,
      'pldm_entity_association_tree_visit' => 1,
      'pldm_entity_extract' => 1,
      'pldm_entity_get_num_children' => 1,
      'pldm_entity_get_parent' => 1,
      'pldm_entity_is_exist_parent' => 1,
      'pldm_entity_is_node_parent' => 1,
      'pldm_entity_node_get_remote_container_id' => 1,
      'pldm_find_entity_ref_in_tree' => 1,
      'pldm_instance_db_destroy' => 1,
      'pldm_instance_db_init' => 1,
      'pldm_instance_db_init_default' => 1,
      'pldm_instance_id_alloc' => 1,
      'pldm_instance_id_free' => 1,
      'pldm_is_current_parent_child' => 1,
      'pldm_is_empty_entity_assoc_tree' => 1,
      'pldm_msg_hdr_correlate_response' => 1,
      'pldm_oem_meta_file_io_read_resp_data' => 1,
      'pldm_oem_meta_file_io_write_req_data' => 1,
      'pldm_pdr_add' => 1,
      'pldm_pdr_add_fru_record_set' => 1,
      'pldm_pdr_delete_by_record_handle' => 1,
      'pldm_pdr_destroy' => 1,
      'pldm_pdr_find_last_in_range' => 1,
      'pldm_pdr_find_record' => 1,
      'pldm_pdr_find_record_by_type' => 1,
      'pldm_pdr_fru_record_set_find_by_rsi' => 1,
      'pldm_pdr_get_next_record' => 1,
      'pldm_pdr_get_record_count' => 1,
      'pldm_pdr_get_record_handle' => 1,
      'pldm_pdr_get_repo_size' => 1,
      'pldm_pdr_init' => 1,
      'pldm_pdr_record_is_remote' => 1,
      'pldm_pdr_remove_pdrs_by_terminus_handle' => 1,
      'pldm_pdr_remove_remote_pdrs' => 1,
      'pldm_pdr_update_TL_pdr' => 1,
      'pldm_platform_cper_event_event_data' => 1,
      'pldm_transport_af_mctp_bind' => 1,
      'pldm_transport_af_mctp_core' => 1,
      'pldm_transport_af_mctp_destroy' => 1,
      'pldm_transport_af_mctp_init' => 1,
      'pldm_transport_af_mctp_init_pollfd' => 1,
      'pldm_transport_af_mctp_map_tid' => 1,
      'pldm_transport_af_mctp_unmap_tid' => 1,
      'pldm_transport_mctp_demux_core' => 1,
      'pldm_transport_mctp_demux_destroy' => 1,
      'pldm_transport_mctp_demux_init' => 1,
      'pldm_transport_mctp_demux_init_pollfd' => 1,
      'pldm_transport_mctp_demux_map_tid' => 1,
      'pldm_transport_mctp_demux_unmap_tid' => 1,
      'pldm_transport_poll' => 1,
      'pldm_transport_recv_msg' => 1,
      'pldm_transport_send_msg' => 1,
      'pldm_transport_send_recv_msg' => 1,
      'unpack_pldm_header' => 1,
      'ver2str' => 1
    }
  },
  'Target' => 'unix',
  'TypeInfo' => {
    '1' => {
      'Name' => 'void',
      'Type' => 'Intrinsic'
    },
    '51' => {
      'Name' => 'char',
      'Size' => '1',
      'Type' => 'Intrinsic'
    },
    '58' => {
      'Name' => 'int',
      'Size' => '4',
      'Type' => 'Intrinsic'
    },
    '65' => {
      'Name' => 'unsigned char',
      'Size' => '1',
      'Type' => 'Intrinsic'
    },
    '72' => {
      'Name' => 'unsigned short',
      'Size' => '2',
      'Type' => 'Intrinsic'
    },
    '79' => {
      'Name' => 'unsigned int',
      'Size' => '4',
      'Type' => 'Intrinsic'
    },
    '86' => {
      'Name' => 'unsigned long',
      'Size' => '8',
      'Type' => 'Intrinsic'
    },
    '93' => {
      'Name' => 'signed char',
      'Size' => '1',
      'Type' => 'Intrinsic'
    },
    '100' => {
      'BaseType' => '65',
      'Header' => 'types.h',
      'Line' => '38',
      'Name' => '__uint8_t',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '112' => {
      'Name' => 'short',
      'Size' => '2',
      'Type' => 'Intrinsic'
    },
    '119' => {
      'BaseType' => '79',
      'Header' => 'types.h',
      'Line' => '42',
      'Name' => '__uint32_t',
      'PrivateABI' => 1,
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '131' => {
      'Name' => 'long',
      'Size' => '8',
      'Type' => 'Intrinsic'
    },
    '138' => {
      'BaseType' => '1',
      'Name' => 'void*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '140' => {
      'BaseType' => '100',
      'Header' => 'stdint-uintn.h',
      'Line' => '24',
      'Name' => 'uint8_t',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '152' => {
      'BaseType' => '119',
      'Header' => 'stdint-uintn.h',
      'Line' => '26',
      'Name' => 'uint32_t',
      'PrivateABI' => 1,
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '164' => {
      'BaseType' => '152',
      'Name' => 'uint32_t const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '169' => {
      'BaseType' => '86',
      'Header' => 'stddef.h',
      'Line' => '214',
      'Name' => 'size_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '195' => {
      'Header' => 'pldm_types.h',
      'Line' => '9',
      'Name' => 'anon-struct-pldm_types.h-9',
      'Size' => '1',
      'Type' => 'Struct'
    },
    '349' => {
      'Header' => 'pldm_types.h',
      'Line' => '19',
      'Memb' => {
        '0' => {
          'name' => 'byte',
          'offset' => '0',
          'type' => '140'
        },
        '1' => {
          'name' => 'bits',
          'offset' => '0',
          'type' => '195'
        }
      },
      'Name' => 'union bitfield8_t',
      'Size' => '1',
      'Type' => 'Union'
    },
    '361' => {
      'BaseType' => '349',
      'Name' => 'bitfield8_t const',
      'Size' => '1',
      'Type' => 'Const'
    },
    '366' => {
      'Header' => 'pldm_types.h',
      'Line' => '25',
      'Memb' => {
        '0' => {
          'name' => 'alpha',
          'offset' => '0',
          'type' => '140'
        },
        '1' => {
          'name' => 'update',
          'offset' => '1',
          'type' => '140'
        },
        '2' => {
          'name' => 'minor',
          'offset' => '2',
          'type' => '140'
        },
        '3' => {
          'name' => 'major',
          'offset' => '3',
          'type' => '140'
        }
      },
      'Name' => 'struct pldm_version',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '432' => {
      'BaseType' => '366',
      'Header' => 'pldm_types.h',
      'Line' => '30',
      'Name' => 'ver32_t',
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '444' => {
      'BaseType' => '432',
      'Name' => 'ver32_t const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '449' => {
      'Name' => 'float',
      'Size' => '4',
      'Type' => 'Intrinsic'
    },
    '884' => {
      'Header' => 'base.h',
      'Line' => '129',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_RESPONSE',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_REQUEST',
          'value' => '1'
        },
        '2' => {
          'name' => 'PLDM_RESERVED',
          'value' => '2'
        },
        '3' => {
          'name' => 'PLDM_ASYNC_REQUEST_NOTIFY',
          'value' => '3'
        }
      },
      'Name' => 'enum MessageType',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '896' => {
      'Header' => 'base.h',
      'Line' => '182',
      'Memb' => {
        '0' => {
          'name' => 'command',
          'offset' => '2',
          'type' => '140'
        }
      },
      'Name' => 'struct pldm_msg_hdr',
      'Size' => '3',
      'Type' => 'Struct'
    },
    '1007' => {
      'BaseType' => '896',
      'Name' => 'struct pldm_msg_hdr const',
      'Size' => '3',
      'Type' => 'Const'
    },
    '1012' => {
      'Header' => 'base.h',
      'Line' => '215',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '896'
        },
        '1' => {
          'name' => 'payload',
          'offset' => '3',
          'type' => '1057'
        }
      },
      'Name' => 'struct pldm_msg',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '1052' => {
      'BaseType' => '1012',
      'Name' => 'struct pldm_msg const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '1057' => {
      'BaseType' => '140',
      'Name' => 'uint8_t[1]',
      'Size' => '1',
      'Type' => 'Array'
    },
    '1073' => {
      'Header' => 'base.h',
      'Line' => '282',
      'Memb' => {
        '0' => {
          'name' => 'msg_type',
          'offset' => '0',
          'type' => '884'
        },
        '1' => {
          'name' => 'instance',
          'offset' => '4',
          'type' => '140'
        },
        '2' => {
          'name' => 'pldm_type',
          'offset' => '5',
          'type' => '140'
        },
        '3' => {
          'name' => 'command',
          'offset' => '6',
          'type' => '140'
        },
        '4' => {
          'name' => 'completion_code',
          'offset' => '7',
          'type' => '140'
        }
      },
      'Name' => 'struct pldm_header_info',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '1153' => {
      'BaseType' => '1073',
      'Name' => 'struct pldm_header_info const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '1158' => {
      'BaseType' => '349',
      'Name' => 'bitfield8_t[8]',
      'Size' => '8',
      'Type' => 'Array'
    },
    '1320' => {
      'BaseType' => '1325',
      'Name' => 'void const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '1325' => {
      'BaseType' => '1',
      'Name' => 'void const',
      'Type' => 'Const'
    },
    '1326' => {
      'BaseType' => '361',
      'Name' => 'bitfield8_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '1501' => {
      'BaseType' => '1012',
      'Name' => 'struct pldm_msg*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '1580' => {
      'BaseType' => '1052',
      'Name' => 'struct pldm_msg const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '1585' => {
      'BaseType' => '140',
      'Name' => 'uint8_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '1590' => {
      'BaseType' => '432',
      'Name' => 'ver32_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '1684' => {
      'BaseType' => '444',
      'Name' => 'ver32_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '1731' => {
      'BaseType' => '152',
      'Name' => 'uint32_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '1800' => {
      'BaseType' => '1007',
      'Name' => 'struct pldm_msg_hdr const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '1805' => {
      'BaseType' => '1073',
      'Name' => 'struct pldm_header_info*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2760' => {
      'BaseType' => '169',
      'Name' => 'size_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '3220' => {
      'BaseType' => '1153',
      'Name' => 'struct pldm_header_info const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '4897' => {
      'BaseType' => '140',
      'Header' => 'base.h',
      'Line' => '19',
      'Name' => 'pldm_tid_t',
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '4909' => {
      'BaseType' => '140',
      'Header' => 'instance-id.h',
      'Line' => '13',
      'Name' => 'pldm_instance_id_t',
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '4921' => {
      'Header' => 'responder.h',
      'Line' => '10',
      'Memb' => {
        '0' => {
          'name' => 'tid',
          'offset' => '0',
          'type' => '4897'
        },
        '1' => {
          'name' => 'instance_id',
          'offset' => '1',
          'type' => '4909'
        },
        '2' => {
          'name' => 'type',
          'offset' => '2',
          'type' => '140'
        },
        '3' => {
          'name' => 'command',
          'offset' => '3',
          'type' => '140'
        },
        '4' => {
          'name' => 'next',
          'offset' => '8',
          'type' => '5001'
        }
      },
      'Name' => 'struct pldm_responder_cookie',
      'PrivateABI' => 1,
      'Size' => '16',
      'Type' => 'Struct'
    },
    '5001' => {
      'BaseType' => '4921',
      'Name' => 'struct pldm_responder_cookie*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '5006' => {
      'Header' => 'pldm.h',
      'Line' => '15',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_REQUESTER_SUCCESS',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_REQUESTER_OPEN_FAIL',
          'value' => '18446744073709551615 (-1)'
        },
        '2' => {
          'name' => 'PLDM_REQUESTER_NOT_PLDM_MSG',
          'value' => '18446744073709551614 (-2)'
        },
        '3' => {
          'name' => 'PLDM_REQUESTER_NOT_RESP_MSG',
          'value' => '18446744073709551613 (-3)'
        },
        '4' => {
          'name' => 'PLDM_REQUESTER_NOT_REQ_MSG',
          'value' => '18446744073709551612 (-4)'
        },
        '5' => {
          'name' => 'PLDM_REQUESTER_RESP_MSG_TOO_SMALL',
          'value' => '18446744073709551611 (-5)'
        },
        '6' => {
          'name' => 'PLDM_REQUESTER_INSTANCE_ID_MISMATCH',
          'value' => '18446744073709551610 (-6)'
        },
        '7' => {
          'name' => 'PLDM_REQUESTER_SEND_FAIL',
          'value' => '18446744073709551609 (-7)'
        },
        '8' => {
          'name' => 'PLDM_REQUESTER_RECV_FAIL',
          'value' => '18446744073709551608 (-8)'
        },
        '9' => {
          'name' => 'PLDM_REQUESTER_INVALID_RECV_LEN',
          'value' => '18446744073709551607 (-9)'
        },
        '10' => {
          'name' => 'PLDM_REQUESTER_SETUP_FAIL',
          'value' => '18446744073709551606 (-10)'
        },
        '11' => {
          'name' => 'PLDM_REQUESTER_INVALID_SETUP',
          'value' => '18446744073709551605 (-11)'
        },
        '12' => {
          'name' => 'PLDM_REQUESTER_POLL_FAIL',
          'value' => '18446744073709551604 (-12)'
        },
        '13' => {
          'name' => 'PLDM_REQUESTER_TRANSPORT_BUSY',
          'value' => '18446744073709551603 (-13)'
        }
      },
      'Name' => 'enum pldm_requester_error_codes',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '5527' => {
      'Name' => '_Bool',
      'Size' => '1',
      'Type' => 'Intrinsic'
    },
    '5654' => {
      'BaseType' => '72',
      'Header' => 'types.h',
      'Line' => '40',
      'Name' => '__uint16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '5692' => {
      'BaseType' => '131',
      'Header' => 'types.h',
      'Line' => '194',
      'Name' => '__ssize_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '5704' => {
      'BaseType' => '51',
      'Name' => 'char*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '5728' => {
      'BaseType' => '140',
      'Name' => 'uint8_t const',
      'Size' => '1',
      'Type' => 'Const'
    },
    '5733' => {
      'BaseType' => '5654',
      'Header' => 'stdint-uintn.h',
      'Line' => '25',
      'Name' => 'uint16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '5865' => {
      'BaseType' => '5692',
      'Header' => 'types.h',
      'Line' => '108',
      'Name' => 'ssize_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '5884' => {
      'BaseType' => '5728',
      'Name' => 'uint8_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '7507' => {
      'BaseType' => '51',
      'Name' => 'char const',
      'Size' => '1',
      'Type' => 'Const'
    },
    '7541' => {
      'BaseType' => '5733',
      'Name' => 'uint16_t const',
      'Size' => '2',
      'Type' => 'Const'
    },
    '7881' => {
      'Header' => 'utils.h',
      'Line' => '20',
      'Memb' => {
        '0' => {
          'name' => 'ptr',
          'offset' => '0',
          'type' => '5884'
        },
        '1' => {
          'name' => 'length',
          'offset' => '8',
          'type' => '169'
        }
      },
      'Name' => 'struct variable_field',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '8998' => {
      'Header' => 'base.h',
      'Line' => '366',
      'Memb' => {
        '0' => {
          'name' => 'pldm_type',
          'offset' => '0',
          'type' => '140'
        },
        '1' => {
          'name' => 'transfer_opflag',
          'offset' => '1',
          'type' => '140'
        },
        '2' => {
          'name' => 'transfer_ctx',
          'offset' => '4',
          'type' => '152'
        },
        '3' => {
          'name' => 'transfer_handle',
          'offset' => '8',
          'type' => '152'
        },
        '4' => {
          'name' => 'section_offset',
          'offset' => '18',
          'type' => '152'
        },
        '5' => {
          'name' => 'section_length',
          'offset' => '22',
          'type' => '152'
        }
      },
      'Name' => 'struct pldm_base_multipart_receive_req',
      'Size' => '20',
      'Type' => 'Struct'
    },
    '9089' => {
      'BaseType' => '8998',
      'Name' => 'struct pldm_base_multipart_receive_req const',
      'Size' => '20',
      'Type' => 'Const'
    },
    '9094' => {
      'Header' => 'base.h',
      'Line' => '384',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '140'
        },
        '1' => {
          'name' => 'transfer_flag',
          'offset' => '1',
          'type' => '140'
        },
        '2' => {
          'name' => 'next_transfer_handle',
          'offset' => '4',
          'type' => '152'
        },
        '3' => {
          'name' => 'data',
          'offset' => '8',
          'type' => '7881'
        }
      },
      'Name' => 'struct pldm_base_multipart_receive_resp',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '9164' => {
      'Header' => 'base.h',
      'Line' => '396',
      'Memb' => {
        '0' => {
          'name' => 'requester_part_size',
          'offset' => '0',
          'type' => '5733'
        },
        '1' => {
          'name' => 'requester_protocol_support',
          'offset' => '2',
          'type' => '1158'
        }
      },
      'Name' => 'struct pldm_base_negotiate_transfer_params_req',
      'Size' => '10',
      'Type' => 'Struct'
    },
    '9203' => {
      'BaseType' => '9164',
      'Name' => 'struct pldm_base_negotiate_transfer_params_req const',
      'Size' => '10',
      'Type' => 'Const'
    },
    '9208' => {
      'Header' => 'base.h',
      'Line' => '405',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '140'
        },
        '1' => {
          'name' => 'responder_part_size',
          'offset' => '2',
          'type' => '5733'
        },
        '2' => {
          'name' => 'responder_protocol_support',
          'offset' => '4',
          'type' => '1158'
        }
      },
      'Name' => 'struct pldm_base_negotiate_transfer_params_resp',
      'Size' => '12',
      'Type' => 'Struct'
    },
    '9294' => {
      'BaseType' => '7507',
      'Name' => 'char const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '10994' => {
      'BaseType' => '9208',
      'Name' => 'struct pldm_base_negotiate_transfer_params_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '12352' => {
      'BaseType' => '9203',
      'Name' => 'struct pldm_base_negotiate_transfer_params_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '18368' => {
      'BaseType' => '9094',
      'Name' => 'struct pldm_base_multipart_receive_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '20543' => {
      'BaseType' => '9089',
      'Name' => 'struct pldm_base_multipart_receive_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '25594' => {
      'BaseType' => '349',
      'Name' => 'bitfield8_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '27366' => {
      'BaseType' => '896',
      'Name' => 'struct pldm_msg_hdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '27744' => {
      'BaseType' => '138',
      'Name' => 'void**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '31131' => {
      'BaseType' => '7881',
      'Name' => 'struct variable_field*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '33213' => {
      'BaseType' => '5733',
      'Name' => 'uint16_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '36463' => {
      'BaseType' => '86',
      'Header' => 'types.h',
      'Line' => '45',
      'Name' => '__uint64_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '36557' => {
      'BaseType' => '36463',
      'Header' => 'stdint-uintn.h',
      'Line' => '27',
      'Name' => 'uint64_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '36855' => {
      'Header' => 'bios.h',
      'Line' => '39',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_BIOS_STRING_TABLE',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_BIOS_ATTR_TABLE',
          'value' => '1'
        },
        '2' => {
          'name' => 'PLDM_BIOS_ATTR_VAL_TABLE',
          'value' => '2'
        }
      },
      'Name' => 'enum pldm_bios_table_types',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '36889' => {
      'Header' => 'bios.h',
      'Line' => '48',
      'Memb' => {
        '0' => {
          'name' => 'string_handle',
          'offset' => '0',
          'type' => '5733'
        },
        '1' => {
          'name' => 'string_length',
          'offset' => '2',
          'type' => '5733'
        },
        '2' => {
          'name' => 'name',
          'offset' => '4',
          'type' => '36946'
        }
      },
      'Name' => 'struct pldm_bios_string_table_entry',
      'Size' => '5',
      'Type' => 'Struct'
    },
    '36941' => {
      'BaseType' => '36889',
      'Name' => 'struct pldm_bios_string_table_entry const',
      'Size' => '5',
      'Type' => 'Const'
    },
    '36946' => {
      'BaseType' => '51',
      'Name' => 'char[1]',
      'Size' => '1',
      'Type' => 'Array'
    },
    '36962' => {
      'Header' => 'bios.h',
      'Line' => '54',
      'Memb' => {
        '0' => {
          'name' => 'attr_handle',
          'offset' => '0',
          'type' => '5733'
        },
        '1' => {
          'name' => 'attr_type',
          'offset' => '2',
          'type' => '140'
        },
        '2' => {
          'name' => 'string_handle',
          'offset' => '3',
          'type' => '5733'
        },
        '3' => {
          'name' => 'metadata',
          'offset' => '5',
          'type' => '1057'
        }
      },
      'Name' => 'struct pldm_bios_attr_table_entry',
      'Size' => '6',
      'Type' => 'Struct'
    },
    '37027' => {
      'BaseType' => '36962',
      'Name' => 'struct pldm_bios_attr_table_entry const',
      'Size' => '6',
      'Type' => 'Const'
    },
    '37032' => {
      'Header' => 'bios.h',
      'Line' => '66',
      'Memb' => {
        '0' => {
          'name' => 'attr_handle',
          'offset' => '0',
          'type' => '5733'
        },
        '1' => {
          'name' => 'attr_type',
          'offset' => '2',
          'type' => '140'
        },
        '2' => {
          'name' => 'value',
          'offset' => '3',
          'type' => '1057'
        }
      },
      'Name' => 'struct pldm_bios_attr_val_table_entry',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '37084' => {
      'BaseType' => '37032',
      'Name' => 'struct pldm_bios_attr_val_table_entry const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '37153' => {
      'Header' => 'bios_table.h',
      'Line' => '206',
      'Memb' => {
        '0' => {
          'name' => 'name_handle',
          'offset' => '0',
          'type' => '5733'
        },
        '1' => {
          'name' => 'read_only',
          'offset' => '2',
          'type' => '5527'
        },
        '2' => {
          'name' => 'pv_num',
          'offset' => '3',
          'type' => '140'
        },
        '3' => {
          'name' => 'pv_handle',
          'offset' => '8',
          'type' => '37256'
        },
        '4' => {
          'name' => 'def_num',
          'offset' => '22',
          'type' => '140'
        },
        '5' => {
          'name' => 'def_index',
          'offset' => '36',
          'type' => '5884'
        }
      },
      'Name' => 'struct pldm_bios_table_attr_entry_enum_info',
      'Size' => '32',
      'Type' => 'Struct'
    },
    '37244' => {
      'BaseType' => '37153',
      'Name' => 'struct pldm_bios_table_attr_entry_enum_info const',
      'Size' => '32',
      'Type' => 'Const'
    },
    '37256' => {
      'BaseType' => '7541',
      'Name' => 'uint16_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '37261' => {
      'Header' => 'bios_table.h',
      'Line' => '294',
      'Memb' => {
        '0' => {
          'name' => 'name_handle',
          'offset' => '0',
          'type' => '5733'
        },
        '1' => {
          'name' => 'read_only',
          'offset' => '2',
          'type' => '5527'
        },
        '2' => {
          'name' => 'string_type',
          'offset' => '3',
          'type' => '140'
        },
        '3' => {
          'name' => 'min_length',
          'offset' => '4',
          'type' => '5733'
        },
        '4' => {
          'name' => 'max_length',
          'offset' => '6',
          'type' => '5733'
        },
        '5' => {
          'name' => 'def_length',
          'offset' => '8',
          'type' => '5733'
        },
        '6' => {
          'name' => 'def_string',
          'offset' => '22',
          'type' => '9294'
        }
      },
      'Name' => 'struct pldm_bios_table_attr_entry_string_info',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '37373' => {
      'BaseType' => '37261',
      'Name' => 'struct pldm_bios_table_attr_entry_string_info const',
      'Size' => '24',
      'Type' => 'Const'
    },
    '37383' => {
      'Header' => 'bios_table.h',
      'Line' => '384',
      'Memb' => {
        '0' => {
          'name' => 'name_handle',
          'offset' => '0',
          'type' => '5733'
        },
        '1' => {
          'name' => 'read_only',
          'offset' => '2',
          'type' => '5527'
        },
        '2' => {
          'name' => 'lower_bound',
          'offset' => '8',
          'type' => '36557'
        },
        '3' => {
          'name' => 'upper_bound',
          'offset' => '22',
          'type' => '36557'
        },
        '4' => {
          'name' => 'scalar_increment',
          'offset' => '36',
          'type' => '152'
        },
        '5' => {
          'name' => 'default_value',
          'offset' => '50',
          'type' => '36557'
        }
      },
      'Name' => 'struct pldm_bios_table_attr_entry_integer_info',
      'Size' => '40',
      'Type' => 'Struct'
    },
    '37481' => {
      'BaseType' => '37383',
      'Name' => 'struct pldm_bios_table_attr_entry_integer_info const',
      'Size' => '40',
      'Type' => 'Const'
    },
    '37713' => {
      'Name' => 'ssize_t(*)(void const*)',
      'Param' => {
        '0' => {
          'type' => '1320'
        }
      },
      'Return' => '5865',
      'Size' => '8',
      'Type' => 'FuncPtr'
    },
    '37783' => {
      'Line' => '957',
      'Memb' => {
        '0' => {
          'name' => 'table_data',
          'offset' => '0',
          'type' => '5884'
        },
        '1' => {
          'name' => 'table_len',
          'offset' => '8',
          'type' => '169'
        },
        '2' => {
          'name' => 'current_pos',
          'offset' => '22',
          'type' => '169'
        },
        '3' => {
          'name' => 'entry_length_handler',
          'offset' => '36',
          'type' => '37713'
        }
      },
      'Name' => 'struct pldm_bios_table_iter',
      'PrivateABI' => 1,
      'Size' => '32',
      'Source' => 'bios_table.c',
      'Type' => 'Struct'
    },
    '37853' => {
      'BaseType' => '37783',
      'Name' => 'struct pldm_bios_table_iter const',
      'Size' => '32',
      'Type' => 'Const'
    },
    '38923' => {
      'BaseType' => '37783',
      'Name' => 'struct pldm_bios_table_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '38928' => {
      'BaseType' => '37084',
      'Name' => 'struct pldm_bios_attr_val_table_entry const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '39342' => {
      'BaseType' => '37027',
      'Name' => 'struct pldm_bios_attr_table_entry const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '39945' => {
      'BaseType' => '36941',
      'Name' => 'struct pldm_bios_string_table_entry const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '41108' => {
      'BaseType' => '37853',
      'Name' => 'struct pldm_bios_table_iter const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '45291' => {
      'BaseType' => '36557',
      'Name' => 'uint64_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '45568' => {
      'BaseType' => '37481',
      'Name' => 'struct pldm_bios_table_attr_entry_integer_info const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '45835' => {
      'BaseType' => '9294',
      'Name' => 'char const**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '46964' => {
      'BaseType' => '37373',
      'Name' => 'struct pldm_bios_table_attr_entry_string_info const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '48418' => {
      'BaseType' => '37244',
      'Name' => 'struct pldm_bios_table_attr_entry_enum_info const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '50641' => {
      'Header' => 'pldm_types.h',
      'Line' => '36',
      'Name' => 'anon-struct-pldm_types.h-36',
      'Size' => '2',
      'Type' => 'Struct'
    },
    '50907' => {
      'Header' => 'pldm_types.h',
      'Line' => '54',
      'Memb' => {
        '0' => {
          'name' => 'value',
          'offset' => '0',
          'type' => '5733'
        },
        '1' => {
          'name' => 'bits',
          'offset' => '0',
          'type' => '50641'
        }
      },
      'Name' => 'union bitfield16_t',
      'Size' => '2',
      'Type' => 'Union'
    },
    '51645' => {
      'Header' => 'file.h',
      'Line' => '53',
      'Memb' => {
        '0' => {
          'name' => 'file_identifier',
          'offset' => '0',
          'type' => '5733'
        },
        '1' => {
          'name' => 'file_attribute',
          'offset' => '2',
          'type' => '50907'
        }
      },
      'Name' => 'struct pldm_file_df_open_req',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '51684' => {
      'BaseType' => '51645',
      'Name' => 'struct pldm_file_df_open_req const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '51689' => {
      'Header' => 'file.h',
      'Line' => '62',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '140'
        },
        '1' => {
          'name' => 'file_descriptor',
          'offset' => '2',
          'type' => '5733'
        }
      },
      'Name' => 'struct pldm_file_df_open_resp',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '51733' => {
      'Header' => 'file.h',
      'Line' => '71',
      'Memb' => {
        '0' => {
          'name' => 'file_descriptor',
          'offset' => '0',
          'type' => '5733'
        },
        '1' => {
          'name' => 'df_close_options',
          'offset' => '2',
          'type' => '50907'
        }
      },
      'Name' => 'struct pldm_file_df_close_req',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '51772' => {
      'BaseType' => '51733',
      'Name' => 'struct pldm_file_df_close_req const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '51777' => {
      'Header' => 'file.h',
      'Line' => '80',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '140'
        }
      },
      'Name' => 'struct pldm_file_df_close_resp',
      'Size' => '1',
      'Type' => 'Struct'
    },
    '51808' => {
      'Header' => 'file.h',
      'Line' => '88',
      'Memb' => {
        '0' => {
          'name' => 'file_descriptor',
          'offset' => '0',
          'type' => '5733'
        },
        '1' => {
          'name' => 'requester_max_interval',
          'offset' => '4',
          'type' => '152'
        }
      },
      'Name' => 'struct pldm_file_df_heartbeat_req',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '51847' => {
      'BaseType' => '51808',
      'Name' => 'struct pldm_file_df_heartbeat_req const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '51852' => {
      'Header' => 'file.h',
      'Line' => '97',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '140'
        },
        '1' => {
          'name' => 'responder_max_interval',
          'offset' => '4',
          'type' => '152'
        }
      },
      'Name' => 'struct pldm_file_df_heartbeat_resp',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '53141' => {
      'BaseType' => '51852',
      'Name' => 'struct pldm_file_df_heartbeat_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '54328' => {
      'BaseType' => '51847',
      'Name' => 'struct pldm_file_df_heartbeat_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '54464' => {
      'BaseType' => '51777',
      'Name' => 'struct pldm_file_df_close_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '57708' => {
      'BaseType' => '51772',
      'Name' => 'struct pldm_file_df_close_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '59041' => {
      'BaseType' => '51689',
      'Name' => 'struct pldm_file_df_open_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '62536' => {
      'BaseType' => '51684',
      'Name' => 'struct pldm_file_df_open_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '63862' => {
      'BaseType' => '140',
      'Header' => 'pldm_types.h',
      'Line' => '32',
      'Name' => 'bool8_t',
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '64150' => {
      'Header' => 'pldm_types.h',
      'Line' => '58',
      'Name' => 'anon-struct-pldm_types.h-58',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '64638' => {
      'Header' => 'pldm_types.h',
      'Line' => '92',
      'Memb' => {
        '0' => {
          'name' => 'value',
          'offset' => '0',
          'type' => '152'
        },
        '1' => {
          'name' => 'bits',
          'offset' => '0',
          'type' => '64150'
        }
      },
      'Name' => 'union bitfield32_t',
      'Size' => '4',
      'Type' => 'Union'
    },
    '64650' => {
      'Header' => 'pldm_types.h',
      'Line' => '96',
      'Name' => 'anon-struct-pldm_types.h-96',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '65586' => {
      'Header' => 'pldm_types.h',
      'Line' => '162',
      'Memb' => {
        '0' => {
          'name' => 'value',
          'offset' => '0',
          'type' => '36557'
        },
        '1' => {
          'name' => 'bits',
          'offset' => '0',
          'type' => '64650'
        }
      },
      'Name' => 'union bitfield64_t',
      'Size' => '8',
      'Type' => 'Union'
    },
    '65617' => {
      'BaseType' => '140',
      'Name' => 'uint8_t[16]',
      'Size' => '16',
      'Type' => 'Array'
    },
    '65662' => {
      'BaseType' => '169',
      'Name' => 'size_t const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '65726' => {
      'BaseType' => '7881',
      'Name' => 'struct variable_field const',
      'Size' => '16',
      'Type' => 'Const'
    },
    '67827' => {
      'BaseType' => '140',
      'Name' => 'uint8_t[8]',
      'Size' => '8',
      'Type' => 'Array'
    },
    '67843' => {
      'Header' => 'firmware_update.h',
      'Line' => '466',
      'Memb' => {
        '0' => {
          'name' => 'uuid',
          'offset' => '0',
          'type' => '65617'
        },
        '1' => {
          'name' => 'package_header_format_version',
          'offset' => '22',
          'type' => '140'
        },
        '2' => {
          'name' => 'package_header_size',
          'offset' => '23',
          'type' => '5733'
        },
        '3' => {
          'name' => 'package_release_date_time',
          'offset' => '25',
          'type' => '67956'
        },
        '4' => {
          'name' => 'component_bitmap_bit_length',
          'offset' => '50',
          'type' => '5733'
        },
        '5' => {
          'name' => 'package_version_string_type',
          'offset' => '52',
          'type' => '140'
        },
        '6' => {
          'name' => 'package_version_string_length',
          'offset' => '53',
          'type' => '140'
        }
      },
      'Name' => 'struct pldm_package_header_information',
      'Size' => '36',
      'Type' => 'Struct'
    },
    '67956' => {
      'BaseType' => '140',
      'Name' => 'uint8_t[13]',
      'Size' => '13',
      'Type' => 'Array'
    },
    '67972' => {
      'Header' => 'firmware_update.h',
      'Line' => '480',
      'Memb' => {
        '0' => {
          'name' => 'record_length',
          'offset' => '0',
          'type' => '5733'
        },
        '1' => {
          'name' => 'descriptor_count',
          'offset' => '2',
          'type' => '140'
        },
        '2' => {
          'name' => 'device_update_option_flags',
          'offset' => '3',
          'type' => '64638'
        },
        '3' => {
          'name' => 'comp_image_set_version_string_type',
          'offset' => '7',
          'type' => '140'
        },
        '4' => {
          'name' => 'comp_image_set_version_string_length',
          'offset' => '8',
          'type' => '140'
        },
        '5' => {
          'name' => 'fw_device_pkg_data_length',
          'offset' => '9',
          'type' => '5733'
        }
      },
      'Name' => 'struct pldm_firmware_device_id_record',
      'Size' => '11',
      'Type' => 'Struct'
    },
    '68185' => {
      'Header' => 'firmware_update.h',
      'Line' => '514',
      'Memb' => {
        '0' => {
          'name' => 'comp_classification',
          'offset' => '0',
          'type' => '5733'
        },
        '1' => {
          'name' => 'comp_identifier',
          'offset' => '2',
          'type' => '5733'
        },
        '2' => {
          'name' => 'comp_comparison_stamp',
          'offset' => '4',
          'type' => '152'
        },
        '3' => {
          'name' => 'comp_options',
          'offset' => '8',
          'type' => '50907'
        },
        '4' => {
          'name' => 'requested_comp_activation_method',
          'offset' => '16',
          'type' => '50907'
        },
        '5' => {
          'name' => 'comp_location_offset',
          'offset' => '18',
          'type' => '152'
        },
        '6' => {
          'name' => 'comp_size',
          'offset' => '22',
          'type' => '152'
        },
        '7' => {
          'name' => 'comp_version_string_type',
          'offset' => '32',
          'type' => '140'
        },
        '8' => {
          'name' => 'comp_version_string_length',
          'offset' => '33',
          'type' => '140'
        }
      },
      'Name' => 'struct pldm_component_image_information',
      'Size' => '22',
      'Type' => 'Struct'
    },
    '68383' => {
      'Header' => 'firmware_update.h',
      'Line' => '540',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '140'
        },
        '1' => {
          'name' => 'capabilities_during_update',
          'offset' => '1',
          'type' => '64638'
        },
        '2' => {
          'name' => 'comp_count',
          'offset' => '5',
          'type' => '5733'
        },
        '3' => {
          'name' => 'active_comp_image_set_ver_str_type',
          'offset' => '7',
          'type' => '140'
        },
        '4' => {
          'name' => 'active_comp_image_set_ver_str_len',
          'offset' => '8',
          'type' => '140'
        },
        '5' => {
          'name' => 'pending_comp_image_set_ver_str_type',
          'offset' => '9',
          'type' => '140'
        },
        '6' => {
          'name' => 'pending_comp_image_set_ver_str_len',
          'offset' => '16',
          'type' => '140'
        }
      },
      'Name' => 'struct pldm_get_firmware_parameters_resp',
      'Size' => '11',
      'Type' => 'Struct'
    },
    '68586' => {
      'Header' => 'firmware_update.h',
      'Line' => '568',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '140'
        },
        '1' => {
          'name' => 'downstream_device_update_supported',
          'offset' => '1',
          'type' => '140'
        },
        '2' => {
          'name' => 'number_of_downstream_devices',
          'offset' => '2',
          'type' => '5733'
        },
        '3' => {
          'name' => 'max_number_of_downstream_devices',
          'offset' => '4',
          'type' => '5733'
        },
        '4' => {
          'name' => 'capabilities',
          'offset' => '8',
          'type' => '64638'
        }
      },
      'Name' => 'struct pldm_query_downstream_devices_resp',
      'Size' => '12',
      'Type' => 'Struct'
    },
    '68671' => {
      'Header' => 'firmware_update.h',
      'Line' => '580',
      'Memb' => {
        '0' => {
          'name' => 'comp_classification',
          'offset' => '0',
          'type' => '5733'
        },
        '1' => {
          'name' => 'comp_identifier',
          'offset' => '2',
          'type' => '5733'
        },
        '2' => {
          'name' => 'comp_classification_index',
          'offset' => '4',
          'type' => '140'
        },
        '3' => {
          'name' => 'active_comp_comparison_stamp',
          'offset' => '5',
          'type' => '152'
        },
        '4' => {
          'name' => 'active_comp_ver_str_type',
          'offset' => '9',
          'type' => '140'
        },
        '5' => {
          'name' => 'active_comp_ver_str_len',
          'offset' => '16',
          'type' => '140'
        },
        '6' => {
          'name' => 'active_comp_release_date',
          'offset' => '17',
          'type' => '67827'
        },
        '7' => {
          'name' => 'pending_comp_comparison_stamp',
          'offset' => '25',
          'type' => '152'
        },
        '8' => {
          'name' => 'pending_comp_ver_str_type',
          'offset' => '35',
          'type' => '140'
        },
        '9' => {
          'name' => 'pending_comp_ver_str_len',
          'offset' => '36',
          'type' => '140'
        },
        '10' => {
          'name' => 'pending_comp_release_date',
          'offset' => '37',
          'type' => '67827'
        },
        '11' => {
          'name' => 'comp_activation_methods',
          'offset' => '51',
          'type' => '50907'
        },
        '12' => {
          'name' => 'capabilities_during_update',
          'offset' => '53',
          'type' => '64638'
        }
      },
      'Name' => 'struct pldm_component_parameter_entry',
      'Size' => '39',
      'Type' => 'Struct'
    },
    '68986' => {
      'Header' => 'firmware_update.h',
      'Line' => '619',
      'Memb' => {
        '0' => {
          'name' => 'data_transfer_handle',
          'offset' => '0',
          'type' => '152'
        },
        '1' => {
          'name' => 'transfer_operation_flag',
          'offset' => '4',
          'type' => '140'
        }
      },
      'Name' => 'struct pldm_query_downstream_identifiers_req',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '69029' => {
      'BaseType' => '68986',
      'Name' => 'struct pldm_query_downstream_identifiers_req const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '69034' => {
      'Header' => 'firmware_update.h',
      'Line' => '633',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '140'
        },
        '1' => {
          'name' => 'next_data_transfer_handle',
          'offset' => '4',
          'type' => '152'
        },
        '2' => {
          'name' => 'transfer_flag',
          'offset' => '8',
          'type' => '140'
        },
        '3' => {
          'name' => 'downstream_devices_length',
          'offset' => '18',
          'type' => '152'
        },
        '4' => {
          'name' => 'number_of_downstream_devices',
          'offset' => '22',
          'type' => '5733'
        }
      },
      'Name' => 'struct pldm_query_downstream_identifiers_resp',
      'Size' => '20',
      'Type' => 'Struct'
    },
    '69119' => {
      'Header' => 'firmware_update.h',
      'Line' => '646',
      'Memb' => {
        '0' => {
          'name' => 'downstream_device_index',
          'offset' => '0',
          'type' => '5733'
        },
        '1' => {
          'name' => 'downstream_descriptor_count',
          'offset' => '2',
          'type' => '140'
        }
      },
      'Name' => 'struct pldm_downstream_device',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '69162' => {
      'Header' => 'firmware_update.h',
      'Line' => '652',
      'Memb' => {
        '0' => {
          'name' => 'field',
          'offset' => '0',
          'type' => '7881'
        },
        '1' => {
          'name' => 'devs',
          'offset' => '22',
          'type' => '169'
        }
      },
      'Name' => 'struct pldm_downstream_device_iter',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '69205' => {
      'Header' => 'firmware_update.h',
      'Line' => '726',
      'Memb' => {
        '0' => {
          'name' => 'descriptor_type',
          'offset' => '0',
          'type' => '5733'
        },
        '1' => {
          'name' => 'descriptor_length',
          'offset' => '2',
          'type' => '5733'
        },
        '2' => {
          'name' => 'descriptor_data',
          'offset' => '8',
          'type' => '1320'
        }
      },
      'Name' => 'struct pldm_descriptor',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '69278' => {
      'Header' => 'firmware_update.h',
      'Line' => '732',
      'Memb' => {
        '0' => {
          'name' => 'field',
          'offset' => '0',
          'type' => '31131'
        },
        '1' => {
          'name' => 'count',
          'offset' => '8',
          'type' => '169'
        }
      },
      'Name' => 'struct pldm_descriptor_iter',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '69326' => {
      'Header' => 'firmware_update.h',
      'Line' => '825',
      'Memb' => {
        '0' => {
          'name' => 'data_transfer_handle',
          'offset' => '0',
          'type' => '152'
        },
        '1' => {
          'name' => 'transfer_operation_flag',
          'offset' => '4',
          'type' => '140'
        }
      },
      'Name' => 'struct pldm_get_downstream_firmware_parameters_req',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '69369' => {
      'BaseType' => '69326',
      'Name' => 'struct pldm_get_downstream_firmware_parameters_req const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '69374' => {
      'Header' => 'firmware_update.h',
      'Line' => '840',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '140'
        },
        '1' => {
          'name' => 'next_data_transfer_handle',
          'offset' => '4',
          'type' => '152'
        },
        '2' => {
          'name' => 'transfer_flag',
          'offset' => '8',
          'type' => '140'
        },
        '3' => {
          'name' => 'fdp_capabilities_during_update',
          'offset' => '18',
          'type' => '64638'
        },
        '4' => {
          'name' => 'downstream_device_count',
          'offset' => '22',
          'type' => '5733'
        }
      },
      'Name' => 'struct pldm_get_downstream_firmware_parameters_resp',
      'Size' => '20',
      'Type' => 'Struct'
    },
    '69459' => {
      'Header' => 'firmware_update.h',
      'Line' => '858',
      'Memb' => {
        '0' => {
          'name' => 'downstream_device_index',
          'offset' => '0',
          'type' => '5733'
        },
        '1' => {
          'name' => 'active_comp_comparison_stamp',
          'offset' => '4',
          'type' => '152'
        },
        '2' => {
          'name' => 'active_comp_ver_str_type',
          'offset' => '8',
          'type' => '140'
        },
        '3' => {
          'name' => 'active_comp_ver_str_len',
          'offset' => '9',
          'type' => '140'
        },
        '4' => {
          'name' => 'active_comp_release_date',
          'offset' => '16',
          'type' => '69656'
        },
        '5' => {
          'name' => 'pending_comp_comparison_stamp',
          'offset' => '32',
          'type' => '152'
        },
        '6' => {
          'name' => 'pending_comp_ver_str_type',
          'offset' => '36',
          'type' => '140'
        },
        '7' => {
          'name' => 'pending_comp_ver_str_len',
          'offset' => '37',
          'type' => '140'
        },
        '8' => {
          'name' => 'pending_comp_release_date',
          'offset' => '38',
          'type' => '69656'
        },
        '9' => {
          'name' => 'comp_activation_methods',
          'offset' => '54',
          'type' => '50907'
        },
        '10' => {
          'name' => 'capabilities_during_update',
          'offset' => '64',
          'type' => '64638'
        },
        '11' => {
          'name' => 'active_comp_ver_str',
          'offset' => '72',
          'type' => '1320'
        },
        '12' => {
          'name' => 'pending_comp_ver_str',
          'offset' => '86',
          'type' => '1320'
        }
      },
      'Name' => 'struct pldm_downstream_device_parameters_entry',
      'Size' => '64',
      'Type' => 'Struct'
    },
    '69656' => {
      'BaseType' => '51',
      'Name' => 'char[9]',
      'Size' => '9',
      'Type' => 'Array'
    },
    '71027' => {
      'Header' => 'firmware_update.h',
      'Line' => '1395',
      'Memb' => {
        '0' => {
          'name' => 'field',
          'offset' => '0',
          'type' => '7881'
        },
        '1' => {
          'name' => 'entries',
          'offset' => '22',
          'type' => '169'
        }
      },
      'Name' => 'struct pldm_downstream_device_parameters_iter',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '87038' => {
      'BaseType' => '63862',
      'Name' => 'bool8_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '87043' => {
      'BaseType' => '65586',
      'Name' => 'bitfield64_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '90421' => {
      'BaseType' => '64638',
      'Name' => 'bitfield32_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '94442' => {
      'BaseType' => '50907',
      'Name' => 'bitfield16_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '104621' => {
      'BaseType' => '65726',
      'Name' => 'struct variable_field const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '125949' => {
      'BaseType' => '71027',
      'Name' => 'struct pldm_downstream_device_parameters_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '125954' => {
      'BaseType' => '69459',
      'Name' => 'struct pldm_downstream_device_parameters_entry*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '128596' => {
      'BaseType' => '69374',
      'Name' => 'struct pldm_get_downstream_firmware_parameters_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '129711' => {
      'BaseType' => '69369',
      'Name' => 'struct pldm_get_downstream_firmware_parameters_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '130867' => {
      'BaseType' => '69162',
      'Name' => 'struct pldm_downstream_device_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '130872' => {
      'BaseType' => '69119',
      'Name' => 'struct pldm_downstream_device*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '133528' => {
      'BaseType' => '69034',
      'Name' => 'struct pldm_query_downstream_identifiers_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '134643' => {
      'BaseType' => '69029',
      'Name' => 'struct pldm_query_downstream_identifiers_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '137208' => {
      'BaseType' => '68586',
      'Name' => 'struct pldm_query_downstream_devices_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '137655' => {
      'BaseType' => '68671',
      'Name' => 'struct pldm_component_parameter_entry*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '146077' => {
      'BaseType' => '68383',
      'Name' => 'struct pldm_get_firmware_parameters_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '149007' => {
      'BaseType' => '1585',
      'Name' => 'uint8_t**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '149349' => {
      'BaseType' => '68185',
      'Name' => 'struct pldm_component_image_information*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '151811' => {
      'BaseType' => '69278',
      'Name' => 'struct pldm_descriptor_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '151816' => {
      'BaseType' => '69205',
      'Name' => 'struct pldm_descriptor*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '152200' => {
      'BaseType' => '67972',
      'Name' => 'struct pldm_firmware_device_id_record*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '159050' => {
      'BaseType' => '67843',
      'Name' => 'struct pldm_package_header_information*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '173937' => {
      'BaseType' => '173954',
      'Header' => 'pdr.h',
      'Line' => '16',
      'Name' => 'pldm_pdr',
      'PrivateABI' => 1,
      'Size' => '24',
      'Type' => 'Typedef'
    },
    '173949' => {
      'BaseType' => '173937',
      'Name' => 'pldm_pdr const',
      'Size' => '24',
      'Type' => 'Const'
    },
    '173954' => {
      'Line' => '30',
      'Memb' => {
        '0' => {
          'name' => 'record_count',
          'offset' => '0',
          'type' => '152'
        },
        '1' => {
          'name' => 'size',
          'offset' => '4',
          'type' => '152'
        },
        '2' => {
          'name' => 'first',
          'offset' => '8',
          'type' => '175381'
        },
        '3' => {
          'name' => 'last',
          'offset' => '22',
          'type' => '175381'
        }
      },
      'Name' => 'struct pldm_pdr',
      'PrivateABI' => 1,
      'Size' => '24',
      'Source' => 'pdr.c',
      'Type' => 'Struct'
    },
    '174020' => {
      'BaseType' => '174037',
      'Header' => 'pdr.h',
      'Line' => '21',
      'Name' => 'pldm_pdr_record',
      'PrivateABI' => 1,
      'Size' => '32',
      'Type' => 'Typedef'
    },
    '174032' => {
      'BaseType' => '174020',
      'Name' => 'pldm_pdr_record const',
      'Size' => '32',
      'Type' => 'Const'
    },
    '174037' => {
      'Line' => '21',
      'Memb' => {
        '0' => {
          'name' => 'record_handle',
          'offset' => '0',
          'type' => '152'
        },
        '1' => {
          'name' => 'size',
          'offset' => '4',
          'type' => '152'
        },
        '2' => {
          'name' => 'data',
          'offset' => '8',
          'type' => '1585'
        },
        '3' => {
          'name' => 'next',
          'offset' => '22',
          'type' => '175369'
        },
        '4' => {
          'name' => 'is_remote',
          'offset' => '36',
          'type' => '5527'
        },
        '5' => {
          'name' => 'terminus_handle',
          'offset' => '38',
          'type' => '5733'
        }
      },
      'Name' => 'struct pldm_pdr_record',
      'PrivateABI' => 1,
      'Size' => '32',
      'Source' => 'pdr.c',
      'Type' => 'Struct'
    },
    '174129' => {
      'Header' => 'pdr.h',
      'Line' => '327',
      'Memb' => {
        '0' => {
          'name' => 'entity_type',
          'offset' => '0',
          'type' => '5733'
        },
        '1' => {
          'name' => 'entity_instance_num',
          'offset' => '2',
          'type' => '5733'
        },
        '2' => {
          'name' => 'entity_container_id',
          'offset' => '4',
          'type' => '5733'
        }
      },
      'Name' => 'struct pldm_entity',
      'Size' => '6',
      'Type' => 'Struct'
    },
    '174191' => {
      'BaseType' => '174129',
      'Header' => 'pdr.h',
      'Line' => '331',
      'Name' => 'pldm_entity',
      'Size' => '6',
      'Type' => 'Typedef'
    },
    '174237' => {
      'BaseType' => '174249',
      'Header' => 'pdr.h',
      'Line' => '341',
      'Name' => 'pldm_entity_association_tree',
      'PrivateABI' => 1,
      'Size' => '16',
      'Type' => 'Typedef'
    },
    '174249' => {
      'Line' => '647',
      'Memb' => {
        '0' => {
          'name' => 'root',
          'offset' => '0',
          'type' => '175386'
        },
        '1' => {
          'name' => 'last_used_container_id',
          'offset' => '8',
          'type' => '5733'
        }
      },
      'Name' => 'struct pldm_entity_association_tree',
      'PrivateABI' => 1,
      'Size' => '16',
      'Source' => 'pdr.c',
      'Type' => 'Struct'
    },
    '174292' => {
      'BaseType' => '174309',
      'Header' => 'pdr.h',
      'Line' => '346',
      'Name' => 'pldm_entity_node',
      'PrivateABI' => 1,
      'Size' => '40',
      'Type' => 'Typedef'
    },
    '174304' => {
      'BaseType' => '174292',
      'Name' => 'pldm_entity_node const',
      'Size' => '40',
      'Type' => 'Const'
    },
    '174309' => {
      'Line' => '652',
      'Memb' => {
        '0' => {
          'name' => 'entity',
          'offset' => '0',
          'type' => '174191'
        },
        '1' => {
          'name' => 'parent',
          'offset' => '6',
          'type' => '174191'
        },
        '2' => {
          'name' => 'remote_container_id',
          'offset' => '18',
          'type' => '5733'
        },
        '3' => {
          'name' => 'first_child',
          'offset' => '22',
          'type' => '175386'
        },
        '4' => {
          'name' => 'next_sibling',
          'offset' => '36',
          'type' => '175386'
        },
        '5' => {
          'name' => 'association_type',
          'offset' => '50',
          'type' => '140'
        }
      },
      'Name' => 'struct pldm_entity_node',
      'PrivateABI' => 1,
      'Size' => '40',
      'Source' => 'pdr.c',
      'Type' => 'Struct'
    },
    '174587' => {
      'Header' => 'platform.h',
      'Line' => '575',
      'Memb' => {
        '0' => {
          'name' => 'record_handle',
          'offset' => '0',
          'type' => '152'
        },
        '1' => {
          'name' => 'version',
          'offset' => '4',
          'type' => '140'
        },
        '2' => {
          'name' => 'type',
          'offset' => '5',
          'type' => '140'
        },
        '3' => {
          'name' => 'record_change_num',
          'offset' => '6',
          'type' => '5733'
        },
        '4' => {
          'name' => 'length',
          'offset' => '8',
          'type' => '5733'
        }
      },
      'Name' => 'struct pldm_pdr_hdr',
      'Size' => '10',
      'Type' => 'Struct'
    },
    '175036' => {
      'Header' => 'platform.h',
      'Line' => '650',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '174587'
        },
        '1' => {
          'name' => 'terminus_handle',
          'offset' => '16',
          'type' => '5733'
        },
        '2' => {
          'name' => 'sensor_id',
          'offset' => '18',
          'type' => '5733'
        },
        '3' => {
          'name' => 'entity_type',
          'offset' => '20',
          'type' => '5733'
        },
        '4' => {
          'name' => 'entity_instance',
          'offset' => '22',
          'type' => '5733'
        },
        '5' => {
          'name' => 'container_id',
          'offset' => '24',
          'type' => '5733'
        },
        '6' => {
          'name' => 'sensor_init',
          'offset' => '32',
          'type' => '140'
        },
        '7' => {
          'name' => 'sensor_auxiliary_names_pdr',
          'offset' => '33',
          'type' => '63862'
        },
        '8' => {
          'name' => 'composite_sensor_count',
          'offset' => '34',
          'type' => '140'
        },
        '9' => {
          'name' => 'possible_states',
          'offset' => '35',
          'type' => '1057'
        }
      },
      'Name' => 'struct pldm_state_sensor_pdr',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '175190' => {
      'Header' => 'platform.h',
      'Line' => '677',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '174587'
        },
        '1' => {
          'name' => 'terminus_handle',
          'offset' => '16',
          'type' => '5733'
        },
        '2' => {
          'name' => 'effecter_id',
          'offset' => '18',
          'type' => '5733'
        },
        '3' => {
          'name' => 'entity_type',
          'offset' => '20',
          'type' => '5733'
        },
        '4' => {
          'name' => 'entity_instance',
          'offset' => '22',
          'type' => '5733'
        },
        '5' => {
          'name' => 'container_id',
          'offset' => '24',
          'type' => '5733'
        },
        '6' => {
          'name' => 'effecter_semantic_id',
          'offset' => '32',
          'type' => '5733'
        },
        '7' => {
          'name' => 'effecter_init',
          'offset' => '34',
          'type' => '140'
        },
        '8' => {
          'name' => 'has_description_pdr',
          'offset' => '35',
          'type' => '63862'
        },
        '9' => {
          'name' => 'composite_effecter_count',
          'offset' => '36',
          'type' => '140'
        },
        '10' => {
          'name' => 'possible_states',
          'offset' => '37',
          'type' => '1057'
        }
      },
      'Name' => 'struct pldm_state_effecter_pdr',
      'Size' => '26',
      'Type' => 'Struct'
    },
    '175369' => {
      'BaseType' => '174037',
      'Name' => 'struct pldm_pdr_record*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '175381' => {
      'BaseType' => '174020',
      'Name' => 'pldm_pdr_record*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '175386' => {
      'BaseType' => '174292',
      'Name' => 'pldm_entity_node*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '175753' => {
      'BaseType' => '174237',
      'Name' => 'pldm_entity_association_tree*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '176880' => {
      'BaseType' => '173937',
      'Name' => 'pldm_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '178173' => {
      'BaseType' => '174032',
      'Name' => 'pldm_pdr_record const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '185281' => {
      'BaseType' => '174191',
      'Name' => 'pldm_entity*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '201237' => {
      'BaseType' => '185281',
      'Name' => 'pldm_entity**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '201884' => {
      'BaseType' => '175386',
      'Name' => 'pldm_entity_node**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '202673' => {
      'BaseType' => '173949',
      'Name' => 'pldm_pdr const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '208146' => {
      'BaseType' => '174304',
      'Name' => 'pldm_entity_node const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '213926' => {
      'BaseType' => '175190',
      'Name' => 'struct pldm_state_effecter_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '218812' => {
      'BaseType' => '175036',
      'Name' => 'struct pldm_state_sensor_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '223477' => {
      'BaseType' => '93',
      'Header' => 'types.h',
      'Line' => '37',
      'Name' => '__int8_t',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '223508' => {
      'BaseType' => '112',
      'Header' => 'types.h',
      'Line' => '39',
      'Name' => '__int16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '223539' => {
      'BaseType' => '58',
      'Header' => 'types.h',
      'Line' => '41',
      'Name' => '__int32_t',
      'PrivateABI' => 1,
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '223577' => {
      'BaseType' => '5654',
      'Header' => 'types.h',
      'Line' => '55',
      'Name' => '__uint_least16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '223630' => {
      'BaseType' => '223477',
      'Header' => 'stdint-intn.h',
      'Line' => '24',
      'Name' => 'int8_t',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '223642' => {
      'BaseType' => '223508',
      'Header' => 'stdint-intn.h',
      'Line' => '25',
      'Name' => 'int16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '223654' => {
      'BaseType' => '223539',
      'Header' => 'stdint-intn.h',
      'Line' => '26',
      'Name' => 'int32_t',
      'PrivateABI' => 1,
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '224271' => {
      'BaseType' => '449',
      'Header' => 'pldm_types.h',
      'Line' => '164',
      'Name' => 'real32_t',
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '225070' => {
      'BaseType' => '223577',
      'Header' => 'uchar.h',
      'Line' => '51',
      'Name' => 'char16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '225949' => {
      'Header' => 'platform.h',
      'Line' => '344',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_SENSOR_OP_STATE',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_STATE_SENSOR_STATE',
          'value' => '1'
        },
        '2' => {
          'name' => 'PLDM_NUMERIC_SENSOR_STATE',
          'value' => '2'
        }
      },
      'Name' => 'enum sensor_event_class_states',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '225983' => {
      'BaseType' => '225949',
      'Name' => 'enum sensor_event_class_states const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '226479' => {
      'Header' => 'platform.h',
      'Line' => '667',
      'Memb' => {
        '0' => {
          'name' => 'state_set_id',
          'offset' => '0',
          'type' => '5733'
        },
        '1' => {
          'name' => 'possible_states_size',
          'offset' => '2',
          'type' => '140'
        },
        '2' => {
          'name' => 'states',
          'offset' => '3',
          'type' => '226541'
        }
      },
      'Name' => 'struct state_sensor_possible_states',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '226536' => {
      'BaseType' => '226479',
      'Name' => 'struct state_sensor_possible_states const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '226541' => {
      'BaseType' => '349',
      'Name' => 'bitfield8_t[1]',
      'Size' => '1',
      'Type' => 'Array'
    },
    '226914' => {
      'Header' => 'platform.h',
      'Line' => '768',
      'Memb' => {
        '0' => {
          'name' => 'value_u8',
          'offset' => '0',
          'type' => '140'
        },
        '1' => {
          'name' => 'value_s8',
          'offset' => '0',
          'type' => '223630'
        },
        '2' => {
          'name' => 'value_u16',
          'offset' => '0',
          'type' => '5733'
        },
        '3' => {
          'name' => 'value_s16',
          'offset' => '0',
          'type' => '223642'
        },
        '4' => {
          'name' => 'value_u32',
          'offset' => '0',
          'type' => '152'
        },
        '5' => {
          'name' => 'value_s32',
          'offset' => '0',
          'type' => '223654'
        },
        '6' => {
          'name' => 'value_f32',
          'offset' => '0',
          'type' => '224271'
        }
      },
      'Name' => 'union union_range_field_format',
      'Size' => '4',
      'Type' => 'Union'
    },
    '227513' => {
      'Header' => 'platform.h',
      'Line' => '825',
      'Memb' => {
        '0' => {
          'name' => 'value_u8',
          'offset' => '0',
          'type' => '140'
        },
        '1' => {
          'name' => 'value_s8',
          'offset' => '0',
          'type' => '223630'
        },
        '2' => {
          'name' => 'value_u16',
          'offset' => '0',
          'type' => '5733'
        },
        '3' => {
          'name' => 'value_s16',
          'offset' => '0',
          'type' => '223642'
        },
        '4' => {
          'name' => 'value_u32',
          'offset' => '0',
          'type' => '152'
        },
        '5' => {
          'name' => 'value_s32',
          'offset' => '0',
          'type' => '223654'
        }
      },
      'Name' => 'union union_sensor_data_size',
      'Size' => '4',
      'Type' => 'Union'
    },
    '227526' => {
      'Header' => 'platform.h',
      'Line' => '832',
      'Memb' => {
        '0' => {
          'name' => 'record_handle',
          'offset' => '0',
          'type' => '152'
        },
        '1' => {
          'name' => 'version',
          'offset' => '4',
          'type' => '140'
        },
        '2' => {
          'name' => 'type',
          'offset' => '5',
          'type' => '140'
        },
        '3' => {
          'name' => 'record_change_num',
          'offset' => '6',
          'type' => '5733'
        },
        '4' => {
          'name' => 'length',
          'offset' => '8',
          'type' => '5733'
        }
      },
      'Name' => 'struct pldm_value_pdr_hdr',
      'Size' => '12',
      'Type' => 'Struct'
    },
    '227611' => {
      'Header' => 'platform.h',
      'Line' => '850',
      'Memb' => {
        '0' => {
          'name' => 'entity_instance_num',
          'offset' => '0',
          'type' => '5733'
        },
        '1' => {
          'name' => 'entity_instance',
          'offset' => '0',
          'type' => '5733'
        }
      },
      'Name' => 'anon-union-platform.h-850',
      'Size' => '2',
      'Type' => 'Union'
    },
    '227646' => {
      'Header' => 'platform.h',
      'Line' => '845',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '227526'
        },
        '1' => {
          'name' => 'terminus_handle',
          'offset' => '18',
          'type' => '5733'
        },
        '2' => {
          'name' => 'sensor_id',
          'offset' => '20',
          'type' => '5733'
        },
        '3' => {
          'name' => 'entity_type',
          'offset' => '22',
          'type' => '5733'
        },
        '4' => {
          'name' => 'unnamed0',
          'offset' => '24',
          'type' => '227611'
        },
        '5' => {
          'name' => 'container_id',
          'offset' => '32',
          'type' => '5733'
        },
        '6' => {
          'name' => 'sensor_init',
          'offset' => '34',
          'type' => '140'
        },
        '7' => {
          'name' => 'sensor_auxiliary_names_pdr',
          'offset' => '35',
          'type' => '63862'
        },
        '8' => {
          'name' => 'base_unit',
          'offset' => '36',
          'type' => '140'
        },
        '9' => {
          'name' => 'unit_modifier',
          'offset' => '37',
          'type' => '223630'
        },
        '10' => {
          'name' => 'rate_unit',
          'offset' => '38',
          'type' => '140'
        },
        '11' => {
          'name' => 'base_oem_unit_handle',
          'offset' => '39',
          'type' => '140'
        },
        '12' => {
          'name' => 'aux_unit',
          'offset' => '40',
          'type' => '140'
        },
        '13' => {
          'name' => 'aux_unit_modifier',
          'offset' => '41',
          'type' => '223630'
        },
        '14' => {
          'name' => 'aux_rate_unit',
          'offset' => '48',
          'type' => '140'
        },
        '15' => {
          'name' => 'rel',
          'offset' => '49',
          'type' => '140'
        },
        '16' => {
          'name' => 'aux_oem_unit_handle',
          'offset' => '50',
          'type' => '140'
        },
        '17' => {
          'name' => 'is_linear',
          'offset' => '51',
          'type' => '63862'
        },
        '18' => {
          'name' => 'sensor_data_size',
          'offset' => '52',
          'type' => '140'
        },
        '19' => {
          'name' => 'resolution',
          'offset' => '54',
          'type' => '224271'
        },
        '20' => {
          'name' => 'offset',
          'offset' => '64',
          'type' => '224271'
        },
        '21' => {
          'name' => 'accuracy',
          'offset' => '68',
          'type' => '5733'
        },
        '22' => {
          'name' => 'plus_tolerance',
          'offset' => '70',
          'type' => '140'
        },
        '23' => {
          'name' => 'minus_tolerance',
          'offset' => '71',
          'type' => '140'
        },
        '24' => {
          'name' => 'hysteresis',
          'offset' => '72',
          'type' => '227513'
        },
        '25' => {
          'name' => 'supported_thresholds',
          'offset' => '82',
          'type' => '349'
        },
        '26' => {
          'name' => 'threshold_and_hysteresis_volatility',
          'offset' => '83',
          'type' => '349'
        },
        '27' => {
          'name' => 'state_transition_interval',
          'offset' => '86',
          'type' => '224271'
        },
        '28' => {
          'name' => 'update_interval',
          'offset' => '96',
          'type' => '224271'
        },
        '29' => {
          'name' => 'max_readable',
          'offset' => '100',
          'type' => '227513'
        },
        '30' => {
          'name' => 'min_readable',
          'offset' => '104',
          'type' => '227513'
        },
        '31' => {
          'name' => 'range_field_format',
          'offset' => '114',
          'type' => '140'
        },
        '32' => {
          'name' => 'range_field_support',
          'offset' => '115',
          'type' => '349'
        },
        '33' => {
          'name' => 'nominal_value',
          'offset' => '118',
          'type' => '226914'
        },
        '34' => {
          'name' => 'normal_max',
          'offset' => '128',
          'type' => '226914'
        },
        '35' => {
          'name' => 'normal_min',
          'offset' => '132',
          'type' => '226914'
        },
        '36' => {
          'name' => 'warning_high',
          'offset' => '136',
          'type' => '226914'
        },
        '37' => {
          'name' => 'warning_low',
          'offset' => '146',
          'type' => '226914'
        },
        '38' => {
          'name' => 'critical_high',
          'offset' => '150',
          'type' => '226914'
        },
        '39' => {
          'name' => 'critical_low',
          'offset' => '256',
          'type' => '226914'
        },
        '40' => {
          'name' => 'fatal_high',
          'offset' => '260',
          'type' => '226914'
        },
        '41' => {
          'name' => 'fatal_low',
          'offset' => '264',
          'type' => '226914'
        }
      },
      'Name' => 'struct pldm_numeric_sensor_value_pdr',
      'Size' => '112',
      'Type' => 'Struct'
    },
    '228239' => {
      'BaseType' => '225070',
      'Header' => 'platform.h',
      'Line' => '893',
      'Name' => 'pldm_utf16be',
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '228252' => {
      'Header' => 'platform.h',
      'Line' => '895',
      'Memb' => {
        '0' => {
          'name' => 'tag',
          'offset' => '0',
          'type' => '5704'
        },
        '1' => {
          'name' => 'name',
          'offset' => '8',
          'type' => '228294'
        }
      },
      'Name' => 'struct pldm_entity_auxiliary_name',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '228294' => {
      'BaseType' => '228239',
      'Name' => 'pldm_utf16be*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '228299' => {
      'Header' => 'platform.h',
      'Line' => '905',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '227526'
        },
        '1' => {
          'name' => 'container',
          'offset' => '18',
          'type' => '174191'
        },
        '2' => {
          'name' => 'shared_name_count',
          'offset' => '24',
          'type' => '140'
        },
        '3' => {
          'name' => 'name_string_count',
          'offset' => '25',
          'type' => '140'
        },
        '4' => {
          'name' => 'names',
          'offset' => '36',
          'type' => '228413'
        },
        '5' => {
          'name' => 'auxiliary_name_data_size',
          'offset' => '50',
          'type' => '169'
        },
        '6' => {
          'name' => 'auxiliary_name_data',
          'offset' => '64',
          'type' => '228418'
        }
      },
      'Name' => 'struct pldm_entity_auxiliary_names_pdr',
      'Size' => '40',
      'Type' => 'Struct'
    },
    '228413' => {
      'BaseType' => '228252',
      'Name' => 'struct pldm_entity_auxiliary_name*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '228418' => {
      'BaseType' => '51',
      'Name' => 'char[]',
      'Size' => '8',
      'Type' => 'Array'
    },
    '228433' => {
      'Header' => 'platform.h',
      'Line' => '935',
      'Memb' => {
        '0' => {
          'name' => 'state_set_id',
          'offset' => '0',
          'type' => '5733'
        },
        '1' => {
          'name' => 'possible_states_size',
          'offset' => '2',
          'type' => '140'
        },
        '2' => {
          'name' => 'states',
          'offset' => '3',
          'type' => '226541'
        }
      },
      'Name' => 'struct state_effecter_possible_states',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '228490' => {
      'BaseType' => '228433',
      'Name' => 'struct state_effecter_possible_states const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '228495' => {
      'Header' => 'platform.h',
      'Line' => '959',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '227526'
        },
        '1' => {
          'name' => 'terminus_handle',
          'offset' => '18',
          'type' => '5733'
        },
        '2' => {
          'name' => 'file_identifier',
          'offset' => '20',
          'type' => '5733'
        },
        '3' => {
          'name' => 'container',
          'offset' => '22',
          'type' => '174191'
        },
        '4' => {
          'name' => 'superior_directory_file_identifier',
          'offset' => '34',
          'type' => '5733'
        },
        '5' => {
          'name' => 'file_classification',
          'offset' => '36',
          'type' => '140'
        },
        '6' => {
          'name' => 'oem_file_classification',
          'offset' => '37',
          'type' => '140'
        },
        '7' => {
          'name' => 'file_capabilities',
          'offset' => '38',
          'type' => '50907'
        },
        '8' => {
          'name' => 'file_version',
          'offset' => '40',
          'type' => '432'
        },
        '9' => {
          'name' => 'file_maximum_size',
          'offset' => '50',
          'type' => '152'
        },
        '10' => {
          'name' => 'file_maximum_file_descriptor_count',
          'offset' => '54',
          'type' => '140'
        },
        '11' => {
          'name' => 'file_name',
          'offset' => '64',
          'type' => '7881'
        },
        '12' => {
          'name' => 'oem_file_classification_name',
          'offset' => '86',
          'type' => '7881'
        }
      },
      'Name' => 'struct pldm_platform_file_descriptor_pdr',
      'Size' => '72',
      'Type' => 'Struct'
    },
    '228691' => {
      'Header' => 'platform.h',
      'Line' => '1005',
      'Memb' => {
        '0' => {
          'name' => 'set_request',
          'offset' => '0',
          'type' => '140'
        },
        '1' => {
          'name' => 'effecter_state',
          'offset' => '1',
          'type' => '140'
        }
      },
      'Name' => 'struct state_field_for_state_effecter_set',
      'Size' => '2',
      'Type' => 'Struct'
    },
    '228734' => {
      'BaseType' => '228691',
      'Header' => 'platform.h',
      'Line' => '1008',
      'Name' => 'set_effecter_state_field',
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '228747' => {
      'Header' => 'platform.h',
      'Line' => '1014',
      'Memb' => {
        '0' => {
          'name' => 'sensor_op_state',
          'offset' => '0',
          'type' => '140'
        },
        '1' => {
          'name' => 'present_state',
          'offset' => '1',
          'type' => '140'
        },
        '2' => {
          'name' => 'previous_state',
          'offset' => '2',
          'type' => '140'
        },
        '3' => {
          'name' => 'event_state',
          'offset' => '3',
          'type' => '140'
        }
      },
      'Name' => 'struct state_field_for_get_state_sensor_readings',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '228818' => {
      'BaseType' => '228747',
      'Header' => 'platform.h',
      'Line' => '1022',
      'Name' => 'get_sensor_state_field',
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '228831' => {
      'Header' => 'platform.h',
      'Line' => '1028',
      'Memb' => {
        '0' => {
          'name' => 'effecter_op_state',
          'offset' => '0',
          'type' => '140'
        },
        '1' => {
          'name' => 'pending_state',
          'offset' => '1',
          'type' => '140'
        },
        '2' => {
          'name' => 'present_state',
          'offset' => '2',
          'type' => '140'
        }
      },
      'Name' => 'struct state_field_for_get_state_effecter_states',
      'Size' => '3',
      'Type' => 'Struct'
    },
    '228888' => {
      'BaseType' => '228831',
      'Header' => 'platform.h',
      'Line' => '1032',
      'Name' => 'get_effecter_state_field',
      'Size' => '3',
      'Type' => 'Typedef'
    },
    '229372' => {
      'Header' => 'platform.h',
      'Line' => '1105',
      'Memb' => {
        '0' => {
          'name' => 'mctp_eid',
          'offset' => '0',
          'type' => '140'
        },
        '1' => {
          'name' => 'vendor_specific',
          'offset' => '0',
          'type' => '7881'
        }
      },
      'Name' => 'anon-union-platform.h-1105',
      'Size' => '16',
      'Type' => 'Union'
    },
    '229406' => {
      'Header' => 'platform.h',
      'Line' => '1102',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '140'
        },
        '1' => {
          'name' => 'transport_protocol_type',
          'offset' => '1',
          'type' => '140'
        },
        '2' => {
          'name' => 'event_receiver_address',
          'offset' => '8',
          'type' => '229372'
        }
      },
      'Name' => 'struct pldm_get_event_receiver_resp',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '229708' => {
      'Header' => 'platform.h',
      'Line' => '1190',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '140'
        },
        '1' => {
          'name' => 'comp_effecter_count',
          'offset' => '1',
          'type' => '140'
        },
        '2' => {
          'name' => 'field',
          'offset' => '2',
          'type' => '229765'
        }
      },
      'Name' => 'struct pldm_get_state_effecter_states_resp',
      'Size' => '26',
      'Type' => 'Struct'
    },
    '229765' => {
      'BaseType' => '228888',
      'Name' => 'get_effecter_state_field[8]',
      'Size' => '24',
      'Type' => 'Array'
    },
    '229781' => {
      'Header' => 'platform.h',
      'Line' => '1200',
      'Memb' => {
        '0' => {
          'name' => 'sensor_id',
          'offset' => '0',
          'type' => '5733'
        },
        '1' => {
          'name' => 'sensor_event_class_type',
          'offset' => '2',
          'type' => '140'
        },
        '2' => {
          'name' => 'event_class',
          'offset' => '3',
          'type' => '1057'
        }
      },
      'Name' => 'struct pldm_sensor_event_data',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '229895' => {
      'Header' => 'platform.h',
      'Line' => '1240',
      'Memb' => {
        '0' => {
          'name' => 'format_version',
          'offset' => '0',
          'type' => '140'
        },
        '1' => {
          'name' => 'event_id',
          'offset' => '2',
          'type' => '5733'
        },
        '2' => {
          'name' => 'data_transfer_handle',
          'offset' => '4',
          'type' => '152'
        }
      },
      'Name' => 'struct pldm_message_poll_event',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '229957' => {
      'Header' => 'platform.h',
      'Line' => '1250',
      'Memb' => {
        '0' => {
          'name' => 'format_version',
          'offset' => '0',
          'type' => '140'
        },
        '1' => {
          'name' => 'format_type',
          'offset' => '1',
          'type' => '140'
        },
        '2' => {
          'name' => 'event_data_length',
          'offset' => '2',
          'type' => '5733'
        },
        '3' => {
          'name' => 'event_data',
          'offset' => '4',
          'type' => '230028'
        }
      },
      'Name' => 'struct pldm_platform_cper_event',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '230028' => {
      'BaseType' => '140',
      'Name' => 'uint8_t[]',
      'Size' => '8',
      'Type' => 'Array'
    },
    '230184' => {
      'Header' => 'platform.h',
      'Line' => '1310',
      'Memb' => {
        '0' => {
          'name' => 'event_data_format',
          'offset' => '0',
          'type' => '140'
        },
        '1' => {
          'name' => 'number_of_change_records',
          'offset' => '1',
          'type' => '140'
        },
        '2' => {
          'name' => 'change_records',
          'offset' => '2',
          'type' => '1057'
        }
      },
      'Name' => 'struct pldm_pdr_repository_chg_event_data',
      'Size' => '3',
      'Type' => 'Struct'
    },
    '238397' => {
      'BaseType' => '228495',
      'Name' => 'struct pldm_platform_file_descriptor_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '238456' => {
      'BaseType' => '229957',
      'Name' => 'struct pldm_platform_cper_event*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '241816' => {
      'BaseType' => '228299',
      'Name' => 'struct pldm_entity_auxiliary_names_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '251114' => {
      'BaseType' => '229708',
      'Name' => 'struct pldm_get_state_effecter_states_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '290284' => {
      'BaseType' => '229406',
      'Name' => 'struct pldm_get_event_receiver_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '291710' => {
      'BaseType' => '2760',
      'Name' => 'size_t*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '305591' => {
      'BaseType' => '229895',
      'Name' => 'struct pldm_message_poll_event*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '306941' => {
      'BaseType' => '306951',
      'Name' => 'uint32_t const*const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '306946' => {
      'BaseType' => '164',
      'Name' => 'uint32_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '306951' => {
      'BaseType' => '306946',
      'Name' => 'uint32_t const*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '306956' => {
      'BaseType' => '230184',
      'Name' => 'struct pldm_pdr_repository_chg_event_data*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '349871' => {
      'BaseType' => '227646',
      'Name' => 'struct pldm_numeric_sensor_value_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '371423' => {
      'BaseType' => '229781',
      'Name' => 'struct pldm_sensor_event_data*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '371428' => {
      'BaseType' => '371423',
      'Name' => 'struct pldm_sensor_event_data*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '375337' => {
      'BaseType' => '228818',
      'Name' => 'get_sensor_state_field*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '398507' => {
      'BaseType' => '228734',
      'Name' => 'set_effecter_state_field*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '399488' => {
      'BaseType' => '218812',
      'Name' => 'struct pldm_state_sensor_pdr*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '399493' => {
      'BaseType' => '226536',
      'Name' => 'struct state_sensor_possible_states const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '399498' => {
      'BaseType' => '399493',
      'Name' => 'struct state_sensor_possible_states const*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '399898' => {
      'BaseType' => '213926',
      'Name' => 'struct pldm_state_effecter_pdr*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '399903' => {
      'BaseType' => '228490',
      'Name' => 'struct state_effecter_possible_states const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '399908' => {
      'BaseType' => '399903',
      'Name' => 'struct state_effecter_possible_states const*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '403468' => {
      'Line' => '19',
      'Memb' => {
        '0' => {
          'name' => 'prev',
          'offset' => '0',
          'type' => '4909'
        },
        '1' => {
          'name' => 'allocations',
          'offset' => '4',
          'type' => '152'
        }
      },
      'Name' => 'struct pldm_tid_state',
      'PrivateABI' => 1,
      'Size' => '8',
      'Source' => 'instance-id.c',
      'Type' => 'Struct'
    },
    '403507' => {
      'Line' => '24',
      'Memb' => {
        '0' => {
          'name' => 'state',
          'offset' => '0',
          'type' => '403549'
        },
        '1' => {
          'name' => 'lock_db_fd',
          'offset' => '8264',
          'type' => '58'
        }
      },
      'Name' => 'struct pldm_instance_db',
      'PrivateABI' => 1,
      'Size' => '2052',
      'Source' => 'instance-id.c',
      'Type' => 'Struct'
    },
    '403549' => {
      'BaseType' => '403468',
      'Name' => 'struct pldm_tid_state[256]',
      'Size' => '2048',
      'Type' => 'Array'
    },
    '404105' => {
      'BaseType' => '403507',
      'Name' => 'struct pldm_instance_db*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '404492' => {
      'BaseType' => '4909',
      'Name' => 'pldm_instance_id_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '404668' => {
      'BaseType' => '404105',
      'Name' => 'struct pldm_instance_db**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '405381' => {
      'BaseType' => '65',
      'Header' => 'int-ll64.h',
      'Line' => '21',
      'Name' => '__u8',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '405393' => {
      'BaseType' => '72',
      'Header' => 'int-ll64.h',
      'Line' => '24',
      'Name' => '__u16',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '405630' => {
      'Header' => 'socket.h',
      'Line' => '5',
      'Memb' => {
        '0' => {
          'name' => 'size',
          'offset' => '0',
          'type' => '58'
        },
        '1' => {
          'name' => 'socket',
          'offset' => '4',
          'type' => '58'
        },
        '2' => {
          'name' => 'max_size',
          'offset' => '8',
          'type' => '58'
        }
      },
      'Name' => 'struct pldm_socket_sndbuf',
      'PrivateABI' => 1,
      'Size' => '12',
      'Type' => 'Struct'
    },
    '405683' => {
      'BaseType' => '140',
      'Header' => 'pldm.h',
      'Line' => '13',
      'Name' => 'mctp_eid_t',
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '405797' => {
      'BaseType' => '5006',
      'Header' => 'pldm.h',
      'Line' => '30',
      'Name' => 'pldm_requester_rc_t',
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '405809' => {
      'Header' => 'transport.h',
      'Line' => '18',
      'Memb' => {
        '0' => {
          'name' => 'name',
          'offset' => '0',
          'type' => '9294'
        },
        '1' => {
          'name' => 'version',
          'offset' => '8',
          'type' => '140'
        },
        '2' => {
          'name' => 'recv',
          'offset' => '22',
          'type' => '405943'
        },
        '3' => {
          'name' => 'send',
          'offset' => '36',
          'type' => '405984'
        },
        '4' => {
          'name' => 'init_pollfd',
          'offset' => '50',
          'type' => '406065'
        }
      },
      'Name' => 'struct pldm_transport',
      'PrivateABI' => 1,
      'Size' => '40',
      'Type' => 'Struct'
    },
    '405923' => {
      'BaseType' => '405809',
      'Name' => 'struct pldm_transport*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '405928' => {
      'BaseType' => '4897',
      'Name' => 'pldm_tid_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '405943' => {
      'Name' => 'pldm_requester_rc_t(*)(struct pldm_transport*, pldm_tid_t*, void**, size_t*)',
      'Param' => {
        '0' => {
          'type' => '405923'
        },
        '1' => {
          'type' => '405928'
        },
        '2' => {
          'type' => '27744'
        },
        '3' => {
          'type' => '2760'
        }
      },
      'Return' => '405797',
      'Size' => '8',
      'Type' => 'FuncPtr'
    },
    '405984' => {
      'Name' => 'pldm_requester_rc_t(*)(struct pldm_transport*, pldm_tid_t, void const*, size_t)',
      'Param' => {
        '0' => {
          'type' => '405923'
        },
        '1' => {
          'type' => '4897'
        },
        '2' => {
          'type' => '1320'
        },
        '3' => {
          'type' => '169'
        }
      },
      'Return' => '405797',
      'Size' => '8',
      'Type' => 'FuncPtr'
    },
    '406009' => {
      'BaseType' => '406014',
      'Name' => 'struct pollfd*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '406014' => {
      'Header' => 'poll.h',
      'Line' => '36',
      'Memb' => {
        '0' => {
          'name' => 'fd',
          'offset' => '0',
          'type' => '58'
        },
        '1' => {
          'name' => 'events',
          'offset' => '4',
          'type' => '112'
        },
        '2' => {
          'name' => 'revents',
          'offset' => '6',
          'type' => '112'
        }
      },
      'Name' => 'struct pollfd',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Struct'
    },
    '406065' => {
      'Name' => 'int(*)(struct pldm_transport*, struct pollfd*)',
      'Param' => {
        '0' => {
          'type' => '405923'
        },
        '1' => {
          'type' => '406009'
        }
      },
      'Return' => '58',
      'Size' => '8',
      'Type' => 'FuncPtr'
    },
    '406070' => {
      'BaseType' => '72',
      'Header' => 'socket.h',
      'Line' => '10',
      'Name' => '__kernel_sa_family_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '406445' => {
      'Header' => 'mctp.h',
      'Line' => '18',
      'Memb' => {
        '0' => {
          'name' => 's_addr',
          'offset' => '0',
          'type' => '405683'
        }
      },
      'Name' => 'struct mctp_addr',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Struct'
    },
    '406472' => {
      'Header' => 'mctp.h',
      'Line' => '22',
      'Memb' => {
        '0' => {
          'name' => 'smctp_family',
          'offset' => '0',
          'type' => '406070'
        },
        '1' => {
          'name' => '__smctp_pad0',
          'offset' => '2',
          'type' => '405393'
        },
        '2' => {
          'name' => 'smctp_network',
          'offset' => '4',
          'type' => '79'
        },
        '3' => {
          'name' => 'smctp_addr',
          'offset' => '8',
          'type' => '406445'
        },
        '4' => {
          'name' => 'smctp_type',
          'offset' => '9',
          'type' => '405381'
        },
        '5' => {
          'name' => 'smctp_tag',
          'offset' => '16',
          'type' => '405381'
        },
        '6' => {
          'name' => '__smctp_pad1',
          'offset' => '17',
          'type' => '405381'
        }
      },
      'Name' => 'struct sockaddr_mctp',
      'PrivateABI' => 1,
      'Size' => '12',
      'Type' => 'Struct'
    },
    '406577' => {
      'BaseType' => '406472',
      'Name' => 'struct sockaddr_mctp const',
      'Size' => '12',
      'Type' => 'Const'
    },
    '406621' => {
      'Line' => '35',
      'Memb' => {
        '0' => {
          'name' => 'transport',
          'offset' => '0',
          'type' => '405809'
        },
        '1' => {
          'name' => 'socket',
          'offset' => '64',
          'type' => '58'
        },
        '2' => {
          'name' => 'tid_eid_map',
          'offset' => '68',
          'type' => '406714'
        },
        '3' => {
          'name' => 'socket_send_buf',
          'offset' => '768',
          'type' => '405630'
        },
        '4' => {
          'name' => 'bound',
          'offset' => '786',
          'type' => '5527'
        },
        '5' => {
          'name' => 'cookie_jar',
          'offset' => '800',
          'type' => '4921'
        }
      },
      'Name' => 'struct pldm_transport_af_mctp',
      'PrivateABI' => 1,
      'Size' => '336',
      'Source' => 'af-mctp.c',
      'Type' => 'Struct'
    },
    '406714' => {
      'BaseType' => '4897',
      'Name' => 'pldm_tid_t[256]',
      'Size' => '256',
      'Type' => 'Array'
    },
    '407515' => {
      'BaseType' => '406621',
      'Name' => 'struct pldm_transport_af_mctp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '407520' => {
      'BaseType' => '406577',
      'Name' => 'struct sockaddr_mctp const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '407833' => {
      'BaseType' => '407515',
      'Name' => 'struct pldm_transport_af_mctp**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '410957' => {
      'Line' => '26',
      'Memb' => {
        '0' => {
          'name' => 'transport',
          'offset' => '0',
          'type' => '405809'
        },
        '1' => {
          'name' => 'socket',
          'offset' => '64',
          'type' => '58'
        },
        '2' => {
          'name' => 'tid_eid_map',
          'offset' => '68',
          'type' => '406714'
        },
        '3' => {
          'name' => 'socket_send_buf',
          'offset' => '768',
          'type' => '405630'
        }
      },
      'Name' => 'struct pldm_transport_mctp_demux',
      'PrivateABI' => 1,
      'Size' => '312',
      'Source' => 'mctp-demux.c',
      'Type' => 'Struct'
    },
    '411562' => {
      'BaseType' => '410957',
      'Name' => 'struct pldm_transport_mctp_demux*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '412068' => {
      'BaseType' => '411562',
      'Name' => 'struct pldm_transport_mctp_demux**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '434905' => {
      'Header' => 'file_io.h',
      'Line' => '32',
      'Memb' => {
        '0' => {
          'name' => 'handle',
          'offset' => '0',
          'type' => '140'
        },
        '1' => {
          'name' => 'length',
          'offset' => '4',
          'type' => '152'
        },
        '2' => {
          'name' => 'data',
          'offset' => '8',
          'type' => '230028'
        }
      },
      'Name' => 'struct pldm_oem_meta_file_io_write_req',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '434972' => {
      'Header' => 'file_io.h',
      'Line' => '45',
      'Memb' => {
        '0' => {
          'name' => 'transferFlag',
          'offset' => '0',
          'type' => '140'
        },
        '1' => {
          'name' => 'offset',
          'offset' => '2',
          'type' => '5733'
        }
      },
      'Name' => 'struct pldm_oem_meta_file_io_read_data_info',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '435011' => {
      'Header' => 'file_io.h',
      'Line' => '55',
      'Memb' => {
        '0' => {
          'name' => 'size',
          'offset' => '0',
          'type' => '5733'
        },
        '1' => {
          'name' => 'crc32',
          'offset' => '4',
          'type' => '152'
        }
      },
      'Name' => 'struct pldm_oem_meta_file_io_read_attr_info',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '435050' => {
      'Header' => 'file_io.h',
      'Line' => '70',
      'Memb' => {
        '0' => {
          'name' => 'data',
          'offset' => '0',
          'type' => '434972'
        }
      },
      'Name' => 'anon-union-file_io.h-70',
      'Size' => '4',
      'Type' => 'Union'
    },
    '435068' => {
      'Header' => 'file_io.h',
      'Line' => '65',
      'Memb' => {
        '0' => {
          'name' => 'version',
          'offset' => '0',
          'type' => '169'
        },
        '1' => {
          'name' => 'handle',
          'offset' => '8',
          'type' => '140'
        },
        '2' => {
          'name' => 'option',
          'offset' => '9',
          'type' => '140'
        },
        '3' => {
          'name' => 'length',
          'offset' => '16',
          'type' => '140'
        },
        '4' => {
          'name' => 'info',
          'offset' => '18',
          'type' => '435050'
        }
      },
      'Name' => 'struct pldm_oem_meta_file_io_read_req',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '435146' => {
      'Header' => 'file_io.h',
      'Line' => '86',
      'Memb' => {
        '0' => {
          'name' => 'attr',
          'offset' => '0',
          'type' => '435011'
        },
        '1' => {
          'name' => 'data',
          'offset' => '0',
          'type' => '434972'
        }
      },
      'Name' => 'anon-union-file_io.h-86',
      'Size' => '8',
      'Type' => 'Union'
    },
    '435174' => {
      'Header' => 'file_io.h',
      'Line' => '80',
      'Memb' => {
        '0' => {
          'name' => 'version',
          'offset' => '0',
          'type' => '169'
        },
        '1' => {
          'name' => 'completion_code',
          'offset' => '8',
          'type' => '140'
        },
        '2' => {
          'name' => 'handle',
          'offset' => '9',
          'type' => '140'
        },
        '3' => {
          'name' => 'option',
          'offset' => '16',
          'type' => '140'
        },
        '4' => {
          'name' => 'length',
          'offset' => '17',
          'type' => '140'
        },
        '5' => {
          'name' => 'info',
          'offset' => '18',
          'type' => '435146'
        },
        '6' => {
          'name' => 'data',
          'offset' => '32',
          'type' => '230028'
        }
      },
      'Name' => 'struct pldm_oem_meta_file_io_read_resp',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '439182' => {
      'BaseType' => '435174',
      'Name' => 'struct pldm_oem_meta_file_io_read_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '441404' => {
      'BaseType' => '435068',
      'Name' => 'struct pldm_oem_meta_file_io_read_req*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '441838' => {
      'BaseType' => '434905',
      'Name' => 'struct pldm_oem_meta_file_io_write_req*',
      'Size' => '8',
      'Type' => 'Pointer'
    }
  },
  'UndefinedSymbols' => {
    'libpldm.so.0.14.0' => {
      '_ITM_deregisterTMCloneTable' => 0,
      '_ITM_registerTMCloneTable' => 0,
      '__assert_fail@GLIBC_2.2.5' => 0,
      '__cxa_finalize@GLIBC_2.2.5' => 0,
      '__errno_location@GLIBC_2.2.5' => 0,
      '__gmon_start__' => 0,
      '__isoc23_strtol@GLIBC_2.38' => 0,
      '__memcpy_chk@GLIBC_2.3.4' => 0,
      '__recv_chk@GLIBC_2.4' => 0,
      '__recvfrom_chk@GLIBC_2.4' => 0,
      '__stack_chk_fail@GLIBC_2.4' => 0,
      'bind@GLIBC_2.2.5' => 0,
      'calloc@GLIBC_2.2.5' => 0,
      'clock_gettime@GLIBC_2.17' => 0,
      'close@GLIBC_2.2.5' => 0,
      'connect@GLIBC_2.2.5' => 0,
      'dup@GLIBC_2.2.5' => 0,
      'fclose@GLIBC_2.2.5' => 0,
      'fcntl64@GLIBC_2.28' => 0,
      'fgets@GLIBC_2.2.5' => 0,
      'fopen64@GLIBC_2.2.5' => 0,
      'free@GLIBC_2.2.5' => 0,
      'getsockopt@GLIBC_2.2.5' => 0,
      'malloc@GLIBC_2.2.5' => 0,
      'memcmp@GLIBC_2.2.5' => 0,
      'memcpy@GLIBC_2.14' => 0,
      'memmem@GLIBC_2.2.5' => 0,
      'open64@GLIBC_2.2.5' => 0,
      'poll@GLIBC_2.2.5' => 0,
      'ppoll@GLIBC_2.4' => 0,
      'recv@GLIBC_2.2.5' => 0,
      'recvmsg@GLIBC_2.2.5' => 0,
      'sendmsg@GLIBC_2.2.5' => 0,
      'sendto@GLIBC_2.2.5' => 0,
      'setsockopt@GLIBC_2.2.5' => 0,
      'socket@GLIBC_2.2.5' => 0,
      'stat64@GLIBC_2.33' => 0,
      'strlen@GLIBC_2.2.5' => 0,
      'strnlen@GLIBC_2.2.5' => 0,
      'timerfd_create@GLIBC_2.8' => 0,
      'timerfd_settime@GLIBC_2.8' => 0,
      'write@GLIBC_2.2.5' => 0
    }
  },
  'WordSize' => '8'
};
