$VAR1 = {
  'ABI_DUMPER_VERSION' => '1.4',
  'ABI_DUMP_VERSION' => '3.5',
  'Arch' => 'x86_64',
  'GccVersion' => '15.2.0',
  'Headers' => {
    'af-mctp.h' => 1,
    'base.h' => 1,
    'bcd.h' => 1,
    'bios.h' => 1,
    'bios_table.h' => 1,
    'edac.h' => 1,
    'file.h' => 1,
    'file_io.h' => 1,
    'firmware_update.h' => 1,
    'fru.h' => 1,
    'host.h' => 1,
    'instance-id.h' => 1,
    'mctp-demux.h' => 1,
    'pdr.h' => 1,
    'platform.h' => 1,
    'pldm.h' => 1,
    'pldm_types.h' => 1,
    'transport.h' => 1
  },
  'Language' => 'C',
  'LibraryName' => 'libpldm.so.0.15.0',
  'LibraryVersion' => '0.15.0',
  'NameSpaces' => {},
  'Needed' => {
    'libc.so.6' => 1
  },
  'PublicABI' => '1',
  'Sources' => {
    'af-mctp.c' => 1,
    'bios_table.c' => 1,
    'instance-id.c' => 1,
    'mctp-demux.c' => 1,
    'pdr.c' => 1
  },
  'SymbolInfo' => {
    '186' => {
      'Header' => 'bcd.h',
      'Line' => '45',
      'Param' => {
        '0' => {
          'name' => 'dec',
          'type' => '174'
        }
      },
      'Return' => '174',
      'ShortName' => 'pldm_bcd_dec2bcd32'
    },
    '315' => {
      'Header' => 'bcd.h',
      'Line' => '39',
      'Param' => {
        '0' => {
          'name' => 'bcd',
          'type' => '174'
        }
      },
      'Return' => '174',
      'ShortName' => 'pldm_bcd_bcd2dec32'
    },
    '418' => {
      'Header' => 'bcd.h',
      'Line' => '33',
      'Param' => {
        '0' => {
          'name' => 'dec',

      'pldm_entity_association_tree_destroy' => 1,
      'pldm_entity_association_tree_destroy_root' => 1,
      'pldm_entity_association_tree_find' => 1,
      'pldm_entity_association_tree_find_with_locality' => 1,
      'pldm_entity_association_tree_init' => 1,
      'pldm_entity_association_tree_visit' => 1,
      'pldm_entity_extract' => 1,
      'pldm_entity_get_num_children' => 1,
      'pldm_entity_get_parent' => 1,
      'pldm_entity_is_exist_parent' => 1,
      'pldm_entity_is_node_parent' => 1,
      'pldm_entity_node_get_remote_container_id' => 1,
      'pldm_find_entity_ref_in_tree' => 1,
      'pldm_instance_db_destroy' => 1,
      'pldm_instance_db_init' => 1,
      'pldm_instance_db_init_default' => 1,
      'pldm_instance_id_alloc' => 1,
      'pldm_instance_id_free' => 1,
      'pldm_is_current_parent_child' => 1,
      'pldm_is_empty_entity_assoc_tree' => 1,
      'pldm_msg_hdr_correlate_response' => 1,
      'pldm_oem_meta_file_io_read_resp_data' => 1,
      'pldm_oem_meta_file_io_write_req_data' => 1,
      'pldm_package_component_image_information_iter_init' => 1,
      'pldm_package_downstream_device_id_record_iter_init' => 1,
      'pldm_package_firmware_device_id_record_iter_init' => 1,
      'pldm_pdr_add' => 1,
      'pldm_pdr_add_fru_record_set' => 1,
      'pldm_pdr_delete_by_effecter_id' => 1,
      'pldm_pdr_delete_by_record_handle' => 1,
      'pldm_pdr_delete_by_sensor_id' => 1,
      'pldm_pdr_destroy' => 1,
      'pldm_pdr_find_last_in_range' => 1,
      'pldm_pdr_find_record' => 1,
      'pldm_pdr_find_record_by_type' => 1,
      'pldm_pdr_fru_record_set_find_by_rsi' => 1,
      'pldm_pdr_get_next_record' => 1,
      'pldm_pdr_get_record_count' => 1,
      'pldm_pdr_get_record_handle' => 1,
      'pldm_pdr_get_repo_size' => 1,
      'pldm_pdr_init' => 1,
      'pldm_pdr_record_is_remote' => 1,
      'pldm_pdr_remove_fru_record_set_by_rsi' => 1,
      'pldm_pdr_remove_pdrs_by_terminus_handle' => 1,
      'pldm_pdr_remove_remote_pdrs' => 1,
      'pldm_pdr_update_TL_pdr' => 1,
      'pldm_platform_cper_event_event_data' => 1,
      'pldm_transport_af_mctp_bind' => 1,
      'pldm_transport_af_mctp_core' => 1,
      'pldm_transport_af_mctp_destroy' => 1,
      'pldm_transport_af_mctp_init' => 1,
      'pldm_transport_af_mctp_init_pollfd' => 1,
      'pldm_transport_af_mctp_map_tid' => 1,
      'pldm_transport_af_mctp_map_tid_fqe' => 1,
      'pldm_transport_af_mctp_unmap_tid' => 1,
      'pldm_transport_af_mctp_unmap_tid_fqe' => 1,
      'pldm_transport_mctp_demux_core' => 1,
      'pldm_transport_mctp_demux_destroy' => 1,
      'pldm_transport_mctp_demux_init' => 1,
      'pldm_transport_mctp_demux_init_pollfd' => 1,
      'pldm_transport_mctp_demux_map_tid' => 1,
      'pldm_transport_mctp_demux_unmap_tid' => 1,
      'pldm_transport_poll' => 1,
      'pldm_transport_recv_msg' => 1,
      'pldm_transport_send_msg' => 1,
      'pldm_transport_send_recv_msg' => 1,
      'unpack_pldm_header' => 1
    }
  },
  'Target' => 'unix',
  'TypeInfo' => {
    '1' => {
      'Name' => 'void',
      'Type' => 'Intrinsic'
    },
    '51' => {
      'Name' => 'unsigned char',
      'Size' => '1',
      'Type' => 'Intrinsic'
    },
    '58' => {
      'Name' => 'unsigned short',
      'Size' => '2',
      'Type' => 'Intrinsic'
    },
    '65' => {
      'Name' => 'unsigned int',
      'Size' => '4',
      'Type' => 'Intrinsic'
    },
    '72' => {
      'Name' => 'unsigned long',
      'Size' => '8',
      'Type' => 'Intrinsic'
    },
    '79' => {
      'Name' => 'signed char',
      'Size' => '1',
      'Type' => 'Intrinsic'
    },
    '86' => {
      'BaseType' => '51',
      'Header' => 'types.h',
      'Line' => '38',
      'Name' => '__uint8_t',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '98' => {
      'Name' => 'short',
      'Size' => '2',
      'Type' => 'Intrinsic'
    },
    '105' => {
      'BaseType' => '58',
      'Header' => 'types.h',
      'Line' => '40',
      'Name' => '__uint16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '117' => {
      'Name' => 'int',
      'Size' => '4',
      'Type' => 'Intrinsic'
    },
    '124' => {
      'BaseType' => '65',
      'Header' => 'types.h',
      'Line' => '42',
      'Name' => '__uint32_t',
      'PrivateABI' => 1,
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '136' => {
      'Name' => 'long',
      'Size' => '8',
      'Type' => 'Intrinsic'
    },
    '143' => {
      'Name' => 'char',
      'Size' => '1',
      'Type' => 'Intrinsic'
    },
    '150' => {
      'BaseType' => '86',
      'Header' => 'stdint-uintn.h',
      'Line' => '24',
      'Name' => 'uint8_t',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '162' => {
      'BaseType' => '105',
      'Header' => 'stdint-uintn.h',
      'Line' => '25',
      'Name' => 'uint16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '174' => {
      'BaseType' => '124',
      'Header' => 'stdint-uintn.h',
      'Line' => '26',
      'Name' => 'uint32_t',
      'PrivateABI' => 1,
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '852' => {
      'BaseType' => '1',
      'Name' => 'void*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '878' => {
      'BaseType' => '174',
      'Name' => 'uint32_t const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '883' => {
      'BaseType' => '72',
      'Header' => 'stddef.h',
      'Line' => '229',
      'Name' => 'size_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '909' => {
      'Header' => 'pldm_types.h',
      'Line' => '15',
      'Name' => 'struct bits8',
      'Size' => '1',
      'Type' => 'Struct'
    },
    '1067' => {
      'Header' => 'pldm_types.h',
      'Line' => '25',
      'Memb' => {
        '0' => {
          'name' => 'byte',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'bits',
          'offset' => '0',
          'type' => '909'
        }
      },
      'Name' => 'union bitfield8_t',
      'Size' => '1',
      'Type' => 'Union'
    },
    '1079' => {
      'BaseType' => '1067',
      'Name' => 'bitfield8_t const',
      'Size' => '1',
      'Type' => 'Const'
    },
    '1084' => {
      'Header' => 'pldm_types.h',
      'Line' => '31',
      'Memb' => {
        '0' => {
          'name' => 'alpha',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'update',
          'offset' => '1',
          'type' => '150'
        },
        '2' => {
          'name' => 'minor',
          'offset' => '2',
          'type' => '150'
        },
        '3' => {
          'name' => 'major',
          'offset' => '3',
          'type' => '150'
        }
      },
      'Name' => 'struct pldm_version',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '1150' => {
      'BaseType' => '1084',
      'Header' => 'pldm_types.h',
      'Line' => '36',
      'Name' => 'ver32_t',
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '1162' => {
      'BaseType' => '1150',
      'Name' => 'ver32_t const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '1167' => {
      'Name' => 'float',
      'Size' => '4',
      'Type' => 'Intrinsic'
    },
    '1608' => {
      'Header' => 'base.h',
      'Line' => '130',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_RESPONSE',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_REQUEST',
          'value' => '1'
        },
        '2' => {
          'name' => 'PLDM_RESERVED',
          'value' => '2'
        },
        '3' => {
          'name' => 'PLDM_ASYNC_REQUEST_NOTIFY',
          'value' => '3'
        }
      },
      'Name' => 'enum MessageType',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '1620' => {
      'Header' => 'base.h',
      'Line' => '183',
      'Memb' => {
        '0' => {
          'name' => 'command',
          'offset' => '2',
          'type' => '150'
        }
      },
      'Name' => 'struct pldm_msg_hdr',
      'Size' => '3',
      'Type' => 'Struct'
    },
    '1731' => {
      'BaseType' => '1620',
      'Name' => 'struct pldm_msg_hdr const',
      'Size' => '3',
      'Type' => 'Const'
    },
    '1736' => {
      'Header' => 'base.h',
      'Line' => '216',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '1620'
        },
        '1' => {
          'name' => 'payload',
          'offset' => '3',
          'type' => '1781'
        }
      },
      'Name' => 'struct pldm_msg',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '1776' => {
      'BaseType' => '1736',
      'Name' => 'struct pldm_msg const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '1781' => {
      'BaseType' => '150',
      'Name' => 'uint8_t[1]',
      'Size' => '1',
      'Type' => 'Array'
    },
    '1797' => {
      'Header' => 'base.h',
      'Line' => '296',
      'Memb' => {
        '0' => {
          'name' => 'msg_type',
          'offset' => '0',
          'type' => '1608'
        },
        '1' => {
          'name' => 'instance',
          'offset' => '4',
          'type' => '150'
        },
        '2' => {
          'name' => 'pldm_type',
          'offset' => '5',
          'type' => '150'
        },
        '3' => {
          'name' => 'command',
          'offset' => '6',
          'type' => '150'
        },
        '4' => {
          'name' => 'completion_code',
          'offset' => '7',
          'type' => '150'
        }
      },
      'Name' => 'struct pldm_header_info',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '1877' => {
      'BaseType' => '1797',
      'Name' => 'struct pldm_header_info const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '1882' => {
      'BaseType' => '1067',
      'Name' => 'bitfield8_t[8]',
      'Size' => '8',
      'Type' => 'Array'
    },
    '2044' => {
      'BaseType' => '2049',
      'Name' => 'void const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2049' => {
      'BaseType' => '1',
      'Name' => 'void const',
      'Type' => 'Const'
    },
    '2050' => {
      'BaseType' => '1079',
      'Name' => 'bitfield8_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2225' => {
      'BaseType' => '1736',
      'Name' => 'struct pldm_msg*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2304' => {
      'BaseType' => '1776',
      'Name' => 'struct pldm_msg const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2309' => {
      'BaseType' => '150',
      'Name' => 'uint8_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2314' => {
      'BaseType' => '1150',
      'Name' => 'ver32_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2408' => {
      'BaseType' => '1162',
      'Name' => 'ver32_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2455' => {
      'BaseType' => '174',
      'Name' => 'uint32_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2524' => {
      'BaseType' => '1731',
      'Name' => 'struct pldm_msg_hdr const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2529' => {
      'BaseType' => '1797',
      'Name' => 'struct pldm_header_info*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '3484' => {
      'BaseType' => '883',
      'Name' => 'size_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '3944' => {
      'BaseType' => '1877',
      'Name' => 'struct pldm_header_info const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '5617' => {
      'BaseType' => '150',
      'Name' => 'uint8_t const',
      'Size' => '1',
      'Type' => 'Const'
    },
    '5828' => {
      'BaseType' => '5617',
      'Name' => 'uint8_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '6366' => {
      'BaseType' => '150',
      'Header' => 'base.h',
      'Line' => '19',
      'Name' => 'pldm_tid_t',
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '6378' => {
      'BaseType' => '150',
      'Header' => 'instance-id.h',
      'Line' => '13',
      'Name' => 'pldm_instance_id_t',
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '6390' => {
      'Header' => 'responder.h',
      'Line' => '10',
      'Memb' => {
        '0' => {
          'name' => 'tid',
          'offset' => '0',
          'type' => '6366'
        },
        '1' => {
          'name' => 'instance_id',
          'offset' => '1',
          'type' => '6378'
        },
        '2' => {
          'name' => 'type',
          'offset' => '2',
          'type' => '150'
        },
        '3' => {
          'name' => 'command',
          'offset' => '3',
          'type' => '150'
        },
        '4' => {
          'name' => 'next',
          'offset' => '8',
          'type' => '6470'
        }
      },
      'Name' => 'struct pldm_responder_cookie',
      'PrivateABI' => 1,
      'Size' => '16',
      'Type' => 'Struct'
    },
    '6470' => {
      'BaseType' => '6390',
      'Name' => 'struct pldm_responder_cookie*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '6475' => {
      'Header' => 'pldm.h',
      'Line' => '15',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_REQUESTER_SUCCESS',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_REQUESTER_OPEN_FAIL',
          'value' => '18446744073709551615 (-1)'
        },
        '2' => {
          'name' => 'PLDM_REQUESTER_NOT_PLDM_MSG',
          'value' => '18446744073709551614 (-2)'
        },
        '3' => {
          'name' => 'PLDM_REQUESTER_NOT_RESP_MSG',
          'value' => '18446744073709551613 (-3)'
        },
        '4' => {
          'name' => 'PLDM_REQUESTER_NOT_REQ_MSG',
          'value' => '18446744073709551612 (-4)'
        },
        '5' => {
          'name' => 'PLDM_REQUESTER_RESP_MSG_TOO_SMALL',
          'value' => '18446744073709551611 (-5)'
        },
        '6' => {
          'name' => 'PLDM_REQUESTER_INSTANCE_ID_MISMATCH',
          'value' => '18446744073709551610 (-6)'
        },
        '7' => {
          'name' => 'PLDM_REQUESTER_SEND_FAIL',
          'value' => '18446744073709551609 (-7)'
        },
        '8' => {
          'name' => 'PLDM_REQUESTER_RECV_FAIL',
          'value' => '18446744073709551608 (-8)'
        },
        '9' => {
          'name' => 'PLDM_REQUESTER_INVALID_RECV_LEN',
          'value' => '18446744073709551607 (-9)'
        },
        '10' => {
          'name' => 'PLDM_REQUESTER_SETUP_FAIL',
          'value' => '18446744073709551606 (-10)'
        },
        '11' => {
          'name' => 'PLDM_REQUESTER_INVALID_SETUP',
          'value' => '18446744073709551605 (-11)'
        },
        '12' => {
          'name' => 'PLDM_REQUESTER_POLL_FAIL',
          'value' => '18446744073709551604 (-12)'
        },
        '13' => {
          'name' => 'PLDM_REQUESTER_TRANSPORT_BUSY',
          'value' => '18446744073709551603 (-13)'
        }
      },
      'Name' => 'enum pldm_requester_error_codes',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '6996' => {
      'Name' => '_Bool',
      'Size' => '1',
      'Type' => 'Intrinsic'
    },
    '7729' => {
      'BaseType' => '136',
      'Header' => 'types.h',
      'Line' => '194',
      'Name' => '__ssize_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '7741' => {
      'BaseType' => '143',
      'Name' => 'char*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '7753' => {
      'BaseType' => '143',
      'Name' => 'char const',
      'Size' => '1',
      'Type' => 'Const'
    },
    '7787' => {
      'BaseType' => '162',
      'Name' => 'uint16_t const',
      'Size' => '2',
      'Type' => 'Const'
    },
    '8124' => {
      'Header' => 'pldm_types.h',
      'Line' => '178',
      'Memb' => {
        '0' => {
          'name' => 'ptr',
          'offset' => '0',
          'type' => '5828'
        },
        '1' => {
          'name' => 'length',
          'offset' => '8',
          'type' => '883'
        }
      },
      'Name' => 'struct variable_field',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '8189' => {
      'BaseType' => '7729',
      'Header' => 'types.h',
      'Line' => '108',
      'Name' => 'ssize_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '9221' => {
      'Header' => 'base.h',
      'Line' => '380',
      'Memb' => {
        '0' => {
          'name' => 'pldm_type',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'transfer_opflag',
          'offset' => '1',
          'type' => '150'
        },
        '2' => {
          'name' => 'transfer_ctx',
          'offset' => '4',
          'type' => '174'
        },
        '3' => {
          'name' => 'transfer_handle',
          'offset' => '8',
          'type' => '174'
        },
        '4' => {
          'name' => 'section_offset',
          'offset' => '18',
          'type' => '174'
        },
        '5' => {
          'name' => 'section_length',
          'offset' => '22',
          'type' => '174'
        }
      },
      'Name' => 'struct pldm_base_multipart_receive_req',
      'Size' => '20',
      'Type' => 'Struct'
    },
    '9312' => {
      'BaseType' => '9221',
      'Name' => 'struct pldm_base_multipart_receive_req const',
      'Size' => '20',
      'Type' => 'Const'
    },
    '9317' => {
      'Header' => 'base.h',
      'Line' => '398',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'transfer_flag',
          'offset' => '1',
          'type' => '150'
        },
        '2' => {
          'name' => 'next_transfer_handle',
          'offset' => '4',
          'type' => '174'
        },
        '3' => {
          'name' => 'data',
          'offset' => '8',
          'type' => '8124'
        }
      },
      'Name' => 'struct pldm_base_multipart_receive_resp',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '9387' => {
      'Header' => 'base.h',
      'Line' => '410',
      'Memb' => {
        '0' => {
          'name' => 'requester_part_size',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'requester_protocol_support',
          'offset' => '2',
          'type' => '1882'
        }
      },
      'Name' => 'struct pldm_base_negotiate_transfer_params_req',
      'Size' => '10',
      'Type' => 'Struct'
    },
    '9426' => {
      'BaseType' => '9387',
      'Name' => 'struct pldm_base_negotiate_transfer_params_req const',
      'Size' => '10',
      'Type' => 'Const'
    },
    '9431' => {
      'Header' => 'base.h',
      'Line' => '419',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'responder_part_size',
          'offset' => '2',
          'type' => '162'
        },
        '2' => {
          'name' => 'responder_protocol_support',
          'offset' => '4',
          'type' => '1882'
        }
      },
      'Name' => 'struct pldm_base_negotiate_transfer_params_resp',
      'Size' => '12',
      'Type' => 'Struct'
    },
    '9520' => {
      'BaseType' => '7753',
      'Name' => 'char const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '11674' => {
      'BaseType' => '9431',
      'Name' => 'struct pldm_base_negotiate_transfer_params_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '17185' => {
      'BaseType' => '9426',
      'Name' => 'struct pldm_base_negotiate_transfer_params_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '24742' => {
      'BaseType' => '9317',
      'Name' => 'struct pldm_base_multipart_receive_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '27496' => {
      'BaseType' => '9312',
      'Name' => 'struct pldm_base_multipart_receive_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '33347' => {
      'BaseType' => '1067',
      'Name' => 'bitfield8_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '35260' => {
      'BaseType' => '1620',
      'Name' => 'struct pldm_msg_hdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '39566' => {
      'BaseType' => '8124',
      'Name' => 'struct variable_field*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '41648' => {
      'BaseType' => '162',
      'Name' => 'uint16_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '44901' => {
      'BaseType' => '72',
      'Header' => 'types.h',
      'Line' => '45',
      'Name' => '__uint64_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '44995' => {
      'BaseType' => '44901',
      'Header' => 'stdint-uintn.h',
      'Line' => '27',
      'Name' => 'uint64_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '45293' => {
      'Header' => 'bios.h',
      'Line' => '48',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_BIOS_STRING_TABLE',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_BIOS_ATTR_TABLE',
          'value' => '1'
        },
        '2' => {
          'name' => 'PLDM_BIOS_ATTR_VAL_TABLE',
          'value' => '2'
        }
      },
      'Name' => 'enum pldm_bios_table_types',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '45327' => {
      'Header' => 'bios.h',
      'Line' => '57',
      'Memb' => {
        '0' => {
          'name' => 'string_handle',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'string_length',
          'offset' => '2',
          'type' => '162'
        },
        '2' => {
          'name' => 'name',
          'offset' => '4',
          'type' => '45384'
        }
      },
      'Name' => 'struct pldm_bios_string_table_entry',
      'Size' => '5',
      'Type' => 'Struct'
    },
    '45379' => {
      'BaseType' => '45327',
      'Name' => 'struct pldm_bios_string_table_entry const',
      'Size' => '5',
      'Type' => 'Const'
    },
    '45384' => {
      'BaseType' => '143',
      'Name' => 'char[1]',
      'Size' => '1',
      'Type' => 'Array'
    },
    '45400' => {
      'Header' => 'bios.h',
      'Line' => '63',
      'Memb' => {
        '0' => {
          'name' => 'attr_handle',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'attr_type',
          'offset' => '2',
          'type' => '150'
        },
        '2' => {
          'name' => 'string_handle',
          'offset' => '3',
          'type' => '162'
        },
        '3' => {
          'name' => 'metadata',
          'offset' => '5',
          'type' => '1781'
        }
      },
      'Name' => 'struct pldm_bios_attr_table_entry',
      'Size' => '6',
      'Type' => 'Struct'
    },
    '45465' => {
      'BaseType' => '45400',
      'Name' => 'struct pldm_bios_attr_table_entry const',
      'Size' => '6',
      'Type' => 'Const'
    },
    '45470' => {
      'Header' => 'bios.h',
      'Line' => '75',
      'Memb' => {
        '0' => {
          'name' => 'attr_handle',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'attr_type',
          'offset' => '2',
          'type' => '150'
        },
        '2' => {
          'name' => 'value',
          'offset' => '3',
          'type' => '1781'
        }
      },
      'Name' => 'struct pldm_bios_attr_val_table_entry',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '45522' => {
      'BaseType' => '45470',
      'Name' => 'struct pldm_bios_attr_val_table_entry const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '45591' => {
      'Header' => 'bios_table.h',
      'Line' => '206',
      'Memb' => {
        '0' => {
          'name' => 'name_handle',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'read_only',
          'offset' => '2',
          'type' => '6996'
        },
        '2' => {
          'name' => 'pv_num',
          'offset' => '3',
          'type' => '150'
        },
        '3' => {
          'name' => 'pv_handle',
          'offset' => '8',
          'type' => '45694'
        },
        '4' => {
          'name' => 'def_num',
          'offset' => '22',
          'type' => '150'
        },
        '5' => {
          'name' => 'def_index',
          'offset' => '36',
          'type' => '5828'
        }
      },
      'Name' => 'struct pldm_bios_table_attr_entry_enum_info',
      'Size' => '32',
      'Type' => 'Struct'
    },
    '45682' => {
      'BaseType' => '45591',
      'Name' => 'struct pldm_bios_table_attr_entry_enum_info const',
      'Size' => '32',
      'Type' => 'Const'
    },
    '45694' => {
      'BaseType' => '7787',
      'Name' => 'uint16_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '45699' => {
      'Header' => 'bios_table.h',
      'Line' => '294',
      'Memb' => {
        '0' => {
          'name' => 'name_handle',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'read_only',
          'offset' => '2',
          'type' => '6996'
        },
        '2' => {
          'name' => 'string_type',
          'offset' => '3',
          'type' => '150'
        },
        '3' => {
          'name' => 'min_length',
          'offset' => '4',
          'type' => '162'
        },
        '4' => {
          'name' => 'max_length',
          'offset' => '6',
          'type' => '162'
        },
        '5' => {
          'name' => 'def_length',
          'offset' => '8',
          'type' => '162'
        },
        '6' => {
          'name' => 'def_string',
          'offset' => '22',
          'type' => '9520'
        }
      },
      'Name' => 'struct pldm_bios_table_attr_entry_string_info',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '45811' => {
      'BaseType' => '45699',
      'Name' => 'struct pldm_bios_table_attr_entry_string_info const',
      'Size' => '24',
      'Type' => 'Const'
    },
    '45821' => {
      'Header' => 'bios_table.h',
      'Line' => '384',
      'Memb' => {
        '0' => {
          'name' => 'name_handle',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'read_only',
          'offset' => '2',
          'type' => '6996'
        },
        '2' => {
          'name' => 'lower_bound',
          'offset' => '8',
          'type' => '44995'
        },
        '3' => {
          'name' => 'upper_bound',
          'offset' => '22',
          'type' => '44995'
        },
        '4' => {
          'name' => 'scalar_increment',
          'offset' => '36',
          'type' => '174'
        },
        '5' => {
          'name' => 'default_value',
          'offset' => '50',
          'type' => '44995'
        }
      },
      'Name' => 'struct pldm_bios_table_attr_entry_integer_info',
      'Size' => '40',
      'Type' => 'Struct'
    },
    '45919' => {
      'BaseType' => '45821',
      'Name' => 'struct pldm_bios_table_attr_entry_integer_info const',
      'Size' => '40',
      'Type' => 'Const'
    },
    '46151' => {
      'Name' => 'ssize_t(*)(void const*)',
      'Param' => {
        '0' => {
          'type' => '2044'
        }
      },
      'Return' => '8189',
      'Size' => '8',
      'Type' => 'FuncPtr'
    },
    '46221' => {
      'Line' => '957',
      'Memb' => {
        '0' => {
          'name' => 'table_data',
          'offset' => '0',
          'type' => '5828'
        },
        '1' => {
          'name' => 'table_len',
          'offset' => '8',
          'type' => '883'
        },
        '2' => {
          'name' => 'current_pos',
          'offset' => '22',
          'type' => '883'
        },
        '3' => {
          'name' => 'entry_length_handler',
          'offset' => '36',
          'type' => '46151'
        }
      },
      'Name' => 'struct pldm_bios_table_iter',
      'PrivateABI' => 1,
      'Size' => '32',
      'Source' => 'bios_table.c',
      'Type' => 'Struct'
    },
    '46291' => {
      'BaseType' => '46221',
      'Name' => 'struct pldm_bios_table_iter const',
      'Size' => '32',
      'Type' => 'Const'
    },
    '47361' => {
      'BaseType' => '46221',
      'Name' => 'struct pldm_bios_table_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '47366' => {
      'BaseType' => '45522',
      'Name' => 'struct pldm_bios_attr_val_table_entry const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '47780' => {
      'BaseType' => '45465',
      'Name' => 'struct pldm_bios_attr_table_entry const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '48383' => {
      'BaseType' => '45379',
      'Name' => 'struct pldm_bios_string_table_entry const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '49546' => {
      'BaseType' => '46291',
      'Name' => 'struct pldm_bios_table_iter const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '53729' => {
      'BaseType' => '44995',
      'Name' => 'uint64_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '54006' => {
      'BaseType' => '45919',
      'Name' => 'struct pldm_bios_table_attr_entry_integer_info const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '54273' => {
      'BaseType' => '9520',
      'Name' => 'char const**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '55402' => {
      'BaseType' => '45811',
      'Name' => 'struct pldm_bios_table_attr_entry_string_info const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '56856' => {
      'BaseType' => '45682',
      'Name' => 'struct pldm_bios_table_attr_entry_enum_info const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '59103' => {
      'Header' => 'pldm_types.h',
      'Line' => '42',
      'Name' => 'struct bits16',
      'Size' => '2',
      'Type' => 'Struct'
    },
    '59373' => {
      'Header' => 'pldm_types.h',
      'Line' => '60',
      'Memb' => {
        '0' => {
          'name' => 'value',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'bits',
          'offset' => '0',
          'type' => '59103'
        }
      },
      'Name' => 'union bitfield16_t',
      'Size' => '2',
      'Type' => 'Union'
    },
    '60131' => {
      'Header' => 'file.h',
      'Line' => '53',
      'Memb' => {
        '0' => {
          'name' => 'file_identifier',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'file_attribute',
          'offset' => '2',
          'type' => '59373'
        }
      },
      'Name' => 'struct pldm_file_df_open_req',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '60171' => {
      'BaseType' => '60131',
      'Name' => 'struct pldm_file_df_open_req const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '60176' => {
      'Header' => 'file.h',
      'Line' => '62',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'file_descriptor',
          'offset' => '2',
          'type' => '162'
        }
      },
      'Name' => 'struct pldm_file_df_open_resp',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '60221' => {
      'Header' => 'file.h',
      'Line' => '71',
      'Memb' => {
        '0' => {
          'name' => 'file_descriptor',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'df_close_options',
          'offset' => '2',
          'type' => '59373'
        }
      },
      'Name' => 'struct pldm_file_df_close_req',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '60261' => {
      'BaseType' => '60221',
      'Name' => 'struct pldm_file_df_close_req const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '60266' => {
      'Header' => 'file.h',
      'Line' => '80',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '150'
        }
      },
      'Name' => 'struct pldm_file_df_close_resp',
      'Size' => '1',
      'Type' => 'Struct'
    },
    '60298' => {
      'Header' => 'file.h',
      'Line' => '88',
      'Memb' => {
        '0' => {
          'name' => 'file_descriptor',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'requester_max_interval',
          'offset' => '4',
          'type' => '174'
        }
      },
      'Name' => 'struct pldm_file_df_heartbeat_req',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '60338' => {
      'BaseType' => '60298',
      'Name' => 'struct pldm_file_df_heartbeat_req const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '60343' => {
      'Header' => 'file.h',
      'Line' => '97',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'responder_max_interval',
          'offset' => '4',
          'type' => '174'
        }
      },
      'Name' => 'struct pldm_file_df_heartbeat_resp',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '61952' => {
      'BaseType' => '60343',
      'Name' => 'struct pldm_file_df_heartbeat_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '63529' => {
      'BaseType' => '60338',
      'Name' => 'struct pldm_file_df_heartbeat_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '63670' => {
      'BaseType' => '60266',
      'Name' => 'struct pldm_file_df_close_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '67961' => {
      'BaseType' => '60261',
      'Name' => 'struct pldm_file_df_close_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '69711' => {
      'BaseType' => '60176',
      'Name' => 'struct pldm_file_df_open_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '74297' => {
      'BaseType' => '60171',
      'Name' => 'struct pldm_file_df_open_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '76052' => {
      'BaseType' => '883',
      'Name' => 'size_t const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '76071' => {
      'BaseType' => '150',
      'Header' => 'pldm_types.h',
      'Line' => '38',
      'Name' => 'bool8_t',
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '76363' => {
      'Header' => 'pldm_types.h',
      'Line' => '64',
      'Name' => 'struct bits32',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '76855' => {
      'Header' => 'pldm_types.h',
      'Line' => '98',
      'Memb' => {
        '0' => {
          'name' => 'value',
          'offset' => '0',
          'type' => '174'
        },
        '1' => {
          'name' => 'bits',
          'offset' => '0',
          'type' => '76363'
        }
      },
      'Name' => 'union bitfield32_t',
      'Size' => '4',
      'Type' => 'Union'
    },
    '76867' => {
      'Header' => 'pldm_types.h',
      'Line' => '102',
      'Name' => 'struct bits64',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '77807' => {
      'Header' => 'pldm_types.h',
      'Line' => '168',
      'Memb' => {
        '0' => {
          'name' => 'value',
          'offset' => '0',
          'type' => '44995'
        },
        '1' => {
          'name' => 'bits',
          'offset' => '0',
          'type' => '76867'
        }
      },
      'Name' => 'union bitfield64_t',
      'Size' => '8',
      'Type' => 'Union'
    },
    '77826' => {
      'BaseType' => '77838',
      'Header' => 'pldm_types.h',
      'Line' => '172',
      'Name' => 'pldm_uuid',
      'Size' => '16',
      'Type' => 'Typedef'
    },
    '77838' => {
      'BaseType' => '150',
      'Name' => 'uint8_t[16]',
      'Size' => '16',
      'Type' => 'Array'
    },
    '77854' => {
      'BaseType' => '77838',
      'Name' => 'uint8_t[16] const',
      'Size' => '16',
      'Type' => 'Const'
    },
    '77898' => {
      'BaseType' => '8124',
      'Name' => 'struct variable_field const',
      'Size' => '16',
      'Type' => 'Const'
    },
    '80051' => {
      'BaseType' => '150',
      'Name' => 'uint8_t[8]',
      'Size' => '8',
      'Type' => 'Array'
    },
    '80067' => {
      'Header' => 'firmware_update.h',
      'Line' => '466',
      'Memb' => {
        '0' => {
          'name' => 'uuid',
          'offset' => '0',
          'type' => '77838'
        },
        '1' => {
          'name' => 'package_header_format_version',
          'offset' => '22',
          'type' => '150'
        },
        '2' => {
          'name' => 'package_header_size',
          'offset' => '23',
          'type' => '162'
        },
        '3' => {
          'name' => 'package_release_date_time',
          'offset' => '25',
          'type' => '80180'
        },
        '4' => {
          'name' => 'component_bitmap_bit_length',
          'offset' => '50',
          'type' => '162'
        },
        '5' => {
          'name' => 'package_version_string_type',
          'offset' => '52',
          'type' => '150'
        },
        '6' => {
          'name' => 'package_version_string_length',
          'offset' => '53',
          'type' => '150'
        }
      },
      'Name' => 'struct pldm_package_header_information',
      'Size' => '36',
      'Type' => 'Struct'
    },
    '80180' => {
      'BaseType' => '150',
      'Name' => 'uint8_t[13]',
      'Size' => '13',
      'Type' => 'Array'
    },
    '80196' => {
      'Header' => 'firmware_update.h',
      'Line' => '480',
      'Memb' => {
        '0' => {
          'name' => 'record_length',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'descriptor_count',
          'offset' => '2',
          'type' => '150'
        },
        '2' => {
          'name' => 'device_update_option_flags',
          'offset' => '3',
          'type' => '76855'
        },
        '3' => {
          'name' => 'comp_image_set_version_string_type',
          'offset' => '7',
          'type' => '150'
        },
        '4' => {
          'name' => 'comp_image_set_version_string_length',
          'offset' => '8',
          'type' => '150'
        },
        '5' => {
          'name' => 'fw_device_pkg_data_length',
          'offset' => '9',
          'type' => '162'
        }
      },
      'Name' => 'struct pldm_firmware_device_id_record',
      'Size' => '11',
      'Type' => 'Struct'
    },
    '80409' => {
      'Header' => 'firmware_update.h',
      'Line' => '514',
      'Memb' => {
        '0' => {
          'name' => 'comp_classification',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'comp_identifier',
          'offset' => '2',
          'type' => '162'
        },
        '2' => {
          'name' => 'comp_comparison_stamp',
          'offset' => '4',
          'type' => '174'
        },
        '3' => {
          'name' => 'comp_options',
          'offset' => '8',
          'type' => '59373'
        },
        '4' => {
          'name' => 'requested_comp_activation_method',
          'offset' => '16',
          'type' => '59373'
        },
        '5' => {
          'name' => 'comp_location_offset',
          'offset' => '18',
          'type' => '174'
        },
        '6' => {
          'name' => 'comp_size',
          'offset' => '22',
          'type' => '174'
        },
        '7' => {
          'name' => 'comp_version_string_type',
          'offset' => '32',
          'type' => '150'
        },
        '8' => {
          'name' => 'comp_version_string_length',
          'offset' => '33',
          'type' => '150'
        }
      },
      'Name' => 'struct pldm_component_image_information',
      'Size' => '22',
      'Type' => 'Struct'
    },
    '80607' => {
      'Header' => 'firmware_update.h',
      'Line' => '540',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'capabilities_during_update',
          'offset' => '1',
          'type' => '76855'
        },
        '2' => {
          'name' => 'comp_count',
          'offset' => '5',
          'type' => '162'
        },
        '3' => {
          'name' => 'active_comp_image_set_ver_str_type',
          'offset' => '7',
          'type' => '150'
        },
        '4' => {
          'name' => 'active_comp_image_set_ver_str_len',
          'offset' => '8',
          'type' => '150'
        },
        '5' => {
          'name' => 'pending_comp_image_set_ver_str_type',
          'offset' => '9',
          'type' => '150'
        },
        '6' => {
          'name' => 'pending_comp_image_set_ver_str_len',
          'offset' => '16',
          'type' => '150'
        }
      },
      'Name' => 'struct pldm_get_firmware_parameters_resp',
      'Size' => '11',
      'Type' => 'Struct'
    },
    '80810' => {
      'Header' => 'firmware_update.h',
      'Line' => '568',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'downstream_device_update_supported',
          'offset' => '1',
          'type' => '150'
        },
        '2' => {
          'name' => 'number_of_downstream_devices',
          'offset' => '2',
          'type' => '162'
        },
        '3' => {
          'name' => 'max_number_of_downstream_devices',
          'offset' => '4',
          'type' => '162'
        },
        '4' => {
          'name' => 'capabilities',
          'offset' => '8',
          'type' => '76855'
        }
      },
      'Name' => 'struct pldm_query_downstream_devices_resp',
      'Size' => '12',
      'Type' => 'Struct'
    },
    '80895' => {
      'Header' => 'firmware_update.h',
      'Line' => '580',
      'Memb' => {
        '0' => {
          'name' => 'comp_classification',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'comp_identifier',
          'offset' => '2',
          'type' => '162'
        },
        '2' => {
          'name' => 'comp_classification_index',
          'offset' => '4',
          'type' => '150'
        },
        '3' => {
          'name' => 'active_comp_comparison_stamp',
          'offset' => '5',
          'type' => '174'
        },
        '4' => {
          'name' => 'active_comp_ver_str_type',
          'offset' => '9',
          'type' => '150'
        },
        '5' => {
          'name' => 'active_comp_ver_str_len',
          'offset' => '16',
          'type' => '150'
        },
        '6' => {
          'name' => 'active_comp_release_date',
          'offset' => '17',
          'type' => '80051'
        },
        '7' => {
          'name' => 'pending_comp_comparison_stamp',
          'offset' => '25',
          'type' => '174'
        },
        '8' => {
          'name' => 'pending_comp_ver_str_type',
          'offset' => '35',
          'type' => '150'
        },
        '9' => {
          'name' => 'pending_comp_ver_str_len',
          'offset' => '36',
          'type' => '150'
        },
        '10' => {
          'name' => 'pending_comp_release_date',
          'offset' => '37',
          'type' => '80051'
        },
        '11' => {
          'name' => 'comp_activation_methods',
          'offset' => '51',
          'type' => '59373'
        },
        '12' => {
          'name' => 'capabilities_during_update',
          'offset' => '53',
          'type' => '76855'
        }
      },
      'Name' => 'struct pldm_component_parameter_entry',
      'Size' => '39',
      'Type' => 'Struct'
    },
    '81210' => {
      'Header' => 'firmware_update.h',
      'Line' => '619',
      'Memb' => {
        '0' => {
          'name' => 'data_transfer_handle',
          'offset' => '0',
          'type' => '174'
        },
        '1' => {
          'name' => 'transfer_operation_flag',
          'offset' => '4',
          'type' => '150'
        }
      },
      'Name' => 'struct pldm_query_downstream_identifiers_req',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '81253' => {
      'BaseType' => '81210',
      'Name' => 'struct pldm_query_downstream_identifiers_req const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '81258' => {
      'Header' => 'firmware_update.h',
      'Line' => '633',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'next_data_transfer_handle',
          'offset' => '4',
          'type' => '174'
        },
        '2' => {
          'name' => 'transfer_flag',
          'offset' => '8',
          'type' => '150'
        },
        '3' => {
          'name' => 'downstream_devices_length',
          'offset' => '18',
          'type' => '174'
        },
        '4' => {
          'name' => 'number_of_downstream_devices',
          'offset' => '22',
          'type' => '162'
        }
      },
      'Name' => 'struct pldm_query_downstream_identifiers_resp',
      'Size' => '20',
      'Type' => 'Struct'
    },
    '81343' => {
      'Header' => 'firmware_update.h',
      'Line' => '646',
      'Memb' => {
        '0' => {
          'name' => 'downstream_device_index',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'downstream_descriptor_count',
          'offset' => '2',
          'type' => '150'
        }
      },
      'Name' => 'struct pldm_downstream_device',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '81386' => {
      'Header' => 'firmware_update.h',
      'Line' => '652',
      'Memb' => {
        '0' => {
          'name' => 'field',
          'offset' => '0',
          'type' => '8124'
        },
        '1' => {
          'name' => 'devs',
          'offset' => '22',
          'type' => '883'
        }
      },
      'Name' => 'struct pldm_downstream_device_iter',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '81429' => {
      'Header' => 'firmware_update.h',
      'Line' => '726',
      'Memb' => {
        '0' => {
          'name' => 'descriptor_type',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'descriptor_length',
          'offset' => '2',
          'type' => '162'
        },
        '2' => {
          'name' => 'descriptor_data',
          'offset' => '8',
          'type' => '2044'
        }
      },
      'Name' => 'struct pldm_descriptor',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '81502' => {
      'Header' => 'firmware_update.h',
      'Line' => '732',
      'Memb' => {
        '0' => {
          'name' => 'field',
          'offset' => '0',
          'type' => '39566'
        },
        '1' => {
          'name' => 'count',
          'offset' => '8',
          'type' => '883'
        }
      },
      'Name' => 'struct pldm_descriptor_iter',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '81550' => {
      'Header' => 'firmware_update.h',
      'Line' => '825',
      'Memb' => {
        '0' => {
          'name' => 'data_transfer_handle',
          'offset' => '0',
          'type' => '174'
        },
        '1' => {
          'name' => 'transfer_operation_flag',
          'offset' => '4',
          'type' => '150'
        }
      },
      'Name' => 'struct pldm_get_downstream_firmware_parameters_req',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '81593' => {
      'BaseType' => '81550',
      'Name' => 'struct pldm_get_downstream_firmware_parameters_req const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '81598' => {
      'Header' => 'firmware_update.h',
      'Line' => '840',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'next_data_transfer_handle',
          'offset' => '4',
          'type' => '174'
        },
        '2' => {
          'name' => 'transfer_flag',
          'offset' => '8',
          'type' => '150'
        },
        '3' => {
          'name' => 'fdp_capabilities_during_update',
          'offset' => '18',
          'type' => '76855'
        },
        '4' => {
          'name' => 'downstream_device_count',
          'offset' => '22',
          'type' => '162'
        }
      },
      'Name' => 'struct pldm_get_downstream_firmware_parameters_resp',
      'Size' => '20',
      'Type' => 'Struct'
    },
    '81683' => {
      'Header' => 'firmware_update.h',
      'Line' => '858',
      'Memb' => {
        '0' => {
          'name' => 'downstream_device_index',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'active_comp_comparison_stamp',
          'offset' => '4',
          'type' => '174'
        },
        '2' => {
          'name' => 'active_comp_ver_str_type',
          'offset' => '8',
          'type' => '150'
        },
        '3' => {
          'name' => 'active_comp_ver_str_len',
          'offset' => '9',
          'type' => '150'
        },
        '4' => {
          'name' => 'active_comp_release_date',
          'offset' => '16',
          'type' => '81880'
        },
        '5' => {
          'name' => 'pending_comp_comparison_stamp',
          'offset' => '32',
          'type' => '174'
        },
        '6' => {
          'name' => 'pending_comp_ver_str_type',
          'offset' => '36',
          'type' => '150'
        },
        '7' => {
          'name' => 'pending_comp_ver_str_len',
          'offset' => '37',
          'type' => '150'
        },
        '8' => {
          'name' => 'pending_comp_release_date',
          'offset' => '38',
          'type' => '81880'
        },
        '9' => {
          'name' => 'comp_activation_methods',
          'offset' => '54',
          'type' => '59373'
        },
        '10' => {
          'name' => 'capabilities_during_update',
          'offset' => '64',
          'type' => '76855'
        },
        '11' => {
          'name' => 'active_comp_ver_str',
          'offset' => '72',
          'type' => '2044'
        },
        '12' => {
          'name' => 'pending_comp_ver_str',
          'offset' => '86',
          'type' => '2044'
        }
      },
      'Name' => 'struct pldm_downstream_device_parameters_entry',
      'Size' => '64',
      'Type' => 'Struct'
    },
    '81880' => {
      'BaseType' => '143',
      'Name' => 'char[9]',
      'Size' => '9',
      'Type' => 'Array'
    },
    '83313' => {
      'Header' => 'firmware_update.h',
      'Line' => '1407',
      'Memb' => {
        '0' => {
          'name' => 'field',
          'offset' => '0',
          'type' => '8124'
        },
        '1' => {
          'name' => 'entries',
          'offset' => '22',
          'type' => '883'
        }
      },
      'Name' => 'struct pldm_downstream_device_parameters_iter',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '83356' => {
      'Header' => 'firmware_update.h',
      'Line' => '2289',
      'Memb' => {
        '0' => {
          'name' => 'magic',
          'offset' => '0',
          'type' => '878'
        },
        '1' => {
          'name' => 'version',
          'offset' => '4',
          'type' => '5617'
        }
      },
      'Name' => 'anon-struct-firmware_update.h-2289',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '83393' => {
      'Header' => 'firmware_update.h',
      'Line' => '2308',
      'Memb' => {
        '0' => {
          'name' => 'identifier',
          'offset' => '0',
          'type' => '77854'
        },
        '1' => {
          'name' => 'revision',
          'offset' => '22',
          'type' => '5617'
        }
      },
      'Name' => 'anon-struct-firmware_update.h-2308',
      'Size' => '17',
      'Type' => 'Struct'
    },
    '83430' => {
      'Header' => 'firmware_update.h',
      'Line' => '2288',
      'Memb' => {
        '0' => {
          'name' => 'meta',
          'offset' => '0',
          'type' => '83356'
        },
        '1' => {
          'name' => 'format',
          'offset' => '8',
          'type' => '83393'
        }
      },
      'Name' => 'struct pldm_package_format_pin',
      'Size' => '28',
      'Type' => 'Struct'
    },
    '83473' => {
      'BaseType' => '83430',
      'Name' => 'struct pldm_package_format_pin const',
      'Size' => '28',
      'Type' => 'Const'
    },
    '83478' => {
      'Header' => 'firmware_update.h',
      'Line' => '2317',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_PACKAGE_PARSE_INIT',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_PACKAGE_PARSE_COMPLETE',
          'value' => '1'
        },
        '2' => {
          'name' => 'PLDM_PACKAGE_PARSE_HEADER',
          'value' => '2'
        },
        '3' => {
          'name' => 'PLDM_PACKAGE_PARSE_FIRMWARE_DEVICES',
          'value' => '3'
        },
        '4' => {
          'name' => 'PLDM_PACKAGE_PARSE_DOWNSTREAM_DEVICES',
          'value' => '4'
        },
        '5' => {
          'name' => 'PLDM_PACKAGE_PARSE_COMPONENT_IMAGE_INFORMATION',
          'value' => '5'
        }
      },
      'Name' => 'enum pldm_package_parse',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '83530' => {
      'Header' => 'firmware_update.h',
      'Line' => '2326',
      'Memb' => {
        '0' => {
          'name' => 'field',
          'offset' => '0',
          'type' => '8124'
        },
        '1' => {
          'name' => 'entries',
          'offset' => '22',
          'type' => '883'
        }
      },
      'Name' => 'struct pldm_package_iter',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '83573' => {
      'Header' => 'firmware_update.h',
      'Line' => '2339',
      'Memb' => {
        '0' => {
          'name' => 'package_header_identifier',
          'offset' => '0',
          'type' => '77826'
        },
        '1' => {
          'name' => 'package_header_format_revision',
          'offset' => '22',
          'type' => '150'
        },
        '2' => {
          'name' => 'package_release_date_time',
          'offset' => '23',
          'type' => '80180'
        },
        '3' => {
          'name' => 'component_bitmap_bit_length',
          'offset' => '48',
          'type' => '162'
        },
        '4' => {
          'name' => 'package_version_string_type',
          'offset' => '50',
          'type' => '150'
        },
        '5' => {
          'name' => 'package_version_string',
          'offset' => '64',
          'type' => '8124'
        }
      },
      'Name' => 'struct pldm__package_header_information',
      'Size' => '56',
      'Type' => 'Struct'
    },
    '83672' => {
      'BaseType' => '83573',
      'Header' => 'firmware_update.h',
      'Line' => '2352',
      'Name' => 'pldm_package_header_information_pad',
      'Size' => '56',
      'Type' => 'Typedef'
    },
    '83685' => {
      'BaseType' => '83672',
      'Name' => 'pldm_package_header_information_pad const',
      'Size' => '56',
      'Type' => 'Const'
    },
    '83690' => {
      'Header' => 'firmware_update.h',
      'Line' => '2355',
      'Memb' => {
        '0' => {
          'name' => 'bitmap',
          'offset' => '0',
          'type' => '8124'
        }
      },
      'Name' => 'struct pldm_package_component_bitmap',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '83719' => {
      'Header' => 'firmware_update.h',
      'Line' => '2367',
      'Memb' => {
        '0' => {
          'name' => 'descriptor_count',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'device_update_option_flags',
          'offset' => '4',
          'type' => '76855'
        },
        '2' => {
          'name' => 'component_image_set_version_string_type',
          'offset' => '8',
          'type' => '150'
        },
        '3' => {
          'name' => 'component_image_set_version_string',
          'offset' => '22',
          'type' => '8124'
        },
        '4' => {
          'name' => 'applicable_components',
          'offset' => '50',
          'type' => '83690'
        },
        '5' => {
          'name' => 'record_descriptors',
          'offset' => '72',
          'type' => '8124'
        },
        '6' => {
          'name' => 'firmware_device_package_data',
          'offset' => '100',
          'type' => '8124'
        },
        '7' => {
          'name' => 'reference_manifest_data',
          'offset' => '128',
          'type' => '8124'
        }
      },
      'Name' => 'struct pldm_package_firmware_device_id_record',
      'Size' => '96',
      'Type' => 'Struct'
    },
    '83846' => {
      'Header' => 'firmware_update.h',
      'Line' => '2418',
      'Memb' => {
        '0' => {
          'name' => 'descriptor_count',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'update_option_flags',
          'offset' => '4',
          'type' => '76855'
        },
        '2' => {
          'name' => 'self_contained_activation_min_version_string_type',
          'offset' => '8',
          'type' => '150'
        },
        '3' => {
          'name' => 'self_contained_activation_min_version_string',
          'offset' => '22',
          'type' => '8124'
        },
        '4' => {
          'name' => 'self_contained_activation_min_version_comparison_stamp',
          'offset' => '50',
          'type' => '174'
        },
        '5' => {
          'name' => 'applicable_components',
          'offset' => '64',
          'type' => '83690'
        },
        '6' => {
          'name' => 'record_descriptors',
          'offset' => '86',
          'type' => '8124'
        },
        '7' => {
          'name' => 'package_data',
          'offset' => '114',
          'type' => '8124'
        },
        '8' => {
          'name' => 'reference_manifest_data',
          'offset' => '136',
          'type' => '8124'
        }
      },
      'Name' => 'struct pldm_package_downstream_device_id_record',
      'Size' => '104',
      'Type' => 'Struct'
    },
    '83987' => {
      'Header' => 'firmware_update.h',
      'Line' => '2468',
      'Memb' => {
        '0' => {
          'name' => 'component_classification',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'component_identifier',
          'offset' => '2',
          'type' => '162'
        },
        '2' => {
          'name' => 'component_comparison_stamp',
          'offset' => '4',
          'type' => '174'
        },
        '3' => {
          'name' => 'component_options',
          'offset' => '8',
          'type' => '59373'
        },
        '4' => {
          'name' => 'requested_component_activation_method',
          'offset' => '16',
          'type' => '59373'
        },
        '5' => {
          'name' => 'component_image',
          'offset' => '22',
          'type' => '8124'
        },
        '6' => {
          'name' => 'component_version_string_type',
          'offset' => '50',
          'type' => '150'
        },
        '7' => {
          'name' => 'component_version_string',
          'offset' => '64',
          'type' => '8124'
        },
        '8' => {
          'name' => 'component_opaque_data',
          'offset' => '86',
          'type' => '8124'
        }
      },
      'Name' => 'struct pldm_package_component_image_information',
      'Size' => '72',
      'Type' => 'Struct'
    },
    '84128' => {
      'Header' => 'firmware_update.h',
      'Line' => '2509',
      'Memb' => {
        '0' => {
          'name' => 'pin',
          'offset' => '0',
          'type' => '84239'
        },
        '1' => {
          'name' => 'hdr',
          'offset' => '8',
          'type' => '84244'
        },
        '2' => {
          'name' => 'state',
          'offset' => '22',
          'type' => '83478'
        },
        '3' => {
          'name' => 'flags',
          'offset' => '32',
          'type' => '174'
        },
        '4' => {
          'name' => 'package',
          'offset' => '36',
          'type' => '8124'
        },
        '5' => {
          'name' => 'areas',
          'offset' => '64',
          'type' => '8124'
        },
        '6' => {
          'name' => 'iter',
          'offset' => '86',
          'type' => '83530'
        }
      },
      'Name' => 'struct pldm_package',
      'Size' => '80',
      'Type' => 'Struct'
    },
    '84239' => {
      'BaseType' => '83473',
      'Name' => 'struct pldm_package_format_pin const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '84244' => {
      'BaseType' => '83685',
      'Name' => 'pldm_package_header_information_pad const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '91124' => {
      'BaseType' => '84128',
      'Name' => 'struct pldm_package*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '91129' => {
      'BaseType' => '83987',
      'Name' => 'struct pldm_package_component_image_information*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '99218' => {
      'BaseType' => '83846',
      'Name' => 'struct pldm_package_downstream_device_id_record*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '100871' => {
      'BaseType' => '83719',
      'Name' => 'struct pldm_package_firmware_device_id_record*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '102623' => {
      'BaseType' => '83672',
      'Name' => 'pldm_package_header_information_pad*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '107634' => {
      'BaseType' => '76071',
      'Name' => 'bool8_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '107639' => {
      'BaseType' => '77807',
      'Name' => 'bitfield64_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '111700' => {
      'BaseType' => '76855',
      'Name' => 'bitfield32_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '116812' => {
      'BaseType' => '59373',
      'Name' => 'bitfield16_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '129521' => {
      'BaseType' => '77898',
      'Name' => 'struct variable_field const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '156394' => {
      'BaseType' => '83313',
      'Name' => 'struct pldm_downstream_device_parameters_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '156399' => {
      'BaseType' => '81683',
      'Name' => 'struct pldm_downstream_device_parameters_entry*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '159863' => {
      'BaseType' => '81598',
      'Name' => 'struct pldm_get_downstream_firmware_parameters_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '161312' => {
      'BaseType' => '81593',
      'Name' => 'struct pldm_get_downstream_firmware_parameters_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '162878' => {
      'BaseType' => '81386',
      'Name' => 'struct pldm_downstream_device_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '162883' => {
      'BaseType' => '81343',
      'Name' => 'struct pldm_downstream_device*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '166344' => {
      'BaseType' => '81258',
      'Name' => 'struct pldm_query_downstream_identifiers_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '167793' => {
      'BaseType' => '81253',
      'Name' => 'struct pldm_query_downstream_identifiers_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '171166' => {
      'BaseType' => '80810',
      'Name' => 'struct pldm_query_downstream_devices_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '171613' => {
      'BaseType' => '80895',
      'Name' => 'struct pldm_component_parameter_entry*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '181957' => {
      'BaseType' => '80607',
      'Name' => 'struct pldm_get_firmware_parameters_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '185583' => {
      'BaseType' => '2309',
      'Name' => 'uint8_t**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '185925' => {
      'BaseType' => '80409',
      'Name' => 'struct pldm_component_image_information*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '188903' => {
      'BaseType' => '81502',
      'Name' => 'struct pldm_descriptor_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '188908' => {
      'BaseType' => '81429',
      'Name' => 'struct pldm_descriptor*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '189292' => {
      'BaseType' => '80196',
      'Name' => 'struct pldm_firmware_device_id_record*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '198055' => {
      'BaseType' => '852',
      'Name' => 'void**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '198556' => {
      'BaseType' => '80067',
      'Name' => 'struct pldm_package_header_information*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '215894' => {
      'BaseType' => '215911',
      'Header' => 'pdr.h',
      'Line' => '16',
      'Name' => 'pldm_pdr',
      'PrivateABI' => 1,
      'Size' => '24',
      'Type' => 'Typedef'
    },
    '215906' => {
      'BaseType' => '215894',
      'Name' => 'pldm_pdr const',
      'Size' => '24',
      'Type' => 'Const'
    },
    '215911' => {
      'Line' => '31',
      'Memb' => {
        '0' => {
          'name' => 'record_count',
          'offset' => '0',
          'type' => '174'
        },
        '1' => {
          'name' => 'size',
          'offset' => '4',
          'type' => '174'
        },
        '2' => {
          'name' => 'first',
          'offset' => '8',
          'type' => '217381'
        },
        '3' => {
          'name' => 'last',
          'offset' => '22',
          'type' => '217381'
        }
      },
      'Name' => 'struct pldm_pdr',
      'PrivateABI' => 1,
      'Size' => '24',
      'Source' => 'pdr.c',
      'Type' => 'Struct'
    },
    '215977' => {
      'BaseType' => '215994',
      'Header' => 'pdr.h',
      'Line' => '21',
      'Name' => 'pldm_pdr_record',
      'PrivateABI' => 1,
      'Size' => '32',
      'Type' => 'Typedef'
    },
    '215989' => {
      'BaseType' => '215977',
      'Name' => 'pldm_pdr_record const',
      'Size' => '32',
      'Type' => 'Const'
    },
    '215994' => {
      'Line' => '22',
      'Memb' => {
        '0' => {
          'name' => 'record_handle',
          'offset' => '0',
          'type' => '174'
        },
        '1' => {
          'name' => 'size',
          'offset' => '4',
          'type' => '174'
        },
        '2' => {
          'name' => 'data',
          'offset' => '8',
          'type' => '2309'
        },
        '3' => {
          'name' => 'next',
          'offset' => '22',
          'type' => '217369'
        },
        '4' => {
          'name' => 'is_remote',
          'offset' => '36',
          'type' => '6996'
        },
        '5' => {
          'name' => 'terminus_handle',
          'offset' => '38',
          'type' => '162'
        }
      },
      'Name' => 'struct pldm_pdr_record',
      'PrivateABI' => 1,
      'Size' => '32',
      'Source' => 'pdr.c',
      'Type' => 'Struct'
    },
    '216086' => {
      'Header' => 'pdr.h',
      'Line' => '327',
      'Memb' => {
        '0' => {
          'name' => 'entity_type',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'entity_instance_num',
          'offset' => '2',
          'type' => '162'
        },
        '2' => {
          'name' => 'entity_container_id',
          'offset' => '4',
          'type' => '162'
        }
      },
      'Name' => 'struct pldm_entity',
      'Size' => '6',
      'Type' => 'Struct'
    },
    '216148' => {
      'BaseType' => '216086',
      'Header' => 'pdr.h',
      'Line' => '331',
      'Name' => 'pldm_entity',
      'Size' => '6',
      'Type' => 'Typedef'
    },
    '216160' => {
      'BaseType' => '216148',
      'Name' => 'pldm_entity const',
      'Size' => '6',
      'Type' => 'Const'
    },
    '216194' => {
      'BaseType' => '216206',
      'Header' => 'pdr.h',
      'Line' => '341',
      'Name' => 'pldm_entity_association_tree',
      'PrivateABI' => 1,
      'Size' => '16',
      'Type' => 'Typedef'
    },
    '216206' => {
      'Line' => '648',
      'Memb' => {
        '0' => {
          'name' => 'root',
          'offset' => '0',
          'type' => '217386'
        },
        '1' => {
          'name' => 'last_used_container_id',
          'offset' => '8',
          'type' => '162'
        }
      },
      'Name' => 'struct pldm_entity_association_tree',
      'PrivateABI' => 1,
      'Size' => '16',
      'Source' => 'pdr.c',
      'Type' => 'Struct'
    },
    '216249' => {
      'BaseType' => '216266',
      'Header' => 'pdr.h',
      'Line' => '346',
      'Name' => 'pldm_entity_node',
      'PrivateABI' => 1,
      'Size' => '40',
      'Type' => 'Typedef'
    },
    '216261' => {
      'BaseType' => '216249',
      'Name' => 'pldm_entity_node const',
      'Size' => '40',
      'Type' => 'Const'
    },
    '216266' => {
      'Line' => '653',
      'Memb' => {
        '0' => {
          'name' => 'entity',
          'offset' => '0',
          'type' => '216148'
        },
        '1' => {
          'name' => 'parent',
          'offset' => '6',
          'type' => '216148'
        },
        '2' => {
          'name' => 'remote_container_id',
          'offset' => '18',
          'type' => '162'
        },
        '3' => {
          'name' => 'first_child',
          'offset' => '22',
          'type' => '217386'
        },
        '4' => {
          'name' => 'next_sibling',
          'offset' => '36',
          'type' => '217386'
        },
        '5' => {
          'name' => 'association_type',
          'offset' => '50',
          'type' => '150'
        }
      },
      'Name' => 'struct pldm_entity_node',
      'PrivateABI' => 1,
      'Size' => '40',
      'Source' => 'pdr.c',
      'Type' => 'Struct'
    },
    '216587' => {
      'Header' => 'platform.h',
      'Line' => '576',
      'Memb' => {
        '0' => {
          'name' => 'record_handle',
          'offset' => '0',
          'type' => '174'
        },
        '1' => {
          'name' => 'version',
          'offset' => '4',
          'type' => '150'
        },
        '2' => {
          'name' => 'type',
          'offset' => '5',
          'type' => '150'
        },
        '3' => {
          'name' => 'record_change_num',
          'offset' => '6',
          'type' => '162'
        },
        '4' => {
          'name' => 'length',
          'offset' => '8',
          'type' => '162'
        }
      },
      'Name' => 'struct pldm_pdr_hdr',
      'Size' => '10',
      'Type' => 'Struct'
    },
    '217036' => {
      'Header' => 'platform.h',
      'Line' => '651',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '216587'
        },
        '1' => {
          'name' => 'terminus_handle',
          'offset' => '16',
          'type' => '162'
        },
        '2' => {
          'name' => 'sensor_id',
          'offset' => '18',
          'type' => '162'
        },
        '3' => {
          'name' => 'entity_type',
          'offset' => '20',
          'type' => '162'
        },
        '4' => {
          'name' => 'entity_instance',
          'offset' => '22',
          'type' => '162'
        },
        '5' => {
          'name' => 'container_id',
          'offset' => '24',
          'type' => '162'
        },
        '6' => {
          'name' => 'sensor_init',
          'offset' => '32',
          'type' => '150'
        },
        '7' => {
          'name' => 'sensor_auxiliary_names_pdr',
          'offset' => '33',
          'type' => '76071'
        },
        '8' => {
          'name' => 'composite_sensor_count',
          'offset' => '34',
          'type' => '150'
        },
        '9' => {
          'name' => 'possible_states',
          'offset' => '35',
          'type' => '1781'
        }
      },
      'Name' => 'struct pldm_state_sensor_pdr',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '217190' => {
      'Header' => 'platform.h',
      'Line' => '678',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '216587'
        },
        '1' => {
          'name' => 'terminus_handle',
          'offset' => '16',
          'type' => '162'
        },
        '2' => {
          'name' => 'effecter_id',
          'offset' => '18',
          'type' => '162'
        },
        '3' => {
          'name' => 'entity_type',
          'offset' => '20',
          'type' => '162'
        },
        '4' => {
          'name' => 'entity_instance',
          'offset' => '22',
          'type' => '162'
        },
        '5' => {
          'name' => 'container_id',
          'offset' => '24',
          'type' => '162'
        },
        '6' => {
          'name' => 'effecter_semantic_id',
          'offset' => '32',
          'type' => '162'
        },
        '7' => {
          'name' => 'effecter_init',
          'offset' => '34',
          'type' => '150'
        },
        '8' => {
          'name' => 'has_description_pdr',
          'offset' => '35',
          'type' => '76071'
        },
        '9' => {
          'name' => 'composite_effecter_count',
          'offset' => '36',
          'type' => '150'
        },
        '10' => {
          'name' => 'possible_states',
          'offset' => '37',
          'type' => '1781'
        }
      },
      'Name' => 'struct pldm_state_effecter_pdr',
      'Size' => '26',
      'Type' => 'Struct'
    },
    '217369' => {
      'BaseType' => '215994',
      'Name' => 'struct pldm_pdr_record*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '217381' => {
      'BaseType' => '215977',
      'Name' => 'pldm_pdr_record*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '217386' => {
      'BaseType' => '216249',
      'Name' => 'pldm_entity_node*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '217753' => {
      'BaseType' => '216194',
      'Name' => 'pldm_entity_association_tree*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '217758' => {
      'BaseType' => '216160',
      'Name' => 'pldm_entity const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '219242' => {
      'BaseType' => '215894',
      'Name' => 'pldm_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '220897' => {
      'BaseType' => '215989',
      'Name' => 'pldm_pdr_record const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '229616' => {
      'BaseType' => '216148',
      'Name' => 'pldm_entity*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '249493' => {
      'BaseType' => '229616',
      'Name' => 'pldm_entity**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '250140' => {
      'BaseType' => '217386',
      'Name' => 'pldm_entity_node**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '250929' => {
      'BaseType' => '215906',
      'Name' => 'pldm_pdr const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '256402' => {
      'BaseType' => '216261',
      'Name' => 'pldm_entity_node const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '263247' => {
      'BaseType' => '217190',
      'Name' => 'struct pldm_state_effecter_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '268938' => {
      'BaseType' => '217036',
      'Name' => 'struct pldm_state_sensor_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '274158' => {
      'BaseType' => '79',
      'Header' => 'types.h',
      'Line' => '37',
      'Name' => '__int8_t',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '274189' => {
      'BaseType' => '98',
      'Header' => 'types.h',
      'Line' => '39',
      'Name' => '__int16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '274220' => {
      'BaseType' => '117',
      'Header' => 'types.h',
      'Line' => '41',
      'Name' => '__int32_t',
      'PrivateABI' => 1,
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '274258' => {
      'BaseType' => '105',
      'Header' => 'types.h',
      'Line' => '55',
      'Name' => '__uint_least16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '274311' => {
      'BaseType' => '274158',
      'Header' => 'stdint-intn.h',
      'Line' => '24',
      'Name' => 'int8_t',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '274323' => {
      'BaseType' => '274189',
      'Header' => 'stdint-intn.h',
      'Line' => '25',
      'Name' => 'int16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '274335' => {
      'BaseType' => '274220',
      'Header' => 'stdint-intn.h',
      'Line' => '26',
      'Name' => 'int32_t',
      'PrivateABI' => 1,
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '275003' => {
      'BaseType' => '1167',
      'Header' => 'pldm_types.h',
      'Line' => '170',
      'Name' => 'real32_t',
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '275763' => {
      'BaseType' => '274258',
      'Header' => 'uchar.h',
      'Line' => '51',
      'Name' => 'char16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '276686' => {
      'Header' => 'platform.h',
      'Line' => '345',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_SENSOR_OP_STATE',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_STATE_SENSOR_STATE',
          'value' => '1'
        },
        '2' => {
          'name' => 'PLDM_NUMERIC_SENSOR_STATE',
          'value' => '2'
        }
      },
      'Name' => 'enum sensor_event_class_states',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '276720' => {
      'BaseType' => '276686',
      'Name' => 'enum sensor_event_class_states const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '277216' => {
      'Header' => 'platform.h',
      'Line' => '668',
      'Memb' => {
        '0' => {
          'name' => 'state_set_id',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'possible_states_size',
          'offset' => '2',
          'type' => '150'
        },
        '2' => {
          'name' => 'states',
          'offset' => '3',
          'type' => '277278'
        }
      },
      'Name' => 'struct state_sensor_possible_states',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '277273' => {
      'BaseType' => '277216',
      'Name' => 'struct state_sensor_possible_states const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '277278' => {
      'BaseType' => '1067',
      'Name' => 'bitfield8_t[1]',
      'Size' => '1',
      'Type' => 'Array'
    },
    '277651' => {
      'Header' => 'platform.h',
      'Line' => '769',
      'Memb' => {
        '0' => {
          'name' => 'value_u8',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'value_s8',
          'offset' => '0',
          'type' => '274311'
        },
        '2' => {
          'name' => 'value_u16',
          'offset' => '0',
          'type' => '162'
        },
        '3' => {
          'name' => 'value_s16',
          'offset' => '0',
          'type' => '274323'
        },
        '4' => {
          'name' => 'value_u32',
          'offset' => '0',
          'type' => '174'
        },
        '5' => {
          'name' => 'value_s32',
          'offset' => '0',
          'type' => '274335'
        },
        '6' => {
          'name' => 'value_f32',
          'offset' => '0',
          'type' => '275003'
        }
      },
      'Name' => 'union union_range_field_format',
      'Size' => '4',
      'Type' => 'Union'
    },
    '278250' => {
      'Header' => 'platform.h',
      'Line' => '826',
      'Memb' => {
        '0' => {
          'name' => 'value_u8',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'value_s8',
          'offset' => '0',
          'type' => '274311'
        },
        '2' => {
          'name' => 'value_u16',
          'offset' => '0',
          'type' => '162'
        },
        '3' => {
          'name' => 'value_s16',
          'offset' => '0',
          'type' => '274323'
        },
        '4' => {
          'name' => 'value_u32',
          'offset' => '0',
          'type' => '174'
        },
        '5' => {
          'name' => 'value_s32',
          'offset' => '0',
          'type' => '274335'
        }
      },
      'Name' => 'union union_sensor_data_size',
      'Size' => '4',
      'Type' => 'Union'
    },
    '278263' => {
      'Header' => 'platform.h',
      'Line' => '833',
      'Memb' => {
        '0' => {
          'name' => 'record_handle',
          'offset' => '0',
          'type' => '174'
        },
        '1' => {
          'name' => 'version',
          'offset' => '4',
          'type' => '150'
        },
        '2' => {
          'name' => 'type',
          'offset' => '5',
          'type' => '150'
        },
        '3' => {
          'name' => 'record_change_num',
          'offset' => '6',
          'type' => '162'
        },
        '4' => {
          'name' => 'length',
          'offset' => '8',
          'type' => '162'
        }
      },
      'Name' => 'struct pldm_value_pdr_hdr',
      'Size' => '12',
      'Type' => 'Struct'
    },
    '278348' => {
      'Header' => 'platform.h',
      'Line' => '851',
      'Memb' => {
        '0' => {
          'name' => 'entity_instance_num',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'entity_instance',
          'offset' => '0',
          'type' => '162'
        }
      },
      'Name' => 'anon-union-platform.h-851',
      'Size' => '2',
      'Type' => 'Union'
    },
    '278383' => {
      'Header' => 'platform.h',
      'Line' => '846',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '278263'
        },
        '1' => {
          'name' => 'terminus_handle',
          'offset' => '18',
          'type' => '162'
        },
        '2' => {
          'name' => 'sensor_id',
          'offset' => '20',
          'type' => '162'
        },
        '3' => {
          'name' => 'entity_type',
          'offset' => '22',
          'type' => '162'
        },
        '4' => {
          'name' => 'unnamed0',
          'offset' => '24',
          'type' => '278348'
        },
        '5' => {
          'name' => 'container_id',
          'offset' => '32',
          'type' => '162'
        },
        '6' => {
          'name' => 'sensor_init',
          'offset' => '34',
          'type' => '150'
        },
        '7' => {
          'name' => 'sensor_auxiliary_names_pdr',
          'offset' => '35',
          'type' => '76071'
        },
        '8' => {
          'name' => 'base_unit',
          'offset' => '36',
          'type' => '150'
        },
        '9' => {
          'name' => 'unit_modifier',
          'offset' => '37',
          'type' => '274311'
        },
        '10' => {
          'name' => 'rate_unit',
          'offset' => '38',
          'type' => '150'
        },
        '11' => {
          'name' => 'base_oem_unit_handle',
          'offset' => '39',
          'type' => '150'
        },
        '12' => {
          'name' => 'aux_unit',
          'offset' => '40',
          'type' => '150'
        },
        '13' => {
          'name' => 'aux_unit_modifier',
          'offset' => '41',
          'type' => '274311'
        },
        '14' => {
          'name' => 'aux_rate_unit',
          'offset' => '48',
          'type' => '150'
        },
        '15' => {
          'name' => 'rel',
          'offset' => '49',
          'type' => '150'
        },
        '16' => {
          'name' => 'aux_oem_unit_handle',
          'offset' => '50',
          'type' => '150'
        },
        '17' => {
          'name' => 'is_linear',
          'offset' => '51',
          'type' => '76071'
        },
        '18' => {
          'name' => 'sensor_data_size',
          'offset' => '52',
          'type' => '150'
        },
        '19' => {
          'name' => 'resolution',
          'offset' => '54',
          'type' => '275003'
        },
        '20' => {
          'name' => 'offset',
          'offset' => '64',
          'type' => '275003'
        },
        '21' => {
          'name' => 'accuracy',
          'offset' => '68',
          'type' => '162'
        },
        '22' => {
          'name' => 'plus_tolerance',
          'offset' => '70',
          'type' => '150'
        },
        '23' => {
          'name' => 'minus_tolerance',
          'offset' => '71',
          'type' => '150'
        },
        '24' => {
          'name' => 'hysteresis',
          'offset' => '72',
          'type' => '278250'
        },
        '25' => {
          'name' => 'supported_thresholds',
          'offset' => '82',
          'type' => '1067'
        },
        '26' => {
          'name' => 'threshold_and_hysteresis_volatility',
          'offset' => '83',
          'type' => '1067'
        },
        '27' => {
          'name' => 'state_transition_interval',
          'offset' => '86',
          'type' => '275003'
        },
        '28' => {
          'name' => 'update_interval',
          'offset' => '96',
          'type' => '275003'
        },
        '29' => {
          'name' => 'max_readable',
          'offset' => '100',
          'type' => '278250'
        },
        '30' => {
          'name' => 'min_readable',
          'offset' => '104',
          'type' => '278250'
        },
        '31' => {
          'name' => 'range_field_format',
          'offset' => '114',
          'type' => '150'
        },
        '32' => {
          'name' => 'range_field_support',
          'offset' => '115',
          'type' => '1067'
        },
        '33' => {
          'name' => 'nominal_value',
          'offset' => '118',
          'type' => '277651'
        },
        '34' => {
          'name' => 'normal_max',
          'offset' => '128',
          'type' => '277651'
        },
        '35' => {
          'name' => 'normal_min',
          'offset' => '132',
          'type' => '277651'
        },
        '36' => {
          'name' => 'warning_high',
          'offset' => '136',
          'type' => '277651'
        },
        '37' => {
          'name' => 'warning_low',
          'offset' => '146',
          'type' => '277651'
        },
        '38' => {
          'name' => 'critical_high',
          'offset' => '150',
          'type' => '277651'
        },
        '39' => {
          'name' => 'critical_low',
          'offset' => '256',
          'type' => '277651'
        },
        '40' => {
          'name' => 'fatal_high',
          'offset' => '260',
          'type' => '277651'
        },
        '41' => {
          'name' => 'fatal_low',
          'offset' => '264',
          'type' => '277651'
        }
      },
      'Name' => 'struct pldm_numeric_sensor_value_pdr',
      'Size' => '112',
      'Type' => 'Struct'
    },
    '278976' => {
      'BaseType' => '275763',
      'Header' => 'platform.h',
      'Line' => '894',
      'Name' => 'pldm_utf16be',
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '278989' => {
      'Header' => 'platform.h',
      'Line' => '896',
      'Memb' => {
        '0' => {
          'name' => 'tag',
          'offset' => '0',
          'type' => '7741'
        },
        '1' => {
          'name' => 'name',
          'offset' => '8',
          'type' => '279031'
        }
      },
      'Name' => 'struct pldm_entity_auxiliary_name',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '279031' => {
      'BaseType' => '278976',
      'Name' => 'pldm_utf16be*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '279036' => {
      'Header' => 'platform.h',
      'Line' => '906',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '278263'
        },
        '1' => {
          'name' => 'container',
          'offset' => '18',
          'type' => '216148'
        },
        '2' => {
          'name' => 'shared_name_count',
          'offset' => '24',
          'type' => '150'
        },
        '3' => {
          'name' => 'name_string_count',
          'offset' => '25',
          'type' => '150'
        },
        '4' => {
          'name' => 'names',
          'offset' => '36',
          'type' => '279150'
        },
        '5' => {
          'name' => 'auxiliary_name_data_size',
          'offset' => '50',
          'type' => '883'
        },
        '6' => {
          'name' => 'auxiliary_name_data',
          'offset' => '64',
          'type' => '279155'
        }
      },
      'Name' => 'struct pldm_entity_auxiliary_names_pdr',
      'Size' => '40',
      'Type' => 'Struct'
    },
    '279150' => {
      'BaseType' => '278989',
      'Name' => 'struct pldm_entity_auxiliary_name*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '279155' => {
      'BaseType' => '143',
      'Name' => 'char[]',
      'Size' => '8',
      'Type' => 'Array'
    },
    '279170' => {
      'Header' => 'platform.h',
      'Line' => '936',
      'Memb' => {
        '0' => {
          'name' => 'state_set_id',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'possible_states_size',
          'offset' => '2',
          'type' => '150'
        },
        '2' => {
          'name' => 'states',
          'offset' => '3',
          'type' => '277278'
        }
      },
      'Name' => 'struct state_effecter_possible_states',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '279227' => {
      'BaseType' => '279170',
      'Name' => 'struct state_effecter_possible_states const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '279232' => {
      'Header' => 'platform.h',
      'Line' => '960',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '278263'
        },
        '1' => {
          'name' => 'terminus_handle',
          'offset' => '18',
          'type' => '162'
        },
        '2' => {
          'name' => 'file_identifier',
          'offset' => '20',
          'type' => '162'
        },
        '3' => {
          'name' => 'container',
          'offset' => '22',
          'type' => '216148'
        },
        '4' => {
          'name' => 'superior_directory_file_identifier',
          'offset' => '34',
          'type' => '162'
        },
        '5' => {
          'name' => 'file_classification',
          'offset' => '36',
          'type' => '150'
        },
        '6' => {
          'name' => 'oem_file_classification',
          'offset' => '37',
          'type' => '150'
        },
        '7' => {
          'name' => 'file_capabilities',
          'offset' => '38',
          'type' => '59373'
        },
        '8' => {
          'name' => 'file_version',
          'offset' => '40',
          'type' => '1150'
        },
        '9' => {
          'name' => 'file_maximum_size',
          'offset' => '50',
          'type' => '174'
        },
        '10' => {
          'name' => 'file_maximum_file_descriptor_count',
          'offset' => '54',
          'type' => '150'
        },
        '11' => {
          'name' => 'file_name',
          'offset' => '64',
          'type' => '8124'
        },
        '12' => {
          'name' => 'oem_file_classification_name',
          'offset' => '86',
          'type' => '8124'
        }
      },
      'Name' => 'struct pldm_platform_file_descriptor_pdr',
      'Size' => '72',
      'Type' => 'Struct'
    },
    '279433' => {
      'Header' => 'platform.h',
      'Line' => '1006',
      'Memb' => {
        '0' => {
          'name' => 'set_request',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'effecter_state',
          'offset' => '1',
          'type' => '150'
        }
      },
      'Name' => 'struct state_field_for_state_effecter_set',
      'Size' => '2',
      'Type' => 'Struct'
    },
    '279476' => {
      'BaseType' => '279433',
      'Header' => 'platform.h',
      'Line' => '1009',
      'Name' => 'set_effecter_state_field',
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '279489' => {
      'Header' => 'platform.h',
      'Line' => '1015',
      'Memb' => {
        '0' => {
          'name' => 'sensor_op_state',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'present_state',
          'offset' => '1',
          'type' => '150'
        },
        '2' => {
          'name' => 'previous_state',
          'offset' => '2',
          'type' => '150'
        },
        '3' => {
          'name' => 'event_state',
          'offset' => '3',
          'type' => '150'
        }
      },
      'Name' => 'struct state_field_for_get_state_sensor_readings',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '279560' => {
      'BaseType' => '279489',
      'Header' => 'platform.h',
      'Line' => '1023',
      'Name' => 'get_sensor_state_field',
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '279573' => {
      'Header' => 'platform.h',
      'Line' => '1029',
      'Memb' => {
        '0' => {
          'name' => 'effecter_op_state',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'pending_state',
          'offset' => '1',
          'type' => '150'
        },
        '2' => {
          'name' => 'present_state',
          'offset' => '2',
          'type' => '150'
        }
      },
      'Name' => 'struct state_field_for_get_state_effecter_states',
      'Size' => '3',
      'Type' => 'Struct'
    },
    '279630' => {
      'BaseType' => '279573',
      'Header' => 'platform.h',
      'Line' => '1033',
      'Name' => 'get_effecter_state_field',
      'Size' => '3',
      'Type' => 'Typedef'
    },
    '280114' => {
      'Header' => 'platform.h',
      'Line' => '1106',
      'Memb' => {
        '0' => {
          'name' => 'mctp_eid',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'vendor_specific',
          'offset' => '0',
          'type' => '8124'
        }
      },
      'Name' => 'anon-union-platform.h-1106',
      'Size' => '16',
      'Type' => 'Union'
    },
    '280148' => {
      'Header' => 'platform.h',
      'Line' => '1103',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'transport_protocol_type',
          'offset' => '1',
          'type' => '150'
        },
        '2' => {
          'name' => 'event_receiver_address',
          'offset' => '8',
          'type' => '280114'
        }
      },
      'Name' => 'struct pldm_get_event_receiver_resp',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '280450' => {
      'Header' => 'platform.h',
      'Line' => '1191',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'comp_effecter_count',
          'offset' => '1',
          'type' => '150'
        },
        '2' => {
          'name' => 'field',
          'offset' => '2',
          'type' => '280507'
        }
      },
      'Name' => 'struct pldm_get_state_effecter_states_resp',
      'Size' => '26',
      'Type' => 'Struct'
    },
    '280507' => {
      'BaseType' => '279630',
      'Name' => 'get_effecter_state_field[8]',
      'Size' => '24',
      'Type' => 'Array'
    },
    '280523' => {
      'Header' => 'platform.h',
      'Line' => '1201',
      'Memb' => {
        '0' => {
          'name' => 'sensor_id',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'sensor_event_class_type',
          'offset' => '2',
          'type' => '150'
        },
        '2' => {
          'name' => 'event_class',
          'offset' => '3',
          'type' => '1781'
        }
      },
      'Name' => 'struct pldm_sensor_event_data',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '280637' => {
      'Header' => 'platform.h',
      'Line' => '1241',
      'Memb' => {
        '0' => {
          'name' => 'format_version',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'event_id',
          'offset' => '2',
          'type' => '162'
        },
        '2' => {
          'name' => 'data_transfer_handle',
          'offset' => '4',
          'type' => '174'
        }
      },
      'Name' => 'struct pldm_message_poll_event',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '280699' => {
      'Header' => 'platform.h',
      'Line' => '1251',
      'Memb' => {
        '0' => {
          'name' => 'format_version',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'format_type',
          'offset' => '1',
          'type' => '150'
        },
        '2' => {
          'name' => 'event_data_length',
          'offset' => '2',
          'type' => '162'
        },
        '3' => {
          'name' => 'event_data',
          'offset' => '4',
          'type' => '280770'
        }
      },
      'Name' => 'struct pldm_platform_cper_event',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '280770' => {
      'BaseType' => '150',
      'Name' => 'uint8_t[]',
      'Size' => '8',
      'Type' => 'Array'
    },
    '280926' => {
      'Header' => 'platform.h',
      'Line' => '1311',
      'Memb' => {
        '0' => {
          'name' => 'event_data_format',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'number_of_change_records',
          'offset' => '1',
          'type' => '150'
        },
        '2' => {
          'name' => 'change_records',
          'offset' => '2',
          'type' => '1781'
        }
      },
      'Name' => 'struct pldm_pdr_repository_chg_event_data',
      'Size' => '3',
      'Type' => 'Struct'
    },
    '289324' => {
      'BaseType' => '3484',
      'Name' => 'size_t*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '298328' => {
      'BaseType' => '279232',
      'Name' => 'struct pldm_platform_file_descriptor_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '298387' => {
      'BaseType' => '280699',
      'Name' => 'struct pldm_platform_cper_event*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '302807' => {
      'BaseType' => '279036',
      'Name' => 'struct pldm_entity_auxiliary_names_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '314713' => {
      'BaseType' => '280450',
      'Name' => 'struct pldm_get_state_effecter_states_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '361425' => {
      'BaseType' => '280148',
      'Name' => 'struct pldm_get_event_receiver_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '380786' => {
      'BaseType' => '280637',
      'Name' => 'struct pldm_message_poll_event*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '382471' => {
      'BaseType' => '382481',
      'Name' => 'uint32_t const*const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '382476' => {
      'BaseType' => '878',
      'Name' => 'uint32_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '382481' => {
      'BaseType' => '382476',
      'Name' => 'uint32_t const*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '382486' => {
      'BaseType' => '280926',
      'Name' => 'struct pldm_pdr_repository_chg_event_data*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '432902' => {
      'BaseType' => '278383',
      'Name' => 'struct pldm_numeric_sensor_value_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '460641' => {
      'BaseType' => '280523',
      'Name' => 'struct pldm_sensor_event_data*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '460646' => {
      'BaseType' => '460641',
      'Name' => 'struct pldm_sensor_event_data*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '465674' => {
      'BaseType' => '279560',
      'Name' => 'get_sensor_state_field*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '493658' => {
      'BaseType' => '279476',
      'Name' => 'set_effecter_state_field*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '494639' => {
      'BaseType' => '268938',
      'Name' => 'struct pldm_state_sensor_pdr*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '494644' => {
      'BaseType' => '277273',
      'Name' => 'struct state_sensor_possible_states const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '494649' => {
      'BaseType' => '494644',
      'Name' => 'struct state_sensor_possible_states const*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '495049' => {
      'BaseType' => '263247',
      'Name' => 'struct pldm_state_effecter_pdr*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '495054' => {
      'BaseType' => '279227',
      'Name' => 'struct state_effecter_possible_states const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '495059' => {
      'BaseType' => '495054',
      'Name' => 'struct state_effecter_possible_states const*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '499448' => {
      'Line' => '19',
      'Memb' => {
        '0' => {
          'name' => 'prev',
          'offset' => '0',
          'type' => '6378'
        },
        '1' => {
          'name' => 'allocations',
          'offset' => '4',
          'type' => '174'
        }
      },
      'Name' => 'struct pldm_tid_state',
      'PrivateABI' => 1,
      'Size' => '8',
      'Source' => 'instance-id.c',
      'Type' => 'Struct'
    },
    '499487' => {
      'Line' => '24',
      'Memb' => {
        '0' => {
          'name' => 'state',
          'offset' => '0',
          'type' => '499529'
        },
        '1' => {
          'name' => 'lock_db_fd',
          'offset' => '8264',
          'type' => '117'
        }
      },
      'Name' => 'struct pldm_instance_db',
      'PrivateABI' => 1,
      'Size' => '2052',
      'Source' => 'instance-id.c',
      'Type' => 'Struct'
    },
    '499529' => {
      'BaseType' => '499448',
      'Name' => 'struct pldm_tid_state[256]',
      'Size' => '2048',
      'Type' => 'Array'
    },
    '500085' => {
      'BaseType' => '499487',
      'Name' => 'struct pldm_instance_db*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '500472' => {
      'BaseType' => '6378',
      'Name' => 'pldm_instance_id_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '500648' => {
      'BaseType' => '500085',
      'Name' => 'struct pldm_instance_db**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '501366' => {
      'BaseType' => '51',
      'Header' => 'int-ll64.h',
      'Line' => '21',
      'Name' => '__u8',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '501378' => {
      'BaseType' => '58',
      'Header' => 'int-ll64.h',
      'Line' => '24',
      'Name' => '__u16',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '501635' => {
      'Header' => 'socket.h',
      'Line' => '5',
      'Memb' => {
        '0' => {
          'name' => 'size',
          'offset' => '0',
          'type' => '117'
        },
        '1' => {
          'name' => 'socket',
          'offset' => '4',
          'type' => '117'
        },
        '2' => {
          'name' => 'max_size',
          'offset' => '8',
          'type' => '117'
        }
      },
      'Name' => 'struct pldm_socket_sndbuf',
      'PrivateABI' => 1,
      'Size' => '12',
      'Type' => 'Struct'
    },
    '501688' => {
      'BaseType' => '150',
      'Header' => 'pldm.h',
      'Line' => '13',
      'Name' => 'mctp_eid_t',
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '501802' => {
      'BaseType' => '6475',
      'Header' => 'pldm.h',
      'Line' => '30',
      'Name' => 'pldm_requester_rc_t',
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '501814' => {
      'Header' => 'transport.h',
      'Line' => '18',
      'Memb' => {
        '0' => {
          'name' => 'name',
          'offset' => '0',
          'type' => '9520'
        },
        '1' => {
          'name' => 'version',
          'offset' => '8',
          'type' => '150'
        },
        '2' => {
          'name' => 'recv',
          'offset' => '22',
          'type' => '501948'
        },
        '3' => {
          'name' => 'send',
          'offset' => '36',
          'type' => '501989'
        },
        '4' => {
          'name' => 'init_pollfd',
          'offset' => '50',
          'type' => '502071'
        }
      },
      'Name' => 'struct pldm_transport',
      'PrivateABI' => 1,
      'Size' => '40',
      'Type' => 'Struct'
    },
    '501928' => {
      'BaseType' => '501814',
      'Name' => 'struct pldm_transport*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '501933' => {
      'BaseType' => '6366',
      'Name' => 'pldm_tid_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '501948' => {
      'Name' => 'pldm_requester_rc_t(*)(struct pldm_transport*, pldm_tid_t*, void**, size_t*)',
      'Param' => {
        '0' => {
          'type' => '501928'
        },
        '1' => {
          'type' => '501933'
        },
        '2' => {
          'type' => '198055'
        },
        '3' => {
          'type' => '3484'
        }
      },
      'Return' => '501802',
      'Size' => '8',
      'Type' => 'FuncPtr'
    },
    '501989' => {
      'Name' => 'pldm_requester_rc_t(*)(struct pldm_transport*, pldm_tid_t, void const*, size_t)',
      'Param' => {
        '0' => {
          'type' => '501928'
        },
        '1' => {
          'type' => '6366'
        },
        '2' => {
          'type' => '2044'
        },
        '3' => {
          'type' => '883'
        }
      },
      'Return' => '501802',
      'Size' => '8',
      'Type' => 'FuncPtr'
    },
    '502014' => {
      'BaseType' => '502019',
      'Name' => 'struct pollfd*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '502019' => {
      'Header' => 'poll.h',
      'Line' => '36',
      'Memb' => {
        '0' => {
          'name' => 'fd',
          'offset' => '0',
          'type' => '117'
        },
        '1' => {
          'name' => 'events',
          'offset' => '4',
          'type' => '98'
        },
        '2' => {
          'name' => 'revents',
          'offset' => '6',
          'type' => '98'
        }
      },
      'Name' => 'struct pollfd',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Struct'
    },
    '502071' => {
      'Name' => 'int(*)(struct pldm_transport*, struct pollfd*)',
      'Param' => {
        '0' => {
          'type' => '501928'
        },
        '1' => {
          'type' => '502014'
        }
      },
      'Return' => '117',
      'Size' => '8',
      'Type' => 'FuncPtr'
    },
    '502076' => {
      'BaseType' => '58',
      'Header' => 'socket.h',
      'Line' => '10',
      'Name' => '__kernel_sa_family_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '502451' => {
      'Header' => 'mctp.h',
      'Line' => '18',
      'Memb' => {
        '0' => {
          'name' => 's_addr',
          'offset' => '0',
          'type' => '501688'
        }
      },
      'Name' => 'struct mctp_addr',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Struct'
    },
    '502478' => {
      'Header' => 'mctp.h',
      'Line' => '22',
      'Memb' => {
        '0' => {
          'name' => 'smctp_family',
          'offset' => '0',
          'type' => '502076'
        },
        '1' => {
          'name' => '__smctp_pad0',
          'offset' => '2',
          'type' => '501378'
        },
        '2' => {
          'name' => 'smctp_network',
          'offset' => '4',
          'type' => '65'
        },
        '3' => {
          'name' => 'smctp_addr',
          'offset' => '8',
          'type' => '502451'
        },
        '4' => {
          'name' => 'smctp_type',
          'offset' => '9',
          'type' => '501366'
        },
        '5' => {
          'name' => 'smctp_tag',
          'offset' => '16',
          'type' => '501366'
        },
        '6' => {
          'name' => '__smctp_pad1',
          'offset' => '17',
          'type' => '501366'
        }
      },
      'Name' => 'struct sockaddr_mctp',
      'PrivateABI' => 1,
      'Size' => '12',
      'Type' => 'Struct'
    },
    '502583' => {
      'BaseType' => '502478',
      'Name' => 'struct sockaddr_mctp const',
      'Size' => '12',
      'Type' => 'Const'
    },
    '502628' => {
      'Line' => '37',
      'Memb' => {
        '0' => {
          'name' => 'net',
          'offset' => '0',
          'type' => '65'
        },
        '1' => {
          'name' => 'eid',
          'offset' => '4',
          'type' => '501688'
        }
      },
      'Name' => 'struct mctp_fq_addr',
      'PrivateABI' => 1,
      'Size' => '8',
      'Source' => 'af-mctp.c',
      'Type' => 'Struct'
    },
    '502668' => {
      'Line' => '43',
      'Memb' => {
        '0' => {
          'name' => 'transport',
          'offset' => '0',
          'type' => '501814'
        },
        '1' => {
          'name' => 'socket',
          'offset' => '64',
          'type' => '117'
        },
        '2' => {
          'name' => 'tid_map',
          'offset' => '68',
          'type' => '502761'
        },
        '3' => {
          'name' => 'socket_send_buf',
          'offset' => '8338',
          'type' => '501635'
        },
        '4' => {
          'name' => 'bound',
          'offset' => '8452',
          'type' => '6996'
        },
        '5' => {
          'name' => 'cookie_jar',
          'offset' => '8466',
          'type' => '6390'
        }
      },
      'Name' => 'struct pldm_transport_af_mctp',
      'PrivateABI' => 1,
      'Size' => '2128',
      'Source' => 'af-mctp.c',
      'Type' => 'Struct'
    },
    '502761' => {
      'BaseType' => '502628',
      'Name' => 'struct mctp_fq_addr[256]',
      'Size' => '2048',
      'Type' => 'Array'
    },
    '503561' => {
      'BaseType' => '502668',
      'Name' => 'struct pldm_transport_af_mctp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '503566' => {
      'BaseType' => '502583',
      'Name' => 'struct sockaddr_mctp const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '503882' => {
      'BaseType' => '503561',
      'Name' => 'struct pldm_transport_af_mctp**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '507228' => {
      'Line' => '26',
      'Memb' => {
        '0' => {
          'name' => 'transport',
          'offset' => '0',
          'type' => '501814'
        },
        '1' => {
          'name' => 'socket',
          'offset' => '64',
          'type' => '117'
        },
        '2' => {
          'name' => 'tid_eid_map',
          'offset' => '68',
          'type' => '507296'
        },
        '3' => {
          'name' => 'socket_send_buf',
          'offset' => '768',
          'type' => '501635'
        }
      },
      'Name' => 'struct pldm_transport_mctp_demux',
      'PrivateABI' => 1,
      'Size' => '312',
      'Source' => 'mctp-demux.c',
      'Type' => 'Struct'
    },
    '507296' => {
      'BaseType' => '6366',
      'Name' => 'pldm_tid_t[256]',
      'Size' => '256',
      'Type' => 'Array'
    },
    '507833' => {
      'BaseType' => '507228',
      'Name' => 'struct pldm_transport_mctp_demux*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '508339' => {
      'BaseType' => '507833',
      'Name' => 'struct pldm_transport_mctp_demux**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '531180' => {
      'Header' => 'file_io.h',
      'Line' => '32',
      'Memb' => {
        '0' => {
          'name' => 'handle',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'length',
          'offset' => '4',
          'type' => '174'
        },
        '2' => {
          'name' => 'data',
          'offset' => '8',
          'type' => '280770'
        }
      },
      'Name' => 'struct pldm_oem_meta_file_io_write_req',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '531247' => {
      'Header' => 'file_io.h',
      'Line' => '45',
      'Memb' => {
        '0' => {
          'name' => 'transferFlag',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'offset',
          'offset' => '2',
          'type' => '162'
        }
      },
      'Name' => 'struct pldm_oem_meta_file_io_read_data_info',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '531286' => {
      'Header' => 'file_io.h',
      'Line' => '55',
      'Memb' => {
        '0' => {
          'name' => 'size',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'crc32',
          'offset' => '4',
          'type' => '174'
        }
      },
      'Name' => 'struct pldm_oem_meta_file_io_read_attr_info',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '531325' => {
      'Header' => 'file_io.h',
      'Line' => '70',
      'Memb' => {
        '0' => {
          'name' => 'data',
          'offset' => '0',
          'type' => '531247'
        }
      },
      'Name' => 'anon-union-file_io.h-70',
      'Size' => '4',
      'Type' => 'Union'
    },
    '531343' => {
      'Header' => 'file_io.h',
      'Line' => '65',
      'Memb' => {
        '0' => {
          'name' => 'version',
          'offset' => '0',
          'type' => '883'
        },
        '1' => {
          'name' => 'handle',
          'offset' => '8',
          'type' => '150'
        },
        '2' => {
          'name' => 'option',
          'offset' => '9',
          'type' => '150'
        },
        '3' => {
          'name' => 'length',
          'offset' => '16',
          'type' => '150'
        },
        '4' => {
          'name' => 'info',
          'offset' => '18',
          'type' => '531325'
        }
      },
      'Name' => 'struct pldm_oem_meta_file_io_read_req',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '531421' => {
      'Header' => 'file_io.h',
      'Line' => '86',
      'Memb' => {
        '0' => {
          'name' => 'attr',
          'offset' => '0',
          'type' => '531286'
        },
        '1' => {
          'name' => 'data',
          'offset' => '0',
          'type' => '531247'
        }
      },
      'Name' => 'anon-union-file_io.h-86',
      'Size' => '8',
      'Type' => 'Union'
    },
    '531449' => {
      'Header' => 'file_io.h',
      'Line' => '80',
      'Memb' => {
        '0' => {
          'name' => 'version',
          'offset' => '0',
          'type' => '883'
        },
        '1' => {
          'name' => 'completion_code',
          'offset' => '8',
          'type' => '150'
        },
        '2' => {
          'name' => 'handle',
          'offset' => '9',
          'type' => '150'
        },
        '3' => {
          'name' => 'option',
          'offset' => '16',
          'type' => '150'
        },
        '4' => {
          'name' => 'length',
          'offset' => '17',
          'type' => '150'
        },
        '5' => {
          'name' => 'info',
          'offset' => '18',
          'type' => '531421'
        },
        '6' => {
          'name' => 'data',
          'offset' => '32',
          'type' => '280770'
        }
      },
      'Name' => 'struct pldm_oem_meta_file_io_read_resp',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '536281' => {
      'BaseType' => '531449',
      'Name' => 'struct pldm_oem_meta_file_io_read_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '539166' => {
      'BaseType' => '531343',
      'Name' => 'struct pldm_oem_meta_file_io_read_req*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '539605' => {
      'BaseType' => '531180',
      'Name' => 'struct pldm_oem_meta_file_io_write_req*',
      'Size' => '8',
      'Type' => 'Pointer'
    }
  },
  'UndefinedSymbols' => {
    'libpldm.so.0.15.0' => {
      '_ITM_deregisterTMCloneTable' => 0,
      '_ITM_registerTMCloneTable' => 0,
      '__assert_fail@GLIBC_2.2.5' => 0,
      '__cxa_finalize@GLIBC_2.2.5' => 0,
      '__errno_location@GLIBC_2.2.5' => 0,
      '__gmon_start__' => 0,
      '__isoc23_strtol@GLIBC_2.38' => 0,
      '__memcpy_chk@GLIBC_2.3.4' => 0,
      '__recv_chk@GLIBC_2.4' => 0,
      '__recvfrom_chk@GLIBC_2.4' => 0,
      '__stack_chk_fail@GLIBC_2.4' => 0,
      'bind@GLIBC_2.2.5' => 0,
      'calloc@GLIBC_2.2.5' => 0,
      'clock_gettime@GLIBC_2.17' => 0,
      'close@GLIBC_2.2.5' => 0,
      'connect@GLIBC_2.2.5' => 0,
      'dup@GLIBC_2.2.5' => 0,
      'fclose@GLIBC_2.2.5' => 0,
      'fcntl64@GLIBC_2.28' => 0,
      'fgets@GLIBC_2.2.5' => 0,
      'fopen64@GLIBC_2.2.5' => 0,
      'free@GLIBC_2.2.5' => 0,
      'getsockopt@GLIBC_2.2.5' => 0,
      'malloc@GLIBC_2.2.5' => 0,
      'memcmp@GLIBC_2.2.5' => 0,
      'memcpy@GLIBC_2.14' => 0,
      'memmem@GLIBC_2.2.5' => 0,
      'open64@GLIBC_2.2.5' => 0,
      'poll@GLIBC_2.2.5' => 0,
      'ppoll@GLIBC_2.4' => 0,
      'recv@GLIBC_2.2.5' => 0,
      'recvmsg@GLIBC_2.2.5' => 0,
      'sendmsg@GLIBC_2.2.5' => 0,
      'sendto@GLIBC_2.2.5' => 0,
      'setsockopt@GLIBC_2.2.5' => 0,
      'socket@GLIBC_2.2.5' => 0,
      'stat64@GLIBC_2.33' => 0,
      'strlen@GLIBC_2.2.5' => 0,
      'strnlen@GLIBC_2.2.5' => 0,
      'timerfd_create@GLIBC_2.8' => 0,
      'timerfd_settime@GLIBC_2.8' => 0,
      'write@GLIBC_2.2.5' => 0
    }
  },
  'WordSize' => '8'
};
