$VAR1 = {
  'ABI_DUMPER_VERSION' => '1.4',
  'ABI_DUMP_VERSION' => '3.5',
  'Arch' => 'x86_64',
  'GccVersion' => '15.2.0',
  'Headers' => {
    'af-mctp.h' => 1,
    'base.h' => 1,
    'bcd.h' => 1,
    'bios.h' => 1,
    'bios_table.h' => 1,
    'edac.h' => 1,
    'file.h' => 1,
    'file_io.h' => 1,
    'firmware_update.h' => 1,
    'fru.h' => 1,
    'host.h' => 1,
    'instance-id.h' => 1,
    'mctp-demux.h' => 1,
    'pdr.h' => 1,
    'platform.h' => 1,
    'pldm.h' => 1,
    'pldm_types.h' => 1,
    'transport.h' => 1
  },
  'Language' => 'C',
  'LibraryName' => 'libpldm.so.0.17.0',
  'LibraryVersion' => '0.17.0',
  'NameSpaces' => {},
  'Needed' => {
    'libc.so.6' => 1
  },
  'PublicABI' => '1',
  'Sources' => {
    'bios_table.c' => 1,
    'instance-id.c' => 1,
    'mctp-demux.c' => 1,
    'pdr.c' => 1
  },
  'SymbolInfo' => {
    '186' => {
      'Header' => 'bcd.h',
      'Line' => '44',
      'Param' => {
        '0' => {
          'name' => 'dec',
          'type' => '174'
        }
      },
      'Return' => '174',
      'ShortName' => 'pldm_bcd_dec2bcd32'
    },
    '315' => {
      'Header' => 'bcd.h',
      'Line' => '38',
      'Param' => {
        '0' => {
          'name' => 'bcd',
          'type' => '174'
        }
      },
      'Return' => '174',
      'ShortName' => 'pldm_bcd_bcd2dec32'
    },
    '418' => {
      'Header' => 'bcd.h',
      'Line' => '32',
      'Param' => {
        '0' => {
          'name' => 'dec',
          'type' => '162'

      'pldm_entity_association_tree_destroy' => 1,
      'pldm_entity_association_tree_destroy_root' => 1,
      'pldm_entity_association_tree_find' => 1,
      'pldm_entity_association_tree_find_with_locality' => 1,
      'pldm_entity_association_tree_init' => 1,
      'pldm_entity_association_tree_visit' => 1,
      'pldm_entity_extract' => 1,
      'pldm_entity_get_num_children' => 1,
      'pldm_entity_get_parent' => 1,
      'pldm_entity_is_exist_parent' => 1,
      'pldm_entity_is_node_parent' => 1,
      'pldm_entity_node_get_remote_container_id' => 1,
      'pldm_find_entity_ref_in_tree' => 1,
      'pldm_instance_db_destroy' => 1,
      'pldm_instance_db_init' => 1,
      'pldm_instance_db_init_default' => 1,
      'pldm_instance_id_alloc' => 1,
      'pldm_instance_id_free' => 1,
      'pldm_is_current_parent_child' => 1,
      'pldm_is_empty_entity_assoc_tree' => 1,
      'pldm_msg_hdr_correlate_response' => 1,
      'pldm_oem_meta_file_io_read_resp_data' => 1,
      'pldm_oem_meta_file_io_write_req_data' => 1,
      'pldm_package_component_image_information_iter_init' => 1,
      'pldm_package_downstream_device_id_record_iter_init' => 1,
      'pldm_package_firmware_device_id_record_iter_init' => 1,
      'pldm_pdr_add' => 1,
      'pldm_pdr_add_fru_record_set' => 1,
      'pldm_pdr_delete_by_effecter_id' => 1,
      'pldm_pdr_delete_by_record_handle' => 1,
      'pldm_pdr_delete_by_sensor_id' => 1,
      'pldm_pdr_destroy' => 1,
      'pldm_pdr_find_last_in_range' => 1,
      'pldm_pdr_find_record' => 1,
      'pldm_pdr_find_record_by_type' => 1,
      'pldm_pdr_fru_record_set_find_by_rsi' => 1,
      'pldm_pdr_get_next_record' => 1,
      'pldm_pdr_get_record_count' => 1,
      'pldm_pdr_get_record_handle' => 1,
      'pldm_pdr_get_repo_size' => 1,
      'pldm_pdr_init' => 1,
      'pldm_pdr_record_is_remote' => 1,
      'pldm_pdr_remove_fru_record_set_by_rsi' => 1,
      'pldm_pdr_remove_pdrs_by_terminus_handle' => 1,
      'pldm_pdr_remove_remote_pdrs' => 1,
      'pldm_pdr_update_TL_pdr' => 1,
      'pldm_platform_cper_event_event_data' => 1,
      'pldm_transport_af_mctp_bind' => 1,
      'pldm_transport_af_mctp_core' => 1,
      'pldm_transport_af_mctp_destroy' => 1,
      'pldm_transport_af_mctp_init' => 1,
      'pldm_transport_af_mctp_init_pollfd' => 1,
      'pldm_transport_af_mctp_map_tid' => 1,
      'pldm_transport_af_mctp_map_tid_fqe' => 1,
      'pldm_transport_af_mctp_unmap_tid' => 1,
      'pldm_transport_af_mctp_unmap_tid_fqe' => 1,
      'pldm_transport_mctp_demux_core' => 1,
      'pldm_transport_mctp_demux_destroy' => 1,
      'pldm_transport_mctp_demux_init' => 1,
      'pldm_transport_mctp_demux_init_pollfd' => 1,
      'pldm_transport_mctp_demux_map_tid' => 1,
      'pldm_transport_mctp_demux_unmap_tid' => 1,
      'pldm_transport_poll' => 1,
      'pldm_transport_recv_msg' => 1,
      'pldm_transport_send_msg' => 1,
      'pldm_transport_send_recv_msg' => 1,
      'unpack_pldm_header' => 1
    }
  },
  'Target' => 'unix',
  'TypeInfo' => {
    '1' => {
      'Name' => 'void',
      'Type' => 'Intrinsic'
    },
    '51' => {
      'Name' => 'unsigned char',
      'Size' => '1',
      'Type' => 'Intrinsic'
    },
    '58' => {
      'Name' => 'unsigned short',
      'Size' => '2',
      'Type' => 'Intrinsic'
    },
    '65' => {
      'Name' => 'unsigned int',
      'Size' => '4',
      'Type' => 'Intrinsic'
    },
    '72' => {
      'Name' => 'unsigned long',
      'Size' => '8',
      'Type' => 'Intrinsic'
    },
    '79' => {
      'Name' => 'signed char',
      'Size' => '1',
      'Type' => 'Intrinsic'
    },
    '86' => {
      'BaseType' => '51',
      'Header' => 'types.h',
      'Line' => '38',
      'Name' => '__uint8_t',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '98' => {
      'Name' => 'short',
      'Size' => '2',
      'Type' => 'Intrinsic'
    },
    '105' => {
      'BaseType' => '58',
      'Header' => 'types.h',
      'Line' => '40',
      'Name' => '__uint16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '117' => {
      'Name' => 'int',
      'Size' => '4',
      'Type' => 'Intrinsic'
    },
    '124' => {
      'BaseType' => '65',
      'Header' => 'types.h',
      'Line' => '42',
      'Name' => '__uint32_t',
      'PrivateABI' => 1,
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '136' => {
      'Name' => 'long',
      'Size' => '8',
      'Type' => 'Intrinsic'
    },
    '143' => {
      'Name' => 'char',
      'Size' => '1',
      'Type' => 'Intrinsic'
    },
    '150' => {
      'BaseType' => '86',
      'Header' => 'stdint-uintn.h',
      'Line' => '24',
      'Name' => 'uint8_t',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '162' => {
      'BaseType' => '105',
      'Header' => 'stdint-uintn.h',
      'Line' => '25',
      'Name' => 'uint16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '174' => {
      'BaseType' => '124',
      'Header' => 'stdint-uintn.h',
      'Line' => '26',
      'Name' => 'uint32_t',
      'PrivateABI' => 1,
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '845' => {
      'BaseType' => '1',
      'Name' => 'void*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '878' => {
      'BaseType' => '174',
      'Name' => 'uint32_t const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '883' => {
      'BaseType' => '72',
      'Header' => 'stddef.h',
      'Line' => '229',
      'Name' => 'size_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '930' => {
      'Header' => 'pldm_types.h',
      'Line' => '14',
      'Name' => 'struct bits8',
      'Size' => '1',
      'Type' => 'Struct'
    },
    '1088' => {
      'Header' => 'pldm_types.h',
      'Line' => '24',
      'Memb' => {
        '0' => {
          'name' => 'byte',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'bits',
          'offset' => '0',
          'type' => '930'
        }
      },
      'Name' => 'union bitfield8_t',
      'Size' => '1',
      'Type' => 'Union'
    },
    '1100' => {
      'BaseType' => '1088',
      'Name' => 'bitfield8_t const',
      'Size' => '1',
      'Type' => 'Const'
    },
    '1105' => {
      'Header' => 'pldm_types.h',
      'Line' => '30',
      'Memb' => {
        '0' => {
          'name' => 'alpha',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'update',
          'offset' => '1',
          'type' => '150'
        },
        '2' => {
          'name' => 'minor',
          'offset' => '2',
          'type' => '150'
        },
        '3' => {
          'name' => 'major',
          'offset' => '3',
          'type' => '150'
        }
      },
      'Name' => 'struct pldm_version',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '1171' => {
      'BaseType' => '1105',
      'Header' => 'pldm_types.h',
      'Line' => '35',
      'Name' => 'ver32_t',
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '1183' => {
      'BaseType' => '1171',
      'Name' => 'ver32_t const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '1188' => {
      'Name' => 'float',
      'Size' => '4',
      'Type' => 'Intrinsic'
    },
    '1608' => {
      'Header' => 'base.h',
      'Line' => '137',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_RESPONSE',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_REQUEST',
          'value' => '1'
        },
        '2' => {
          'name' => 'PLDM_RESERVED',
          'value' => '2'
        },
        '3' => {
          'name' => 'PLDM_ASYNC_REQUEST_NOTIFY',
          'value' => '3'
        }
      },
      'Name' => 'enum MessageType',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '1620' => {
      'Header' => 'base.h',
      'Line' => '190',
      'Memb' => {
        '0' => {
          'name' => 'command',
          'offset' => '2',
          'type' => '150'
        }
      },
      'Name' => 'struct pldm_msg_hdr',
      'Size' => '3',
      'Type' => 'Struct'
    },
    '1731' => {
      'BaseType' => '1620',
      'Name' => 'struct pldm_msg_hdr const',
      'Size' => '3',
      'Type' => 'Const'
    },
    '1736' => {
      'Header' => 'base.h',
      'Line' => '217',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '1620'
        },
        '1' => {
          'name' => 'payload',
          'offset' => '3',
          'type' => '1781'
        }
      },
      'Name' => 'struct pldm_msg',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '1776' => {
      'BaseType' => '1736',
      'Name' => 'struct pldm_msg const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '1781' => {
      'BaseType' => '150',
      'Name' => 'uint8_t[1]',
      'Size' => '1',
      'Type' => 'Array'
    },
    '1797' => {
      'Header' => 'base.h',
      'Line' => '297',
      'Memb' => {
        '0' => {
          'name' => 'msg_type',
          'offset' => '0',
          'type' => '1608'
        },
        '1' => {
          'name' => 'instance',
          'offset' => '4',
          'type' => '150'
        },
        '2' => {
          'name' => 'pldm_type',
          'offset' => '5',
          'type' => '150'
        },
        '3' => {
          'name' => 'command',
          'offset' => '6',
          'type' => '150'
        },
        '4' => {
          'name' => 'completion_code',
          'offset' => '7',
          'type' => '150'
        }
      },
      'Name' => 'struct pldm_header_info',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '1875' => {
      'BaseType' => '1797',
      'Name' => 'struct pldm_header_info const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '1880' => {
      'BaseType' => '1088',
      'Name' => 'bitfield8_t[8]',
      'Size' => '8',
      'Type' => 'Array'
    },
    '1896' => {
      'Header' => 'base.h',
      'Line' => '919',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'tid',
          'offset' => '1',
          'type' => '150'
        }
      },
      'Name' => 'struct pldm_base_get_tid_resp',
      'Size' => '2',
      'Type' => 'Struct'
    },
    '1936' => {
      'BaseType' => '1896',
      'Name' => 'struct pldm_base_get_tid_resp const',
      'Size' => '2',
      'Type' => 'Const'
    },
    '1941' => {
      'Header' => 'base.h',
      'Line' => '962',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'pldm_types',
          'offset' => '1',
          'type' => '1880'
        }
      },
      'Name' => 'struct pldm_base_get_pldm_types_resp',
      'Size' => '9',
      'Type' => 'Struct'
    },
    '1980' => {
      'BaseType' => '1941',
      'Name' => 'struct pldm_base_get_pldm_types_resp const',
      'Size' => '9',
      'Type' => 'Const'
    },
    '2131' => {
      'BaseType' => '2136',
      'Name' => 'void const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2136' => {
      'BaseType' => '1',
      'Name' => 'void const',
      'Type' => 'Const'
    },
    '2137' => {
      'BaseType' => '1100',
      'Name' => 'bitfield8_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2312' => {
      'BaseType' => '1736',
      'Name' => 'struct pldm_msg*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2391' => {
      'BaseType' => '1776',
      'Name' => 'struct pldm_msg const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2396' => {
      'BaseType' => '150',
      'Name' => 'uint8_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2401' => {
      'BaseType' => '1171',
      'Name' => 'ver32_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2443' => {
      'BaseType' => '1980',
      'Name' => 'struct pldm_base_get_pldm_types_resp const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2448' => {
      'BaseType' => '883',
      'Name' => 'size_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2505' => {
      'BaseType' => '1183',
      'Name' => 'ver32_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2552' => {
      'BaseType' => '174',
      'Name' => 'uint32_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2594' => {
      'BaseType' => '1936',
      'Name' => 'struct pldm_base_get_tid_resp const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2626' => {
      'BaseType' => '1731',
      'Name' => 'struct pldm_msg_hdr const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2631' => {
      'BaseType' => '1797',
      'Name' => 'struct pldm_header_info*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '4041' => {
      'BaseType' => '1875',
      'Name' => 'struct pldm_header_info const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '5532' => {
      'BaseType' => '150',
      'Name' => 'uint8_t const',
      'Size' => '1',
      'Type' => 'Const'
    },
    '5778' => {
      'BaseType' => '5532',
      'Name' => 'uint8_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '6316' => {
      'BaseType' => '150',
      'Header' => 'base.h',
      'Line' => '19',
      'Name' => 'pldm_tid_t',
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '6328' => {
      'BaseType' => '150',
      'Header' => 'instance-id.h',
      'Line' => '12',
      'Name' => 'pldm_instance_id_t',
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '6340' => {
      'Header' => 'responder.h',
      'Line' => '9',
      'Memb' => {
        '0' => {
          'name' => 'tid',
          'offset' => '0',
          'type' => '6316'
        },
        '1' => {
          'name' => 'instance_id',
          'offset' => '1',
          'type' => '6328'
        },
        '2' => {
          'name' => 'type',
          'offset' => '2',
          'type' => '150'
        },
        '3' => {
          'name' => 'command',
          'offset' => '3',
          'type' => '150'
        },
        '4' => {
          'name' => 'next',
          'offset' => '8',
          'type' => '6420'
        }
      },
      'Name' => 'struct pldm_responder_cookie',
      'PrivateABI' => 1,
      'Size' => '16',
      'Type' => 'Struct'
    },
    '6420' => {
      'BaseType' => '6340',
      'Name' => 'struct pldm_responder_cookie*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '6425' => {
      'Header' => 'pldm.h',
      'Line' => '14',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_REQUESTER_SUCCESS',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_REQUESTER_OPEN_FAIL',
          'value' => '18446744073709551615 (-1)'
        },
        '2' => {
          'name' => 'PLDM_REQUESTER_NOT_PLDM_MSG',
          'value' => '18446744073709551614 (-2)'
        },
        '3' => {
          'name' => 'PLDM_REQUESTER_NOT_RESP_MSG',
          'value' => '18446744073709551613 (-3)'
        },
        '4' => {
          'name' => 'PLDM_REQUESTER_NOT_REQ_MSG',
          'value' => '18446744073709551612 (-4)'
        },
        '5' => {
          'name' => 'PLDM_REQUESTER_RESP_MSG_TOO_SMALL',
          'value' => '18446744073709551611 (-5)'
        },
        '6' => {
          'name' => 'PLDM_REQUESTER_INSTANCE_ID_MISMATCH',
          'value' => '18446744073709551610 (-6)'
        },
        '7' => {
          'name' => 'PLDM_REQUESTER_SEND_FAIL',
          'value' => '18446744073709551609 (-7)'
        },
        '8' => {
          'name' => 'PLDM_REQUESTER_RECV_FAIL',
          'value' => '18446744073709551608 (-8)'
        },
        '9' => {
          'name' => 'PLDM_REQUESTER_INVALID_RECV_LEN',
          'value' => '18446744073709551607 (-9)'
        },
        '10' => {
          'name' => 'PLDM_REQUESTER_SETUP_FAIL',
          'value' => '18446744073709551606 (-10)'
        },
        '11' => {
          'name' => 'PLDM_REQUESTER_INVALID_SETUP',
          'value' => '18446744073709551605 (-11)'
        },
        '12' => {
          'name' => 'PLDM_REQUESTER_POLL_FAIL',
          'value' => '18446744073709551604 (-12)'
        },
        '13' => {
          'name' => 'PLDM_REQUESTER_TRANSPORT_BUSY',
          'value' => '18446744073709551603 (-13)'
        }
      },
      'Name' => 'enum pldm_requester_error_codes',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '6946' => {
      'Name' => '_Bool',
      'Size' => '1',
      'Type' => 'Intrinsic'
    },
    '7568' => {
      'BaseType' => '143',
      'Name' => 'char*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '7580' => {
      'BaseType' => '143',
      'Name' => 'char const',
      'Size' => '1',
      'Type' => 'Const'
    },
    '7724' => {
      'BaseType' => '136',
      'Header' => 'types.h',
      'Line' => '194',
      'Name' => '__ssize_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '7765' => {
      'BaseType' => '162',
      'Name' => 'uint16_t const',
      'Size' => '2',
      'Type' => 'Const'
    },
    '8095' => {
      'Header' => 'pldm_types.h',
      'Line' => '177',
      'Memb' => {
        '0' => {
          'name' => 'ptr',
          'offset' => '0',
          'type' => '5778'
        },
        '1' => {
          'name' => 'length',
          'offset' => '8',
          'type' => '883'
        }
      },
      'Name' => 'struct variable_field',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '8139' => {
      'BaseType' => '7724',
      'Header' => 'types.h',
      'Line' => '108',
      'Name' => 'ssize_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '9283' => {
      'Header' => 'base.h',
      'Line' => '395',
      'Memb' => {
        '0' => {
          'name' => 'pldm_type',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'transfer_opflag',
          'offset' => '1',
          'type' => '150'
        },
        '2' => {
          'name' => 'transfer_ctx',
          'offset' => '4',
          'type' => '174'
        },
        '3' => {
          'name' => 'transfer_handle',
          'offset' => '8',
          'type' => '174'
        },
        '4' => {
          'name' => 'section_offset',
          'offset' => '18',
          'type' => '174'
        },
        '5' => {
          'name' => 'section_length',
          'offset' => '22',
          'type' => '174'
        }
      },
      'Name' => 'struct pldm_base_multipart_receive_req',
      'Size' => '20',
      'Type' => 'Struct'
    },
    '9374' => {
      'BaseType' => '9283',
      'Name' => 'struct pldm_base_multipart_receive_req const',
      'Size' => '20',
      'Type' => 'Const'
    },
    '9379' => {
      'Header' => 'base.h',
      'Line' => '413',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'transfer_flag',
          'offset' => '1',
          'type' => '150'
        },
        '2' => {
          'name' => 'next_transfer_handle',
          'offset' => '4',
          'type' => '174'
        },
        '3' => {
          'name' => 'data',
          'offset' => '8',
          'type' => '8095'
        }
      },
      'Name' => 'struct pldm_base_multipart_receive_resp',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '9449' => {
      'Header' => 'base.h',
      'Line' => '425',
      'Memb' => {
        '0' => {
          'name' => 'requester_part_size',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'requester_protocol_support',
          'offset' => '2',
          'type' => '1880'
        }
      },
      'Name' => 'struct pldm_base_negotiate_transfer_params_req',
      'Size' => '10',
      'Type' => 'Struct'
    },
    '9488' => {
      'BaseType' => '9449',
      'Name' => 'struct pldm_base_negotiate_transfer_params_req const',
      'Size' => '10',
      'Type' => 'Const'
    },
    '9509' => {
      'Header' => 'base.h',
      'Line' => '434',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'responder_part_size',
          'offset' => '2',
          'type' => '162'
        },
        '2' => {
          'name' => 'responder_protocol_support',
          'offset' => '4',
          'type' => '1880'
        }
      },
      'Name' => 'struct pldm_base_negotiate_transfer_params_resp',
      'Size' => '12',
      'Type' => 'Struct'
    },
    '9685' => {
      'BaseType' => '7580',
      'Name' => 'char const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '11286' => {
      'BaseType' => '1941',
      'Name' => 'struct pldm_base_get_pldm_types_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '14351' => {
      'BaseType' => '1896',
      'Name' => 'struct pldm_base_get_tid_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '17961' => {
      'BaseType' => '9509',
      'Name' => 'struct pldm_base_negotiate_transfer_params_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '23452' => {
      'BaseType' => '9488',
      'Name' => 'struct pldm_base_negotiate_transfer_params_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '43508' => {
      'BaseType' => '9379',
      'Name' => 'struct pldm_base_multipart_receive_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '46257' => {
      'BaseType' => '9374',
      'Name' => 'struct pldm_base_multipart_receive_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '51657' => {
      'BaseType' => '1088',
      'Name' => 'bitfield8_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '53098' => {
      'BaseType' => '1620',
      'Name' => 'struct pldm_msg_hdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '57404' => {
      'BaseType' => '8095',
      'Name' => 'struct variable_field*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '59486' => {
      'BaseType' => '162',
      'Name' => 'uint16_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '62784' => {
      'BaseType' => '72',
      'Header' => 'types.h',
      'Line' => '45',
      'Name' => '__uint64_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '62861' => {
      'BaseType' => '62784',
      'Header' => 'stdint-uintn.h',
      'Line' => '27',
      'Name' => 'uint64_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '63131' => {
      'Header' => 'bios.h',
      'Line' => '50',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_BIOS_STRING_TABLE',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_BIOS_ATTR_TABLE',
          'value' => '1'
        },
        '2' => {
          'name' => 'PLDM_BIOS_ATTR_VAL_TABLE',
          'value' => '2'
        }
      },
      'Name' => 'enum pldm_bios_table_types',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '63165' => {
      'Header' => 'bios.h',
      'Line' => '56',
      'Memb' => {
        '0' => {
          'name' => 'string_handle',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'string_length',
          'offset' => '2',
          'type' => '162'
        },
        '2' => {
          'name' => 'name',
          'offset' => '4',
          'type' => '63222'
        }
      },
      'Name' => 'struct pldm_bios_string_table_entry',
      'Size' => '5',
      'Type' => 'Struct'
    },
    '63217' => {
      'BaseType' => '63165',
      'Name' => 'struct pldm_bios_string_table_entry const',
      'Size' => '5',
      'Type' => 'Const'
    },
    '63222' => {
      'BaseType' => '143',
      'Name' => 'char[1]',
      'Size' => '1',
      'Type' => 'Array'
    },
    '63238' => {
      'Header' => 'bios.h',
      'Line' => '62',
      'Memb' => {
        '0' => {
          'name' => 'attr_handle',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'attr_type',
          'offset' => '2',
          'type' => '150'
        },
        '2' => {
          'name' => 'string_handle',
          'offset' => '3',
          'type' => '162'
        },
        '3' => {
          'name' => 'metadata',
          'offset' => '5',
          'type' => '1781'
        }
      },
      'Name' => 'struct pldm_bios_attr_table_entry',
      'Size' => '6',
      'Type' => 'Struct'
    },
    '63303' => {
      'BaseType' => '63238',
      'Name' => 'struct pldm_bios_attr_table_entry const',
      'Size' => '6',
      'Type' => 'Const'
    },
    '63308' => {
      'Header' => 'bios.h',
      'Line' => '74',
      'Memb' => {
        '0' => {
          'name' => 'attr_handle',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'attr_type',
          'offset' => '2',
          'type' => '150'
        },
        '2' => {
          'name' => 'value',
          'offset' => '3',
          'type' => '1781'
        }
      },
      'Name' => 'struct pldm_bios_attr_val_table_entry',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '63360' => {
      'BaseType' => '63308',
      'Name' => 'struct pldm_bios_attr_val_table_entry const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '63429' => {
      'Header' => 'bios_table.h',
      'Line' => '205',
      'Memb' => {
        '0' => {
          'name' => 'name_handle',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'read_only',
          'offset' => '2',
          'type' => '6946'
        },
        '2' => {
          'name' => 'pv_num',
          'offset' => '3',
          'type' => '150'
        },
        '3' => {
          'name' => 'pv_handle',
          'offset' => '8',
          'type' => '63532'
        },
        '4' => {
          'name' => 'def_num',
          'offset' => '22',
          'type' => '150'
        },
        '5' => {
          'name' => 'def_index',
          'offset' => '36',
          'type' => '5778'
        }
      },
      'Name' => 'struct pldm_bios_table_attr_entry_enum_info',
      'Size' => '32',
      'Type' => 'Struct'
    },
    '63520' => {
      'BaseType' => '63429',
      'Name' => 'struct pldm_bios_table_attr_entry_enum_info const',
      'Size' => '32',
      'Type' => 'Const'
    },
    '63532' => {
      'BaseType' => '7765',
      'Name' => 'uint16_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '63537' => {
      'Header' => 'bios_table.h',
      'Line' => '293',
      'Memb' => {
        '0' => {
          'name' => 'name_handle',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'read_only',
          'offset' => '2',
          'type' => '6946'
        },
        '2' => {
          'name' => 'string_type',
          'offset' => '3',
          'type' => '150'
        },
        '3' => {
          'name' => 'min_length',
          'offset' => '4',
          'type' => '162'
        },
        '4' => {
          'name' => 'max_length',
          'offset' => '6',
          'type' => '162'
        },
        '5' => {
          'name' => 'def_length',
          'offset' => '8',
          'type' => '162'
        },
        '6' => {
          'name' => 'def_string',
          'offset' => '22',
          'type' => '9685'
        }
      },
      'Name' => 'struct pldm_bios_table_attr_entry_string_info',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '63649' => {
      'BaseType' => '63537',
      'Name' => 'struct pldm_bios_table_attr_entry_string_info const',
      'Size' => '24',
      'Type' => 'Const'
    },
    '63659' => {
      'Header' => 'bios_table.h',
      'Line' => '383',
      'Memb' => {
        '0' => {
          'name' => 'name_handle',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'read_only',
          'offset' => '2',
          'type' => '6946'
        },
        '2' => {
          'name' => 'lower_bound',
          'offset' => '8',
          'type' => '62861'
        },
        '3' => {
          'name' => 'upper_bound',
          'offset' => '22',
          'type' => '62861'
        },
        '4' => {
          'name' => 'scalar_increment',
          'offset' => '36',
          'type' => '174'
        },
        '5' => {
          'name' => 'default_value',
          'offset' => '50',
          'type' => '62861'
        }
      },
      'Name' => 'struct pldm_bios_table_attr_entry_integer_info',
      'Size' => '40',
      'Type' => 'Struct'
    },
    '63757' => {
      'BaseType' => '63659',
      'Name' => 'struct pldm_bios_table_attr_entry_integer_info const',
      'Size' => '40',
      'Type' => 'Const'
    },
    '64024' => {
      'Name' => 'ssize_t(*)(void const*)',
      'Param' => {
        '0' => {
          'type' => '2131'
        }
      },
      'Return' => '8139',
      'Size' => '8',
      'Type' => 'FuncPtr'
    },
    '64094' => {
      'Line' => '958',
      'Memb' => {
        '0' => {
          'name' => 'table_data',
          'offset' => '0',
          'type' => '5778'
        },
        '1' => {
          'name' => 'table_len',
          'offset' => '8',
          'type' => '883'
        },
        '2' => {
          'name' => 'current_pos',
          'offset' => '22',
          'type' => '883'
        },
        '3' => {
          'name' => 'entry_length_handler',
          'offset' => '36',
          'type' => '64024'
        }
      },
      'Name' => 'struct pldm_bios_table_iter',
      'PrivateABI' => 1,
      'Size' => '32',
      'Source' => 'bios_table.c',
      'Type' => 'Struct'
    },
    '64164' => {
      'BaseType' => '64094',
      'Name' => 'struct pldm_bios_table_iter const',
      'Size' => '32',
      'Type' => 'Const'
    },
    '65234' => {
      'BaseType' => '64094',
      'Name' => 'struct pldm_bios_table_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '65239' => {
      'BaseType' => '63360',
      'Name' => 'struct pldm_bios_attr_val_table_entry const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '65653' => {
      'BaseType' => '63303',
      'Name' => 'struct pldm_bios_attr_table_entry const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '66256' => {
      'BaseType' => '63217',
      'Name' => 'struct pldm_bios_string_table_entry const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '67419' => {
      'BaseType' => '64164',
      'Name' => 'struct pldm_bios_table_iter const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '71602' => {
      'BaseType' => '62861',
      'Name' => 'uint64_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '71879' => {
      'BaseType' => '63757',
      'Name' => 'struct pldm_bios_table_attr_entry_integer_info const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '72146' => {
      'BaseType' => '9685',
      'Name' => 'char const**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '73275' => {
      'BaseType' => '63649',
      'Name' => 'struct pldm_bios_table_attr_entry_string_info const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '74730' => {
      'BaseType' => '63520',
      'Name' => 'struct pldm_bios_table_attr_entry_enum_info const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '76895' => {
      'Header' => 'pldm_types.h',
      'Line' => '41',
      'Name' => 'struct bits16',
      'Size' => '2',
      'Type' => 'Struct'
    },
    '77165' => {
      'Header' => 'pldm_types.h',
      'Line' => '59',
      'Memb' => {
        '0' => {
          'name' => 'value',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'bits',
          'offset' => '0',
          'type' => '76895'
        }
      },
      'Name' => 'union bitfield16_t',
      'Size' => '2',
      'Type' => 'Union'
    },
    '77902' => {
      'Header' => 'file.h',
      'Line' => '52',
      'Memb' => {
        '0' => {
          'name' => 'file_identifier',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'file_attribute',
          'offset' => '2',
          'type' => '77165'
        }
      },
      'Name' => 'struct pldm_file_df_open_req',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '77942' => {
      'BaseType' => '77902',
      'Name' => 'struct pldm_file_df_open_req const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '77947' => {
      'Header' => 'file.h',
      'Line' => '61',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'file_descriptor',
          'offset' => '2',
          'type' => '162'
        }
      },
      'Name' => 'struct pldm_file_df_open_resp',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '77992' => {
      'Header' => 'file.h',
      'Line' => '70',
      'Memb' => {
        '0' => {
          'name' => 'file_descriptor',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'df_close_options',
          'offset' => '2',
          'type' => '77165'
        }
      },
      'Name' => 'struct pldm_file_df_close_req',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '78032' => {
      'BaseType' => '77992',
      'Name' => 'struct pldm_file_df_close_req const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '78037' => {
      'Header' => 'file.h',
      'Line' => '79',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '150'
        }
      },
      'Name' => 'struct pldm_file_df_close_resp',
      'Size' => '1',
      'Type' => 'Struct'
    },
    '78069' => {
      'Header' => 'file.h',
      'Line' => '87',
      'Memb' => {
        '0' => {
          'name' => 'file_descriptor',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'requester_max_interval',
          'offset' => '4',
          'type' => '174'
        }
      },
      'Name' => 'struct pldm_file_df_heartbeat_req',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '78109' => {
      'BaseType' => '78069',
      'Name' => 'struct pldm_file_df_heartbeat_req const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '78114' => {
      'Header' => 'file.h',
      'Line' => '96',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'responder_max_interval',
          'offset' => '4',
          'type' => '174'
        }
      },
      'Name' => 'struct pldm_file_df_heartbeat_resp',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '82817' => {
      'BaseType' => '78114',
      'Name' => 'struct pldm_file_df_heartbeat_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '84387' => {
      'BaseType' => '78109',
      'Name' => 'struct pldm_file_df_heartbeat_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '84513' => {
      'BaseType' => '78037',
      'Name' => 'struct pldm_file_df_close_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '88804' => {
      'BaseType' => '78032',
      'Name' => 'struct pldm_file_df_close_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '90554' => {
      'BaseType' => '77947',
      'Name' => 'struct pldm_file_df_open_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '95140' => {
      'BaseType' => '77942',
      'Name' => 'struct pldm_file_df_open_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '96923' => {
      'BaseType' => '883',
      'Name' => 'size_t const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '96935' => {
      'BaseType' => '150',
      'Header' => 'pldm_types.h',
      'Line' => '37',
      'Name' => 'bool8_t',
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '97227' => {
      'Header' => 'pldm_types.h',
      'Line' => '63',
      'Name' => 'struct bits32',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '97719' => {
      'Header' => 'pldm_types.h',
      'Line' => '97',
      'Memb' => {
        '0' => {
          'name' => 'value',
          'offset' => '0',
          'type' => '174'
        },
        '1' => {
          'name' => 'bits',
          'offset' => '0',
          'type' => '97227'
        }
      },
      'Name' => 'union bitfield32_t',
      'Size' => '4',
      'Type' => 'Union'
    },
    '97731' => {
      'Header' => 'pldm_types.h',
      'Line' => '101',
      'Name' => 'struct bits64',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '98671' => {
      'Header' => 'pldm_types.h',
      'Line' => '167',
      'Memb' => {
        '0' => {
          'name' => 'value',
          'offset' => '0',
          'type' => '62861'
        },
        '1' => {
          'name' => 'bits',
          'offset' => '0',
          'type' => '97731'
        }
      },
      'Name' => 'union bitfield64_t',
      'Size' => '8',
      'Type' => 'Union'
    },
    '98690' => {
      'BaseType' => '98702',
      'Header' => 'pldm_types.h',
      'Line' => '171',
      'Name' => 'pldm_uuid',
      'Size' => '16',
      'Type' => 'Typedef'
    },
    '98702' => {
      'BaseType' => '150',
      'Name' => 'uint8_t[16]',
      'Size' => '16',
      'Type' => 'Array'
    },
    '98718' => {
      'BaseType' => '98702',
      'Name' => 'uint8_t[16] const',
      'Size' => '16',
      'Type' => 'Const'
    },
    '98762' => {
      'BaseType' => '8095',
      'Name' => 'struct variable_field const',
      'Size' => '16',
      'Type' => 'Const'
    },
    '100894' => {
      'BaseType' => '150',
      'Name' => 'uint8_t[8]',
      'Size' => '8',
      'Type' => 'Array'
    },
    '100910' => {
      'Header' => 'firmware_update.h',
      'Line' => '465',
      'Memb' => {
        '0' => {
          'name' => 'uuid',
          'offset' => '0',
          'type' => '98702'
        },
        '1' => {
          'name' => 'package_header_format_version',
          'offset' => '22',
          'type' => '150'
        },
        '2' => {
          'name' => 'package_header_size',
          'offset' => '23',
          'type' => '162'
        },
        '3' => {
          'name' => 'package_release_date_time',
          'offset' => '25',
          'type' => '101023'
        },
        '4' => {
          'name' => 'component_bitmap_bit_length',
          'offset' => '50',
          'type' => '162'
        },
        '5' => {
          'name' => 'package_version_string_type',
          'offset' => '52',
          'type' => '150'
        },
        '6' => {
          'name' => 'package_version_string_length',
          'offset' => '53',
          'type' => '150'
        }
      },
      'Name' => 'struct pldm_package_header_information',
      'Size' => '36',
      'Type' => 'Struct'
    },
    '101023' => {
      'BaseType' => '150',
      'Name' => 'uint8_t[13]',
      'Size' => '13',
      'Type' => 'Array'
    },
    '101039' => {
      'Header' => 'firmware_update.h',
      'Line' => '479',
      'Memb' => {
        '0' => {
          'name' => 'record_length',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'descriptor_count',
          'offset' => '2',
          'type' => '150'
        },
        '2' => {
          'name' => 'device_update_option_flags',
          'offset' => '3',
          'type' => '97719'
        },
        '3' => {
          'name' => 'comp_image_set_version_string_type',
          'offset' => '7',
          'type' => '150'
        },
        '4' => {
          'name' => 'comp_image_set_version_string_length',
          'offset' => '8',
          'type' => '150'
        },
        '5' => {
          'name' => 'fw_device_pkg_data_length',
          'offset' => '9',
          'type' => '162'
        }
      },
      'Name' => 'struct pldm_firmware_device_id_record',
      'Size' => '11',
      'Type' => 'Struct'
    },
    '101252' => {
      'Header' => 'firmware_update.h',
      'Line' => '513',
      'Memb' => {
        '0' => {
          'name' => 'comp_classification',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'comp_identifier',
          'offset' => '2',
          'type' => '162'
        },
        '2' => {
          'name' => 'comp_comparison_stamp',
          'offset' => '4',
          'type' => '174'
        },
        '3' => {
          'name' => 'comp_options',
          'offset' => '8',
          'type' => '77165'
        },
        '4' => {
          'name' => 'requested_comp_activation_method',
          'offset' => '16',
          'type' => '77165'
        },
        '5' => {
          'name' => 'comp_location_offset',
          'offset' => '18',
          'type' => '174'
        },
        '6' => {
          'name' => 'comp_size',
          'offset' => '22',
          'type' => '174'
        },
        '7' => {
          'name' => 'comp_version_string_type',
          'offset' => '32',
          'type' => '150'
        },
        '8' => {
          'name' => 'comp_version_string_length',
          'offset' => '33',
          'type' => '150'
        }
      },
      'Name' => 'struct pldm_component_image_information',
      'Size' => '22',
      'Type' => 'Struct'
    },
    '101450' => {
      'Header' => 'firmware_update.h',
      'Line' => '539',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'capabilities_during_update',
          'offset' => '1',
          'type' => '97719'
        },
        '2' => {
          'name' => 'comp_count',
          'offset' => '5',
          'type' => '162'
        },
        '3' => {
          'name' => 'active_comp_image_set_ver_str_type',
          'offset' => '7',
          'type' => '150'
        },
        '4' => {
          'name' => 'active_comp_image_set_ver_str_len',
          'offset' => '8',
          'type' => '150'
        },
        '5' => {
          'name' => 'pending_comp_image_set_ver_str_type',
          'offset' => '9',
          'type' => '150'
        },
        '6' => {
          'name' => 'pending_comp_image_set_ver_str_len',
          'offset' => '16',
          'type' => '150'
        }
      },
      'Name' => 'struct pldm_get_firmware_parameters_resp',
      'Size' => '11',
      'Type' => 'Struct'
    },
    '101653' => {
      'Header' => 'firmware_update.h',
      'Line' => '567',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'downstream_device_update_supported',
          'offset' => '1',
          'type' => '150'
        },
        '2' => {
          'name' => 'number_of_downstream_devices',
          'offset' => '2',
          'type' => '162'
        },
        '3' => {
          'name' => 'max_number_of_downstream_devices',
          'offset' => '4',
          'type' => '162'
        },
        '4' => {
          'name' => 'capabilities',
          'offset' => '8',
          'type' => '97719'
        }
      },
      'Name' => 'struct pldm_query_downstream_devices_resp',
      'Size' => '12',
      'Type' => 'Struct'
    },
    '101738' => {
      'Header' => 'firmware_update.h',
      'Line' => '579',
      'Memb' => {
        '0' => {
          'name' => 'comp_classification',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'comp_identifier',
          'offset' => '2',
          'type' => '162'
        },
        '2' => {
          'name' => 'comp_classification_index',
          'offset' => '4',
          'type' => '150'
        },
        '3' => {
          'name' => 'active_comp_comparison_stamp',
          'offset' => '5',
          'type' => '174'
        },
        '4' => {
          'name' => 'active_comp_ver_str_type',
          'offset' => '9',
          'type' => '150'
        },
        '5' => {
          'name' => 'active_comp_ver_str_len',
          'offset' => '16',
          'type' => '150'
        },
        '6' => {
          'name' => 'active_comp_release_date',
          'offset' => '17',
          'type' => '100894'
        },
        '7' => {
          'name' => 'pending_comp_comparison_stamp',
          'offset' => '25',
          'type' => '174'
        },
        '8' => {
          'name' => 'pending_comp_ver_str_type',
          'offset' => '35',
          'type' => '150'
        },
        '9' => {
          'name' => 'pending_comp_ver_str_len',
          'offset' => '36',
          'type' => '150'
        },
        '10' => {
          'name' => 'pending_comp_release_date',
          'offset' => '37',
          'type' => '100894'
        },
        '11' => {
          'name' => 'comp_activation_methods',
          'offset' => '51',
          'type' => '77165'
        },
        '12' => {
          'name' => 'capabilities_during_update',
          'offset' => '53',
          'type' => '97719'
        }
      },
      'Name' => 'struct pldm_component_parameter_entry',
      'Size' => '39',
      'Type' => 'Struct'
    },
    '102053' => {
      'Header' => 'firmware_update.h',
      'Line' => '618',
      'Memb' => {
        '0' => {
          'name' => 'data_transfer_handle',
          'offset' => '0',
          'type' => '174'
        },
        '1' => {
          'name' => 'transfer_operation_flag',
          'offset' => '4',
          'type' => '150'
        }
      },
      'Name' => 'struct pldm_query_downstream_identifiers_req',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '102096' => {
      'BaseType' => '102053',
      'Name' => 'struct pldm_query_downstream_identifiers_req const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '102101' => {
      'Header' => 'firmware_update.h',
      'Line' => '632',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'next_data_transfer_handle',
          'offset' => '4',
          'type' => '174'
        },
        '2' => {
          'name' => 'transfer_flag',
          'offset' => '8',
          'type' => '150'
        },
        '3' => {
          'name' => 'downstream_devices_length',
          'offset' => '18',
          'type' => '174'
        },
        '4' => {
          'name' => 'number_of_downstream_devices',
          'offset' => '22',
          'type' => '162'
        }
      },
      'Name' => 'struct pldm_query_downstream_identifiers_resp',
      'Size' => '20',
      'Type' => 'Struct'
    },
    '102186' => {
      'Header' => 'firmware_update.h',
      'Line' => '645',
      'Memb' => {
        '0' => {
          'name' => 'downstream_device_index',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'downstream_descriptor_count',
          'offset' => '2',
          'type' => '150'
        }
      },
      'Name' => 'struct pldm_downstream_device',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '102229' => {
      'Header' => 'firmware_update.h',
      'Line' => '651',
      'Memb' => {
        '0' => {
          'name' => 'field',
          'offset' => '0',
          'type' => '8095'
        },
        '1' => {
          'name' => 'devs',
          'offset' => '22',
          'type' => '883'
        }
      },
      'Name' => 'struct pldm_downstream_device_iter',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '102272' => {
      'Header' => 'firmware_update.h',
      'Line' => '725',
      'Memb' => {
        '0' => {
          'name' => 'descriptor_type',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'descriptor_length',
          'offset' => '2',
          'type' => '162'
        },
        '2' => {
          'name' => 'descriptor_data',
          'offset' => '8',
          'type' => '2131'
        }
      },
      'Name' => 'struct pldm_descriptor',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '102345' => {
      'Header' => 'firmware_update.h',
      'Line' => '731',
      'Memb' => {
        '0' => {
          'name' => 'field',
          'offset' => '0',
          'type' => '57404'
        },
        '1' => {
          'name' => 'count',
          'offset' => '8',
          'type' => '883'
        }
      },
      'Name' => 'struct pldm_descriptor_iter',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '102393' => {
      'Header' => 'firmware_update.h',
      'Line' => '824',
      'Memb' => {
        '0' => {
          'name' => 'data_transfer_handle',
          'offset' => '0',
          'type' => '174'
        },
        '1' => {
          'name' => 'transfer_operation_flag',
          'offset' => '4',
          'type' => '150'
        }
      },
      'Name' => 'struct pldm_get_downstream_firmware_parameters_req',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '102436' => {
      'BaseType' => '102393',
      'Name' => 'struct pldm_get_downstream_firmware_parameters_req const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '102441' => {
      'Header' => 'firmware_update.h',
      'Line' => '839',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'next_data_transfer_handle',
          'offset' => '4',
          'type' => '174'
        },
        '2' => {
          'name' => 'transfer_flag',
          'offset' => '8',
          'type' => '150'
        },
        '3' => {
          'name' => 'fdp_capabilities_during_update',
          'offset' => '18',
          'type' => '97719'
        },
        '4' => {
          'name' => 'downstream_device_count',
          'offset' => '22',
          'type' => '162'
        }
      },
      'Name' => 'struct pldm_get_downstream_firmware_parameters_resp',
      'Size' => '20',
      'Type' => 'Struct'
    },
    '102526' => {
      'Header' => 'firmware_update.h',
      'Line' => '857',
      'Memb' => {
        '0' => {
          'name' => 'downstream_device_index',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'active_comp_comparison_stamp',
          'offset' => '4',
          'type' => '174'
        },
        '2' => {
          'name' => 'active_comp_ver_str_type',
          'offset' => '8',
          'type' => '150'
        },
        '3' => {
          'name' => 'active_comp_ver_str_len',
          'offset' => '9',
          'type' => '150'
        },
        '4' => {
          'name' => 'active_comp_release_date',
          'offset' => '16',
          'type' => '102723'
        },
        '5' => {
          'name' => 'pending_comp_comparison_stamp',
          'offset' => '32',
          'type' => '174'
        },
        '6' => {
          'name' => 'pending_comp_ver_str_type',
          'offset' => '36',
          'type' => '150'
        },
        '7' => {
          'name' => 'pending_comp_ver_str_len',
          'offset' => '37',
          'type' => '150'
        },
        '8' => {
          'name' => 'pending_comp_release_date',
          'offset' => '38',
          'type' => '102723'
        },
        '9' => {
          'name' => 'comp_activation_methods',
          'offset' => '54',
          'type' => '77165'
        },
        '10' => {
          'name' => 'capabilities_during_update',
          'offset' => '64',
          'type' => '97719'
        },
        '11' => {
          'name' => 'active_comp_ver_str',
          'offset' => '72',
          'type' => '2131'
        },
        '12' => {
          'name' => 'pending_comp_ver_str',
          'offset' => '86',
          'type' => '2131'
        }
      },
      'Name' => 'struct pldm_downstream_device_parameters_entry',
      'Size' => '64',
      'Type' => 'Struct'
    },
    '102723' => {
      'BaseType' => '143',
      'Name' => 'char[9]',
      'Size' => '9',
      'Type' => 'Array'
    },
    '104094' => {
      'Header' => 'firmware_update.h',
      'Line' => '1089',
      'Memb' => {
        '0' => {
          'name' => 'component_classification',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'component_identifier',
          'offset' => '2',
          'type' => '162'
        },
        '2' => {
          'name' => 'component_classification_index',
          'offset' => '4',
          'type' => '150'
        }
      },
      'Name' => 'struct pldm_fwup_update_security_revision_req',
      'Size' => '6',
      'Type' => 'Struct'
    },
    '104151' => {
      'BaseType' => '104094',
      'Name' => 'struct pldm_fwup_update_security_revision_req const',
      'Size' => '6',
      'Type' => 'Const'
    },
    '104156' => {
      'Header' => 'firmware_update.h',
      'Line' => '1406',
      'Memb' => {
        '0' => {
          'name' => 'field',
          'offset' => '0',
          'type' => '8095'
        },
        '1' => {
          'name' => 'entries',
          'offset' => '22',
          'type' => '883'
        }
      },
      'Name' => 'struct pldm_downstream_device_parameters_iter',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '104199' => {
      'Header' => 'firmware_update.h',
      'Line' => '2288',
      'Memb' => {
        '0' => {
          'name' => 'magic',
          'offset' => '0',
          'type' => '878'
        },
        '1' => {
          'name' => 'version',
          'offset' => '4',
          'type' => '5532'
        }
      },
      'Name' => 'anon-struct-firmware_update.h-2288',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '104236' => {
      'Header' => 'firmware_update.h',
      'Line' => '2307',
      'Memb' => {
        '0' => {
          'name' => 'identifier',
          'offset' => '0',
          'type' => '98718'
        },
        '1' => {
          'name' => 'revision',
          'offset' => '22',
          'type' => '5532'
        }
      },
      'Name' => 'anon-struct-firmware_update.h-2307',
      'Size' => '17',
      'Type' => 'Struct'
    },
    '104273' => {
      'Header' => 'firmware_update.h',
      'Line' => '2287',
      'Memb' => {
        '0' => {
          'name' => 'meta',
          'offset' => '0',
          'type' => '104199'
        },
        '1' => {
          'name' => 'format',
          'offset' => '8',
          'type' => '104236'
        }
      },
      'Name' => 'struct pldm_package_format_pin',
      'Size' => '28',
      'Type' => 'Struct'
    },
    '104316' => {
      'BaseType' => '104273',
      'Name' => 'struct pldm_package_format_pin const',
      'Size' => '28',
      'Type' => 'Const'
    },
    '104321' => {
      'Header' => 'firmware_update.h',
      'Line' => '2316',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_PACKAGE_PARSE_INIT',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_PACKAGE_PARSE_COMPLETE',
          'value' => '1'
        },
        '2' => {
          'name' => 'PLDM_PACKAGE_PARSE_HEADER',
          'value' => '2'
        },
        '3' => {
          'name' => 'PLDM_PACKAGE_PARSE_FIRMWARE_DEVICES',
          'value' => '3'
        },
        '4' => {
          'name' => 'PLDM_PACKAGE_PARSE_DOWNSTREAM_DEVICES',
          'value' => '4'
        },
        '5' => {
          'name' => 'PLDM_PACKAGE_PARSE_COMPONENT_IMAGE_INFORMATION',
          'value' => '5'
        }
      },
      'Name' => 'enum pldm_package_parse',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '104373' => {
      'Header' => 'firmware_update.h',
      'Line' => '2325',
      'Memb' => {
        '0' => {
          'name' => 'field',
          'offset' => '0',
          'type' => '8095'
        },
        '1' => {
          'name' => 'entries',
          'offset' => '22',
          'type' => '883'
        }
      },
      'Name' => 'struct pldm_package_iter',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '104416' => {
      'Header' => 'firmware_update.h',
      'Line' => '2338',
      'Memb' => {
        '0' => {
          'name' => 'package_header_identifier',
          'offset' => '0',
          'type' => '98690'
        },
        '1' => {
          'name' => 'package_header_format_revision',
          'offset' => '22',
          'type' => '150'
        },
        '2' => {
          'name' => 'package_release_date_time',
          'offset' => '23',
          'type' => '101023'
        },
        '3' => {
          'name' => 'component_bitmap_bit_length',
          'offset' => '48',
          'type' => '162'
        },
        '4' => {
          'name' => 'package_version_string_type',
          'offset' => '50',
          'type' => '150'
        },
        '5' => {
          'name' => 'package_version_string',
          'offset' => '64',
          'type' => '8095'
        }
      },
      'Name' => 'struct pldm__package_header_information',
      'Size' => '56',
      'Type' => 'Struct'
    },
    '104515' => {
      'BaseType' => '104416',
      'Header' => 'firmware_update.h',
      'Line' => '2351',
      'Name' => 'pldm_package_header_information_pad',
      'Size' => '56',
      'Type' => 'Typedef'
    },
    '104528' => {
      'BaseType' => '104515',
      'Name' => 'pldm_package_header_information_pad const',
      'Size' => '56',
      'Type' => 'Const'
    },
    '104533' => {
      'Header' => 'firmware_update.h',
      'Line' => '2354',
      'Memb' => {
        '0' => {
          'name' => 'bitmap',
          'offset' => '0',
          'type' => '8095'
        }
      },
      'Name' => 'struct pldm_package_component_bitmap',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '104562' => {
      'Header' => 'firmware_update.h',
      'Line' => '2366',
      'Memb' => {
        '0' => {
          'name' => 'descriptor_count',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'device_update_option_flags',
          'offset' => '4',
          'type' => '97719'
        },
        '2' => {
          'name' => 'component_image_set_version_string_type',
          'offset' => '8',
          'type' => '150'
        },
        '3' => {
          'name' => 'component_image_set_version_string',
          'offset' => '22',
          'type' => '8095'
        },
        '4' => {
          'name' => 'applicable_components',
          'offset' => '50',
          'type' => '104533'
        },
        '5' => {
          'name' => 'record_descriptors',
          'offset' => '72',
          'type' => '8095'
        },
        '6' => {
          'name' => 'firmware_device_package_data',
          'offset' => '100',
          'type' => '8095'
        },
        '7' => {
          'name' => 'reference_manifest_data',
          'offset' => '128',
          'type' => '8095'
        }
      },
      'Name' => 'struct pldm_package_firmware_device_id_record',
      'Size' => '96',
      'Type' => 'Struct'
    },
    '104689' => {
      'Header' => 'firmware_update.h',
      'Line' => '2417',
      'Memb' => {
        '0' => {
          'name' => 'descriptor_count',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'update_option_flags',
          'offset' => '4',
          'type' => '97719'
        },
        '2' => {
          'name' => 'self_contained_activation_min_version_string_type',
          'offset' => '8',
          'type' => '150'
        },
        '3' => {
          'name' => 'self_contained_activation_min_version_string',
          'offset' => '22',
          'type' => '8095'
        },
        '4' => {
          'name' => 'self_contained_activation_min_version_comparison_stamp',
          'offset' => '50',
          'type' => '174'
        },
        '5' => {
          'name' => 'applicable_components',
          'offset' => '64',
          'type' => '104533'
        },
        '6' => {
          'name' => 'record_descriptors',
          'offset' => '86',
          'type' => '8095'
        },
        '7' => {
          'name' => 'package_data',
          'offset' => '114',
          'type' => '8095'
        },
        '8' => {
          'name' => 'reference_manifest_data',
          'offset' => '136',
          'type' => '8095'
        }
      },
      'Name' => 'struct pldm_package_downstream_device_id_record',
      'Size' => '104',
      'Type' => 'Struct'
    },
    '104830' => {
      'Header' => 'firmware_update.h',
      'Line' => '2467',
      'Memb' => {
        '0' => {
          'name' => 'component_classification',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'component_identifier',
          'offset' => '2',
          'type' => '162'
        },
        '2' => {
          'name' => 'component_comparison_stamp',
          'offset' => '4',
          'type' => '174'
        },
        '3' => {
          'name' => 'component_options',
          'offset' => '8',
          'type' => '77165'
        },
        '4' => {
          'name' => 'requested_component_activation_method',
          'offset' => '16',
          'type' => '77165'
        },
        '5' => {
          'name' => 'component_image',
          'offset' => '22',
          'type' => '8095'
        },
        '6' => {
          'name' => 'component_version_string_type',
          'offset' => '50',
          'type' => '150'
        },
        '7' => {
          'name' => 'component_version_string',
          'offset' => '64',
          'type' => '8095'
        },
        '8' => {
          'name' => 'component_opaque_data',
          'offset' => '86',
          'type' => '8095'
        }
      },
      'Name' => 'struct pldm_package_component_image_information',
      'Size' => '72',
      'Type' => 'Struct'
    },
    '104971' => {
      'Header' => 'firmware_update.h',
      'Line' => '2508',
      'Memb' => {
        '0' => {
          'name' => 'pin',
          'offset' => '0',
          'type' => '105082'
        },
        '1' => {
          'name' => 'hdr',
          'offset' => '8',
          'type' => '105087'
        },
        '2' => {
          'name' => 'state',
          'offset' => '22',
          'type' => '104321'
        },
        '3' => {
          'name' => 'flags',
          'offset' => '32',
          'type' => '174'
        },
        '4' => {
          'name' => 'package',
          'offset' => '36',
          'type' => '8095'
        },
        '5' => {
          'name' => 'areas',
          'offset' => '64',
          'type' => '8095'
        },
        '6' => {
          'name' => 'iter',
          'offset' => '86',
          'type' => '104373'
        }
      },
      'Name' => 'struct pldm_package',
      'Size' => '80',
      'Type' => 'Struct'
    },
    '105082' => {
      'BaseType' => '104316',
      'Name' => 'struct pldm_package_format_pin const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '105087' => {
      'BaseType' => '104528',
      'Name' => 'pldm_package_header_information_pad const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '111967' => {
      'BaseType' => '104971',
      'Name' => 'struct pldm_package*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '111972' => {
      'BaseType' => '104830',
      'Name' => 'struct pldm_package_component_image_information*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '120061' => {
      'BaseType' => '104689',
      'Name' => 'struct pldm_package_downstream_device_id_record*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '121714' => {
      'BaseType' => '104562',
      'Name' => 'struct pldm_package_firmware_device_id_record*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '123466' => {
      'BaseType' => '104515',
      'Name' => 'pldm_package_header_information_pad*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '126406' => {
      'BaseType' => '104151',
      'Name' => 'struct pldm_fwup_update_security_revision_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '128477' => {
      'BaseType' => '96935',
      'Name' => 'bool8_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '128482' => {
      'BaseType' => '98671',
      'Name' => 'bitfield64_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '132543' => {
      'BaseType' => '97719',
      'Name' => 'bitfield32_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '137655' => {
      'BaseType' => '77165',
      'Name' => 'bitfield16_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '150364' => {
      'BaseType' => '98762',
      'Name' => 'struct variable_field const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '177237' => {
      'BaseType' => '104156',
      'Name' => 'struct pldm_downstream_device_parameters_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '177242' => {
      'BaseType' => '102526',
      'Name' => 'struct pldm_downstream_device_parameters_entry*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '180706' => {
      'BaseType' => '102441',
      'Name' => 'struct pldm_get_downstream_firmware_parameters_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '182155' => {
      'BaseType' => '102436',
      'Name' => 'struct pldm_get_downstream_firmware_parameters_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '183721' => {
      'BaseType' => '102229',
      'Name' => 'struct pldm_downstream_device_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '183726' => {
      'BaseType' => '102186',
      'Name' => 'struct pldm_downstream_device*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '187187' => {
      'BaseType' => '102101',
      'Name' => 'struct pldm_query_downstream_identifiers_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '188636' => {
      'BaseType' => '102096',
      'Name' => 'struct pldm_query_downstream_identifiers_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '192009' => {
      'BaseType' => '101653',
      'Name' => 'struct pldm_query_downstream_devices_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '192456' => {
      'BaseType' => '101738',
      'Name' => 'struct pldm_component_parameter_entry*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '202807' => {
      'BaseType' => '101450',
      'Name' => 'struct pldm_get_firmware_parameters_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '206433' => {
      'BaseType' => '2396',
      'Name' => 'uint8_t**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '206775' => {
      'BaseType' => '101252',
      'Name' => 'struct pldm_component_image_information*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '209753' => {
      'BaseType' => '102345',
      'Name' => 'struct pldm_descriptor_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '209758' => {
      'BaseType' => '102272',
      'Name' => 'struct pldm_descriptor*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '210142' => {
      'BaseType' => '101039',
      'Name' => 'struct pldm_firmware_device_id_record*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '218905' => {
      'BaseType' => '845',
      'Name' => 'void**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '219406' => {
      'BaseType' => '100910',
      'Name' => 'struct pldm_package_header_information*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '236973' => {
      'BaseType' => '236990',
      'Header' => 'pdr.h',
      'Line' => '15',
      'Name' => 'pldm_pdr',
      'PrivateABI' => 1,
      'Size' => '24',
      'Type' => 'Typedef'
    },
    '236985' => {
      'BaseType' => '236973',
      'Name' => 'pldm_pdr const',
      'Size' => '24',
      'Type' => 'Const'
    },
    '236990' => {
      'Line' => '33',
      'Memb' => {
        '0' => {
          'name' => 'record_count',
          'offset' => '0',
          'type' => '174'
        },
        '1' => {
          'name' => 'size',
          'offset' => '4',
          'type' => '174'
        },
        '2' => {
          'name' => 'first',
          'offset' => '8',
          'type' => '238460'
        },
        '3' => {
          'name' => 'last',
          'offset' => '22',
          'type' => '238460'
        }
      },
      'Name' => 'struct pldm_pdr',
      'PrivateABI' => 1,
      'Size' => '24',
      'Source' => 'pdr.c',
      'Type' => 'Struct'
    },
    '237056' => {
      'BaseType' => '237073',
      'Header' => 'pdr.h',
      'Line' => '20',
      'Name' => 'pldm_pdr_record',
      'PrivateABI' => 1,
      'Size' => '32',
      'Type' => 'Typedef'
    },
    '237068' => {
      'BaseType' => '237056',
      'Name' => 'pldm_pdr_record const',
      'Size' => '32',
      'Type' => 'Const'
    },
    '237073' => {
      'Line' => '24',
      'Memb' => {
        '0' => {
          'name' => 'record_handle',
          'offset' => '0',
          'type' => '174'
        },
        '1' => {
          'name' => 'size',
          'offset' => '4',
          'type' => '174'
        },
        '2' => {
          'name' => 'data',
          'offset' => '8',
          'type' => '2396'
        },
        '3' => {
          'name' => 'next',
          'offset' => '22',
          'type' => '238448'
        },
        '4' => {
          'name' => 'is_remote',
          'offset' => '36',
          'type' => '6946'
        },
        '5' => {
          'name' => 'terminus_handle',
          'offset' => '38',
          'type' => '162'
        }
      },
      'Name' => 'struct pldm_pdr_record',
      'PrivateABI' => 1,
      'Size' => '32',
      'Source' => 'pdr.c',
      'Type' => 'Struct'
    },
    '237165' => {
      'Header' => 'pdr.h',
      'Line' => '326',
      'Memb' => {
        '0' => {
          'name' => 'entity_type',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'entity_instance_num',
          'offset' => '2',
          'type' => '162'
        },
        '2' => {
          'name' => 'entity_container_id',
          'offset' => '4',
          'type' => '162'
        }
      },
      'Name' => 'struct pldm_entity',
      'Size' => '6',
      'Type' => 'Struct'
    },
    '237227' => {
      'BaseType' => '237165',
      'Header' => 'pdr.h',
      'Line' => '330',
      'Name' => 'pldm_entity',
      'Size' => '6',
      'Type' => 'Typedef'
    },
    '237239' => {
      'BaseType' => '237227',
      'Name' => 'pldm_entity const',
      'Size' => '6',
      'Type' => 'Const'
    },
    '237273' => {
      'BaseType' => '237285',
      'Header' => 'pdr.h',
      'Line' => '340',
      'Name' => 'pldm_entity_association_tree',
      'PrivateABI' => 1,
      'Size' => '16',
      'Type' => 'Typedef'
    },
    '237285' => {
      'Line' => '652',
      'Memb' => {
        '0' => {
          'name' => 'root',
          'offset' => '0',
          'type' => '238465'
        },
        '1' => {
          'name' => 'last_used_container_id',
          'offset' => '8',
          'type' => '162'
        }
      },
      'Name' => 'struct pldm_entity_association_tree',
      'PrivateABI' => 1,
      'Size' => '16',
      'Source' => 'pdr.c',
      'Type' => 'Struct'
    },
    '237328' => {
      'BaseType' => '237345',
      'Header' => 'pdr.h',
      'Line' => '345',
      'Name' => 'pldm_entity_node',
      'PrivateABI' => 1,
      'Size' => '40',
      'Type' => 'Typedef'
    },
    '237340' => {
      'BaseType' => '237328',
      'Name' => 'pldm_entity_node const',
      'Size' => '40',
      'Type' => 'Const'
    },
    '237345' => {
      'Line' => '657',
      'Memb' => {
        '0' => {
          'name' => 'entity',
          'offset' => '0',
          'type' => '237227'
        },
        '1' => {
          'name' => 'parent',
          'offset' => '6',
          'type' => '237227'
        },
        '2' => {
          'name' => 'remote_container_id',
          'offset' => '18',
          'type' => '162'
        },
        '3' => {
          'name' => 'first_child',
          'offset' => '22',
          'type' => '238465'
        },
        '4' => {
          'name' => 'next_sibling',
          'offset' => '36',
          'type' => '238465'
        },
        '5' => {
          'name' => 'association_type',
          'offset' => '50',
          'type' => '150'
        }
      },
      'Name' => 'struct pldm_entity_node',
      'PrivateABI' => 1,
      'Size' => '40',
      'Source' => 'pdr.c',
      'Type' => 'Struct'
    },
    '237666' => {
      'Header' => 'platform.h',
      'Line' => '593',
      'Memb' => {
        '0' => {
          'name' => 'record_handle',
          'offset' => '0',
          'type' => '174'
        },
        '1' => {
          'name' => 'version',
          'offset' => '4',
          'type' => '150'
        },
        '2' => {
          'name' => 'type',
          'offset' => '5',
          'type' => '150'
        },
        '3' => {
          'name' => 'record_change_num',
          'offset' => '6',
          'type' => '162'
        },
        '4' => {
          'name' => 'length',
          'offset' => '8',
          'type' => '162'
        }
      },
      'Name' => 'struct pldm_pdr_hdr',
      'Size' => '10',
      'Type' => 'Struct'
    },
    '238115' => {
      'Header' => 'platform.h',
      'Line' => '668',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '237666'
        },
        '1' => {
          'name' => 'terminus_handle',
          'offset' => '16',
          'type' => '162'
        },
        '2' => {
          'name' => 'sensor_id',
          'offset' => '18',
          'type' => '162'
        },
        '3' => {
          'name' => 'entity_type',
          'offset' => '20',
          'type' => '162'
        },
        '4' => {
          'name' => 'entity_instance',
          'offset' => '22',
          'type' => '162'
        },
        '5' => {
          'name' => 'container_id',
          'offset' => '24',
          'type' => '162'
        },
        '6' => {
          'name' => 'sensor_init',
          'offset' => '32',
          'type' => '150'
        },
        '7' => {
          'name' => 'sensor_auxiliary_names_pdr',
          'offset' => '33',
          'type' => '96935'
        },
        '8' => {
          'name' => 'composite_sensor_count',
          'offset' => '34',
          'type' => '150'
        },
        '9' => {
          'name' => 'possible_states',
          'offset' => '35',
          'type' => '1781'
        }
      },
      'Name' => 'struct pldm_state_sensor_pdr',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '238269' => {
      'Header' => 'platform.h',
      'Line' => '695',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '237666'
        },
        '1' => {
          'name' => 'terminus_handle',
          'offset' => '16',
          'type' => '162'
        },
        '2' => {
          'name' => 'effecter_id',
          'offset' => '18',
          'type' => '162'
        },
        '3' => {
          'name' => 'entity_type',
          'offset' => '20',
          'type' => '162'
        },
        '4' => {
          'name' => 'entity_instance',
          'offset' => '22',
          'type' => '162'
        },
        '5' => {
          'name' => 'container_id',
          'offset' => '24',
          'type' => '162'
        },
        '6' => {
          'name' => 'effecter_semantic_id',
          'offset' => '32',
          'type' => '162'
        },
        '7' => {
          'name' => 'effecter_init',
          'offset' => '34',
          'type' => '150'
        },
        '8' => {
          'name' => 'has_description_pdr',
          'offset' => '35',
          'type' => '96935'
        },
        '9' => {
          'name' => 'composite_effecter_count',
          'offset' => '36',
          'type' => '150'
        },
        '10' => {
          'name' => 'possible_states',
          'offset' => '37',
          'type' => '1781'
        }
      },
      'Name' => 'struct pldm_state_effecter_pdr',
      'Size' => '26',
      'Type' => 'Struct'
    },
    '238448' => {
      'BaseType' => '237073',
      'Name' => 'struct pldm_pdr_record*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '238460' => {
      'BaseType' => '237056',
      'Name' => 'pldm_pdr_record*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '238465' => {
      'BaseType' => '237328',
      'Name' => 'pldm_entity_node*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '238832' => {
      'BaseType' => '237273',
      'Name' => 'pldm_entity_association_tree*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '238837' => {
      'BaseType' => '237239',
      'Name' => 'pldm_entity const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '240321' => {
      'BaseType' => '236973',
      'Name' => 'pldm_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '241976' => {
      'BaseType' => '237068',
      'Name' => 'pldm_pdr_record const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '250695' => {
      'BaseType' => '237227',
      'Name' => 'pldm_entity*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '270572' => {
      'BaseType' => '250695',
      'Name' => 'pldm_entity**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '271219' => {
      'BaseType' => '238465',
      'Name' => 'pldm_entity_node**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '272008' => {
      'BaseType' => '236985',
      'Name' => 'pldm_pdr const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '277668' => {
      'BaseType' => '237340',
      'Name' => 'pldm_entity_node const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '284513' => {
      'BaseType' => '238269',
      'Name' => 'struct pldm_state_effecter_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '290204' => {
      'BaseType' => '238115',
      'Name' => 'struct pldm_state_sensor_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '295482' => {
      'BaseType' => '79',
      'Header' => 'types.h',
      'Line' => '37',
      'Name' => '__int8_t',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '295506' => {
      'BaseType' => '98',
      'Header' => 'types.h',
      'Line' => '39',
      'Name' => '__int16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '295530' => {
      'BaseType' => '117',
      'Header' => 'types.h',
      'Line' => '41',
      'Name' => '__int32_t',
      'PrivateABI' => 1,
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '295554' => {
      'BaseType' => '105',
      'Header' => 'types.h',
      'Line' => '55',
      'Name' => '__uint_least16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '295585' => {
      'BaseType' => '295482',
      'Header' => 'stdint-intn.h',
      'Line' => '24',
      'Name' => 'int8_t',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '295597' => {
      'BaseType' => '295506',
      'Header' => 'stdint-intn.h',
      'Line' => '25',
      'Name' => 'int16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '295609' => {
      'BaseType' => '295530',
      'Header' => 'stdint-intn.h',
      'Line' => '26',
      'Name' => 'int32_t',
      'PrivateABI' => 1,
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '296270' => {
      'BaseType' => '1188',
      'Header' => 'pldm_types.h',
      'Line' => '169',
      'Name' => 'real32_t',
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '297009' => {
      'BaseType' => '295554',
      'Header' => 'uchar.h',
      'Line' => '55',
      'Name' => 'char16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '297932' => {
      'Header' => 'platform.h',
      'Line' => '345',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_SENSOR_OP_STATE',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_STATE_SENSOR_STATE',
          'value' => '1'
        },
        '2' => {
          'name' => 'PLDM_NUMERIC_SENSOR_STATE',
          'value' => '2'
        }
      },
      'Name' => 'enum sensor_event_class_states',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '297966' => {
      'BaseType' => '297932',
      'Name' => 'enum sensor_event_class_states const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '298462' => {
      'Header' => 'platform.h',
      'Line' => '685',
      'Memb' => {
        '0' => {
          'name' => 'state_set_id',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'possible_states_size',
          'offset' => '2',
          'type' => '150'
        },
        '2' => {
          'name' => 'states',
          'offset' => '3',
          'type' => '298524'
        }
      },
      'Name' => 'struct state_sensor_possible_states',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '298519' => {
      'BaseType' => '298462',
      'Name' => 'struct state_sensor_possible_states const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '298524' => {
      'BaseType' => '1088',
      'Name' => 'bitfield8_t[1]',
      'Size' => '1',
      'Type' => 'Array'
    },
    '298902' => {
      'Header' => 'platform.h',
      'Line' => '786',
      'Memb' => {
        '0' => {
          'name' => 'value_u8',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'value_s8',
          'offset' => '0',
          'type' => '295585'
        },
        '2' => {
          'name' => 'value_u16',
          'offset' => '0',
          'type' => '162'
        },
        '3' => {
          'name' => 'value_s16',
          'offset' => '0',
          'type' => '295597'
        },
        '4' => {
          'name' => 'value_u32',
          'offset' => '0',
          'type' => '174'
        },
        '5' => {
          'name' => 'value_s32',
          'offset' => '0',
          'type' => '295609'
        },
        '6' => {
          'name' => 'value_f32',
          'offset' => '0',
          'type' => '296270'
        }
      },
      'Name' => 'union union_range_field_format',
      'Size' => '4',
      'Type' => 'Union'
    },
    '299501' => {
      'Header' => 'platform.h',
      'Line' => '843',
      'Memb' => {
        '0' => {
          'name' => 'value_u8',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'value_s8',
          'offset' => '0',
          'type' => '295585'
        },
        '2' => {
          'name' => 'value_u16',
          'offset' => '0',
          'type' => '162'
        },
        '3' => {
          'name' => 'value_s16',
          'offset' => '0',
          'type' => '295597'
        },
        '4' => {
          'name' => 'value_u32',
          'offset' => '0',
          'type' => '174'
        },
        '5' => {
          'name' => 'value_s32',
          'offset' => '0',
          'type' => '295609'
        }
      },
      'Name' => 'union union_sensor_data_size',
      'Size' => '4',
      'Type' => 'Union'
    },
    '299514' => {
      'Header' => 'platform.h',
      'Line' => '850',
      'Memb' => {
        '0' => {
          'name' => 'record_handle',
          'offset' => '0',
          'type' => '174'
        },
        '1' => {
          'name' => 'version',
          'offset' => '4',
          'type' => '150'
        },
        '2' => {
          'name' => 'type',
          'offset' => '5',
          'type' => '150'
        },
        '3' => {
          'name' => 'record_change_num',
          'offset' => '6',
          'type' => '162'
        },
        '4' => {
          'name' => 'length',
          'offset' => '8',
          'type' => '162'
        }
      },
      'Name' => 'struct pldm_value_pdr_hdr',
      'Size' => '12',
      'Type' => 'Struct'
    },
    '299599' => {
      'Header' => 'platform.h',
      'Line' => '868',
      'Memb' => {
        '0' => {
          'name' => 'entity_instance_num',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'entity_instance',
          'offset' => '0',
          'type' => '162'
        }
      },
      'Name' => 'anon-union-platform.h-868',
      'Size' => '2',
      'Type' => 'Union'
    },
    '299634' => {
      'Header' => 'platform.h',
      'Line' => '863',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '299514'
        },
        '1' => {
          'name' => 'terminus_handle',
          'offset' => '18',
          'type' => '162'
        },
        '2' => {
          'name' => 'sensor_id',
          'offset' => '20',
          'type' => '162'
        },
        '3' => {
          'name' => 'entity_type',
          'offset' => '22',
          'type' => '162'
        },
        '4' => {
          'name' => 'unnamed0',
          'offset' => '24',
          'type' => '299599'
        },
        '5' => {
          'name' => 'container_id',
          'offset' => '32',
          'type' => '162'
        },
        '6' => {
          'name' => 'sensor_init',
          'offset' => '34',
          'type' => '150'
        },
        '7' => {
          'name' => 'sensor_auxiliary_names_pdr',
          'offset' => '35',
          'type' => '96935'
        },
        '8' => {
          'name' => 'base_unit',
          'offset' => '36',
          'type' => '150'
        },
        '9' => {
          'name' => 'unit_modifier',
          'offset' => '37',
          'type' => '295585'
        },
        '10' => {
          'name' => 'rate_unit',
          'offset' => '38',
          'type' => '150'
        },
        '11' => {
          'name' => 'base_oem_unit_handle',
          'offset' => '39',
          'type' => '150'
        },
        '12' => {
          'name' => 'aux_unit',
          'offset' => '40',
          'type' => '150'
        },
        '13' => {
          'name' => 'aux_unit_modifier',
          'offset' => '41',
          'type' => '295585'
        },
        '14' => {
          'name' => 'aux_rate_unit',
          'offset' => '48',
          'type' => '150'
        },
        '15' => {
          'name' => 'rel',
          'offset' => '49',
          'type' => '150'
        },
        '16' => {
          'name' => 'aux_oem_unit_handle',
          'offset' => '50',
          'type' => '150'
        },
        '17' => {
          'name' => 'is_linear',
          'offset' => '51',
          'type' => '96935'
        },
        '18' => {
          'name' => 'sensor_data_size',
          'offset' => '52',
          'type' => '150'
        },
        '19' => {
          'name' => 'resolution',
          'offset' => '54',
          'type' => '296270'
        },
        '20' => {
          'name' => 'offset',
          'offset' => '64',
          'type' => '296270'
        },
        '21' => {
          'name' => 'accuracy',
          'offset' => '68',
          'type' => '162'
        },
        '22' => {
          'name' => 'plus_tolerance',
          'offset' => '70',
          'type' => '150'
        },
        '23' => {
          'name' => 'minus_tolerance',
          'offset' => '71',
          'type' => '150'
        },
        '24' => {
          'name' => 'hysteresis',
          'offset' => '72',
          'type' => '299501'
        },
        '25' => {
          'name' => 'supported_thresholds',
          'offset' => '82',
          'type' => '1088'
        },
        '26' => {
          'name' => 'threshold_and_hysteresis_volatility',
          'offset' => '83',
          'type' => '1088'
        },
        '27' => {
          'name' => 'state_transition_interval',
          'offset' => '86',
          'type' => '296270'
        },
        '28' => {
          'name' => 'update_interval',
          'offset' => '96',
          'type' => '296270'
        },
        '29' => {
          'name' => 'max_readable',
          'offset' => '100',
          'type' => '299501'
        },
        '30' => {
          'name' => 'min_readable',
          'offset' => '104',
          'type' => '299501'
        },
        '31' => {
          'name' => 'range_field_format',
          'offset' => '114',
          'type' => '150'
        },
        '32' => {
          'name' => 'range_field_support',
          'offset' => '115',
          'type' => '1088'
        },
        '33' => {
          'name' => 'nominal_value',
          'offset' => '118',
          'type' => '298902'
        },
        '34' => {
          'name' => 'normal_max',
          'offset' => '128',
          'type' => '298902'
        },
        '35' => {
          'name' => 'normal_min',
          'offset' => '132',
          'type' => '298902'
        },
        '36' => {
          'name' => 'warning_high',
          'offset' => '136',
          'type' => '298902'
        },
        '37' => {
          'name' => 'warning_low',
          'offset' => '146',
          'type' => '298902'
        },
        '38' => {
          'name' => 'critical_high',
          'offset' => '150',
          'type' => '298902'
        },
        '39' => {
          'name' => 'critical_low',
          'offset' => '256',
          'type' => '298902'
        },
        '40' => {
          'name' => 'fatal_high',
          'offset' => '260',
          'type' => '298902'
        },
        '41' => {
          'name' => 'fatal_low',
          'offset' => '264',
          'type' => '298902'
        }
      },
      'Name' => 'struct pldm_numeric_sensor_value_pdr',
      'Size' => '112',
      'Type' => 'Struct'
    },
    '300227' => {
      'BaseType' => '297009',
      'Header' => 'platform.h',
      'Line' => '911',
      'Name' => 'pldm_utf16be',
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '300240' => {
      'Header' => 'platform.h',
      'Line' => '913',
      'Memb' => {
        '0' => {
          'name' => 'tag',
          'offset' => '0',
          'type' => '7568'
        },
        '1' => {
          'name' => 'name',
          'offset' => '8',
          'type' => '300282'
        }
      },
      'Name' => 'struct pldm_entity_auxiliary_name',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '300282' => {
      'BaseType' => '300227',
      'Name' => 'pldm_utf16be*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '300287' => {
      'Header' => 'platform.h',
      'Line' => '923',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '299514'
        },
        '1' => {
          'name' => 'container',
          'offset' => '18',
          'type' => '237227'
        },
        '2' => {
          'name' => 'shared_name_count',
          'offset' => '24',
          'type' => '150'
        },
        '3' => {
          'name' => 'name_string_count',
          'offset' => '25',
          'type' => '150'
        },
        '4' => {
          'name' => 'names',
          'offset' => '36',
          'type' => '300401'
        },
        '5' => {
          'name' => 'auxiliary_name_data_size',
          'offset' => '50',
          'type' => '883'
        },
        '6' => {
          'name' => 'auxiliary_name_data',
          'offset' => '64',
          'type' => '300406'
        }
      },
      'Name' => 'struct pldm_entity_auxiliary_names_pdr',
      'Size' => '40',
      'Type' => 'Struct'
    },
    '300401' => {
      'BaseType' => '300240',
      'Name' => 'struct pldm_entity_auxiliary_name*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '300406' => {
      'BaseType' => '143',
      'Name' => 'char[]',
      'Size' => '8',
      'Type' => 'Array'
    },
    '300421' => {
      'Header' => 'platform.h',
      'Line' => '953',
      'Memb' => {
        '0' => {
          'name' => 'state_set_id',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'possible_states_size',
          'offset' => '2',
          'type' => '150'
        },
        '2' => {
          'name' => 'states',
          'offset' => '3',
          'type' => '298524'
        }
      },
      'Name' => 'struct state_effecter_possible_states',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '300478' => {
      'BaseType' => '300421',
      'Name' => 'struct state_effecter_possible_states const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '300483' => {
      'Header' => 'platform.h',
      'Line' => '977',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '299514'
        },
        '1' => {
          'name' => 'terminus_handle',
          'offset' => '18',
          'type' => '162'
        },
        '2' => {
          'name' => 'file_identifier',
          'offset' => '20',
          'type' => '162'
        },
        '3' => {
          'name' => 'container',
          'offset' => '22',
          'type' => '237227'
        },
        '4' => {
          'name' => 'superior_directory_file_identifier',
          'offset' => '34',
          'type' => '162'
        },
        '5' => {
          'name' => 'file_classification',
          'offset' => '36',
          'type' => '150'
        },
        '6' => {
          'name' => 'oem_file_classification',
          'offset' => '37',
          'type' => '150'
        },
        '7' => {
          'name' => 'file_capabilities',
          'offset' => '38',
          'type' => '77165'
        },
        '8' => {
          'name' => 'file_version',
          'offset' => '40',
          'type' => '1171'
        },
        '9' => {
          'name' => 'file_maximum_size',
          'offset' => '50',
          'type' => '174'
        },
        '10' => {
          'name' => 'file_maximum_file_descriptor_count',
          'offset' => '54',
          'type' => '150'
        },
        '11' => {
          'name' => 'file_name',
          'offset' => '64',
          'type' => '8095'
        },
        '12' => {
          'name' => 'oem_file_classification_name',
          'offset' => '86',
          'type' => '8095'
        }
      },
      'Name' => 'struct pldm_platform_file_descriptor_pdr',
      'Size' => '72',
      'Type' => 'Struct'
    },
    '300684' => {
      'Header' => 'platform.h',
      'Line' => '1023',
      'Memb' => {
        '0' => {
          'name' => 'set_request',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'effecter_state',
          'offset' => '1',
          'type' => '150'
        }
      },
      'Name' => 'struct state_field_for_state_effecter_set',
      'Size' => '2',
      'Type' => 'Struct'
    },
    '300727' => {
      'BaseType' => '300684',
      'Header' => 'platform.h',
      'Line' => '1026',
      'Name' => 'set_effecter_state_field',
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '300740' => {
      'Header' => 'platform.h',
      'Line' => '1032',
      'Memb' => {
        '0' => {
          'name' => 'sensor_op_state',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'present_state',
          'offset' => '1',
          'type' => '150'
        },
        '2' => {
          'name' => 'previous_state',
          'offset' => '2',
          'type' => '150'
        },
        '3' => {
          'name' => 'event_state',
          'offset' => '3',
          'type' => '150'
        }
      },
      'Name' => 'struct state_field_for_get_state_sensor_readings',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '300811' => {
      'BaseType' => '300740',
      'Header' => 'platform.h',
      'Line' => '1040',
      'Name' => 'get_sensor_state_field',
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '300824' => {
      'Header' => 'platform.h',
      'Line' => '1046',
      'Memb' => {
        '0' => {
          'name' => 'effecter_op_state',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'pending_state',
          'offset' => '1',
          'type' => '150'
        },
        '2' => {
          'name' => 'present_state',
          'offset' => '2',
          'type' => '150'
        }
      },
      'Name' => 'struct state_field_for_get_state_effecter_states',
      'Size' => '3',
      'Type' => 'Struct'
    },
    '300881' => {
      'BaseType' => '300824',
      'Header' => 'platform.h',
      'Line' => '1050',
      'Name' => 'get_effecter_state_field',
      'Size' => '3',
      'Type' => 'Typedef'
    },
    '301365' => {
      'Header' => 'platform.h',
      'Line' => '1125',
      'Memb' => {
        '0' => {
          'name' => 'mctp_eid',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'vendor_specific',
          'offset' => '0',
          'type' => '8095'
        }
      },
      'Name' => 'anon-union-platform.h-1125',
      'Size' => '16',
      'Type' => 'Union'
    },
    '301399' => {
      'Header' => 'platform.h',
      'Line' => '1122',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'transport_protocol_type',
          'offset' => '1',
          'type' => '150'
        },
        '2' => {
          'name' => 'event_receiver_address',
          'offset' => '8',
          'type' => '301365'
        }
      },
      'Name' => 'struct pldm_get_event_receiver_resp',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '301701' => {
      'Header' => 'platform.h',
      'Line' => '1210',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'comp_effecter_count',
          'offset' => '1',
          'type' => '150'
        },
        '2' => {
          'name' => 'field',
          'offset' => '2',
          'type' => '301758'
        }
      },
      'Name' => 'struct pldm_get_state_effecter_states_resp',
      'Size' => '26',
      'Type' => 'Struct'
    },
    '301758' => {
      'BaseType' => '300881',
      'Name' => 'get_effecter_state_field[8]',
      'Size' => '24',
      'Type' => 'Array'
    },
    '301774' => {
      'Header' => 'platform.h',
      'Line' => '1220',
      'Memb' => {
        '0' => {
          'name' => 'sensor_id',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'sensor_event_class_type',
          'offset' => '2',
          'type' => '150'
        },
        '2' => {
          'name' => 'event_class',
          'offset' => '3',
          'type' => '1781'
        }
      },
      'Name' => 'struct pldm_sensor_event_data',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '301888' => {
      'Header' => 'platform.h',
      'Line' => '1260',
      'Memb' => {
        '0' => {
          'name' => 'format_version',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'event_id',
          'offset' => '2',
          'type' => '162'
        },
        '2' => {
          'name' => 'data_transfer_handle',
          'offset' => '4',
          'type' => '174'
        }
      },
      'Name' => 'struct pldm_message_poll_event',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '301950' => {
      'Header' => 'platform.h',
      'Line' => '1270',
      'Memb' => {
        '0' => {
          'name' => 'format_version',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'format_type',
          'offset' => '1',
          'type' => '150'
        },
        '2' => {
          'name' => 'event_data_length',
          'offset' => '2',
          'type' => '162'
        },
        '3' => {
          'name' => 'event_data',
          'offset' => '4',
          'type' => '302021'
        }
      },
      'Name' => 'struct pldm_platform_cper_event',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '302021' => {
      'BaseType' => '150',
      'Name' => 'uint8_t[]',
      'Size' => '8',
      'Type' => 'Array'
    },
    '302177' => {
      'Header' => 'platform.h',
      'Line' => '1330',
      'Memb' => {
        '0' => {
          'name' => 'event_data_format',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'number_of_change_records',
          'offset' => '1',
          'type' => '150'
        },
        '2' => {
          'name' => 'change_records',
          'offset' => '2',
          'type' => '1781'
        }
      },
      'Name' => 'struct pldm_pdr_repository_chg_event_data',
      'Size' => '3',
      'Type' => 'Struct'
    },
    '302755' => {
      'Header' => 'platform.h',
      'Line' => '2844',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '299514'
        },
        '1' => {
          'name' => 'resource_id',
          'offset' => '18',
          'type' => '174'
        },
        '2' => {
          'name' => 'resource_flags',
          'offset' => '22',
          'type' => '1088'
        },
        '3' => {
          'name' => 'containing_resource_id',
          'offset' => '32',
          'type' => '174'
        },
        '4' => {
          'name' => 'proposed_containing_resource_name',
          'offset' => '36',
          'type' => '8095'
        },
        '5' => {
          'name' => 'sub_uri',
          'offset' => '64',
          'type' => '8095'
        },
        '6' => {
          'name' => 'additional_resource_id_count',
          'offset' => '86',
          'type' => '162'
        },
        '7' => {
          'name' => 'additional_resources',
          'offset' => '100',
          'type' => '8095'
        },
        '8' => {
          'name' => 'major_schema_version',
          'offset' => '128',
          'type' => '1171'
        },
        '9' => {
          'name' => 'major_schema_dictionary_length_bytes',
          'offset' => '132',
          'type' => '162'
        },
        '10' => {
          'name' => 'major_schema_dictionary_signature',
          'offset' => '136',
          'type' => '174'
        },
        '11' => {
          'name' => 'major_schema_name',
          'offset' => '150',
          'type' => '8095'
        },
        '12' => {
          'name' => 'oem_count',
          'offset' => '274',
          'type' => '162'
        },
        '13' => {
          'name' => 'oem_names',
          'offset' => '288',
          'type' => '8095'
        }
      },
      'Name' => 'struct pldm_platform_redfish_resource_pdr',
      'Size' => '136',
      'Type' => 'Struct'
    },
    '302965' => {
      'Header' => 'platform.h',
      'Line' => '2920',
      'Memb' => {
        '0' => {
          'name' => 'id',
          'offset' => '0',
          'type' => '174'
        },
        '1' => {
          'name' => 'sub_uri',
          'offset' => '8',
          'type' => '8095'
        }
      },
      'Name' => 'struct pldm_platform_redfish_resource_pdr_additional_resource',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '303006' => {
      'Header' => 'platform.h',
      'Line' => '2925',
      'Memb' => {
        '0' => {
          'name' => 'field',
          'offset' => '0',
          'type' => '8095'
        },
        '1' => {
          'name' => 'entries',
          'offset' => '22',
          'type' => '883'
        }
      },
      'Name' => 'struct pldm_platform_redfish_resource_pdr_additional_resource_iter',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '303049' => {
      'Header' => 'platform.h',
      'Line' => '3020',
      'Memb' => {
        '0' => {
          'name' => 'name',
          'offset' => '0',
          'type' => '8095'
        }
      },
      'Name' => 'struct pldm_platform_redfish_resource_pdr_oem_name',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '303078' => {
      'Header' => 'platform.h',
      'Line' => '3024',
      'Memb' => {
        '0' => {
          'name' => 'field',
          'offset' => '0',
          'type' => '8095'
        },
        '1' => {
          'name' => 'entries',
          'offset' => '22',
          'type' => '883'
        }
      },
      'Name' => 'struct pldm_platform_redfish_resource_pdr_oem_name_iter',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '303121' => {
      'Header' => 'platform.h',
      'Line' => '3114',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '299514'
        },
        '1' => {
          'name' => 'action_pdr_index',
          'offset' => '18',
          'type' => '150'
        },
        '2' => {
          'name' => 'related_resource_count',
          'offset' => '20',
          'type' => '162'
        },
        '3' => {
          'name' => 'related_resources',
          'offset' => '22',
          'type' => '8095'
        },
        '4' => {
          'name' => 'action_count',
          'offset' => '50',
          'type' => '150'
        },
        '5' => {
          'name' => 'actions',
          'offset' => '64',
          'type' => '8095'
        }
      },
      'Name' => 'struct pldm_platform_redfish_action_pdr',
      'Size' => '56',
      'Type' => 'Struct'
    },
    '303219' => {
      'Header' => 'platform.h',
      'Line' => '3174',
      'Memb' => {
        '0' => {
          'name' => 'field',
          'offset' => '0',
          'type' => '8095'
        },
        '1' => {
          'name' => 'entries',
          'offset' => '22',
          'type' => '883'
        }
      },
      'Name' => 'struct pldm_platform_redfish_action_pdr_related_resource_id_iter',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '303262' => {
      'Header' => 'platform.h',
      'Line' => '3266',
      'Memb' => {
        '0' => {
          'name' => 'name',
          'offset' => '0',
          'type' => '8095'
        },
        '1' => {
          'name' => 'path',
          'offset' => '22',
          'type' => '8095'
        }
      },
      'Name' => 'struct pldm_platform_redfish_action_pdr_action',
      'Size' => '32',
      'Type' => 'Struct'
    },
    '303305' => {
      'Header' => 'platform.h',
      'Line' => '3271',
      'Memb' => {
        '0' => {
          'name' => 'field',
          'offset' => '0',
          'type' => '8095'
        },
        '1' => {
          'name' => 'entries',
          'offset' => '22',
          'type' => '883'
        }
      },
      'Name' => 'struct pldm_platform_redfish_action_pdr_action_iter',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '309412' => {
      'BaseType' => '303305',
      'Name' => 'struct pldm_platform_redfish_action_pdr_action_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '309417' => {
      'BaseType' => '303262',
      'Name' => 'struct pldm_platform_redfish_action_pdr_action*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '310704' => {
      'BaseType' => '303219',
      'Name' => 'struct pldm_platform_redfish_action_pdr_related_resource_id_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '316818' => {
      'BaseType' => '303121',
      'Name' => 'struct pldm_platform_redfish_action_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '318435' => {
      'BaseType' => '303078',
      'Name' => 'struct pldm_platform_redfish_resource_pdr_oem_name_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '318440' => {
      'BaseType' => '303049',
      'Name' => 'struct pldm_platform_redfish_resource_pdr_oem_name*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '320447' => {
      'BaseType' => '303006',
      'Name' => 'struct pldm_platform_redfish_resource_pdr_additional_resource_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '320452' => {
      'BaseType' => '302965',
      'Name' => 'struct pldm_platform_redfish_resource_pdr_additional_resource*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '331462' => {
      'BaseType' => '302755',
      'Name' => 'struct pldm_platform_redfish_resource_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '339117' => {
      'BaseType' => '2448',
      'Name' => 'size_t*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '348121' => {
      'BaseType' => '300483',
      'Name' => 'struct pldm_platform_file_descriptor_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '348175' => {
      'BaseType' => '301950',
      'Name' => 'struct pldm_platform_cper_event*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '352595' => {
      'BaseType' => '300287',
      'Name' => 'struct pldm_entity_auxiliary_names_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '364501' => {
      'BaseType' => '301701',
      'Name' => 'struct pldm_get_state_effecter_states_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '411208' => {
      'BaseType' => '301399',
      'Name' => 'struct pldm_get_event_receiver_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '433467' => {
      'BaseType' => '301888',
      'Name' => 'struct pldm_message_poll_event*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '435152' => {
      'BaseType' => '435162',
      'Name' => 'uint32_t const*const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '435157' => {
      'BaseType' => '878',
      'Name' => 'uint32_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '435162' => {
      'BaseType' => '435157',
      'Name' => 'uint32_t const*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '435167' => {
      'BaseType' => '302177',
      'Name' => 'struct pldm_pdr_repository_chg_event_data*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '485583' => {
      'BaseType' => '299634',
      'Name' => 'struct pldm_numeric_sensor_value_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '513317' => {
      'BaseType' => '301774',
      'Name' => 'struct pldm_sensor_event_data*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '513322' => {
      'BaseType' => '513317',
      'Name' => 'struct pldm_sensor_event_data*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '518350' => {
      'BaseType' => '300811',
      'Name' => 'get_sensor_state_field*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '546334' => {
      'BaseType' => '300727',
      'Name' => 'set_effecter_state_field*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '547315' => {
      'BaseType' => '290204',
      'Name' => 'struct pldm_state_sensor_pdr*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '547320' => {
      'BaseType' => '298519',
      'Name' => 'struct state_sensor_possible_states const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '547325' => {
      'BaseType' => '547320',
      'Name' => 'struct state_sensor_possible_states const*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '547725' => {
      'BaseType' => '284513',
      'Name' => 'struct pldm_state_effecter_pdr*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '547730' => {
      'BaseType' => '300478',
      'Name' => 'struct state_effecter_possible_states const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '547735' => {
      'BaseType' => '547730',
      'Name' => 'struct state_effecter_possible_states const*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '552295' => {
      'Line' => '20',
      'Memb' => {
        '0' => {
          'name' => 'prev',
          'offset' => '0',
          'type' => '6328'
        },
        '1' => {
          'name' => 'allocations',
          'offset' => '4',
          'type' => '174'
        }
      },
      'Name' => 'struct pldm_tid_state',
      'PrivateABI' => 1,
      'Size' => '8',
      'Source' => 'instance-id.c',
      'Type' => 'Struct'
    },
    '552334' => {
      'Line' => '25',
      'Memb' => {
        '0' => {
          'name' => 'state',
          'offset' => '0',
          'type' => '552376'
        },
        '1' => {
          'name' => 'lock_db_fd',
          'offset' => '8264',
          'type' => '117'
        }
      },
      'Name' => 'struct pldm_instance_db',
      'PrivateABI' => 1,
      'Size' => '2052',
      'Source' => 'instance-id.c',
      'Type' => 'Struct'
    },
    '552376' => {
      'BaseType' => '552295',
      'Name' => 'struct pldm_tid_state[256]',
      'Size' => '2048',
      'Type' => 'Array'
    },
    '552932' => {
      'BaseType' => '552334',
      'Name' => 'struct pldm_instance_db*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '553319' => {
      'BaseType' => '6328',
      'Name' => 'pldm_instance_id_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '553495' => {
      'BaseType' => '552932',
      'Name' => 'struct pldm_instance_db**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '554027' => {
      'Header' => 'socket.h',
      'Line' => '4',
      'Memb' => {
        '0' => {
          'name' => 'size',
          'offset' => '0',
          'type' => '117'
        },
        '1' => {
          'name' => 'socket',
          'offset' => '4',
          'type' => '117'
        },
        '2' => {
          'name' => 'max_size',
          'offset' => '8',
          'type' => '117'
        }
      },
      'Name' => 'struct pldm_socket_sndbuf',
      'PrivateABI' => 1,
      'Size' => '12',
      'Type' => 'Struct'
    },
    '556002' => {
      'BaseType' => '51',
      'Header' => 'int-ll64.h',
      'Line' => '21',
      'Name' => '__u8',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '556028' => {
      'BaseType' => '58',
      'Header' => 'int-ll64.h',
      'Line' => '24',
      'Name' => '__u16',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '556497' => {
      'BaseType' => '150',
      'Header' => 'pldm.h',
      'Line' => '12',
      'Name' => 'mctp_eid_t',
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '556611' => {
      'BaseType' => '6425',
      'Header' => 'pldm.h',
      'Line' => '29',
      'Name' => 'pldm_requester_rc_t',
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '556623' => {
      'Header' => 'transport.h',
      'Line' => '17',
      'Memb' => {
        '0' => {
          'name' => 'name',
          'offset' => '0',
          'type' => '9685'
        },
        '1' => {
          'name' => 'version',
          'offset' => '8',
          'type' => '150'
        },
        '2' => {
          'name' => 'recv',
          'offset' => '22',
          'type' => '556757'
        },
        '3' => {
          'name' => 'send',
          'offset' => '36',
          'type' => '556798'
        },
        '4' => {
          'name' => 'init_pollfd',
          'offset' => '50',
          'type' => '556880'
        }
      },
      'Name' => 'struct pldm_transport',
      'PrivateABI' => 1,
      'Size' => '40',
      'Type' => 'Struct'
    },
    '556737' => {
      'BaseType' => '556623',
      'Name' => 'struct pldm_transport*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '556742' => {
      'BaseType' => '6316',
      'Name' => 'pldm_tid_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '556757' => {
      'Name' => 'pldm_requester_rc_t(*)(struct pldm_transport*, pldm_tid_t*, void**, size_t*)',
      'Param' => {
        '0' => {
          'type' => '556737'
        },
        '1' => {
          'type' => '556742'
        },
        '2' => {
          'type' => '218905'
        },
        '3' => {
          'type' => '2448'
        }
      },
      'Return' => '556611',
      'Size' => '8',
      'Type' => 'FuncPtr'
    },
    '556798' => {
      'Name' => 'pldm_requester_rc_t(*)(struct pldm_transport*, pldm_tid_t, void const*, size_t)',
      'Param' => {
        '0' => {
          'type' => '556737'
        },
        '1' => {
          'type' => '6316'
        },
        '2' => {
          'type' => '2131'
        },
        '3' => {
          'type' => '883'
        }
      },
      'Return' => '556611',
      'Size' => '8',
      'Type' => 'FuncPtr'
    },
    '556823' => {
      'BaseType' => '556828',
      'Name' => 'struct pollfd*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '556828' => {
      'Header' => 'poll.h',
      'Line' => '36',
      'Memb' => {
        '0' => {
          'name' => 'fd',
          'offset' => '0',
          'type' => '117'
        },
        '1' => {
          'name' => 'events',
          'offset' => '4',
          'type' => '98'
        },
        '2' => {
          'name' => 'revents',
          'offset' => '6',
          'type' => '98'
        }
      },
      'Name' => 'struct pollfd',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Struct'
    },
    '556880' => {
      'Name' => 'int(*)(struct pldm_transport*, struct pollfd*)',
      'Param' => {
        '0' => {
          'type' => '556737'
        },
        '1' => {
          'type' => '556823'
        }
      },
      'Return' => '117',
      'Size' => '8',
      'Type' => 'FuncPtr'
    },
    '556885' => {
      'BaseType' => '58',
      'Header' => 'socket.h',
      'Line' => '10',
      'Name' => '__kernel_sa_family_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '557260' => {
      'Header' => 'mctp.h',
      'Line' => '18',
      'Memb' => {
        '0' => {
          'name' => 's_addr',
          'offset' => '0',
          'type' => '556497'
        }
      },
      'Name' => 'struct mctp_addr',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Struct'
    },
    '557287' => {
      'Header' => 'mctp.h',
      'Line' => '22',
      'Memb' => {
        '0' => {
          'name' => 'smctp_family',
          'offset' => '0',
          'type' => '556885'
        },
        '1' => {
          'name' => '__smctp_pad0',
          'offset' => '2',
          'type' => '556028'
        },
        '2' => {
          'name' => 'smctp_network',
          'offset' => '4',
          'type' => '65'
        },
        '3' => {
          'name' => 'smctp_addr',
          'offset' => '8',
          'type' => '557260'
        },
        '4' => {
          'name' => 'smctp_type',
          'offset' => '9',
          'type' => '556002'
        },
        '5' => {
          'name' => 'smctp_tag',
          'offset' => '16',
          'type' => '556002'
        },
        '6' => {
          'name' => '__smctp_pad1',
          'offset' => '17',
          'type' => '556002'
        }
      },
      'Name' => 'struct sockaddr_mctp',
      'PrivateABI' => 1,
      'Size' => '12',
      'Type' => 'Struct'
    },
    '557392' => {
      'BaseType' => '557287',
      'Name' => 'struct sockaddr_mctp const',
      'Size' => '12',
      'Type' => 'Const'
    },
    '557397' => {
      'Header' => 'mctp.h',
      'Line' => '43',
      'Memb' => {
        '0' => {
          'name' => 'net',
          'offset' => '0',
          'type' => '65'
        },
        '1' => {
          'name' => 'eid',
          'offset' => '4',
          'type' => '556497'
        }
      },
      'Name' => 'struct mctp_fq_addr',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Struct'
    },
    '557437' => {
      'Header' => 'af-mctp-internal.h',
      'Line' => '24',
      'Memb' => {
        '0' => {
          'name' => 'transport',
          'offset' => '0',
          'type' => '556623'
        },
        '1' => {
          'name' => 'socket',
          'offset' => '64',
          'type' => '117'
        },
        '2' => {
          'name' => 'tid_map',
          'offset' => '68',
          'type' => '557530'
        },
        '3' => {
          'name' => 'socket_send_buf',
          'offset' => '8338',
          'type' => '554027'
        },
        '4' => {
          'name' => 'bound',
          'offset' => '8452',
          'type' => '6946'
        },
        '5' => {
          'name' => 'cookie_jar',
          'offset' => '8466',
          'type' => '6340'
        }
      },
      'Name' => 'struct pldm_transport_af_mctp',
      'PrivateABI' => 1,
      'Size' => '2128',
      'Type' => 'Struct'
    },
    '557530' => {
      'BaseType' => '557397',
      'Name' => 'struct mctp_fq_addr[256]',
      'Size' => '2048',
      'Type' => 'Array'
    },
    '558406' => {
      'BaseType' => '557437',
      'Name' => 'struct pldm_transport_af_mctp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '558411' => {
      'BaseType' => '557392',
      'Name' => 'struct sockaddr_mctp const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '558728' => {
      'BaseType' => '558406',
      'Name' => 'struct pldm_transport_af_mctp**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '562294' => {
      'Line' => '27',
      'Memb' => {
        '0' => {
          'name' => 'transport',
          'offset' => '0',
          'type' => '556623'
        },
        '1' => {
          'name' => 'socket',
          'offset' => '64',
          'type' => '117'
        },
        '2' => {
          'name' => 'tid_eid_map',
          'offset' => '68',
          'type' => '562362'
        },
        '3' => {
          'name' => 'socket_send_buf',
          'offset' => '768',
          'type' => '554027'
        }
      },
      'Name' => 'struct pldm_transport_mctp_demux',
      'PrivateABI' => 1,
      'Size' => '312',
      'Source' => 'mctp-demux.c',
      'Type' => 'Struct'
    },
    '562362' => {
      'BaseType' => '6316',
      'Name' => 'pldm_tid_t[256]',
      'Size' => '256',
      'Type' => 'Array'
    },
    '562899' => {
      'BaseType' => '562294',
      'Name' => 'struct pldm_transport_mctp_demux*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '563405' => {
      'BaseType' => '562899',
      'Name' => 'struct pldm_transport_mctp_demux**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '584831' => {
      'Header' => 'file_io.h',
      'Line' => '32',
      'Memb' => {
        '0' => {
          'name' => 'handle',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'length',
          'offset' => '4',
          'type' => '174'
        },
        '2' => {
          'name' => 'data',
          'offset' => '8',
          'type' => '302021'
        }
      },
      'Name' => 'struct pldm_oem_meta_file_io_write_req',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '584898' => {
      'Header' => 'file_io.h',
      'Line' => '45',
      'Memb' => {
        '0' => {
          'name' => 'transferFlag',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'offset',
          'offset' => '2',
          'type' => '162'
        }
      },
      'Name' => 'struct pldm_oem_meta_file_io_read_data_info',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '584937' => {
      'Header' => 'file_io.h',
      'Line' => '55',
      'Memb' => {
        '0' => {
          'name' => 'size',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'crc32',
          'offset' => '4',
          'type' => '174'
        }
      },
      'Name' => 'struct pldm_oem_meta_file_io_read_attr_info',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '584976' => {
      'Header' => 'file_io.h',
      'Line' => '70',
      'Memb' => {
        '0' => {
          'name' => 'data',
          'offset' => '0',
          'type' => '584898'
        }
      },
      'Name' => 'anon-union-file_io.h-70',
      'Size' => '4',
      'Type' => 'Union'
    },
    '584994' => {
      'Header' => 'file_io.h',
      'Line' => '65',
      'Memb' => {
        '0' => {
          'name' => 'version',
          'offset' => '0',
          'type' => '883'
        },
        '1' => {
          'name' => 'handle',
          'offset' => '8',
          'type' => '150'
        },
        '2' => {
          'name' => 'option',
          'offset' => '9',
          'type' => '150'
        },
        '3' => {
          'name' => 'length',
          'offset' => '16',
          'type' => '150'
        },
        '4' => {
          'name' => 'info',
          'offset' => '18',
          'type' => '584976'
        }
      },
      'Name' => 'struct pldm_oem_meta_file_io_read_req',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '585072' => {
      'Header' => 'file_io.h',
      'Line' => '86',
      'Memb' => {
        '0' => {
          'name' => 'attr',
          'offset' => '0',
          'type' => '584937'
        },
        '1' => {
          'name' => 'data',
          'offset' => '0',
          'type' => '584898'
        }
      },
      'Name' => 'anon-union-file_io.h-86',
      'Size' => '8',
      'Type' => 'Union'
    },
    '585100' => {
      'Header' => 'file_io.h',
      'Line' => '80',
      'Memb' => {
        '0' => {
          'name' => 'version',
          'offset' => '0',
          'type' => '883'
        },
        '1' => {
          'name' => 'completion_code',
          'offset' => '8',
          'type' => '150'
        },
        '2' => {
          'name' => 'handle',
          'offset' => '9',
          'type' => '150'
        },
        '3' => {
          'name' => 'option',
          'offset' => '16',
          'type' => '150'
        },
        '4' => {
          'name' => 'length',
          'offset' => '17',
          'type' => '150'
        },
        '5' => {
          'name' => 'info',
          'offset' => '18',
          'type' => '585072'
        },
        '6' => {
          'name' => 'data',
          'offset' => '32',
          'type' => '302021'
        }
      },
      'Name' => 'struct pldm_oem_meta_file_io_read_resp',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '589387' => {
      'BaseType' => '585100',
      'Name' => 'struct pldm_oem_meta_file_io_read_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '592272' => {
      'BaseType' => '584994',
      'Name' => 'struct pldm_oem_meta_file_io_read_req*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '592711' => {
      'BaseType' => '584831',
      'Name' => 'struct pldm_oem_meta_file_io_write_req*',
      'Size' => '8',
      'Type' => 'Pointer'
    }
  },
  'UndefinedSymbols' => {
    'libpldm.so.0.17.0' => {
      '_ITM_deregisterTMCloneTable' => 0,
      '_ITM_registerTMCloneTable' => 0,
      '__assert_fail@GLIBC_2.2.5' => 0,
      '__cxa_finalize@GLIBC_2.2.5' => 0,
      '__errno_location@GLIBC_2.2.5' => 0,
      '__gmon_start__' => 0,
      '__isoc23_strtol@GLIBC_2.38' => 0,
      '__memcpy_chk@GLIBC_2.3.4' => 0,
      '__recv_chk@GLIBC_2.4' => 0,
      '__recvfrom_chk@GLIBC_2.4' => 0,
      '__stack_chk_fail@GLIBC_2.4' => 0,
      'bind@GLIBC_2.2.5' => 0,
      'calloc@GLIBC_2.2.5' => 0,
      'clock_gettime@GLIBC_2.17' => 0,
      'close@GLIBC_2.2.5' => 0,
      'connect@GLIBC_2.2.5' => 0,
      'dup@GLIBC_2.2.5' => 0,
      'fclose@GLIBC_2.2.5' => 0,
      'fcntl64@GLIBC_2.28' => 0,
      'fgets@GLIBC_2.2.5' => 0,
      'fopen64@GLIBC_2.2.5' => 0,
      'free@GLIBC_2.2.5' => 0,
      'getsockopt@GLIBC_2.2.5' => 0,
      'malloc@GLIBC_2.2.5' => 0,
      'memcmp@GLIBC_2.2.5' => 0,
      'memcpy@GLIBC_2.14' => 0,
      'memmem@GLIBC_2.2.5' => 0,
      'open64@GLIBC_2.2.5' => 0,
      'poll@GLIBC_2.2.5' => 0,
      'ppoll@GLIBC_2.4' => 0,
      'recv@GLIBC_2.2.5' => 0,
      'recvmsg@GLIBC_2.2.5' => 0,
      'sendmsg@GLIBC_2.2.5' => 0,
      'sendto@GLIBC_2.2.5' => 0,
      'setsockopt@GLIBC_2.2.5' => 0,
      'socket@GLIBC_2.2.5' => 0,
      'stat64@GLIBC_2.33' => 0,
      'strlen@GLIBC_2.2.5' => 0,
      'strnlen@GLIBC_2.2.5' => 0,
      'timerfd_create@GLIBC_2.8' => 0,
      'timerfd_settime@GLIBC_2.8' => 0,
      'write@GLIBC_2.2.5' => 0
    }
  },
  'WordSize' => '8'
};
