$VAR1 = {
  'ABI_DUMPER_VERSION' => '1.4',
  'ABI_DUMP_VERSION' => '3.5',
  'Arch' => 'x86_64',
  'GccVersion' => '15.2.0',
  'Headers' => {
    'af-mctp.h' => 1,
    'base.h' => 1,
    'bcd.h' => 1,
    'bios.h' => 1,
    'bios_table.h' => 1,
    'edac.h' => 1,
    'file.h' => 1,
    'file_io.h' => 1,
    'firmware_update.h' => 1,
    'fru.h' => 1,
    'host.h' => 1,
    'instance-id.h' => 1,
    'mctp-demux.h' => 1,
    'pdr.h' => 1,
    'platform.h' => 1,
    'pldm.h' => 1,
    'pldm_types.h' => 1,
    'transport.h' => 1
  },
  'Language' => 'C',
  'LibraryName' => 'libpldm.so.0.16.0',
  'LibraryVersion' => '0.16.0',
  'NameSpaces' => {},
  'Needed' => {
    'libc.so.6' => 1
  },
  'PublicABI' => '1',
  'Sources' => {
    'bios_table.c' => 1,
    'instance-id.c' => 1,
    'mctp-demux.c' => 1,
    'pdr.c' => 1
  },
  'SymbolInfo' => {
    '186' => {
      'Header' => 'bcd.h',
      'Line' => '44',
      'Param' => {
        '0' => {
          'name' => 'dec',
          'type' => '174'
        }
      },
      'Return' => '174',
      'ShortName' => 'pldm_bcd_dec2bcd32'
    },
    '315' => {
      'Header' => 'bcd.h',
      'Line' => '38',
      'Param' => {
        '0' => {
          'name' => 'bcd',
          'type' => '174'
        }
      },
      'Return' => '174',
      'ShortName' => 'pldm_bcd_bcd2dec32'
    },
    '418' => {
      'Header' => 'bcd.h',
      'Line' => '32',
      'Param' => {
        '0' => {
          'name' => 'dec',
          'type' => '162'

      'pldm_entity_association_tree_destroy' => 1,
      'pldm_entity_association_tree_destroy_root' => 1,
      'pldm_entity_association_tree_find' => 1,
      'pldm_entity_association_tree_find_with_locality' => 1,
      'pldm_entity_association_tree_init' => 1,
      'pldm_entity_association_tree_visit' => 1,
      'pldm_entity_extract' => 1,
      'pldm_entity_get_num_children' => 1,
      'pldm_entity_get_parent' => 1,
      'pldm_entity_is_exist_parent' => 1,
      'pldm_entity_is_node_parent' => 1,
      'pldm_entity_node_get_remote_container_id' => 1,
      'pldm_find_entity_ref_in_tree' => 1,
      'pldm_instance_db_destroy' => 1,
      'pldm_instance_db_init' => 1,
      'pldm_instance_db_init_default' => 1,
      'pldm_instance_id_alloc' => 1,
      'pldm_instance_id_free' => 1,
      'pldm_is_current_parent_child' => 1,
      'pldm_is_empty_entity_assoc_tree' => 1,
      'pldm_msg_hdr_correlate_response' => 1,
      'pldm_oem_meta_file_io_read_resp_data' => 1,
      'pldm_oem_meta_file_io_write_req_data' => 1,
      'pldm_package_component_image_information_iter_init' => 1,
      'pldm_package_downstream_device_id_record_iter_init' => 1,
      'pldm_package_firmware_device_id_record_iter_init' => 1,
      'pldm_pdr_add' => 1,
      'pldm_pdr_add_fru_record_set' => 1,
      'pldm_pdr_delete_by_effecter_id' => 1,
      'pldm_pdr_delete_by_record_handle' => 1,
      'pldm_pdr_delete_by_sensor_id' => 1,
      'pldm_pdr_destroy' => 1,
      'pldm_pdr_find_last_in_range' => 1,
      'pldm_pdr_find_record' => 1,
      'pldm_pdr_find_record_by_type' => 1,
      'pldm_pdr_fru_record_set_find_by_rsi' => 1,
      'pldm_pdr_get_next_record' => 1,
      'pldm_pdr_get_record_count' => 1,
      'pldm_pdr_get_record_handle' => 1,
      'pldm_pdr_get_repo_size' => 1,
      'pldm_pdr_init' => 1,
      'pldm_pdr_record_is_remote' => 1,
      'pldm_pdr_remove_fru_record_set_by_rsi' => 1,
      'pldm_pdr_remove_pdrs_by_terminus_handle' => 1,
      'pldm_pdr_remove_remote_pdrs' => 1,
      'pldm_pdr_update_TL_pdr' => 1,
      'pldm_platform_cper_event_event_data' => 1,
      'pldm_transport_af_mctp_bind' => 1,
      'pldm_transport_af_mctp_core' => 1,
      'pldm_transport_af_mctp_destroy' => 1,
      'pldm_transport_af_mctp_init' => 1,
      'pldm_transport_af_mctp_init_pollfd' => 1,
      'pldm_transport_af_mctp_map_tid' => 1,
      'pldm_transport_af_mctp_map_tid_fqe' => 1,
      'pldm_transport_af_mctp_unmap_tid' => 1,
      'pldm_transport_af_mctp_unmap_tid_fqe' => 1,
      'pldm_transport_mctp_demux_core' => 1,
      'pldm_transport_mctp_demux_destroy' => 1,
      'pldm_transport_mctp_demux_init' => 1,
      'pldm_transport_mctp_demux_init_pollfd' => 1,
      'pldm_transport_mctp_demux_map_tid' => 1,
      'pldm_transport_mctp_demux_unmap_tid' => 1,
      'pldm_transport_poll' => 1,
      'pldm_transport_recv_msg' => 1,
      'pldm_transport_send_msg' => 1,
      'pldm_transport_send_recv_msg' => 1,
      'unpack_pldm_header' => 1
    }
  },
  'Target' => 'unix',
  'TypeInfo' => {
    '1' => {
      'Name' => 'void',
      'Type' => 'Intrinsic'
    },
    '51' => {
      'Name' => 'unsigned char',
      'Size' => '1',
      'Type' => 'Intrinsic'
    },
    '58' => {
      'Name' => 'unsigned short',
      'Size' => '2',
      'Type' => 'Intrinsic'
    },
    '65' => {
      'Name' => 'unsigned int',
      'Size' => '4',
      'Type' => 'Intrinsic'
    },
    '72' => {
      'Name' => 'unsigned long',
      'Size' => '8',
      'Type' => 'Intrinsic'
    },
    '79' => {
      'Name' => 'signed char',
      'Size' => '1',
      'Type' => 'Intrinsic'
    },
    '86' => {
      'BaseType' => '51',
      'Header' => 'types.h',
      'Line' => '38',
      'Name' => '__uint8_t',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '98' => {
      'Name' => 'short',
      'Size' => '2',
      'Type' => 'Intrinsic'
    },
    '105' => {
      'BaseType' => '58',
      'Header' => 'types.h',
      'Line' => '40',
      'Name' => '__uint16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '117' => {
      'Name' => 'int',
      'Size' => '4',
      'Type' => 'Intrinsic'
    },
    '124' => {
      'BaseType' => '65',
      'Header' => 'types.h',
      'Line' => '42',
      'Name' => '__uint32_t',
      'PrivateABI' => 1,
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '136' => {
      'Name' => 'long',
      'Size' => '8',
      'Type' => 'Intrinsic'
    },
    '143' => {
      'Name' => 'char',
      'Size' => '1',
      'Type' => 'Intrinsic'
    },
    '150' => {
      'BaseType' => '86',
      'Header' => 'stdint-uintn.h',
      'Line' => '24',
      'Name' => 'uint8_t',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '162' => {
      'BaseType' => '105',
      'Header' => 'stdint-uintn.h',
      'Line' => '25',
      'Name' => 'uint16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '174' => {
      'BaseType' => '124',
      'Header' => 'stdint-uintn.h',
      'Line' => '26',
      'Name' => 'uint32_t',
      'PrivateABI' => 1,
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '845' => {
      'BaseType' => '1',
      'Name' => 'void*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '878' => {
      'BaseType' => '174',
      'Name' => 'uint32_t const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '883' => {
      'BaseType' => '72',
      'Header' => 'stddef.h',
      'Line' => '229',
      'Name' => 'size_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '930' => {
      'Header' => 'pldm_types.h',
      'Line' => '14',
      'Name' => 'struct bits8',
      'Size' => '1',
      'Type' => 'Struct'
    },
    '1088' => {
      'Header' => 'pldm_types.h',
      'Line' => '24',
      'Memb' => {
        '0' => {
          'name' => 'byte',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'bits',
          'offset' => '0',
          'type' => '930'
        }
      },
      'Name' => 'union bitfield8_t',
      'Size' => '1',
      'Type' => 'Union'
    },
    '1100' => {
      'BaseType' => '1088',
      'Name' => 'bitfield8_t const',
      'Size' => '1',
      'Type' => 'Const'
    },
    '1105' => {
      'Header' => 'pldm_types.h',
      'Line' => '30',
      'Memb' => {
        '0' => {
          'name' => 'alpha',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'update',
          'offset' => '1',
          'type' => '150'
        },
        '2' => {
          'name' => 'minor',
          'offset' => '2',
          'type' => '150'
        },
        '3' => {
          'name' => 'major',
          'offset' => '3',
          'type' => '150'
        }
      },
      'Name' => 'struct pldm_version',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '1171' => {
      'BaseType' => '1105',
      'Header' => 'pldm_types.h',
      'Line' => '35',
      'Name' => 'ver32_t',
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '1183' => {
      'BaseType' => '1171',
      'Name' => 'ver32_t const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '1188' => {
      'Name' => 'float',
      'Size' => '4',
      'Type' => 'Intrinsic'
    },
    '1608' => {
      'Header' => 'base.h',
      'Line' => '137',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_RESPONSE',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_REQUEST',
          'value' => '1'
        },
        '2' => {
          'name' => 'PLDM_RESERVED',
          'value' => '2'
        },
        '3' => {
          'name' => 'PLDM_ASYNC_REQUEST_NOTIFY',
          'value' => '3'
        }
      },
      'Name' => 'enum MessageType',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '1620' => {
      'Header' => 'base.h',
      'Line' => '189',
      'Memb' => {
        '0' => {
          'name' => 'command',
          'offset' => '2',
          'type' => '150'
        }
      },
      'Name' => 'struct pldm_msg_hdr',
      'Size' => '3',
      'Type' => 'Struct'
    },
    '1731' => {
      'BaseType' => '1620',
      'Name' => 'struct pldm_msg_hdr const',
      'Size' => '3',
      'Type' => 'Const'
    },
    '1736' => {
      'Header' => 'base.h',
      'Line' => '216',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '1620'
        },
        '1' => {
          'name' => 'payload',
          'offset' => '3',
          'type' => '1781'
        }
      },
      'Name' => 'struct pldm_msg',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '1776' => {
      'BaseType' => '1736',
      'Name' => 'struct pldm_msg const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '1781' => {
      'BaseType' => '150',
      'Name' => 'uint8_t[1]',
      'Size' => '1',
      'Type' => 'Array'
    },
    '1797' => {
      'Header' => 'base.h',
      'Line' => '296',
      'Memb' => {
        '0' => {
          'name' => 'msg_type',
          'offset' => '0',
          'type' => '1608'
        },
        '1' => {
          'name' => 'instance',
          'offset' => '4',
          'type' => '150'
        },
        '2' => {
          'name' => 'pldm_type',
          'offset' => '5',
          'type' => '150'
        },
        '3' => {
          'name' => 'command',
          'offset' => '6',
          'type' => '150'
        },
        '4' => {
          'name' => 'completion_code',
          'offset' => '7',
          'type' => '150'
        }
      },
      'Name' => 'struct pldm_header_info',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '1875' => {
      'BaseType' => '1797',
      'Name' => 'struct pldm_header_info const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '1880' => {
      'BaseType' => '1088',
      'Name' => 'bitfield8_t[8]',
      'Size' => '8',
      'Type' => 'Array'
    },
    '1896' => {
      'Header' => 'base.h',
      'Line' => '964',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'pldm_types',
          'offset' => '1',
          'type' => '1880'
        }
      },
      'Name' => 'struct pldm_base_get_pldm_types_resp',
      'Size' => '9',
      'Type' => 'Struct'
    },
    '1935' => {
      'BaseType' => '1896',
      'Name' => 'struct pldm_base_get_pldm_types_resp const',
      'Size' => '9',
      'Type' => 'Const'
    },
    '2086' => {
      'BaseType' => '2091',
      'Name' => 'void const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2091' => {
      'BaseType' => '1',
      'Name' => 'void const',
      'Type' => 'Const'
    },
    '2092' => {
      'BaseType' => '1100',
      'Name' => 'bitfield8_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2267' => {
      'BaseType' => '1736',
      'Name' => 'struct pldm_msg*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2346' => {
      'BaseType' => '1776',
      'Name' => 'struct pldm_msg const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2351' => {
      'BaseType' => '150',
      'Name' => 'uint8_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2356' => {
      'BaseType' => '1171',
      'Name' => 'ver32_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2398' => {
      'BaseType' => '1935',
      'Name' => 'struct pldm_base_get_pldm_types_resp const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2403' => {
      'BaseType' => '883',
      'Name' => 'size_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2460' => {
      'BaseType' => '1183',
      'Name' => 'ver32_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2507' => {
      'BaseType' => '174',
      'Name' => 'uint32_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2576' => {
      'BaseType' => '1731',
      'Name' => 'struct pldm_msg_hdr const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2581' => {
      'BaseType' => '1797',
      'Name' => 'struct pldm_header_info*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '3991' => {
      'BaseType' => '1875',
      'Name' => 'struct pldm_header_info const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '5519' => {
      'BaseType' => '150',
      'Name' => 'uint8_t const',
      'Size' => '1',
      'Type' => 'Const'
    },
    '5765' => {
      'BaseType' => '5519',
      'Name' => 'uint8_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '6303' => {
      'BaseType' => '150',
      'Header' => 'base.h',
      'Line' => '19',
      'Name' => 'pldm_tid_t',
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '6315' => {
      'BaseType' => '150',
      'Header' => 'instance-id.h',
      'Line' => '12',
      'Name' => 'pldm_instance_id_t',
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '6327' => {
      'Header' => 'responder.h',
      'Line' => '9',
      'Memb' => {
        '0' => {
          'name' => 'tid',
          'offset' => '0',
          'type' => '6303'
        },
        '1' => {
          'name' => 'instance_id',
          'offset' => '1',
          'type' => '6315'
        },
        '2' => {
          'name' => 'type',
          'offset' => '2',
          'type' => '150'
        },
        '3' => {
          'name' => 'command',
          'offset' => '3',
          'type' => '150'
        },
        '4' => {
          'name' => 'next',
          'offset' => '8',
          'type' => '6407'
        }
      },
      'Name' => 'struct pldm_responder_cookie',
      'PrivateABI' => 1,
      'Size' => '16',
      'Type' => 'Struct'
    },
    '6407' => {
      'BaseType' => '6327',
      'Name' => 'struct pldm_responder_cookie*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '6412' => {
      'Header' => 'pldm.h',
      'Line' => '14',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_REQUESTER_SUCCESS',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_REQUESTER_OPEN_FAIL',
          'value' => '18446744073709551615 (-1)'
        },
        '2' => {
          'name' => 'PLDM_REQUESTER_NOT_PLDM_MSG',
          'value' => '18446744073709551614 (-2)'
        },
        '3' => {
          'name' => 'PLDM_REQUESTER_NOT_RESP_MSG',
          'value' => '18446744073709551613 (-3)'
        },
        '4' => {
          'name' => 'PLDM_REQUESTER_NOT_REQ_MSG',
          'value' => '18446744073709551612 (-4)'
        },
        '5' => {
          'name' => 'PLDM_REQUESTER_RESP_MSG_TOO_SMALL',
          'value' => '18446744073709551611 (-5)'
        },
        '6' => {
          'name' => 'PLDM_REQUESTER_INSTANCE_ID_MISMATCH',
          'value' => '18446744073709551610 (-6)'
        },
        '7' => {
          'name' => 'PLDM_REQUESTER_SEND_FAIL',
          'value' => '18446744073709551609 (-7)'
        },
        '8' => {
          'name' => 'PLDM_REQUESTER_RECV_FAIL',
          'value' => '18446744073709551608 (-8)'
        },
        '9' => {
          'name' => 'PLDM_REQUESTER_INVALID_RECV_LEN',
          'value' => '18446744073709551607 (-9)'
        },
        '10' => {
          'name' => 'PLDM_REQUESTER_SETUP_FAIL',
          'value' => '18446744073709551606 (-10)'
        },
        '11' => {
          'name' => 'PLDM_REQUESTER_INVALID_SETUP',
          'value' => '18446744073709551605 (-11)'
        },
        '12' => {
          'name' => 'PLDM_REQUESTER_POLL_FAIL',
          'value' => '18446744073709551604 (-12)'
        },
        '13' => {
          'name' => 'PLDM_REQUESTER_TRANSPORT_BUSY',
          'value' => '18446744073709551603 (-13)'
        }
      },
      'Name' => 'enum pldm_requester_error_codes',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '6933' => {
      'Name' => '_Bool',
      'Size' => '1',
      'Type' => 'Intrinsic'
    },
    '7555' => {
      'BaseType' => '143',
      'Name' => 'char*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '7567' => {
      'BaseType' => '143',
      'Name' => 'char const',
      'Size' => '1',
      'Type' => 'Const'
    },
    '7711' => {
      'BaseType' => '136',
      'Header' => 'types.h',
      'Line' => '194',
      'Name' => '__ssize_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '7752' => {
      'BaseType' => '162',
      'Name' => 'uint16_t const',
      'Size' => '2',
      'Type' => 'Const'
    },
    '8082' => {
      'Header' => 'pldm_types.h',
      'Line' => '177',
      'Memb' => {
        '0' => {
          'name' => 'ptr',
          'offset' => '0',
          'type' => '5765'
        },
        '1' => {
          'name' => 'length',
          'offset' => '8',
          'type' => '883'
        }
      },
      'Name' => 'struct variable_field',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '8126' => {
      'BaseType' => '7711',
      'Header' => 'types.h',
      'Line' => '108',
      'Name' => 'ssize_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '9308' => {
      'Header' => 'base.h',
      'Line' => '404',
      'Memb' => {
        '0' => {
          'name' => 'pldm_type',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'transfer_opflag',
          'offset' => '1',
          'type' => '150'
        },
        '2' => {
          'name' => 'transfer_ctx',
          'offset' => '4',
          'type' => '174'
        },
        '3' => {
          'name' => 'transfer_handle',
          'offset' => '8',
          'type' => '174'
        },
        '4' => {
          'name' => 'section_offset',
          'offset' => '18',
          'type' => '174'
        },
        '5' => {
          'name' => 'section_length',
          'offset' => '22',
          'type' => '174'
        }
      },
      'Name' => 'struct pldm_base_multipart_receive_req',
      'Size' => '20',
      'Type' => 'Struct'
    },
    '9399' => {
      'BaseType' => '9308',
      'Name' => 'struct pldm_base_multipart_receive_req const',
      'Size' => '20',
      'Type' => 'Const'
    },
    '9404' => {
      'Header' => 'base.h',
      'Line' => '422',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'transfer_flag',
          'offset' => '1',
          'type' => '150'
        },
        '2' => {
          'name' => 'next_transfer_handle',
          'offset' => '4',
          'type' => '174'
        },
        '3' => {
          'name' => 'data',
          'offset' => '8',
          'type' => '8082'
        }
      },
      'Name' => 'struct pldm_base_multipart_receive_resp',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '9474' => {
      'Header' => 'base.h',
      'Line' => '434',
      'Memb' => {
        '0' => {
          'name' => 'requester_part_size',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'requester_protocol_support',
          'offset' => '2',
          'type' => '1880'
        }
      },
      'Name' => 'struct pldm_base_negotiate_transfer_params_req',
      'Size' => '10',
      'Type' => 'Struct'
    },
    '9513' => {
      'BaseType' => '9474',
      'Name' => 'struct pldm_base_negotiate_transfer_params_req const',
      'Size' => '10',
      'Type' => 'Const'
    },
    '9534' => {
      'Header' => 'base.h',
      'Line' => '443',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'responder_part_size',
          'offset' => '2',
          'type' => '162'
        },
        '2' => {
          'name' => 'responder_protocol_support',
          'offset' => '4',
          'type' => '1880'
        }
      },
      'Name' => 'struct pldm_base_negotiate_transfer_params_resp',
      'Size' => '12',
      'Type' => 'Struct'
    },
    '9667' => {
      'BaseType' => '7567',
      'Name' => 'char const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '11268' => {
      'BaseType' => '1896',
      'Name' => 'struct pldm_base_get_pldm_types_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '14922' => {
      'BaseType' => '9534',
      'Name' => 'struct pldm_base_negotiate_transfer_params_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '20413' => {
      'BaseType' => '9513',
      'Name' => 'struct pldm_base_negotiate_transfer_params_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '40469' => {
      'BaseType' => '9404',
      'Name' => 'struct pldm_base_multipart_receive_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '43218' => {
      'BaseType' => '9399',
      'Name' => 'struct pldm_base_multipart_receive_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '49069' => {
      'BaseType' => '1088',
      'Name' => 'bitfield8_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '50510' => {
      'BaseType' => '1620',
      'Name' => 'struct pldm_msg_hdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '54816' => {
      'BaseType' => '8082',
      'Name' => 'struct variable_field*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '56898' => {
      'BaseType' => '162',
      'Name' => 'uint16_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '60196' => {
      'BaseType' => '72',
      'Header' => 'types.h',
      'Line' => '45',
      'Name' => '__uint64_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '60273' => {
      'BaseType' => '60196',
      'Header' => 'stdint-uintn.h',
      'Line' => '27',
      'Name' => 'uint64_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '60543' => {
      'Header' => 'bios.h',
      'Line' => '50',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_BIOS_STRING_TABLE',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_BIOS_ATTR_TABLE',
          'value' => '1'
        },
        '2' => {
          'name' => 'PLDM_BIOS_ATTR_VAL_TABLE',
          'value' => '2'
        }
      },
      'Name' => 'enum pldm_bios_table_types',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '60577' => {
      'Header' => 'bios.h',
      'Line' => '56',
      'Memb' => {
        '0' => {
          'name' => 'string_handle',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'string_length',
          'offset' => '2',
          'type' => '162'
        },
        '2' => {
          'name' => 'name',
          'offset' => '4',
          'type' => '60634'
        }
      },
      'Name' => 'struct pldm_bios_string_table_entry',
      'Size' => '5',
      'Type' => 'Struct'
    },
    '60629' => {
      'BaseType' => '60577',
      'Name' => 'struct pldm_bios_string_table_entry const',
      'Size' => '5',
      'Type' => 'Const'
    },
    '60634' => {
      'BaseType' => '143',
      'Name' => 'char[1]',
      'Size' => '1',
      'Type' => 'Array'
    },
    '60650' => {
      'Header' => 'bios.h',
      'Line' => '62',
      'Memb' => {
        '0' => {
          'name' => 'attr_handle',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'attr_type',
          'offset' => '2',
          'type' => '150'
        },
        '2' => {
          'name' => 'string_handle',
          'offset' => '3',
          'type' => '162'
        },
        '3' => {
          'name' => 'metadata',
          'offset' => '5',
          'type' => '1781'
        }
      },
      'Name' => 'struct pldm_bios_attr_table_entry',
      'Size' => '6',
      'Type' => 'Struct'
    },
    '60715' => {
      'BaseType' => '60650',
      'Name' => 'struct pldm_bios_attr_table_entry const',
      'Size' => '6',
      'Type' => 'Const'
    },
    '60720' => {
      'Header' => 'bios.h',
      'Line' => '74',
      'Memb' => {
        '0' => {
          'name' => 'attr_handle',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'attr_type',
          'offset' => '2',
          'type' => '150'
        },
        '2' => {
          'name' => 'value',
          'offset' => '3',
          'type' => '1781'
        }
      },
      'Name' => 'struct pldm_bios_attr_val_table_entry',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '60772' => {
      'BaseType' => '60720',
      'Name' => 'struct pldm_bios_attr_val_table_entry const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '60841' => {
      'Header' => 'bios_table.h',
      'Line' => '205',
      'Memb' => {
        '0' => {
          'name' => 'name_handle',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'read_only',
          'offset' => '2',
          'type' => '6933'
        },
        '2' => {
          'name' => 'pv_num',
          'offset' => '3',
          'type' => '150'
        },
        '3' => {
          'name' => 'pv_handle',
          'offset' => '8',
          'type' => '60944'
        },
        '4' => {
          'name' => 'def_num',
          'offset' => '22',
          'type' => '150'
        },
        '5' => {
          'name' => 'def_index',
          'offset' => '36',
          'type' => '5765'
        }
      },
      'Name' => 'struct pldm_bios_table_attr_entry_enum_info',
      'Size' => '32',
      'Type' => 'Struct'
    },
    '60932' => {
      'BaseType' => '60841',
      'Name' => 'struct pldm_bios_table_attr_entry_enum_info const',
      'Size' => '32',
      'Type' => 'Const'
    },
    '60944' => {
      'BaseType' => '7752',
      'Name' => 'uint16_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '60949' => {
      'Header' => 'bios_table.h',
      'Line' => '293',
      'Memb' => {
        '0' => {
          'name' => 'name_handle',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'read_only',
          'offset' => '2',
          'type' => '6933'
        },
        '2' => {
          'name' => 'string_type',
          'offset' => '3',
          'type' => '150'
        },
        '3' => {
          'name' => 'min_length',
          'offset' => '4',
          'type' => '162'
        },
        '4' => {
          'name' => 'max_length',
          'offset' => '6',
          'type' => '162'
        },
        '5' => {
          'name' => 'def_length',
          'offset' => '8',
          'type' => '162'
        },
        '6' => {
          'name' => 'def_string',
          'offset' => '22',
          'type' => '9667'
        }
      },
      'Name' => 'struct pldm_bios_table_attr_entry_string_info',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '61061' => {
      'BaseType' => '60949',
      'Name' => 'struct pldm_bios_table_attr_entry_string_info const',
      'Size' => '24',
      'Type' => 'Const'
    },
    '61071' => {
      'Header' => 'bios_table.h',
      'Line' => '383',
      'Memb' => {
        '0' => {
          'name' => 'name_handle',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'read_only',
          'offset' => '2',
          'type' => '6933'
        },
        '2' => {
          'name' => 'lower_bound',
          'offset' => '8',
          'type' => '60273'
        },
        '3' => {
          'name' => 'upper_bound',
          'offset' => '22',
          'type' => '60273'
        },
        '4' => {
          'name' => 'scalar_increment',
          'offset' => '36',
          'type' => '174'
        },
        '5' => {
          'name' => 'default_value',
          'offset' => '50',
          'type' => '60273'
        }
      },
      'Name' => 'struct pldm_bios_table_attr_entry_integer_info',
      'Size' => '40',
      'Type' => 'Struct'
    },
    '61169' => {
      'BaseType' => '61071',
      'Name' => 'struct pldm_bios_table_attr_entry_integer_info const',
      'Size' => '40',
      'Type' => 'Const'
    },
    '61436' => {
      'Name' => 'ssize_t(*)(void const*)',
      'Param' => {
        '0' => {
          'type' => '2086'
        }
      },
      'Return' => '8126',
      'Size' => '8',
      'Type' => 'FuncPtr'
    },
    '61506' => {
      'Line' => '958',
      'Memb' => {
        '0' => {
          'name' => 'table_data',
          'offset' => '0',
          'type' => '5765'
        },
        '1' => {
          'name' => 'table_len',
          'offset' => '8',
          'type' => '883'
        },
        '2' => {
          'name' => 'current_pos',
          'offset' => '22',
          'type' => '883'
        },
        '3' => {
          'name' => 'entry_length_handler',
          'offset' => '36',
          'type' => '61436'
        }
      },
      'Name' => 'struct pldm_bios_table_iter',
      'PrivateABI' => 1,
      'Size' => '32',
      'Source' => 'bios_table.c',
      'Type' => 'Struct'
    },
    '61576' => {
      'BaseType' => '61506',
      'Name' => 'struct pldm_bios_table_iter const',
      'Size' => '32',
      'Type' => 'Const'
    },
    '62646' => {
      'BaseType' => '61506',
      'Name' => 'struct pldm_bios_table_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '62651' => {
      'BaseType' => '60772',
      'Name' => 'struct pldm_bios_attr_val_table_entry const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '63065' => {
      'BaseType' => '60715',
      'Name' => 'struct pldm_bios_attr_table_entry const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '63668' => {
      'BaseType' => '60629',
      'Name' => 'struct pldm_bios_string_table_entry const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '64831' => {
      'BaseType' => '61576',
      'Name' => 'struct pldm_bios_table_iter const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '69014' => {
      'BaseType' => '60273',
      'Name' => 'uint64_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '69291' => {
      'BaseType' => '61169',
      'Name' => 'struct pldm_bios_table_attr_entry_integer_info const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '69558' => {
      'BaseType' => '9667',
      'Name' => 'char const**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '70687' => {
      'BaseType' => '61061',
      'Name' => 'struct pldm_bios_table_attr_entry_string_info const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '72142' => {
      'BaseType' => '60932',
      'Name' => 'struct pldm_bios_table_attr_entry_enum_info const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '74307' => {
      'Header' => 'pldm_types.h',
      'Line' => '41',
      'Name' => 'struct bits16',
      'Size' => '2',
      'Type' => 'Struct'
    },
    '74577' => {
      'Header' => 'pldm_types.h',
      'Line' => '59',
      'Memb' => {
        '0' => {
          'name' => 'value',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'bits',
          'offset' => '0',
          'type' => '74307'
        }
      },
      'Name' => 'union bitfield16_t',
      'Size' => '2',
      'Type' => 'Union'
    },
    '75314' => {
      'Header' => 'file.h',
      'Line' => '52',
      'Memb' => {
        '0' => {
          'name' => 'file_identifier',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'file_attribute',
          'offset' => '2',
          'type' => '74577'
        }
      },
      'Name' => 'struct pldm_file_df_open_req',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '75354' => {
      'BaseType' => '75314',
      'Name' => 'struct pldm_file_df_open_req const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '75359' => {
      'Header' => 'file.h',
      'Line' => '61',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'file_descriptor',
          'offset' => '2',
          'type' => '162'
        }
      },
      'Name' => 'struct pldm_file_df_open_resp',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '75404' => {
      'Header' => 'file.h',
      'Line' => '70',
      'Memb' => {
        '0' => {
          'name' => 'file_descriptor',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'df_close_options',
          'offset' => '2',
          'type' => '74577'
        }
      },
      'Name' => 'struct pldm_file_df_close_req',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '75444' => {
      'BaseType' => '75404',
      'Name' => 'struct pldm_file_df_close_req const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '75449' => {
      'Header' => 'file.h',
      'Line' => '79',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '150'
        }
      },
      'Name' => 'struct pldm_file_df_close_resp',
      'Size' => '1',
      'Type' => 'Struct'
    },
    '75481' => {
      'Header' => 'file.h',
      'Line' => '87',
      'Memb' => {
        '0' => {
          'name' => 'file_descriptor',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'requester_max_interval',
          'offset' => '4',
          'type' => '174'
        }
      },
      'Name' => 'struct pldm_file_df_heartbeat_req',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '75521' => {
      'BaseType' => '75481',
      'Name' => 'struct pldm_file_df_heartbeat_req const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '75526' => {
      'Header' => 'file.h',
      'Line' => '96',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'responder_max_interval',
          'offset' => '4',
          'type' => '174'
        }
      },
      'Name' => 'struct pldm_file_df_heartbeat_resp',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '80229' => {
      'BaseType' => '75526',
      'Name' => 'struct pldm_file_df_heartbeat_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '81799' => {
      'BaseType' => '75521',
      'Name' => 'struct pldm_file_df_heartbeat_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '81925' => {
      'BaseType' => '75449',
      'Name' => 'struct pldm_file_df_close_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '86216' => {
      'BaseType' => '75444',
      'Name' => 'struct pldm_file_df_close_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '87966' => {
      'BaseType' => '75359',
      'Name' => 'struct pldm_file_df_open_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '92552' => {
      'BaseType' => '75354',
      'Name' => 'struct pldm_file_df_open_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '94335' => {
      'BaseType' => '883',
      'Name' => 'size_t const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '94347' => {
      'BaseType' => '150',
      'Header' => 'pldm_types.h',
      'Line' => '37',
      'Name' => 'bool8_t',
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '94639' => {
      'Header' => 'pldm_types.h',
      'Line' => '63',
      'Name' => 'struct bits32',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '95131' => {
      'Header' => 'pldm_types.h',
      'Line' => '97',
      'Memb' => {
        '0' => {
          'name' => 'value',
          'offset' => '0',
          'type' => '174'
        },
        '1' => {
          'name' => 'bits',
          'offset' => '0',
          'type' => '94639'
        }
      },
      'Name' => 'union bitfield32_t',
      'Size' => '4',
      'Type' => 'Union'
    },
    '95143' => {
      'Header' => 'pldm_types.h',
      'Line' => '101',
      'Name' => 'struct bits64',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '96083' => {
      'Header' => 'pldm_types.h',
      'Line' => '167',
      'Memb' => {
        '0' => {
          'name' => 'value',
          'offset' => '0',
          'type' => '60273'
        },
        '1' => {
          'name' => 'bits',
          'offset' => '0',
          'type' => '95143'
        }
      },
      'Name' => 'union bitfield64_t',
      'Size' => '8',
      'Type' => 'Union'
    },
    '96102' => {
      'BaseType' => '96114',
      'Header' => 'pldm_types.h',
      'Line' => '171',
      'Name' => 'pldm_uuid',
      'Size' => '16',
      'Type' => 'Typedef'
    },
    '96114' => {
      'BaseType' => '150',
      'Name' => 'uint8_t[16]',
      'Size' => '16',
      'Type' => 'Array'
    },
    '96130' => {
      'BaseType' => '96114',
      'Name' => 'uint8_t[16] const',
      'Size' => '16',
      'Type' => 'Const'
    },
    '96174' => {
      'BaseType' => '8082',
      'Name' => 'struct variable_field const',
      'Size' => '16',
      'Type' => 'Const'
    },
    '98306' => {
      'BaseType' => '150',
      'Name' => 'uint8_t[8]',
      'Size' => '8',
      'Type' => 'Array'
    },
    '98322' => {
      'Header' => 'firmware_update.h',
      'Line' => '465',
      'Memb' => {
        '0' => {
          'name' => 'uuid',
          'offset' => '0',
          'type' => '96114'
        },
        '1' => {
          'name' => 'package_header_format_version',
          'offset' => '22',
          'type' => '150'
        },
        '2' => {
          'name' => 'package_header_size',
          'offset' => '23',
          'type' => '162'
        },
        '3' => {
          'name' => 'package_release_date_time',
          'offset' => '25',
          'type' => '98435'
        },
        '4' => {
          'name' => 'component_bitmap_bit_length',
          'offset' => '50',
          'type' => '162'
        },
        '5' => {
          'name' => 'package_version_string_type',
          'offset' => '52',
          'type' => '150'
        },
        '6' => {
          'name' => 'package_version_string_length',
          'offset' => '53',
          'type' => '150'
        }
      },
      'Name' => 'struct pldm_package_header_information',
      'Size' => '36',
      'Type' => 'Struct'
    },
    '98435' => {
      'BaseType' => '150',
      'Name' => 'uint8_t[13]',
      'Size' => '13',
      'Type' => 'Array'
    },
    '98451' => {
      'Header' => 'firmware_update.h',
      'Line' => '479',
      'Memb' => {
        '0' => {
          'name' => 'record_length',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'descriptor_count',
          'offset' => '2',
          'type' => '150'
        },
        '2' => {
          'name' => 'device_update_option_flags',
          'offset' => '3',
          'type' => '95131'
        },
        '3' => {
          'name' => 'comp_image_set_version_string_type',
          'offset' => '7',
          'type' => '150'
        },
        '4' => {
          'name' => 'comp_image_set_version_string_length',
          'offset' => '8',
          'type' => '150'
        },
        '5' => {
          'name' => 'fw_device_pkg_data_length',
          'offset' => '9',
          'type' => '162'
        }
      },
      'Name' => 'struct pldm_firmware_device_id_record',
      'Size' => '11',
      'Type' => 'Struct'
    },
    '98664' => {
      'Header' => 'firmware_update.h',
      'Line' => '513',
      'Memb' => {
        '0' => {
          'name' => 'comp_classification',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'comp_identifier',
          'offset' => '2',
          'type' => '162'
        },
        '2' => {
          'name' => 'comp_comparison_stamp',
          'offset' => '4',
          'type' => '174'
        },
        '3' => {
          'name' => 'comp_options',
          'offset' => '8',
          'type' => '74577'
        },
        '4' => {
          'name' => 'requested_comp_activation_method',
          'offset' => '16',
          'type' => '74577'
        },
        '5' => {
          'name' => 'comp_location_offset',
          'offset' => '18',
          'type' => '174'
        },
        '6' => {
          'name' => 'comp_size',
          'offset' => '22',
          'type' => '174'
        },
        '7' => {
          'name' => 'comp_version_string_type',
          'offset' => '32',
          'type' => '150'
        },
        '8' => {
          'name' => 'comp_version_string_length',
          'offset' => '33',
          'type' => '150'
        }
      },
      'Name' => 'struct pldm_component_image_information',
      'Size' => '22',
      'Type' => 'Struct'
    },
    '98862' => {
      'Header' => 'firmware_update.h',
      'Line' => '539',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'capabilities_during_update',
          'offset' => '1',
          'type' => '95131'
        },
        '2' => {
          'name' => 'comp_count',
          'offset' => '5',
          'type' => '162'
        },
        '3' => {
          'name' => 'active_comp_image_set_ver_str_type',
          'offset' => '7',
          'type' => '150'
        },
        '4' => {
          'name' => 'active_comp_image_set_ver_str_len',
          'offset' => '8',
          'type' => '150'
        },
        '5' => {
          'name' => 'pending_comp_image_set_ver_str_type',
          'offset' => '9',
          'type' => '150'
        },
        '6' => {
          'name' => 'pending_comp_image_set_ver_str_len',
          'offset' => '16',
          'type' => '150'
        }
      },
      'Name' => 'struct pldm_get_firmware_parameters_resp',
      'Size' => '11',
      'Type' => 'Struct'
    },
    '99065' => {
      'Header' => 'firmware_update.h',
      'Line' => '567',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'downstream_device_update_supported',
          'offset' => '1',
          'type' => '150'
        },
        '2' => {
          'name' => 'number_of_downstream_devices',
          'offset' => '2',
          'type' => '162'
        },
        '3' => {
          'name' => 'max_number_of_downstream_devices',
          'offset' => '4',
          'type' => '162'
        },
        '4' => {
          'name' => 'capabilities',
          'offset' => '8',
          'type' => '95131'
        }
      },
      'Name' => 'struct pldm_query_downstream_devices_resp',
      'Size' => '12',
      'Type' => 'Struct'
    },
    '99150' => {
      'Header' => 'firmware_update.h',
      'Line' => '579',
      'Memb' => {
        '0' => {
          'name' => 'comp_classification',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'comp_identifier',
          'offset' => '2',
          'type' => '162'
        },
        '2' => {
          'name' => 'comp_classification_index',
          'offset' => '4',
          'type' => '150'
        },
        '3' => {
          'name' => 'active_comp_comparison_stamp',
          'offset' => '5',
          'type' => '174'
        },
        '4' => {
          'name' => 'active_comp_ver_str_type',
          'offset' => '9',
          'type' => '150'
        },
        '5' => {
          'name' => 'active_comp_ver_str_len',
          'offset' => '16',
          'type' => '150'
        },
        '6' => {
          'name' => 'active_comp_release_date',
          'offset' => '17',
          'type' => '98306'
        },
        '7' => {
          'name' => 'pending_comp_comparison_stamp',
          'offset' => '25',
          'type' => '174'
        },
        '8' => {
          'name' => 'pending_comp_ver_str_type',
          'offset' => '35',
          'type' => '150'
        },
        '9' => {
          'name' => 'pending_comp_ver_str_len',
          'offset' => '36',
          'type' => '150'
        },
        '10' => {
          'name' => 'pending_comp_release_date',
          'offset' => '37',
          'type' => '98306'
        },
        '11' => {
          'name' => 'comp_activation_methods',
          'offset' => '51',
          'type' => '74577'
        },
        '12' => {
          'name' => 'capabilities_during_update',
          'offset' => '53',
          'type' => '95131'
        }
      },
      'Name' => 'struct pldm_component_parameter_entry',
      'Size' => '39',
      'Type' => 'Struct'
    },
    '99465' => {
      'Header' => 'firmware_update.h',
      'Line' => '618',
      'Memb' => {
        '0' => {
          'name' => 'data_transfer_handle',
          'offset' => '0',
          'type' => '174'
        },
        '1' => {
          'name' => 'transfer_operation_flag',
          'offset' => '4',
          'type' => '150'
        }
      },
      'Name' => 'struct pldm_query_downstream_identifiers_req',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '99508' => {
      'BaseType' => '99465',
      'Name' => 'struct pldm_query_downstream_identifiers_req const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '99513' => {
      'Header' => 'firmware_update.h',
      'Line' => '632',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'next_data_transfer_handle',
          'offset' => '4',
          'type' => '174'
        },
        '2' => {
          'name' => 'transfer_flag',
          'offset' => '8',
          'type' => '150'
        },
        '3' => {
          'name' => 'downstream_devices_length',
          'offset' => '18',
          'type' => '174'
        },
        '4' => {
          'name' => 'number_of_downstream_devices',
          'offset' => '22',
          'type' => '162'
        }
      },
      'Name' => 'struct pldm_query_downstream_identifiers_resp',
      'Size' => '20',
      'Type' => 'Struct'
    },
    '99598' => {
      'Header' => 'firmware_update.h',
      'Line' => '645',
      'Memb' => {
        '0' => {
          'name' => 'downstream_device_index',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'downstream_descriptor_count',
          'offset' => '2',
          'type' => '150'
        }
      },
      'Name' => 'struct pldm_downstream_device',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '99641' => {
      'Header' => 'firmware_update.h',
      'Line' => '651',
      'Memb' => {
        '0' => {
          'name' => 'field',
          'offset' => '0',
          'type' => '8082'
        },
        '1' => {
          'name' => 'devs',
          'offset' => '22',
          'type' => '883'
        }
      },
      'Name' => 'struct pldm_downstream_device_iter',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '99684' => {
      'Header' => 'firmware_update.h',
      'Line' => '725',
      'Memb' => {
        '0' => {
          'name' => 'descriptor_type',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'descriptor_length',
          'offset' => '2',
          'type' => '162'
        },
        '2' => {
          'name' => 'descriptor_data',
          'offset' => '8',
          'type' => '2086'
        }
      },
      'Name' => 'struct pldm_descriptor',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '99757' => {
      'Header' => 'firmware_update.h',
      'Line' => '731',
      'Memb' => {
        '0' => {
          'name' => 'field',
          'offset' => '0',
          'type' => '54816'
        },
        '1' => {
          'name' => 'count',
          'offset' => '8',
          'type' => '883'
        }
      },
      'Name' => 'struct pldm_descriptor_iter',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '99805' => {
      'Header' => 'firmware_update.h',
      'Line' => '824',
      'Memb' => {
        '0' => {
          'name' => 'data_transfer_handle',
          'offset' => '0',
          'type' => '174'
        },
        '1' => {
          'name' => 'transfer_operation_flag',
          'offset' => '4',
          'type' => '150'
        }
      },
      'Name' => 'struct pldm_get_downstream_firmware_parameters_req',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '99848' => {
      'BaseType' => '99805',
      'Name' => 'struct pldm_get_downstream_firmware_parameters_req const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '99853' => {
      'Header' => 'firmware_update.h',
      'Line' => '839',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'next_data_transfer_handle',
          'offset' => '4',
          'type' => '174'
        },
        '2' => {
          'name' => 'transfer_flag',
          'offset' => '8',
          'type' => '150'
        },
        '3' => {
          'name' => 'fdp_capabilities_during_update',
          'offset' => '18',
          'type' => '95131'
        },
        '4' => {
          'name' => 'downstream_device_count',
          'offset' => '22',
          'type' => '162'
        }
      },
      'Name' => 'struct pldm_get_downstream_firmware_parameters_resp',
      'Size' => '20',
      'Type' => 'Struct'
    },
    '99938' => {
      'Header' => 'firmware_update.h',
      'Line' => '857',
      'Memb' => {
        '0' => {
          'name' => 'downstream_device_index',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'active_comp_comparison_stamp',
          'offset' => '4',
          'type' => '174'
        },
        '2' => {
          'name' => 'active_comp_ver_str_type',
          'offset' => '8',
          'type' => '150'
        },
        '3' => {
          'name' => 'active_comp_ver_str_len',
          'offset' => '9',
          'type' => '150'
        },
        '4' => {
          'name' => 'active_comp_release_date',
          'offset' => '16',
          'type' => '100135'
        },
        '5' => {
          'name' => 'pending_comp_comparison_stamp',
          'offset' => '32',
          'type' => '174'
        },
        '6' => {
          'name' => 'pending_comp_ver_str_type',
          'offset' => '36',
          'type' => '150'
        },
        '7' => {
          'name' => 'pending_comp_ver_str_len',
          'offset' => '37',
          'type' => '150'
        },
        '8' => {
          'name' => 'pending_comp_release_date',
          'offset' => '38',
          'type' => '100135'
        },
        '9' => {
          'name' => 'comp_activation_methods',
          'offset' => '54',
          'type' => '74577'
        },
        '10' => {
          'name' => 'capabilities_during_update',
          'offset' => '64',
          'type' => '95131'
        },
        '11' => {
          'name' => 'active_comp_ver_str',
          'offset' => '72',
          'type' => '2086'
        },
        '12' => {
          'name' => 'pending_comp_ver_str',
          'offset' => '86',
          'type' => '2086'
        }
      },
      'Name' => 'struct pldm_downstream_device_parameters_entry',
      'Size' => '64',
      'Type' => 'Struct'
    },
    '100135' => {
      'BaseType' => '143',
      'Name' => 'char[9]',
      'Size' => '9',
      'Type' => 'Array'
    },
    '101506' => {
      'Header' => 'firmware_update.h',
      'Line' => '1089',
      'Memb' => {
        '0' => {
          'name' => 'component_classification',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'component_identifier',
          'offset' => '2',
          'type' => '162'
        },
        '2' => {
          'name' => 'component_classification_index',
          'offset' => '4',
          'type' => '150'
        }
      },
      'Name' => 'struct pldm_fwup_update_security_revision_req',
      'Size' => '6',
      'Type' => 'Struct'
    },
    '101563' => {
      'BaseType' => '101506',
      'Name' => 'struct pldm_fwup_update_security_revision_req const',
      'Size' => '6',
      'Type' => 'Const'
    },
    '101568' => {
      'Header' => 'firmware_update.h',
      'Line' => '1406',
      'Memb' => {
        '0' => {
          'name' => 'field',
          'offset' => '0',
          'type' => '8082'
        },
        '1' => {
          'name' => 'entries',
          'offset' => '22',
          'type' => '883'
        }
      },
      'Name' => 'struct pldm_downstream_device_parameters_iter',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '101611' => {
      'Header' => 'firmware_update.h',
      'Line' => '2288',
      'Memb' => {
        '0' => {
          'name' => 'magic',
          'offset' => '0',
          'type' => '878'
        },
        '1' => {
          'name' => 'version',
          'offset' => '4',
          'type' => '5519'
        }
      },
      'Name' => 'anon-struct-firmware_update.h-2288',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '101648' => {
      'Header' => 'firmware_update.h',
      'Line' => '2307',
      'Memb' => {
        '0' => {
          'name' => 'identifier',
          'offset' => '0',
          'type' => '96130'
        },
        '1' => {
          'name' => 'revision',
          'offset' => '22',
          'type' => '5519'
        }
      },
      'Name' => 'anon-struct-firmware_update.h-2307',
      'Size' => '17',
      'Type' => 'Struct'
    },
    '101685' => {
      'Header' => 'firmware_update.h',
      'Line' => '2287',
      'Memb' => {
        '0' => {
          'name' => 'meta',
          'offset' => '0',
          'type' => '101611'
        },
        '1' => {
          'name' => 'format',
          'offset' => '8',
          'type' => '101648'
        }
      },
      'Name' => 'struct pldm_package_format_pin',
      'Size' => '28',
      'Type' => 'Struct'
    },
    '101728' => {
      'BaseType' => '101685',
      'Name' => 'struct pldm_package_format_pin const',
      'Size' => '28',
      'Type' => 'Const'
    },
    '101733' => {
      'Header' => 'firmware_update.h',
      'Line' => '2316',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_PACKAGE_PARSE_INIT',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_PACKAGE_PARSE_COMPLETE',
          'value' => '1'
        },
        '2' => {
          'name' => 'PLDM_PACKAGE_PARSE_HEADER',
          'value' => '2'
        },
        '3' => {
          'name' => 'PLDM_PACKAGE_PARSE_FIRMWARE_DEVICES',
          'value' => '3'
        },
        '4' => {
          'name' => 'PLDM_PACKAGE_PARSE_DOWNSTREAM_DEVICES',
          'value' => '4'
        },
        '5' => {
          'name' => 'PLDM_PACKAGE_PARSE_COMPONENT_IMAGE_INFORMATION',
          'value' => '5'
        }
      },
      'Name' => 'enum pldm_package_parse',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '101785' => {
      'Header' => 'firmware_update.h',
      'Line' => '2325',
      'Memb' => {
        '0' => {
          'name' => 'field',
          'offset' => '0',
          'type' => '8082'
        },
        '1' => {
          'name' => 'entries',
          'offset' => '22',
          'type' => '883'
        }
      },
      'Name' => 'struct pldm_package_iter',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '101828' => {
      'Header' => 'firmware_update.h',
      'Line' => '2338',
      'Memb' => {
        '0' => {
          'name' => 'package_header_identifier',
          'offset' => '0',
          'type' => '96102'
        },
        '1' => {
          'name' => 'package_header_format_revision',
          'offset' => '22',
          'type' => '150'
        },
        '2' => {
          'name' => 'package_release_date_time',
          'offset' => '23',
          'type' => '98435'
        },
        '3' => {
          'name' => 'component_bitmap_bit_length',
          'offset' => '48',
          'type' => '162'
        },
        '4' => {
          'name' => 'package_version_string_type',
          'offset' => '50',
          'type' => '150'
        },
        '5' => {
          'name' => 'package_version_string',
          'offset' => '64',
          'type' => '8082'
        }
      },
      'Name' => 'struct pldm__package_header_information',
      'Size' => '56',
      'Type' => 'Struct'
    },
    '101927' => {
      'BaseType' => '101828',
      'Header' => 'firmware_update.h',
      'Line' => '2351',
      'Name' => 'pldm_package_header_information_pad',
      'Size' => '56',
      'Type' => 'Typedef'
    },
    '101940' => {
      'BaseType' => '101927',
      'Name' => 'pldm_package_header_information_pad const',
      'Size' => '56',
      'Type' => 'Const'
    },
    '101945' => {
      'Header' => 'firmware_update.h',
      'Line' => '2354',
      'Memb' => {
        '0' => {
          'name' => 'bitmap',
          'offset' => '0',
          'type' => '8082'
        }
      },
      'Name' => 'struct pldm_package_component_bitmap',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '101974' => {
      'Header' => 'firmware_update.h',
      'Line' => '2366',
      'Memb' => {
        '0' => {
          'name' => 'descriptor_count',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'device_update_option_flags',
          'offset' => '4',
          'type' => '95131'
        },
        '2' => {
          'name' => 'component_image_set_version_string_type',
          'offset' => '8',
          'type' => '150'
        },
        '3' => {
          'name' => 'component_image_set_version_string',
          'offset' => '22',
          'type' => '8082'
        },
        '4' => {
          'name' => 'applicable_components',
          'offset' => '50',
          'type' => '101945'
        },
        '5' => {
          'name' => 'record_descriptors',
          'offset' => '72',
          'type' => '8082'
        },
        '6' => {
          'name' => 'firmware_device_package_data',
          'offset' => '100',
          'type' => '8082'
        },
        '7' => {
          'name' => 'reference_manifest_data',
          'offset' => '128',
          'type' => '8082'
        }
      },
      'Name' => 'struct pldm_package_firmware_device_id_record',
      'Size' => '96',
      'Type' => 'Struct'
    },
    '102101' => {
      'Header' => 'firmware_update.h',
      'Line' => '2417',
      'Memb' => {
        '0' => {
          'name' => 'descriptor_count',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'update_option_flags',
          'offset' => '4',
          'type' => '95131'
        },
        '2' => {
          'name' => 'self_contained_activation_min_version_string_type',
          'offset' => '8',
          'type' => '150'
        },
        '3' => {
          'name' => 'self_contained_activation_min_version_string',
          'offset' => '22',
          'type' => '8082'
        },
        '4' => {
          'name' => 'self_contained_activation_min_version_comparison_stamp',
          'offset' => '50',
          'type' => '174'
        },
        '5' => {
          'name' => 'applicable_components',
          'offset' => '64',
          'type' => '101945'
        },
        '6' => {
          'name' => 'record_descriptors',
          'offset' => '86',
          'type' => '8082'
        },
        '7' => {
          'name' => 'package_data',
          'offset' => '114',
          'type' => '8082'
        },
        '8' => {
          'name' => 'reference_manifest_data',
          'offset' => '136',
          'type' => '8082'
        }
      },
      'Name' => 'struct pldm_package_downstream_device_id_record',
      'Size' => '104',
      'Type' => 'Struct'
    },
    '102242' => {
      'Header' => 'firmware_update.h',
      'Line' => '2467',
      'Memb' => {
        '0' => {
          'name' => 'component_classification',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'component_identifier',
          'offset' => '2',
          'type' => '162'
        },
        '2' => {
          'name' => 'component_comparison_stamp',
          'offset' => '4',
          'type' => '174'
        },
        '3' => {
          'name' => 'component_options',
          'offset' => '8',
          'type' => '74577'
        },
        '4' => {
          'name' => 'requested_component_activation_method',
          'offset' => '16',
          'type' => '74577'
        },
        '5' => {
          'name' => 'component_image',
          'offset' => '22',
          'type' => '8082'
        },
        '6' => {
          'name' => 'component_version_string_type',
          'offset' => '50',
          'type' => '150'
        },
        '7' => {
          'name' => 'component_version_string',
          'offset' => '64',
          'type' => '8082'
        },
        '8' => {
          'name' => 'component_opaque_data',
          'offset' => '86',
          'type' => '8082'
        }
      },
      'Name' => 'struct pldm_package_component_image_information',
      'Size' => '72',
      'Type' => 'Struct'
    },
    '102383' => {
      'Header' => 'firmware_update.h',
      'Line' => '2508',
      'Memb' => {
        '0' => {
          'name' => 'pin',
          'offset' => '0',
          'type' => '102494'
        },
        '1' => {
          'name' => 'hdr',
          'offset' => '8',
          'type' => '102499'
        },
        '2' => {
          'name' => 'state',
          'offset' => '22',
          'type' => '101733'
        },
        '3' => {
          'name' => 'flags',
          'offset' => '32',
          'type' => '174'
        },
        '4' => {
          'name' => 'package',
          'offset' => '36',
          'type' => '8082'
        },
        '5' => {
          'name' => 'areas',
          'offset' => '64',
          'type' => '8082'
        },
        '6' => {
          'name' => 'iter',
          'offset' => '86',
          'type' => '101785'
        }
      },
      'Name' => 'struct pldm_package',
      'Size' => '80',
      'Type' => 'Struct'
    },
    '102494' => {
      'BaseType' => '101728',
      'Name' => 'struct pldm_package_format_pin const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '102499' => {
      'BaseType' => '101940',
      'Name' => 'pldm_package_header_information_pad const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '109379' => {
      'BaseType' => '102383',
      'Name' => 'struct pldm_package*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '109384' => {
      'BaseType' => '102242',
      'Name' => 'struct pldm_package_component_image_information*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '117473' => {
      'BaseType' => '102101',
      'Name' => 'struct pldm_package_downstream_device_id_record*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '119126' => {
      'BaseType' => '101974',
      'Name' => 'struct pldm_package_firmware_device_id_record*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '120878' => {
      'BaseType' => '101927',
      'Name' => 'pldm_package_header_information_pad*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '123818' => {
      'BaseType' => '101563',
      'Name' => 'struct pldm_fwup_update_security_revision_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '125889' => {
      'BaseType' => '94347',
      'Name' => 'bool8_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '125894' => {
      'BaseType' => '96083',
      'Name' => 'bitfield64_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '129955' => {
      'BaseType' => '95131',
      'Name' => 'bitfield32_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '135067' => {
      'BaseType' => '74577',
      'Name' => 'bitfield16_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '147776' => {
      'BaseType' => '96174',
      'Name' => 'struct variable_field const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '174649' => {
      'BaseType' => '101568',
      'Name' => 'struct pldm_downstream_device_parameters_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '174654' => {
      'BaseType' => '99938',
      'Name' => 'struct pldm_downstream_device_parameters_entry*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '178118' => {
      'BaseType' => '99853',
      'Name' => 'struct pldm_get_downstream_firmware_parameters_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '179567' => {
      'BaseType' => '99848',
      'Name' => 'struct pldm_get_downstream_firmware_parameters_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '181133' => {
      'BaseType' => '99641',
      'Name' => 'struct pldm_downstream_device_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '181138' => {
      'BaseType' => '99598',
      'Name' => 'struct pldm_downstream_device*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '184599' => {
      'BaseType' => '99513',
      'Name' => 'struct pldm_query_downstream_identifiers_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '186048' => {
      'BaseType' => '99508',
      'Name' => 'struct pldm_query_downstream_identifiers_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '189421' => {
      'BaseType' => '99065',
      'Name' => 'struct pldm_query_downstream_devices_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '189868' => {
      'BaseType' => '99150',
      'Name' => 'struct pldm_component_parameter_entry*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '200219' => {
      'BaseType' => '98862',
      'Name' => 'struct pldm_get_firmware_parameters_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '203845' => {
      'BaseType' => '2351',
      'Name' => 'uint8_t**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '204187' => {
      'BaseType' => '98664',
      'Name' => 'struct pldm_component_image_information*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '207165' => {
      'BaseType' => '99757',
      'Name' => 'struct pldm_descriptor_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '207170' => {
      'BaseType' => '99684',
      'Name' => 'struct pldm_descriptor*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '207554' => {
      'BaseType' => '98451',
      'Name' => 'struct pldm_firmware_device_id_record*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '216317' => {
      'BaseType' => '845',
      'Name' => 'void**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '216818' => {
      'BaseType' => '98322',
      'Name' => 'struct pldm_package_header_information*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '234385' => {
      'BaseType' => '234402',
      'Header' => 'pdr.h',
      'Line' => '15',
      'Name' => 'pldm_pdr',
      'PrivateABI' => 1,
      'Size' => '24',
      'Type' => 'Typedef'
    },
    '234397' => {
      'BaseType' => '234385',
      'Name' => 'pldm_pdr const',
      'Size' => '24',
      'Type' => 'Const'
    },
    '234402' => {
      'Line' => '32',
      'Memb' => {
        '0' => {
          'name' => 'record_count',
          'offset' => '0',
          'type' => '174'
        },
        '1' => {
          'name' => 'size',
          'offset' => '4',
          'type' => '174'
        },
        '2' => {
          'name' => 'first',
          'offset' => '8',
          'type' => '235872'
        },
        '3' => {
          'name' => 'last',
          'offset' => '22',
          'type' => '235872'
        }
      },
      'Name' => 'struct pldm_pdr',
      'PrivateABI' => 1,
      'Size' => '24',
      'Source' => 'pdr.c',
      'Type' => 'Struct'
    },
    '234468' => {
      'BaseType' => '234485',
      'Header' => 'pdr.h',
      'Line' => '20',
      'Name' => 'pldm_pdr_record',
      'PrivateABI' => 1,
      'Size' => '32',
      'Type' => 'Typedef'
    },
    '234480' => {
      'BaseType' => '234468',
      'Name' => 'pldm_pdr_record const',
      'Size' => '32',
      'Type' => 'Const'
    },
    '234485' => {
      'Line' => '23',
      'Memb' => {
        '0' => {
          'name' => 'record_handle',
          'offset' => '0',
          'type' => '174'
        },
        '1' => {
          'name' => 'size',
          'offset' => '4',
          'type' => '174'
        },
        '2' => {
          'name' => 'data',
          'offset' => '8',
          'type' => '2351'
        },
        '3' => {
          'name' => 'next',
          'offset' => '22',
          'type' => '235860'
        },
        '4' => {
          'name' => 'is_remote',
          'offset' => '36',
          'type' => '6933'
        },
        '5' => {
          'name' => 'terminus_handle',
          'offset' => '38',
          'type' => '162'
        }
      },
      'Name' => 'struct pldm_pdr_record',
      'PrivateABI' => 1,
      'Size' => '32',
      'Source' => 'pdr.c',
      'Type' => 'Struct'
    },
    '234577' => {
      'Header' => 'pdr.h',
      'Line' => '326',
      'Memb' => {
        '0' => {
          'name' => 'entity_type',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'entity_instance_num',
          'offset' => '2',
          'type' => '162'
        },
        '2' => {
          'name' => 'entity_container_id',
          'offset' => '4',
          'type' => '162'
        }
      },
      'Name' => 'struct pldm_entity',
      'Size' => '6',
      'Type' => 'Struct'
    },
    '234639' => {
      'BaseType' => '234577',
      'Header' => 'pdr.h',
      'Line' => '330',
      'Name' => 'pldm_entity',
      'Size' => '6',
      'Type' => 'Typedef'
    },
    '234651' => {
      'BaseType' => '234639',
      'Name' => 'pldm_entity const',
      'Size' => '6',
      'Type' => 'Const'
    },
    '234685' => {
      'BaseType' => '234697',
      'Header' => 'pdr.h',
      'Line' => '340',
      'Name' => 'pldm_entity_association_tree',
      'PrivateABI' => 1,
      'Size' => '16',
      'Type' => 'Typedef'
    },
    '234697' => {
      'Line' => '651',
      'Memb' => {
        '0' => {
          'name' => 'root',
          'offset' => '0',
          'type' => '235877'
        },
        '1' => {
          'name' => 'last_used_container_id',
          'offset' => '8',
          'type' => '162'
        }
      },
      'Name' => 'struct pldm_entity_association_tree',
      'PrivateABI' => 1,
      'Size' => '16',
      'Source' => 'pdr.c',
      'Type' => 'Struct'
    },
    '234740' => {
      'BaseType' => '234757',
      'Header' => 'pdr.h',
      'Line' => '345',
      'Name' => 'pldm_entity_node',
      'PrivateABI' => 1,
      'Size' => '40',
      'Type' => 'Typedef'
    },
    '234752' => {
      'BaseType' => '234740',
      'Name' => 'pldm_entity_node const',
      'Size' => '40',
      'Type' => 'Const'
    },
    '234757' => {
      'Line' => '656',
      'Memb' => {
        '0' => {
          'name' => 'entity',
          'offset' => '0',
          'type' => '234639'
        },
        '1' => {
          'name' => 'parent',
          'offset' => '6',
          'type' => '234639'
        },
        '2' => {
          'name' => 'remote_container_id',
          'offset' => '18',
          'type' => '162'
        },
        '3' => {
          'name' => 'first_child',
          'offset' => '22',
          'type' => '235877'
        },
        '4' => {
          'name' => 'next_sibling',
          'offset' => '36',
          'type' => '235877'
        },
        '5' => {
          'name' => 'association_type',
          'offset' => '50',
          'type' => '150'
        }
      },
      'Name' => 'struct pldm_entity_node',
      'PrivateABI' => 1,
      'Size' => '40',
      'Source' => 'pdr.c',
      'Type' => 'Struct'
    },
    '235078' => {
      'Header' => 'platform.h',
      'Line' => '593',
      'Memb' => {
        '0' => {
          'name' => 'record_handle',
          'offset' => '0',
          'type' => '174'
        },
        '1' => {
          'name' => 'version',
          'offset' => '4',
          'type' => '150'
        },
        '2' => {
          'name' => 'type',
          'offset' => '5',
          'type' => '150'
        },
        '3' => {
          'name' => 'record_change_num',
          'offset' => '6',
          'type' => '162'
        },
        '4' => {
          'name' => 'length',
          'offset' => '8',
          'type' => '162'
        }
      },
      'Name' => 'struct pldm_pdr_hdr',
      'Size' => '10',
      'Type' => 'Struct'
    },
    '235527' => {
      'Header' => 'platform.h',
      'Line' => '668',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '235078'
        },
        '1' => {
          'name' => 'terminus_handle',
          'offset' => '16',
          'type' => '162'
        },
        '2' => {
          'name' => 'sensor_id',
          'offset' => '18',
          'type' => '162'
        },
        '3' => {
          'name' => 'entity_type',
          'offset' => '20',
          'type' => '162'
        },
        '4' => {
          'name' => 'entity_instance',
          'offset' => '22',
          'type' => '162'
        },
        '5' => {
          'name' => 'container_id',
          'offset' => '24',
          'type' => '162'
        },
        '6' => {
          'name' => 'sensor_init',
          'offset' => '32',
          'type' => '150'
        },
        '7' => {
          'name' => 'sensor_auxiliary_names_pdr',
          'offset' => '33',
          'type' => '94347'
        },
        '8' => {
          'name' => 'composite_sensor_count',
          'offset' => '34',
          'type' => '150'
        },
        '9' => {
          'name' => 'possible_states',
          'offset' => '35',
          'type' => '1781'
        }
      },
      'Name' => 'struct pldm_state_sensor_pdr',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '235681' => {
      'Header' => 'platform.h',
      'Line' => '695',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '235078'
        },
        '1' => {
          'name' => 'terminus_handle',
          'offset' => '16',
          'type' => '162'
        },
        '2' => {
          'name' => 'effecter_id',
          'offset' => '18',
          'type' => '162'
        },
        '3' => {
          'name' => 'entity_type',
          'offset' => '20',
          'type' => '162'
        },
        '4' => {
          'name' => 'entity_instance',
          'offset' => '22',
          'type' => '162'
        },
        '5' => {
          'name' => 'container_id',
          'offset' => '24',
          'type' => '162'
        },
        '6' => {
          'name' => 'effecter_semantic_id',
          'offset' => '32',
          'type' => '162'
        },
        '7' => {
          'name' => 'effecter_init',
          'offset' => '34',
          'type' => '150'
        },
        '8' => {
          'name' => 'has_description_pdr',
          'offset' => '35',
          'type' => '94347'
        },
        '9' => {
          'name' => 'composite_effecter_count',
          'offset' => '36',
          'type' => '150'
        },
        '10' => {
          'name' => 'possible_states',
          'offset' => '37',
          'type' => '1781'
        }
      },
      'Name' => 'struct pldm_state_effecter_pdr',
      'Size' => '26',
      'Type' => 'Struct'
    },
    '235860' => {
      'BaseType' => '234485',
      'Name' => 'struct pldm_pdr_record*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '235872' => {
      'BaseType' => '234468',
      'Name' => 'pldm_pdr_record*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '235877' => {
      'BaseType' => '234740',
      'Name' => 'pldm_entity_node*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '236244' => {
      'BaseType' => '234685',
      'Name' => 'pldm_entity_association_tree*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '236249' => {
      'BaseType' => '234651',
      'Name' => 'pldm_entity const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '237733' => {
      'BaseType' => '234385',
      'Name' => 'pldm_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '239388' => {
      'BaseType' => '234480',
      'Name' => 'pldm_pdr_record const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '248107' => {
      'BaseType' => '234639',
      'Name' => 'pldm_entity*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '267984' => {
      'BaseType' => '248107',
      'Name' => 'pldm_entity**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '268631' => {
      'BaseType' => '235877',
      'Name' => 'pldm_entity_node**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '269420' => {
      'BaseType' => '234397',
      'Name' => 'pldm_pdr const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '275080' => {
      'BaseType' => '234752',
      'Name' => 'pldm_entity_node const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '281925' => {
      'BaseType' => '235681',
      'Name' => 'struct pldm_state_effecter_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '287616' => {
      'BaseType' => '235527',
      'Name' => 'struct pldm_state_sensor_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '292893' => {
      'BaseType' => '79',
      'Header' => 'types.h',
      'Line' => '37',
      'Name' => '__int8_t',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '292917' => {
      'BaseType' => '98',
      'Header' => 'types.h',
      'Line' => '39',
      'Name' => '__int16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '292941' => {
      'BaseType' => '117',
      'Header' => 'types.h',
      'Line' => '41',
      'Name' => '__int32_t',
      'PrivateABI' => 1,
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '292965' => {
      'BaseType' => '105',
      'Header' => 'types.h',
      'Line' => '55',
      'Name' => '__uint_least16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '292996' => {
      'BaseType' => '292893',
      'Header' => 'stdint-intn.h',
      'Line' => '24',
      'Name' => 'int8_t',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '293008' => {
      'BaseType' => '292917',
      'Header' => 'stdint-intn.h',
      'Line' => '25',
      'Name' => 'int16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '293020' => {
      'BaseType' => '292941',
      'Header' => 'stdint-intn.h',
      'Line' => '26',
      'Name' => 'int32_t',
      'PrivateABI' => 1,
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '293681' => {
      'BaseType' => '1188',
      'Header' => 'pldm_types.h',
      'Line' => '169',
      'Name' => 'real32_t',
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '294420' => {
      'BaseType' => '292965',
      'Header' => 'uchar.h',
      'Line' => '55',
      'Name' => 'char16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '295343' => {
      'Header' => 'platform.h',
      'Line' => '345',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_SENSOR_OP_STATE',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_STATE_SENSOR_STATE',
          'value' => '1'
        },
        '2' => {
          'name' => 'PLDM_NUMERIC_SENSOR_STATE',
          'value' => '2'
        }
      },
      'Name' => 'enum sensor_event_class_states',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '295377' => {
      'BaseType' => '295343',
      'Name' => 'enum sensor_event_class_states const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '295873' => {
      'Header' => 'platform.h',
      'Line' => '685',
      'Memb' => {
        '0' => {
          'name' => 'state_set_id',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'possible_states_size',
          'offset' => '2',
          'type' => '150'
        },
        '2' => {
          'name' => 'states',
          'offset' => '3',
          'type' => '295935'
        }
      },
      'Name' => 'struct state_sensor_possible_states',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '295930' => {
      'BaseType' => '295873',
      'Name' => 'struct state_sensor_possible_states const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '295935' => {
      'BaseType' => '1088',
      'Name' => 'bitfield8_t[1]',
      'Size' => '1',
      'Type' => 'Array'
    },
    '296313' => {
      'Header' => 'platform.h',
      'Line' => '786',
      'Memb' => {
        '0' => {
          'name' => 'value_u8',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'value_s8',
          'offset' => '0',
          'type' => '292996'
        },
        '2' => {
          'name' => 'value_u16',
          'offset' => '0',
          'type' => '162'
        },
        '3' => {
          'name' => 'value_s16',
          'offset' => '0',
          'type' => '293008'
        },
        '4' => {
          'name' => 'value_u32',
          'offset' => '0',
          'type' => '174'
        },
        '5' => {
          'name' => 'value_s32',
          'offset' => '0',
          'type' => '293020'
        },
        '6' => {
          'name' => 'value_f32',
          'offset' => '0',
          'type' => '293681'
        }
      },
      'Name' => 'union union_range_field_format',
      'Size' => '4',
      'Type' => 'Union'
    },
    '296912' => {
      'Header' => 'platform.h',
      'Line' => '843',
      'Memb' => {
        '0' => {
          'name' => 'value_u8',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'value_s8',
          'offset' => '0',
          'type' => '292996'
        },
        '2' => {
          'name' => 'value_u16',
          'offset' => '0',
          'type' => '162'
        },
        '3' => {
          'name' => 'value_s16',
          'offset' => '0',
          'type' => '293008'
        },
        '4' => {
          'name' => 'value_u32',
          'offset' => '0',
          'type' => '174'
        },
        '5' => {
          'name' => 'value_s32',
          'offset' => '0',
          'type' => '293020'
        }
      },
      'Name' => 'union union_sensor_data_size',
      'Size' => '4',
      'Type' => 'Union'
    },
    '296925' => {
      'Header' => 'platform.h',
      'Line' => '850',
      'Memb' => {
        '0' => {
          'name' => 'record_handle',
          'offset' => '0',
          'type' => '174'
        },
        '1' => {
          'name' => 'version',
          'offset' => '4',
          'type' => '150'
        },
        '2' => {
          'name' => 'type',
          'offset' => '5',
          'type' => '150'
        },
        '3' => {
          'name' => 'record_change_num',
          'offset' => '6',
          'type' => '162'
        },
        '4' => {
          'name' => 'length',
          'offset' => '8',
          'type' => '162'
        }
      },
      'Name' => 'struct pldm_value_pdr_hdr',
      'Size' => '12',
      'Type' => 'Struct'
    },
    '297010' => {
      'Header' => 'platform.h',
      'Line' => '868',
      'Memb' => {
        '0' => {
          'name' => 'entity_instance_num',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'entity_instance',
          'offset' => '0',
          'type' => '162'
        }
      },
      'Name' => 'anon-union-platform.h-868',
      'Size' => '2',
      'Type' => 'Union'
    },
    '297045' => {
      'Header' => 'platform.h',
      'Line' => '863',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '296925'
        },
        '1' => {
          'name' => 'terminus_handle',
          'offset' => '18',
          'type' => '162'
        },
        '2' => {
          'name' => 'sensor_id',
          'offset' => '20',
          'type' => '162'
        },
        '3' => {
          'name' => 'entity_type',
          'offset' => '22',
          'type' => '162'
        },
        '4' => {
          'name' => 'unnamed0',
          'offset' => '24',
          'type' => '297010'
        },
        '5' => {
          'name' => 'container_id',
          'offset' => '32',
          'type' => '162'
        },
        '6' => {
          'name' => 'sensor_init',
          'offset' => '34',
          'type' => '150'
        },
        '7' => {
          'name' => 'sensor_auxiliary_names_pdr',
          'offset' => '35',
          'type' => '94347'
        },
        '8' => {
          'name' => 'base_unit',
          'offset' => '36',
          'type' => '150'
        },
        '9' => {
          'name' => 'unit_modifier',
          'offset' => '37',
          'type' => '292996'
        },
        '10' => {
          'name' => 'rate_unit',
          'offset' => '38',
          'type' => '150'
        },
        '11' => {
          'name' => 'base_oem_unit_handle',
          'offset' => '39',
          'type' => '150'
        },
        '12' => {
          'name' => 'aux_unit',
          'offset' => '40',
          'type' => '150'
        },
        '13' => {
          'name' => 'aux_unit_modifier',
          'offset' => '41',
          'type' => '292996'
        },
        '14' => {
          'name' => 'aux_rate_unit',
          'offset' => '48',
          'type' => '150'
        },
        '15' => {
          'name' => 'rel',
          'offset' => '49',
          'type' => '150'
        },
        '16' => {
          'name' => 'aux_oem_unit_handle',
          'offset' => '50',
          'type' => '150'
        },
        '17' => {
          'name' => 'is_linear',
          'offset' => '51',
          'type' => '94347'
        },
        '18' => {
          'name' => 'sensor_data_size',
          'offset' => '52',
          'type' => '150'
        },
        '19' => {
          'name' => 'resolution',
          'offset' => '54',
          'type' => '293681'
        },
        '20' => {
          'name' => 'offset',
          'offset' => '64',
          'type' => '293681'
        },
        '21' => {
          'name' => 'accuracy',
          'offset' => '68',
          'type' => '162'
        },
        '22' => {
          'name' => 'plus_tolerance',
          'offset' => '70',
          'type' => '150'
        },
        '23' => {
          'name' => 'minus_tolerance',
          'offset' => '71',
          'type' => '150'
        },
        '24' => {
          'name' => 'hysteresis',
          'offset' => '72',
          'type' => '296912'
        },
        '25' => {
          'name' => 'supported_thresholds',
          'offset' => '82',
          'type' => '1088'
        },
        '26' => {
          'name' => 'threshold_and_hysteresis_volatility',
          'offset' => '83',
          'type' => '1088'
        },
        '27' => {
          'name' => 'state_transition_interval',
          'offset' => '86',
          'type' => '293681'
        },
        '28' => {
          'name' => 'update_interval',
          'offset' => '96',
          'type' => '293681'
        },
        '29' => {
          'name' => 'max_readable',
          'offset' => '100',
          'type' => '296912'
        },
        '30' => {
          'name' => 'min_readable',
          'offset' => '104',
          'type' => '296912'
        },
        '31' => {
          'name' => 'range_field_format',
          'offset' => '114',
          'type' => '150'
        },
        '32' => {
          'name' => 'range_field_support',
          'offset' => '115',
          'type' => '1088'
        },
        '33' => {
          'name' => 'nominal_value',
          'offset' => '118',
          'type' => '296313'
        },
        '34' => {
          'name' => 'normal_max',
          'offset' => '128',
          'type' => '296313'
        },
        '35' => {
          'name' => 'normal_min',
          'offset' => '132',
          'type' => '296313'
        },
        '36' => {
          'name' => 'warning_high',
          'offset' => '136',
          'type' => '296313'
        },
        '37' => {
          'name' => 'warning_low',
          'offset' => '146',
          'type' => '296313'
        },
        '38' => {
          'name' => 'critical_high',
          'offset' => '150',
          'type' => '296313'
        },
        '39' => {
          'name' => 'critical_low',
          'offset' => '256',
          'type' => '296313'
        },
        '40' => {
          'name' => 'fatal_high',
          'offset' => '260',
          'type' => '296313'
        },
        '41' => {
          'name' => 'fatal_low',
          'offset' => '264',
          'type' => '296313'
        }
      },
      'Name' => 'struct pldm_numeric_sensor_value_pdr',
      'Size' => '112',
      'Type' => 'Struct'
    },
    '297638' => {
      'BaseType' => '294420',
      'Header' => 'platform.h',
      'Line' => '911',
      'Name' => 'pldm_utf16be',
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '297651' => {
      'Header' => 'platform.h',
      'Line' => '913',
      'Memb' => {
        '0' => {
          'name' => 'tag',
          'offset' => '0',
          'type' => '7555'
        },
        '1' => {
          'name' => 'name',
          'offset' => '8',
          'type' => '297693'
        }
      },
      'Name' => 'struct pldm_entity_auxiliary_name',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '297693' => {
      'BaseType' => '297638',
      'Name' => 'pldm_utf16be*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '297698' => {
      'Header' => 'platform.h',
      'Line' => '923',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '296925'
        },
        '1' => {
          'name' => 'container',
          'offset' => '18',
          'type' => '234639'
        },
        '2' => {
          'name' => 'shared_name_count',
          'offset' => '24',
          'type' => '150'
        },
        '3' => {
          'name' => 'name_string_count',
          'offset' => '25',
          'type' => '150'
        },
        '4' => {
          'name' => 'names',
          'offset' => '36',
          'type' => '297812'
        },
        '5' => {
          'name' => 'auxiliary_name_data_size',
          'offset' => '50',
          'type' => '883'
        },
        '6' => {
          'name' => 'auxiliary_name_data',
          'offset' => '64',
          'type' => '297817'
        }
      },
      'Name' => 'struct pldm_entity_auxiliary_names_pdr',
      'Size' => '40',
      'Type' => 'Struct'
    },
    '297812' => {
      'BaseType' => '297651',
      'Name' => 'struct pldm_entity_auxiliary_name*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '297817' => {
      'BaseType' => '143',
      'Name' => 'char[]',
      'Size' => '8',
      'Type' => 'Array'
    },
    '297832' => {
      'Header' => 'platform.h',
      'Line' => '953',
      'Memb' => {
        '0' => {
          'name' => 'state_set_id',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'possible_states_size',
          'offset' => '2',
          'type' => '150'
        },
        '2' => {
          'name' => 'states',
          'offset' => '3',
          'type' => '295935'
        }
      },
      'Name' => 'struct state_effecter_possible_states',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '297889' => {
      'BaseType' => '297832',
      'Name' => 'struct state_effecter_possible_states const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '297894' => {
      'Header' => 'platform.h',
      'Line' => '977',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '296925'
        },
        '1' => {
          'name' => 'terminus_handle',
          'offset' => '18',
          'type' => '162'
        },
        '2' => {
          'name' => 'file_identifier',
          'offset' => '20',
          'type' => '162'
        },
        '3' => {
          'name' => 'container',
          'offset' => '22',
          'type' => '234639'
        },
        '4' => {
          'name' => 'superior_directory_file_identifier',
          'offset' => '34',
          'type' => '162'
        },
        '5' => {
          'name' => 'file_classification',
          'offset' => '36',
          'type' => '150'
        },
        '6' => {
          'name' => 'oem_file_classification',
          'offset' => '37',
          'type' => '150'
        },
        '7' => {
          'name' => 'file_capabilities',
          'offset' => '38',
          'type' => '74577'
        },
        '8' => {
          'name' => 'file_version',
          'offset' => '40',
          'type' => '1171'
        },
        '9' => {
          'name' => 'file_maximum_size',
          'offset' => '50',
          'type' => '174'
        },
        '10' => {
          'name' => 'file_maximum_file_descriptor_count',
          'offset' => '54',
          'type' => '150'
        },
        '11' => {
          'name' => 'file_name',
          'offset' => '64',
          'type' => '8082'
        },
        '12' => {
          'name' => 'oem_file_classification_name',
          'offset' => '86',
          'type' => '8082'
        }
      },
      'Name' => 'struct pldm_platform_file_descriptor_pdr',
      'Size' => '72',
      'Type' => 'Struct'
    },
    '298095' => {
      'Header' => 'platform.h',
      'Line' => '1023',
      'Memb' => {
        '0' => {
          'name' => 'set_request',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'effecter_state',
          'offset' => '1',
          'type' => '150'
        }
      },
      'Name' => 'struct state_field_for_state_effecter_set',
      'Size' => '2',
      'Type' => 'Struct'
    },
    '298138' => {
      'BaseType' => '298095',
      'Header' => 'platform.h',
      'Line' => '1026',
      'Name' => 'set_effecter_state_field',
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '298151' => {
      'Header' => 'platform.h',
      'Line' => '1032',
      'Memb' => {
        '0' => {
          'name' => 'sensor_op_state',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'present_state',
          'offset' => '1',
          'type' => '150'
        },
        '2' => {
          'name' => 'previous_state',
          'offset' => '2',
          'type' => '150'
        },
        '3' => {
          'name' => 'event_state',
          'offset' => '3',
          'type' => '150'
        }
      },
      'Name' => 'struct state_field_for_get_state_sensor_readings',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '298222' => {
      'BaseType' => '298151',
      'Header' => 'platform.h',
      'Line' => '1040',
      'Name' => 'get_sensor_state_field',
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '298235' => {
      'Header' => 'platform.h',
      'Line' => '1046',
      'Memb' => {
        '0' => {
          'name' => 'effecter_op_state',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'pending_state',
          'offset' => '1',
          'type' => '150'
        },
        '2' => {
          'name' => 'present_state',
          'offset' => '2',
          'type' => '150'
        }
      },
      'Name' => 'struct state_field_for_get_state_effecter_states',
      'Size' => '3',
      'Type' => 'Struct'
    },
    '298292' => {
      'BaseType' => '298235',
      'Header' => 'platform.h',
      'Line' => '1050',
      'Name' => 'get_effecter_state_field',
      'Size' => '3',
      'Type' => 'Typedef'
    },
    '298776' => {
      'Header' => 'platform.h',
      'Line' => '1125',
      'Memb' => {
        '0' => {
          'name' => 'mctp_eid',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'vendor_specific',
          'offset' => '0',
          'type' => '8082'
        }
      },
      'Name' => 'anon-union-platform.h-1125',
      'Size' => '16',
      'Type' => 'Union'
    },
    '298810' => {
      'Header' => 'platform.h',
      'Line' => '1122',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'transport_protocol_type',
          'offset' => '1',
          'type' => '150'
        },
        '2' => {
          'name' => 'event_receiver_address',
          'offset' => '8',
          'type' => '298776'
        }
      },
      'Name' => 'struct pldm_get_event_receiver_resp',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '299112' => {
      'Header' => 'platform.h',
      'Line' => '1210',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'comp_effecter_count',
          'offset' => '1',
          'type' => '150'
        },
        '2' => {
          'name' => 'field',
          'offset' => '2',
          'type' => '299169'
        }
      },
      'Name' => 'struct pldm_get_state_effecter_states_resp',
      'Size' => '26',
      'Type' => 'Struct'
    },
    '299169' => {
      'BaseType' => '298292',
      'Name' => 'get_effecter_state_field[8]',
      'Size' => '24',
      'Type' => 'Array'
    },
    '299185' => {
      'Header' => 'platform.h',
      'Line' => '1220',
      'Memb' => {
        '0' => {
          'name' => 'sensor_id',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'sensor_event_class_type',
          'offset' => '2',
          'type' => '150'
        },
        '2' => {
          'name' => 'event_class',
          'offset' => '3',
          'type' => '1781'
        }
      },
      'Name' => 'struct pldm_sensor_event_data',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '299299' => {
      'Header' => 'platform.h',
      'Line' => '1260',
      'Memb' => {
        '0' => {
          'name' => 'format_version',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'event_id',
          'offset' => '2',
          'type' => '162'
        },
        '2' => {
          'name' => 'data_transfer_handle',
          'offset' => '4',
          'type' => '174'
        }
      },
      'Name' => 'struct pldm_message_poll_event',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '299361' => {
      'Header' => 'platform.h',
      'Line' => '1270',
      'Memb' => {
        '0' => {
          'name' => 'format_version',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'format_type',
          'offset' => '1',
          'type' => '150'
        },
        '2' => {
          'name' => 'event_data_length',
          'offset' => '2',
          'type' => '162'
        },
        '3' => {
          'name' => 'event_data',
          'offset' => '4',
          'type' => '299432'
        }
      },
      'Name' => 'struct pldm_platform_cper_event',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '299432' => {
      'BaseType' => '150',
      'Name' => 'uint8_t[]',
      'Size' => '8',
      'Type' => 'Array'
    },
    '299588' => {
      'Header' => 'platform.h',
      'Line' => '1330',
      'Memb' => {
        '0' => {
          'name' => 'event_data_format',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'number_of_change_records',
          'offset' => '1',
          'type' => '150'
        },
        '2' => {
          'name' => 'change_records',
          'offset' => '2',
          'type' => '1781'
        }
      },
      'Name' => 'struct pldm_pdr_repository_chg_event_data',
      'Size' => '3',
      'Type' => 'Struct'
    },
    '336528' => {
      'BaseType' => '2403',
      'Name' => 'size_t*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '345532' => {
      'BaseType' => '297894',
      'Name' => 'struct pldm_platform_file_descriptor_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '345586' => {
      'BaseType' => '299361',
      'Name' => 'struct pldm_platform_cper_event*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '350006' => {
      'BaseType' => '297698',
      'Name' => 'struct pldm_entity_auxiliary_names_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '361912' => {
      'BaseType' => '299112',
      'Name' => 'struct pldm_get_state_effecter_states_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '408619' => {
      'BaseType' => '298810',
      'Name' => 'struct pldm_get_event_receiver_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '430878' => {
      'BaseType' => '299299',
      'Name' => 'struct pldm_message_poll_event*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '432563' => {
      'BaseType' => '432573',
      'Name' => 'uint32_t const*const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '432568' => {
      'BaseType' => '878',
      'Name' => 'uint32_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '432573' => {
      'BaseType' => '432568',
      'Name' => 'uint32_t const*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '432578' => {
      'BaseType' => '299588',
      'Name' => 'struct pldm_pdr_repository_chg_event_data*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '482994' => {
      'BaseType' => '297045',
      'Name' => 'struct pldm_numeric_sensor_value_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '510728' => {
      'BaseType' => '299185',
      'Name' => 'struct pldm_sensor_event_data*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '510733' => {
      'BaseType' => '510728',
      'Name' => 'struct pldm_sensor_event_data*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '515761' => {
      'BaseType' => '298222',
      'Name' => 'get_sensor_state_field*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '543745' => {
      'BaseType' => '298138',
      'Name' => 'set_effecter_state_field*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '544726' => {
      'BaseType' => '287616',
      'Name' => 'struct pldm_state_sensor_pdr*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '544731' => {
      'BaseType' => '295930',
      'Name' => 'struct state_sensor_possible_states const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '544736' => {
      'BaseType' => '544731',
      'Name' => 'struct state_sensor_possible_states const*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '545136' => {
      'BaseType' => '281925',
      'Name' => 'struct pldm_state_effecter_pdr*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '545141' => {
      'BaseType' => '297889',
      'Name' => 'struct state_effecter_possible_states const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '545146' => {
      'BaseType' => '545141',
      'Name' => 'struct state_effecter_possible_states const*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '549706' => {
      'Line' => '20',
      'Memb' => {
        '0' => {
          'name' => 'prev',
          'offset' => '0',
          'type' => '6315'
        },
        '1' => {
          'name' => 'allocations',
          'offset' => '4',
          'type' => '174'
        }
      },
      'Name' => 'struct pldm_tid_state',
      'PrivateABI' => 1,
      'Size' => '8',
      'Source' => 'instance-id.c',
      'Type' => 'Struct'
    },
    '549745' => {
      'Line' => '25',
      'Memb' => {
        '0' => {
          'name' => 'state',
          'offset' => '0',
          'type' => '549787'
        },
        '1' => {
          'name' => 'lock_db_fd',
          'offset' => '8264',
          'type' => '117'
        }
      },
      'Name' => 'struct pldm_instance_db',
      'PrivateABI' => 1,
      'Size' => '2052',
      'Source' => 'instance-id.c',
      'Type' => 'Struct'
    },
    '549787' => {
      'BaseType' => '549706',
      'Name' => 'struct pldm_tid_state[256]',
      'Size' => '2048',
      'Type' => 'Array'
    },
    '550343' => {
      'BaseType' => '549745',
      'Name' => 'struct pldm_instance_db*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '550730' => {
      'BaseType' => '6315',
      'Name' => 'pldm_instance_id_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '550906' => {
      'BaseType' => '550343',
      'Name' => 'struct pldm_instance_db**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '551438' => {
      'Header' => 'socket.h',
      'Line' => '4',
      'Memb' => {
        '0' => {
          'name' => 'size',
          'offset' => '0',
          'type' => '117'
        },
        '1' => {
          'name' => 'socket',
          'offset' => '4',
          'type' => '117'
        },
        '2' => {
          'name' => 'max_size',
          'offset' => '8',
          'type' => '117'
        }
      },
      'Name' => 'struct pldm_socket_sndbuf',
      'PrivateABI' => 1,
      'Size' => '12',
      'Type' => 'Struct'
    },
    '553413' => {
      'BaseType' => '51',
      'Header' => 'int-ll64.h',
      'Line' => '21',
      'Name' => '__u8',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '553439' => {
      'BaseType' => '58',
      'Header' => 'int-ll64.h',
      'Line' => '24',
      'Name' => '__u16',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '553908' => {
      'BaseType' => '150',
      'Header' => 'pldm.h',
      'Line' => '12',
      'Name' => 'mctp_eid_t',
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '554022' => {
      'BaseType' => '6412',
      'Header' => 'pldm.h',
      'Line' => '29',
      'Name' => 'pldm_requester_rc_t',
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '554034' => {
      'Header' => 'transport.h',
      'Line' => '17',
      'Memb' => {
        '0' => {
          'name' => 'name',
          'offset' => '0',
          'type' => '9667'
        },
        '1' => {
          'name' => 'version',
          'offset' => '8',
          'type' => '150'
        },
        '2' => {
          'name' => 'recv',
          'offset' => '22',
          'type' => '554168'
        },
        '3' => {
          'name' => 'send',
          'offset' => '36',
          'type' => '554209'
        },
        '4' => {
          'name' => 'init_pollfd',
          'offset' => '50',
          'type' => '554291'
        }
      },
      'Name' => 'struct pldm_transport',
      'PrivateABI' => 1,
      'Size' => '40',
      'Type' => 'Struct'
    },
    '554148' => {
      'BaseType' => '554034',
      'Name' => 'struct pldm_transport*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '554153' => {
      'BaseType' => '6303',
      'Name' => 'pldm_tid_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '554168' => {
      'Name' => 'pldm_requester_rc_t(*)(struct pldm_transport*, pldm_tid_t*, void**, size_t*)',
      'Param' => {
        '0' => {
          'type' => '554148'
        },
        '1' => {
          'type' => '554153'
        },
        '2' => {
          'type' => '216317'
        },
        '3' => {
          'type' => '2403'
        }
      },
      'Return' => '554022',
      'Size' => '8',
      'Type' => 'FuncPtr'
    },
    '554209' => {
      'Name' => 'pldm_requester_rc_t(*)(struct pldm_transport*, pldm_tid_t, void const*, size_t)',
      'Param' => {
        '0' => {
          'type' => '554148'
        },
        '1' => {
          'type' => '6303'
        },
        '2' => {
          'type' => '2086'
        },
        '3' => {
          'type' => '883'
        }
      },
      'Return' => '554022',
      'Size' => '8',
      'Type' => 'FuncPtr'
    },
    '554234' => {
      'BaseType' => '554239',
      'Name' => 'struct pollfd*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '554239' => {
      'Header' => 'poll.h',
      'Line' => '36',
      'Memb' => {
        '0' => {
          'name' => 'fd',
          'offset' => '0',
          'type' => '117'
        },
        '1' => {
          'name' => 'events',
          'offset' => '4',
          'type' => '98'
        },
        '2' => {
          'name' => 'revents',
          'offset' => '6',
          'type' => '98'
        }
      },
      'Name' => 'struct pollfd',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Struct'
    },
    '554291' => {
      'Name' => 'int(*)(struct pldm_transport*, struct pollfd*)',
      'Param' => {
        '0' => {
          'type' => '554148'
        },
        '1' => {
          'type' => '554234'
        }
      },
      'Return' => '117',
      'Size' => '8',
      'Type' => 'FuncPtr'
    },
    '554296' => {
      'BaseType' => '58',
      'Header' => 'socket.h',
      'Line' => '10',
      'Name' => '__kernel_sa_family_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '554671' => {
      'Header' => 'mctp.h',
      'Line' => '18',
      'Memb' => {
        '0' => {
          'name' => 's_addr',
          'offset' => '0',
          'type' => '553908'
        }
      },
      'Name' => 'struct mctp_addr',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Struct'
    },
    '554698' => {
      'Header' => 'mctp.h',
      'Line' => '22',
      'Memb' => {
        '0' => {
          'name' => 'smctp_family',
          'offset' => '0',
          'type' => '554296'
        },
        '1' => {
          'name' => '__smctp_pad0',
          'offset' => '2',
          'type' => '553439'
        },
        '2' => {
          'name' => 'smctp_network',
          'offset' => '4',
          'type' => '65'
        },
        '3' => {
          'name' => 'smctp_addr',
          'offset' => '8',
          'type' => '554671'
        },
        '4' => {
          'name' => 'smctp_type',
          'offset' => '9',
          'type' => '553413'
        },
        '5' => {
          'name' => 'smctp_tag',
          'offset' => '16',
          'type' => '553413'
        },
        '6' => {
          'name' => '__smctp_pad1',
          'offset' => '17',
          'type' => '553413'
        }
      },
      'Name' => 'struct sockaddr_mctp',
      'PrivateABI' => 1,
      'Size' => '12',
      'Type' => 'Struct'
    },
    '554803' => {
      'BaseType' => '554698',
      'Name' => 'struct sockaddr_mctp const',
      'Size' => '12',
      'Type' => 'Const'
    },
    '554808' => {
      'Header' => 'mctp.h',
      'Line' => '43',
      'Memb' => {
        '0' => {
          'name' => 'net',
          'offset' => '0',
          'type' => '65'
        },
        '1' => {
          'name' => 'eid',
          'offset' => '4',
          'type' => '553908'
        }
      },
      'Name' => 'struct mctp_fq_addr',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Struct'
    },
    '554848' => {
      'Header' => 'af-mctp-internal.h',
      'Line' => '24',
      'Memb' => {
        '0' => {
          'name' => 'transport',
          'offset' => '0',
          'type' => '554034'
        },
        '1' => {
          'name' => 'socket',
          'offset' => '64',
          'type' => '117'
        },
        '2' => {
          'name' => 'tid_map',
          'offset' => '68',
          'type' => '554941'
        },
        '3' => {
          'name' => 'socket_send_buf',
          'offset' => '8338',
          'type' => '551438'
        },
        '4' => {
          'name' => 'bound',
          'offset' => '8452',
          'type' => '6933'
        },
        '5' => {
          'name' => 'cookie_jar',
          'offset' => '8466',
          'type' => '6327'
        }
      },
      'Name' => 'struct pldm_transport_af_mctp',
      'PrivateABI' => 1,
      'Size' => '2128',
      'Type' => 'Struct'
    },
    '554941' => {
      'BaseType' => '554808',
      'Name' => 'struct mctp_fq_addr[256]',
      'Size' => '2048',
      'Type' => 'Array'
    },
    '555817' => {
      'BaseType' => '554848',
      'Name' => 'struct pldm_transport_af_mctp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '555822' => {
      'BaseType' => '554803',
      'Name' => 'struct sockaddr_mctp const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '556139' => {
      'BaseType' => '555817',
      'Name' => 'struct pldm_transport_af_mctp**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '559705' => {
      'Line' => '27',
      'Memb' => {
        '0' => {
          'name' => 'transport',
          'offset' => '0',
          'type' => '554034'
        },
        '1' => {
          'name' => 'socket',
          'offset' => '64',
          'type' => '117'
        },
        '2' => {
          'name' => 'tid_eid_map',
          'offset' => '68',
          'type' => '559773'
        },
        '3' => {
          'name' => 'socket_send_buf',
          'offset' => '768',
          'type' => '551438'
        }
      },
      'Name' => 'struct pldm_transport_mctp_demux',
      'PrivateABI' => 1,
      'Size' => '312',
      'Source' => 'mctp-demux.c',
      'Type' => 'Struct'
    },
    '559773' => {
      'BaseType' => '6303',
      'Name' => 'pldm_tid_t[256]',
      'Size' => '256',
      'Type' => 'Array'
    },
    '560310' => {
      'BaseType' => '559705',
      'Name' => 'struct pldm_transport_mctp_demux*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '560816' => {
      'BaseType' => '560310',
      'Name' => 'struct pldm_transport_mctp_demux**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '582242' => {
      'Header' => 'file_io.h',
      'Line' => '32',
      'Memb' => {
        '0' => {
          'name' => 'handle',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'length',
          'offset' => '4',
          'type' => '174'
        },
        '2' => {
          'name' => 'data',
          'offset' => '8',
          'type' => '299432'
        }
      },
      'Name' => 'struct pldm_oem_meta_file_io_write_req',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '582309' => {
      'Header' => 'file_io.h',
      'Line' => '45',
      'Memb' => {
        '0' => {
          'name' => 'transferFlag',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'offset',
          'offset' => '2',
          'type' => '162'
        }
      },
      'Name' => 'struct pldm_oem_meta_file_io_read_data_info',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '582348' => {
      'Header' => 'file_io.h',
      'Line' => '55',
      'Memb' => {
        '0' => {
          'name' => 'size',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'crc32',
          'offset' => '4',
          'type' => '174'
        }
      },
      'Name' => 'struct pldm_oem_meta_file_io_read_attr_info',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '582387' => {
      'Header' => 'file_io.h',
      'Line' => '70',
      'Memb' => {
        '0' => {
          'name' => 'data',
          'offset' => '0',
          'type' => '582309'
        }
      },
      'Name' => 'anon-union-file_io.h-70',
      'Size' => '4',
      'Type' => 'Union'
    },
    '582405' => {
      'Header' => 'file_io.h',
      'Line' => '65',
      'Memb' => {
        '0' => {
          'name' => 'version',
          'offset' => '0',
          'type' => '883'
        },
        '1' => {
          'name' => 'handle',
          'offset' => '8',
          'type' => '150'
        },
        '2' => {
          'name' => 'option',
          'offset' => '9',
          'type' => '150'
        },
        '3' => {
          'name' => 'length',
          'offset' => '16',
          'type' => '150'
        },
        '4' => {
          'name' => 'info',
          'offset' => '18',
          'type' => '582387'
        }
      },
      'Name' => 'struct pldm_oem_meta_file_io_read_req',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '582483' => {
      'Header' => 'file_io.h',
      'Line' => '86',
      'Memb' => {
        '0' => {
          'name' => 'attr',
          'offset' => '0',
          'type' => '582348'
        },
        '1' => {
          'name' => 'data',
          'offset' => '0',
          'type' => '582309'
        }
      },
      'Name' => 'anon-union-file_io.h-86',
      'Size' => '8',
      'Type' => 'Union'
    },
    '582511' => {
      'Header' => 'file_io.h',
      'Line' => '80',
      'Memb' => {
        '0' => {
          'name' => 'version',
          'offset' => '0',
          'type' => '883'
        },
        '1' => {
          'name' => 'completion_code',
          'offset' => '8',
          'type' => '150'
        },
        '2' => {
          'name' => 'handle',
          'offset' => '9',
          'type' => '150'
        },
        '3' => {
          'name' => 'option',
          'offset' => '16',
          'type' => '150'
        },
        '4' => {
          'name' => 'length',
          'offset' => '17',
          'type' => '150'
        },
        '5' => {
          'name' => 'info',
          'offset' => '18',
          'type' => '582483'
        },
        '6' => {
          'name' => 'data',
          'offset' => '32',
          'type' => '299432'
        }
      },
      'Name' => 'struct pldm_oem_meta_file_io_read_resp',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '586798' => {
      'BaseType' => '582511',
      'Name' => 'struct pldm_oem_meta_file_io_read_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '589683' => {
      'BaseType' => '582405',
      'Name' => 'struct pldm_oem_meta_file_io_read_req*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '590122' => {
      'BaseType' => '582242',
      'Name' => 'struct pldm_oem_meta_file_io_write_req*',
      'Size' => '8',
      'Type' => 'Pointer'
    }
  },
  'UndefinedSymbols' => {
    'libpldm.so.0.16.0' => {
      '_ITM_deregisterTMCloneTable' => 0,
      '_ITM_registerTMCloneTable' => 0,
      '__assert_fail@GLIBC_2.2.5' => 0,
      '__cxa_finalize@GLIBC_2.2.5' => 0,
      '__errno_location@GLIBC_2.2.5' => 0,
      '__gmon_start__' => 0,
      '__isoc23_strtol@GLIBC_2.38' => 0,
      '__memcpy_chk@GLIBC_2.3.4' => 0,
      '__recv_chk@GLIBC_2.4' => 0,
      '__recvfrom_chk@GLIBC_2.4' => 0,
      '__stack_chk_fail@GLIBC_2.4' => 0,
      'bind@GLIBC_2.2.5' => 0,
      'calloc@GLIBC_2.2.5' => 0,
      'clock_gettime@GLIBC_2.17' => 0,
      'close@GLIBC_2.2.5' => 0,
      'connect@GLIBC_2.2.5' => 0,
      'dup@GLIBC_2.2.5' => 0,
      'fclose@GLIBC_2.2.5' => 0,
      'fcntl64@GLIBC_2.28' => 0,
      'fgets@GLIBC_2.2.5' => 0,
      'fopen64@GLIBC_2.2.5' => 0,
      'free@GLIBC_2.2.5' => 0,
      'getsockopt@GLIBC_2.2.5' => 0,
      'malloc@GLIBC_2.2.5' => 0,
      'memcmp@GLIBC_2.2.5' => 0,
      'memcpy@GLIBC_2.14' => 0,
      'memmem@GLIBC_2.2.5' => 0,
      'open64@GLIBC_2.2.5' => 0,
      'poll@GLIBC_2.2.5' => 0,
      'ppoll@GLIBC_2.4' => 0,
      'recv@GLIBC_2.2.5' => 0,
      'recvmsg@GLIBC_2.2.5' => 0,
      'sendmsg@GLIBC_2.2.5' => 0,
      'sendto@GLIBC_2.2.5' => 0,
      'setsockopt@GLIBC_2.2.5' => 0,
      'socket@GLIBC_2.2.5' => 0,
      'stat64@GLIBC_2.33' => 0,
      'strlen@GLIBC_2.2.5' => 0,
      'strnlen@GLIBC_2.2.5' => 0,
      'timerfd_create@GLIBC_2.8' => 0,
      'timerfd_settime@GLIBC_2.8' => 0,
      'write@GLIBC_2.2.5' => 0
    }
  },
  'WordSize' => '8'
};
