$VAR1 = {
          'ABI_DUMPER_VERSION' => '1.2',
          'ABI_DUMP_VERSION' => '3.5',
          'Arch' => 'x86_64',
          'GccVersion' => '13.2.0',
          'Headers' => {
                         'af-mctp.h' => 1,
                         'base.h' => 1,
                         'bios.h' => 1,
                         'bios_table.h' => 1,
                         'file_io.h' => 1,
                         'firmware_update.h' => 1,
                         'fru.h' => 1,
                         'host.h' => 1,
                         'instance-id.h' => 1,
                         'mctp-demux.h' => 1,
                         'pdr.h' => 1,
                         'platform.h' => 1,
                         'pldm.h' => 1,
                         'pldm_types.h' => 1,
                         'transport.h' => 1,
                         'utils.h' => 1
                       },
          'Language' => 'C',
          'LibraryName' => 'libpldm.so.0.7.0',
          'LibraryVersion' => '0.7.0',
          'NameSpaces' => {},
          'Needed' => {
                        'libc.so.6' => 1
                      },
          'PublicABI' => '1',
          'Sources' => {
                         'af-mctp.c' => 1,
                         'bios_table.c' => 1,
                         'instance-id.c' => 1,
                         'mctp-demux.c' => 1,
                         'pdr.c' => 1
                       },
          'SymbolInfo' => {
                            '1434' => {

                                                 'pldm_pdr_get_record_count' => 1,
                                                 'pldm_pdr_get_record_handle' => 1,
                                                 'pldm_pdr_get_repo_size' => 1,
                                                 'pldm_pdr_init' => 1,
                                                 'pldm_pdr_record_is_remote' => 1,
                                                 'pldm_pdr_remove_pdrs_by_terminus_handle' => 1,
                                                 'pldm_pdr_remove_remote_pdrs' => 1,
                                                 'pldm_pdr_update_TL_pdr' => 1,
                                                 'pldm_recv' => 1,
                                                 'pldm_recv_any' => 1,
                                                 'pldm_send' => 1,
                                                 'pldm_send_recv' => 1,
                                                 'pldm_transport_af_mctp_bind' => 1,
                                                 'pldm_transport_af_mctp_core' => 1,
                                                 'pldm_transport_af_mctp_destroy' => 1,
                                                 'pldm_transport_af_mctp_init' => 1,
                                                 'pldm_transport_af_mctp_init_pollfd' => 1,
                                                 'pldm_transport_af_mctp_map_tid' => 1,
                                                 'pldm_transport_af_mctp_unmap_tid' => 1,
                                                 'pldm_transport_mctp_demux_core' => 1,
                                                 'pldm_transport_mctp_demux_destroy' => 1,
                                                 'pldm_transport_mctp_demux_init' => 1,
                                                 'pldm_transport_mctp_demux_init_pollfd' => 1,
                                                 'pldm_transport_mctp_demux_map_tid' => 1,
                                                 'pldm_transport_mctp_demux_unmap_tid' => 1,
                                                 'pldm_transport_poll' => 1,
                                                 'pldm_transport_recv_msg' => 1,
                                                 'pldm_transport_send_msg' => 1,
                                                 'pldm_transport_send_recv_msg' => 1,
                                                 'pldm_transport_test_core' => 1,
                                                 'pldm_transport_test_destroy' => 1,
                                                 'pldm_transport_test_init' => 1,
                                                 'pldm_transport_test_init_pollfd' => 1,
                                                 'unpack_pldm_header' => 1,
                                                 'ver2str' => 1
                                               }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '46' => {
                                    'Name' => 'unsigned char',
                                    'Size' => '1',
                                    'Type' => 'Intrinsic'
                                  },
                          '53' => {
                                    'Name' => 'unsigned short',
                                    'Size' => '2',
                                    'Type' => 'Intrinsic'
                                  },
                          '60' => {
                                    'Name' => 'unsigned int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  },
                          '67' => {
                                    'Name' => 'unsigned long',
                                    'Size' => '8',
                                    'Type' => 'Intrinsic'
                                  },
                          '74' => {
                                    'Name' => 'signed char',
                                    'Size' => '1',
                                    'Type' => 'Intrinsic'
                                  },
                          '81' => {
                                    'BaseType' => '46',
                                    'Header' => 'types.h',
                                    'Line' => '38',
                                    'Name' => '__uint8_t',
                                    'PrivateABI' => 1,
                                    'Size' => '1',
                                    'Type' => 'Typedef'
                                  },
                          '93' => {
                                    'Name' => 'short',
                                    'Size' => '2',
                                    'Type' => 'Intrinsic'
                                  },
                          '100' => {
                                     'Name' => 'int',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '107' => {
                                     'BaseType' => '60',
                                     'Header' => 'types.h',
                                     'Line' => '42',
                                     'Name' => '__uint32_t',
                                     'PrivateABI' => 1,
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '119' => {
                                     'Name' => 'long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '126' => {
                                     'BaseType' => '1',
                                     'Name' => 'void*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '133' => {
                                     'Name' => 'char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '140' => {
                                     'BaseType' => '81',
                                     'Header' => 'stdint-uintn.h',
                                     'Line' => '24',
                                     'Name' => 'uint8_t',
                                     'PrivateABI' => 1,
                                     'Size' => '1',
                                     'Type' => 'Typedef'
                                   },
                          '152' => {
                                     'BaseType' => '107',
                                     'Header' => 'stdint-uintn.h',
                                     'Line' => '26',
                                     'Name' => 'uint32_t',
                                     'PrivateABI' => 1,
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '164' => {
                                     'Header' => 'pldm_types.h',
                                     'Line' => '9',
                                     'Name' => 'anon-struct-pldm_types.h-9',
                                     'Size' => '1',
                                     'Type' => 'Struct'
                                   },
                          '318' => {
                                     'Header' => 'pldm_types.h',
                                     'Line' => '19',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'byte',
                                                          'offset' => '0',
                                                          'type' => '140'
                                                        },
                                                 '1' => {
                                                          'name' => 'bits',
                                                          'offset' => '0',
                                                          'type' => '164'
                                                        }
                                               },
                                     'Name' => 'union bitfield8_t',
                                     'Size' => '1',
                                     'Type' => 'Union'
                                   },
                          '330' => {
                                     'BaseType' => '318',
                                     'Name' => 'bitfield8_t const',
                                     'Size' => '1',
                                     'Type' => 'Const'
                                   },
                          '335' => {
                                     'Header' => 'pldm_types.h',
                                     'Line' => '25',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'alpha',
                                                          'offset' => '0',
                                                          'type' => '140'
                                                        },
                                                 '1' => {
                                                          'name' => 'update',
                                                          'offset' => '1',
                                                          'type' => '140'
                                                        },
                                                 '2' => {
                                                          'name' => 'minor',
                                                          'offset' => '2',
                                                          'type' => '140'
                                                        },
                                                 '3' => {
                                                          'name' => 'major',
                                                          'offset' => '3',
                                                          'type' => '140'
                                                        }
                                               },
                                     'Name' => 'struct pldm_version',
                                     'Size' => '4',
                                     'Type' => 'Struct'
                                   },
                          '401' => {
                                     'BaseType' => '335',
                                     'Header' => 'pldm_types.h',
                                     'Line' => '30',
                                     'Name' => 'ver32_t',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '413' => {
                                     'BaseType' => '401',
                                     'Name' => 'ver32_t const',
                                     'Size' => '4',
                                     'Type' => 'Const'
                                   },
                          '418' => {
                                     'Name' => 'float',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '453' => {
                                     'BaseType' => '67',
                                     'Header' => 'stddef.h',
                                     'Line' => '214',
                                     'Name' => 'size_t',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '733' => {
                                     'Header' => 'base.h',
                                     'Line' => '92',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'PLDM_RESPONSE',
                                                          'value' => '0'
                                                        },
                                                 '1' => {
                                                          'name' => 'PLDM_REQUEST',
                                                          'value' => '1'
                                                        },
                                                 '2' => {
                                                          'name' => 'PLDM_RESERVED',
                                                          'value' => '2'
                                                        },
                                                 '3' => {
                                                          'name' => 'PLDM_ASYNC_REQUEST_NOTIFY',
                                                          'value' => '3'
                                                        }
                                               },
                                     'Name' => 'enum MessageType',
                                     'Size' => '4',
                                     'Type' => 'Enum'
                                   },
                          '745' => {
                                     'Header' => 'base.h',
                                     'Line' => '121',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'command',
                                                          'offset' => '2',
                                                          'type' => '140'
                                                        }
                                               },
                                     'Name' => 'struct pldm_msg_hdr',
                                     'Size' => '3',
                                     'Type' => 'Struct'
                                   },
                          '856' => {
                                     'BaseType' => '745',
                                     'Name' => 'struct pldm_msg_hdr const',
                                     'Size' => '3',
                                     'Type' => 'Const'
                                   },
                          '861' => {
                                     'Header' => 'base.h',
                                     'Line' => '154',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'hdr',
                                                          'offset' => '0',
                                                          'type' => '745'
                                                        },
                                                 '1' => {
                                                          'name' => 'payload',
                                                          'offset' => '3',
                                                          'type' => '904'
                                                        }
                                               },
                                     'Name' => 'struct pldm_msg',
                                     'Size' => '4',
                                     'Type' => 'Struct'
                                   },
                          '899' => {
                                     'BaseType' => '861',
                                     'Name' => 'struct pldm_msg const',
                                     'Size' => '4',
                                     'Type' => 'Const'
                                   },
                          '904' => {
                                     'BaseType' => '140',
                                     'Name' => 'uint8_t[1]',
                                     'Size' => '1',
                                     'Type' => 'Array'
                                   },
                          '920' => {
                                     'Header' => 'base.h',
                                     'Line' => '180',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'msg_type',
                                                          'offset' => '0',
                                                          'type' => '733'
                                                        },
                                                 '1' => {
                                                          'name' => 'instance',
                                                          'offset' => '4',
                                                          'type' => '140'
                                                        },
                                                 '2' => {
                                                          'name' => 'pldm_type',
                                                          'offset' => '5',
                                                          'type' => '140'
                                                        },
                                                 '3' => {
                                                          'name' => 'command',
                                                          'offset' => '6',
                                                          'type' => '140'
                                                        },
                                                 '4' => {
                                                          'name' => 'completion_code',
                                                          'offset' => '7',
                                                          'type' => '140'
                                                        }
                                               },
                                     'Name' => 'struct pldm_header_info',
                                     'Size' => '8',
                                     'Type' => 'Struct'
                                   },
                          '999' => {
                                     'BaseType' => '920',
                                     'Name' => 'struct pldm_header_info const',
                                     'Size' => '8',
                                     'Type' => 'Const'
                                   },
                          '1627' => {
                                      'BaseType' => '861',
                                      'Name' => 'struct pldm_msg*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2074' => {
                                      'BaseType' => '899',
                                      'Name' => 'struct pldm_msg const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2079' => {
                                      'BaseType' => '140',
                                      'Name' => 'uint8_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2084' => {
                                      'BaseType' => '152',
                                      'Name' => 'uint32_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2979' => {
                                      'BaseType' => '401',
                                      'Name' => 'ver32_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '3484' => {
                                      'BaseType' => '413',
                                      'Name' => 'ver32_t const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '3892' => {
                                      'BaseType' => '318',
                                      'Name' => 'bitfield8_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4350' => {
                                      'BaseType' => '330',
                                      'Name' => 'bitfield8_t const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '5126' => {
                                      'Name' => '_Bool',
                                      'Size' => '1',
                                      'Type' => 'Intrinsic'
                                    },
                          '5133' => {
                                      'BaseType' => '856',
                                      'Name' => 'struct pldm_msg_hdr const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '5199' => {
                                      'BaseType' => '920',
                                      'Name' => 'struct pldm_header_info*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '5290' => {
                                      'BaseType' => '999',
                                      'Name' => 'struct pldm_header_info const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '5295' => {
                                      'BaseType' => '745',
                                      'Name' => 'struct pldm_msg_hdr*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '5345' => {
                                      'BaseType' => '5355',
                                      'Name' => 'void const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '5355' => {
                                      'BaseType' => '1',
                                      'Name' => 'void const',
                                      'Type' => 'Const'
                                    },
                          '5507' => {
                                      'BaseType' => '53',
                                      'Header' => 'types.h',
                                      'Line' => '40',
                                      'Name' => '__uint16_t',
                                      'PrivateABI' => 1,
                                      'Size' => '2',
                                      'Type' => 'Typedef'
                                    },
                          '5571' => {
                                      'BaseType' => '140',
                                      'Name' => 'uint8_t const',
                                      'Size' => '1',
                                      'Type' => 'Const'
                                    },
                          '5576' => {
                                      'BaseType' => '5507',
                                      'Header' => 'stdint-uintn.h',
                                      'Line' => '25',
                                      'Name' => 'uint16_t',
                                      'PrivateABI' => 1,
                                      'Size' => '2',
                                      'Type' => 'Typedef'
                                    },
                          '6781' => {
                                      'Header' => 'utils.h',
                                      'Line' => '20',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ptr',
                                                           'offset' => '0',
                                                           'type' => '6820'
                                                         },
                                                  '1' => {
                                                           'name' => 'length',
                                                           'offset' => '8',
                                                           'type' => '453'
                                                         }
                                                },
                                      'Name' => 'struct variable_field',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '6820' => {
                                      'BaseType' => '5571',
                                      'Name' => 'uint8_t const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7177' => {
                                      'BaseType' => '6781',
                                      'Name' => 'struct variable_field*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '9259' => {
                                      'BaseType' => '5576',
                                      'Name' => 'uint16_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '9822' => {
                                      'BaseType' => '453',
                                      'Name' => 'size_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '12434' => {
                                       'BaseType' => '74',
                                       'Header' => 'types.h',
                                       'Line' => '37',
                                       'Name' => '__int8_t',
                                       'PrivateABI' => 1,
                                       'Size' => '1',
                                       'Type' => 'Typedef'
                                     },
                          '12465' => {
                                       'BaseType' => '93',
                                       'Header' => 'types.h',
                                       'Line' => '39',
                                       'Name' => '__int16_t',
                                       'PrivateABI' => 1,
                                       'Size' => '2',
                                       'Type' => 'Typedef'
                                     },
                          '12496' => {
                                       'BaseType' => '100',
                                       'Header' => 'types.h',
                                       'Line' => '41',
                                       'Name' => '__int32_t',
                                       'PrivateABI' => 1,
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '12541' => {
                                       'BaseType' => '119',
                                       'Header' => 'types.h',
                                       'Line' => '194',
                                       'Name' => '__ssize_t',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '12553' => {
                                       'BaseType' => '133',
                                       'Name' => 'char*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '12570' => {
                                       'BaseType' => '133',
                                       'Name' => 'char const',
                                       'Size' => '1',
                                       'Type' => 'Const'
                                     },
                          '12575' => {
                                       'BaseType' => '12434',
                                       'Header' => 'stdint-intn.h',
                                       'Line' => '24',
                                       'Name' => 'int8_t',
                                       'PrivateABI' => 1,
                                       'Size' => '1',
                                       'Type' => 'Typedef'
                                     },
                          '12587' => {
                                       'BaseType' => '12465',
                                       'Header' => 'stdint-intn.h',
                                       'Line' => '25',
                                       'Name' => 'int16_t',
                                       'PrivateABI' => 1,
                                       'Size' => '2',
                                       'Type' => 'Typedef'
                                     },
                          '12599' => {
                                       'BaseType' => '12496',
                                       'Header' => 'stdint-intn.h',
                                       'Line' => '26',
                                       'Name' => 'int32_t',
                                       'PrivateABI' => 1,
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '12640' => {
                                       'BaseType' => '5576',
                                       'Name' => 'uint16_t const',
                                       'Size' => '2',
                                       'Type' => 'Const'
                                     },
                          '12657' => {
                                       'BaseType' => '152',
                                       'Name' => 'uint32_t const',
                                       'Size' => '4',
                                       'Type' => 'Const'
                                     },
                          '12828' => {
                                       'BaseType' => '140',
                                       'Header' => 'pldm_types.h',
                                       'Line' => '32',
                                       'Name' => 'bool8_t',
                                       'Size' => '1',
                                       'Type' => 'Typedef'
                                     },
                          '12840' => {
                                       'BaseType' => '418',
                                       'Header' => 'pldm_types.h',
                                       'Line' => '164',
                                       'Name' => 'real32_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '12899' => {
                                       'BaseType' => '453',
                                       'Name' => 'size_t const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '13445' => {
                                       'BaseType' => '12570',
                                       'Name' => 'char const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '13450' => {
                                       'BaseType' => '12541',
                                       'Header' => 'types.h',
                                       'Line' => '108',
                                       'Name' => 'ssize_t',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '13986' => {
                                       'Header' => 'platform.h',
                                       'Line' => '238',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'PLDM_SENSOR_OP_STATE',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'PLDM_STATE_SENSOR_STATE',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'PLDM_NUMERIC_SENSOR_STATE',
                                                            'value' => '2'
                                                          }
                                                 },
                                       'Name' => 'enum sensor_event_class_states',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '14020' => {
                                       'BaseType' => '13986',
                                       'Name' => 'enum sensor_event_class_states const',
                                       'Size' => '4',
                                       'Type' => 'Const'
                                     },
                          '14243' => {
                                       'Header' => 'platform.h',
                                       'Line' => '455',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'record_handle',
                                                            'offset' => '0',
                                                            'type' => '152'
                                                          },
                                                   '1' => {
                                                            'name' => 'version',
                                                            'offset' => '4',
                                                            'type' => '140'
                                                          },
                                                   '2' => {
                                                            'name' => 'type',
                                                            'offset' => '5',
                                                            'type' => '140'
                                                          },
                                                   '3' => {
                                                            'name' => 'record_change_num',
                                                            'offset' => '6',
                                                            'type' => '5576'
                                                          },
                                                   '4' => {
                                                            'name' => 'length',
                                                            'offset' => '8',
                                                            'type' => '5576'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_pdr_hdr',
                                       'Size' => '10',
                                       'Type' => 'Struct'
                                     },
                          '14322' => {
                                       'Header' => 'platform.h',
                                       'Line' => '530',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '14243'
                                                          },
                                                   '1' => {
                                                            'name' => 'terminus_handle',
                                                            'offset' => '16',
                                                            'type' => '5576'
                                                          },
                                                   '2' => {
                                                            'name' => 'sensor_id',
                                                            'offset' => '18',
                                                            'type' => '5576'
                                                          },
                                                   '3' => {
                                                            'name' => 'entity_type',
                                                            'offset' => '20',
                                                            'type' => '5576'
                                                          },
                                                   '4' => {
                                                            'name' => 'entity_instance',
                                                            'offset' => '22',
                                                            'type' => '5576'
                                                          },
                                                   '5' => {
                                                            'name' => 'container_id',
                                                            'offset' => '24',
                                                            'type' => '5576'
                                                          },
                                                   '6' => {
                                                            'name' => 'sensor_init',
                                                            'offset' => '32',
                                                            'type' => '140'
                                                          },
                                                   '7' => {
                                                            'name' => 'sensor_auxiliary_names_pdr',
                                                            'offset' => '33',
                                                            'type' => '12828'
                                                          },
                                                   '8' => {
                                                            'name' => 'composite_sensor_count',
                                                            'offset' => '34',
                                                            'type' => '140'
                                                          },
                                                   '9' => {
                                                            'name' => 'possible_states',
                                                            'offset' => '35',
                                                            'type' => '904'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_state_sensor_pdr',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '14466' => {
                                       'Header' => 'platform.h',
                                       'Line' => '547',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'state_set_id',
                                                            'offset' => '0',
                                                            'type' => '5576'
                                                          },
                                                   '1' => {
                                                            'name' => 'possible_states_size',
                                                            'offset' => '2',
                                                            'type' => '140'
                                                          },
                                                   '2' => {
                                                            'name' => 'states',
                                                            'offset' => '3',
                                                            'type' => '14524'
                                                          }
                                                 },
                                       'Name' => 'struct state_sensor_possible_states',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '14519' => {
                                       'BaseType' => '14466',
                                       'Name' => 'struct state_sensor_possible_states const',
                                       'Size' => '4',
                                       'Type' => 'Const'
                                     },
                          '14524' => {
                                       'BaseType' => '318',
                                       'Name' => 'bitfield8_t[1]',
                                       'Size' => '1',
                                       'Type' => 'Array'
                                     },
                          '14540' => {
                                       'Header' => 'platform.h',
                                       'Line' => '557',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '14243'
                                                          },
                                                   '1' => {
                                                            'name' => 'terminus_handle',
                                                            'offset' => '16',
                                                            'type' => '5576'
                                                          },
                                                   '2' => {
                                                            'name' => 'effecter_id',
                                                            'offset' => '18',
                                                            'type' => '5576'
                                                          },
                                                   '3' => {
                                                            'name' => 'entity_type',
                                                            'offset' => '20',
                                                            'type' => '5576'
                                                          },
                                                   '4' => {
                                                            'name' => 'entity_instance',
                                                            'offset' => '22',
                                                            'type' => '5576'
                                                          },
                                                   '5' => {
                                                            'name' => 'container_id',
                                                            'offset' => '24',
                                                            'type' => '5576'
                                                          },
                                                   '6' => {
                                                            'name' => 'effecter_semantic_id',
                                                            'offset' => '32',
                                                            'type' => '5576'
                                                          },
                                                   '7' => {
                                                            'name' => 'effecter_init',
                                                            'offset' => '34',
                                                            'type' => '140'
                                                          },
                                                   '8' => {
                                                            'name' => 'has_description_pdr',
                                                            'offset' => '35',
                                                            'type' => '12828'
                                                          },
                                                   '9' => {
                                                            'name' => 'composite_effecter_count',
                                                            'offset' => '36',
                                                            'type' => '140'
                                                          },
                                                   '10' => {
                                                             'name' => 'possible_states',
                                                             'offset' => '37',
                                                             'type' => '904'
                                                           }
                                                 },
                                       'Name' => 'struct pldm_state_effecter_pdr',
                                       'Size' => '26',
                                       'Type' => 'Struct'
                                     },
                          '14791' => {
                                       'Header' => 'platform.h',
                                       'Line' => '648',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'value_u8',
                                                            'offset' => '0',
                                                            'type' => '140'
                                                          },
                                                   '1' => {
                                                            'name' => 'value_s8',
                                                            'offset' => '0',
                                                            'type' => '12575'
                                                          },
                                                   '2' => {
                                                            'name' => 'value_u16',
                                                            'offset' => '0',
                                                            'type' => '5576'
                                                          },
                                                   '3' => {
                                                            'name' => 'value_s16',
                                                            'offset' => '0',
                                                            'type' => '12587'
                                                          },
                                                   '4' => {
                                                            'name' => 'value_u32',
                                                            'offset' => '0',
                                                            'type' => '152'
                                                          },
                                                   '5' => {
                                                            'name' => 'value_s32',
                                                            'offset' => '0',
                                                            'type' => '12599'
                                                          },
                                                   '6' => {
                                                            'name' => 'value_f32',
                                                            'offset' => '0',
                                                            'type' => '12840'
                                                          }
                                                 },
                                       'Name' => 'union union_range_field_format',
                                       'Size' => '4',
                                       'Type' => 'Union'
                                     },
                          '14885' => {
                                       'Header' => 'platform.h',
                                       'Line' => '705',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'value_u8',
                                                            'offset' => '0',
                                                            'type' => '140'
                                                          },
                                                   '1' => {
                                                            'name' => 'value_s8',
                                                            'offset' => '0',
                                                            'type' => '12575'
                                                          },
                                                   '2' => {
                                                            'name' => 'value_u16',
                                                            'offset' => '0',
                                                            'type' => '5576'
                                                          },
                                                   '3' => {
                                                            'name' => 'value_s16',
                                                            'offset' => '0',
                                                            'type' => '12587'
                                                          },
                                                   '4' => {
                                                            'name' => 'value_u32',
                                                            'offset' => '0',
                                                            'type' => '152'
                                                          },
                                                   '5' => {
                                                            'name' => 'value_s32',
                                                            'offset' => '0',
                                                            'type' => '12599'
                                                          }
                                                 },
                                       'Name' => 'union union_sensor_data_size',
                                       'Size' => '4',
                                       'Type' => 'Union'
                                     },
                          '14897' => {
                                       'Header' => 'platform.h',
                                       'Line' => '712',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'record_handle',
                                                            'offset' => '0',
                                                            'type' => '152'
                                                          },
                                                   '1' => {
                                                            'name' => 'version',
                                                            'offset' => '4',
                                                            'type' => '140'
                                                          },
                                                   '2' => {
                                                            'name' => 'type',
                                                            'offset' => '5',
                                                            'type' => '140'
                                                          },
                                                   '3' => {
                                                            'name' => 'record_change_num',
                                                            'offset' => '6',
                                                            'type' => '5576'
                                                          },
                                                   '4' => {
                                                            'name' => 'length',
                                                            'offset' => '8',
                                                            'type' => '5576'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_value_pdr_hdr',
                                       'Size' => '12',
                                       'Type' => 'Struct'
                                     },
                          '14976' => {
                                       'Header' => 'platform.h',
                                       'Line' => '730',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'entity_instance_num',
                                                            'offset' => '0',
                                                            'type' => '5576'
                                                          },
                                                   '1' => {
                                                            'name' => 'entity_instance',
                                                            'offset' => '0',
                                                            'type' => '5576'
                                                          }
                                                 },
                                       'Name' => 'anon-union-platform.h-730',
                                       'Size' => '2',
                                       'Type' => 'Union'
                                     },
                          '15010' => {
                                       'Header' => 'platform.h',
                                       'Line' => '725',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '14897'
                                                          },
                                                   '1' => {
                                                            'name' => 'terminus_handle',
                                                            'offset' => '18',
                                                            'type' => '5576'
                                                          },
                                                   '2' => {
                                                            'name' => 'sensor_id',
                                                            'offset' => '20',
                                                            'type' => '5576'
                                                          },
                                                   '3' => {
                                                            'name' => 'entity_type',
                                                            'offset' => '22',
                                                            'type' => '5576'
                                                          },
                                                   '4' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '24',
                                                            'type' => '14976'
                                                          },
                                                   '5' => {
                                                            'name' => 'container_id',
                                                            'offset' => '32',
                                                            'type' => '5576'
                                                          },
                                                   '6' => {
                                                            'name' => 'sensor_init',
                                                            'offset' => '34',
                                                            'type' => '140'
                                                          },
                                                   '7' => {
                                                            'name' => 'sensor_auxiliary_names_pdr',
                                                            'offset' => '35',
                                                            'type' => '12828'
                                                          },
                                                   '8' => {
                                                            'name' => 'base_unit',
                                                            'offset' => '36',
                                                            'type' => '140'
                                                          },
                                                   '9' => {
                                                            'name' => 'unit_modifier',
                                                            'offset' => '37',
                                                            'type' => '12575'
                                                          },
                                                   '10' => {
                                                             'name' => 'rate_unit',
                                                             'offset' => '38',
                                                             'type' => '140'
                                                           },
                                                   '11' => {
                                                             'name' => 'base_oem_unit_handle',
                                                             'offset' => '39',
                                                             'type' => '140'
                                                           },
                                                   '12' => {
                                                             'name' => 'aux_unit',
                                                             'offset' => '40',
                                                             'type' => '140'
                                                           },
                                                   '13' => {
                                                             'name' => 'aux_unit_modifier',
                                                             'offset' => '41',
                                                             'type' => '12575'
                                                           },
                                                   '14' => {
                                                             'name' => 'aux_rate_unit',
                                                             'offset' => '48',
                                                             'type' => '140'
                                                           },
                                                   '15' => {
                                                             'name' => 'rel',
                                                             'offset' => '49',
                                                             'type' => '140'
                                                           },
                                                   '16' => {
                                                             'name' => 'aux_oem_unit_handle',
                                                             'offset' => '50',
                                                             'type' => '140'
                                                           },
                                                   '17' => {
                                                             'name' => 'is_linear',
                                                             'offset' => '51',
                                                             'type' => '12828'
                                                           },
                                                   '18' => {
                                                             'name' => 'sensor_data_size',
                                                             'offset' => '52',
                                                             'type' => '140'
                                                           },
                                                   '19' => {
                                                             'name' => 'resolution',
                                                             'offset' => '54',
                                                             'type' => '12840'
                                                           },
                                                   '20' => {
                                                             'name' => 'offset',
                                                             'offset' => '64',
                                                             'type' => '12840'
                                                           },
                                                   '21' => {
                                                             'name' => 'accuracy',
                                                             'offset' => '68',
                                                             'type' => '5576'
                                                           },
                                                   '22' => {
                                                             'name' => 'plus_tolerance',
                                                             'offset' => '70',
                                                             'type' => '140'
                                                           },
                                                   '23' => {
                                                             'name' => 'minus_tolerance',
                                                             'offset' => '71',
                                                             'type' => '140'
                                                           },
                                                   '24' => {
                                                             'name' => 'hysteresis',
                                                             'offset' => '72',
                                                             'type' => '14885'
                                                           },
                                                   '25' => {
                                                             'name' => 'supported_thresholds',
                                                             'offset' => '82',
                                                             'type' => '318'
                                                           },
                                                   '26' => {
                                                             'name' => 'threshold_and_hysteresis_volatility',
                                                             'offset' => '83',
                                                             'type' => '318'
                                                           },
                                                   '27' => {
                                                             'name' => 'state_transition_interval',
                                                             'offset' => '86',
                                                             'type' => '12840'
                                                           },
                                                   '28' => {
                                                             'name' => 'update_interval',
                                                             'offset' => '96',
                                                             'type' => '12840'
                                                           },
                                                   '29' => {
                                                             'name' => 'max_readable',
                                                             'offset' => '100',
                                                             'type' => '14885'
                                                           },
                                                   '30' => {
                                                             'name' => 'min_readable',
                                                             'offset' => '104',
                                                             'type' => '14885'
                                                           },
                                                   '31' => {
                                                             'name' => 'range_field_format',
                                                             'offset' => '114',
                                                             'type' => '140'
                                                           },
                                                   '32' => {
                                                             'name' => 'range_field_support',
                                                             'offset' => '115',
                                                             'type' => '318'
                                                           },
                                                   '33' => {
                                                             'name' => 'nominal_value',
                                                             'offset' => '118',
                                                             'type' => '14791'
                                                           },
                                                   '34' => {
                                                             'name' => 'normal_max',
                                                             'offset' => '128',
                                                             'type' => '14791'
                                                           },
                                                   '35' => {
                                                             'name' => 'normal_min',
                                                             'offset' => '132',
                                                             'type' => '14791'
                                                           },
                                                   '36' => {
                                                             'name' => 'warning_high',
                                                             'offset' => '136',
                                                             'type' => '14791'
                                                           },
                                                   '37' => {
                                                             'name' => 'warning_low',
                                                             'offset' => '146',
                                                             'type' => '14791'
                                                           },
                                                   '38' => {
                                                             'name' => 'critical_high',
                                                             'offset' => '150',
                                                             'type' => '14791'
                                                           },
                                                   '39' => {
                                                             'name' => 'critical_low',
                                                             'offset' => '256',
                                                             'type' => '14791'
                                                           },
                                                   '40' => {
                                                             'name' => 'fatal_high',
                                                             'offset' => '260',
                                                             'type' => '14791'
                                                           },
                                                   '41' => {
                                                             'name' => 'fatal_low',
                                                             'offset' => '264',
                                                             'type' => '14791'
                                                           }
                                                 },
                                       'Name' => 'struct pldm_numeric_sensor_value_pdr',
                                       'Size' => '112',
                                       'Type' => 'Struct'
                                     },
                          '15563' => {
                                       'Header' => 'platform.h',
                                       'Line' => '777',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'state_set_id',
                                                            'offset' => '0',
                                                            'type' => '5576'
                                                          },
                                                   '1' => {
                                                            'name' => 'possible_states_size',
                                                            'offset' => '2',
                                                            'type' => '140'
                                                          },
                                                   '2' => {
                                                            'name' => 'states',
                                                            'offset' => '3',
                                                            'type' => '14524'
                                                          }
                                                 },
                                       'Name' => 'struct state_effecter_possible_states',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '15616' => {
                                       'BaseType' => '15563',
                                       'Name' => 'struct state_effecter_possible_states const',
                                       'Size' => '4',
                                       'Type' => 'Const'
                                     },
                          '15621' => {
                                       'Header' => 'platform.h',
                                       'Line' => '825',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'set_request',
                                                            'offset' => '0',
                                                            'type' => '140'
                                                          },
                                                   '1' => {
                                                            'name' => 'effecter_state',
                                                            'offset' => '1',
                                                            'type' => '140'
                                                          }
                                                 },
                                       'Name' => 'struct state_field_for_state_effecter_set',
                                       'Size' => '2',
                                       'Type' => 'Struct'
                                     },
                          '15661' => {
                                       'BaseType' => '15621',
                                       'Header' => 'platform.h',
                                       'Line' => '828',
                                       'Name' => 'set_effecter_state_field',
                                       'Size' => '2',
                                       'Type' => 'Typedef'
                                     },
                          '15673' => {
                                       'Header' => 'platform.h',
                                       'Line' => '834',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'sensor_op_state',
                                                            'offset' => '0',
                                                            'type' => '140'
                                                          },
                                                   '1' => {
                                                            'name' => 'present_state',
                                                            'offset' => '1',
                                                            'type' => '140'
                                                          },
                                                   '2' => {
                                                            'name' => 'previous_state',
                                                            'offset' => '2',
                                                            'type' => '140'
                                                          },
                                                   '3' => {
                                                            'name' => 'event_state',
                                                            'offset' => '3',
                                                            'type' => '140'
                                                          }
                                                 },
                                       'Name' => 'struct state_field_for_get_state_sensor_readings',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '15739' => {
                                       'BaseType' => '15673',
                                       'Header' => 'platform.h',
                                       'Line' => '842',
                                       'Name' => 'get_sensor_state_field',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '15938' => {
                                       'BaseType' => '140',
                                       'Name' => 'uint8_t[13]',
                                       'Size' => '13',
                                       'Type' => 'Array'
                                     },
                          '16420' => {
                                       'Header' => 'platform.h',
                                       'Line' => '979',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'sensor_id',
                                                            'offset' => '0',
                                                            'type' => '5576'
                                                          },
                                                   '1' => {
                                                            'name' => 'sensor_event_class_type',
                                                            'offset' => '2',
                                                            'type' => '140'
                                                          },
                                                   '2' => {
                                                            'name' => 'event_class',
                                                            'offset' => '3',
                                                            'type' => '904'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_sensor_event_data',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '16632' => {
                                       'Header' => 'platform.h',
                                       'Line' => '1060',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'event_data_format',
                                                            'offset' => '0',
                                                            'type' => '140'
                                                          },
                                                   '1' => {
                                                            'name' => 'number_of_change_records',
                                                            'offset' => '1',
                                                            'type' => '140'
                                                          },
                                                   '2' => {
                                                            'name' => 'change_records',
                                                            'offset' => '2',
                                                            'type' => '904'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_pdr_repository_chg_event_data',
                                       'Size' => '3',
                                       'Type' => 'Struct'
                                     },
                          '17829' => {
                                       'BaseType' => '126',
                                       'Name' => 'void**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '22136' => {
                                       'BaseType' => '9822',
                                       'Name' => 'size_t*const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '23753' => {
                                       'BaseType' => '23763',
                                       'Name' => 'uint32_t const*const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '23758' => {
                                       'BaseType' => '12657',
                                       'Name' => 'uint32_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '23763' => {
                                       'BaseType' => '23758',
                                       'Name' => 'uint32_t const*const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '23768' => {
                                       'BaseType' => '16632',
                                       'Name' => 'struct pldm_pdr_repository_chg_event_data*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '30475' => {
                                       'BaseType' => '15010',
                                       'Name' => 'struct pldm_numeric_sensor_value_pdr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '37113' => {
                                       'BaseType' => '16420',
                                       'Name' => 'struct pldm_sensor_event_data*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '37118' => {
                                       'BaseType' => '37113',
                                       'Name' => 'struct pldm_sensor_event_data*const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '38119' => {
                                       'BaseType' => '15739',
                                       'Name' => 'get_sensor_state_field*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '43720' => {
                                       'BaseType' => '15661',
                                       'Name' => 'set_effecter_state_field*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '44703' => {
                                       'BaseType' => '14322',
                                       'Name' => 'struct pldm_state_sensor_pdr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '44708' => {
                                       'BaseType' => '44703',
                                       'Name' => 'struct pldm_state_sensor_pdr*const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '44713' => {
                                       'BaseType' => '14519',
                                       'Name' => 'struct state_sensor_possible_states const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '44718' => {
                                       'BaseType' => '44713',
                                       'Name' => 'struct state_sensor_possible_states const*const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '45115' => {
                                       'BaseType' => '14540',
                                       'Name' => 'struct pldm_state_effecter_pdr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '45120' => {
                                       'BaseType' => '45115',
                                       'Name' => 'struct pldm_state_effecter_pdr*const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '45125' => {
                                       'BaseType' => '15616',
                                       'Name' => 'struct state_effecter_possible_states const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '45130' => {
                                       'BaseType' => '45125',
                                       'Name' => 'struct state_effecter_possible_states const*const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '49514' => {
                                       'BaseType' => '67',
                                       'Header' => 'types.h',
                                       'Line' => '45',
                                       'Name' => '__uint64_t',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '49608' => {
                                       'BaseType' => '49514',
                                       'Header' => 'stdint-uintn.h',
                                       'Line' => '27',
                                       'Name' => 'uint64_t',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '49754' => {
                                       'Header' => 'bios.h',
                                       'Line' => '39',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'PLDM_BIOS_STRING_TABLE',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'PLDM_BIOS_ATTR_TABLE',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'PLDM_BIOS_ATTR_VAL_TABLE',
                                                            'value' => '2'
                                                          }
                                                 },
                                       'Name' => 'enum pldm_bios_table_types',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '49788' => {
                                       'Header' => 'bios.h',
                                       'Line' => '48',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'string_handle',
                                                            'offset' => '0',
                                                            'type' => '5576'
                                                          },
                                                   '1' => {
                                                            'name' => 'string_length',
                                                            'offset' => '2',
                                                            'type' => '5576'
                                                          },
                                                   '2' => {
                                                            'name' => 'name',
                                                            'offset' => '4',
                                                            'type' => '49845'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_string_table_entry',
                                       'Size' => '5',
                                       'Type' => 'Struct'
                                     },
                          '49840' => {
                                       'BaseType' => '49788',
                                       'Name' => 'struct pldm_bios_string_table_entry const',
                                       'Size' => '5',
                                       'Type' => 'Const'
                                     },
                          '49845' => {
                                       'BaseType' => '133',
                                       'Name' => 'char[1]',
                                       'Size' => '1',
                                       'Type' => 'Array'
                                     },
                          '49861' => {
                                       'Header' => 'bios.h',
                                       'Line' => '54',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'attr_handle',
                                                            'offset' => '0',
                                                            'type' => '5576'
                                                          },
                                                   '1' => {
                                                            'name' => 'attr_type',
                                                            'offset' => '2',
                                                            'type' => '140'
                                                          },
                                                   '2' => {
                                                            'name' => 'string_handle',
                                                            'offset' => '3',
                                                            'type' => '5576'
                                                          },
                                                   '3' => {
                                                            'name' => 'metadata',
                                                            'offset' => '5',
                                                            'type' => '904'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_attr_table_entry',
                                       'Size' => '6',
                                       'Type' => 'Struct'
                                     },
                          '49926' => {
                                       'BaseType' => '49861',
                                       'Name' => 'struct pldm_bios_attr_table_entry const',
                                       'Size' => '6',
                                       'Type' => 'Const'
                                     },
                          '49931' => {
                                       'Header' => 'bios.h',
                                       'Line' => '66',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'attr_handle',
                                                            'offset' => '0',
                                                            'type' => '5576'
                                                          },
                                                   '1' => {
                                                            'name' => 'attr_type',
                                                            'offset' => '2',
                                                            'type' => '140'
                                                          },
                                                   '2' => {
                                                            'name' => 'value',
                                                            'offset' => '3',
                                                            'type' => '904'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_attr_val_table_entry',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '49983' => {
                                       'BaseType' => '49931',
                                       'Name' => 'struct pldm_bios_attr_val_table_entry const',
                                       'Size' => '4',
                                       'Type' => 'Const'
                                     },
                          '50052' => {
                                       'Header' => 'bios_table.h',
                                       'Line' => '206',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'name_handle',
                                                            'offset' => '0',
                                                            'type' => '5576'
                                                          },
                                                   '1' => {
                                                            'name' => 'read_only',
                                                            'offset' => '2',
                                                            'type' => '5126'
                                                          },
                                                   '2' => {
                                                            'name' => 'pv_num',
                                                            'offset' => '3',
                                                            'type' => '140'
                                                          },
                                                   '3' => {
                                                            'name' => 'pv_handle',
                                                            'offset' => '8',
                                                            'type' => '50181'
                                                          },
                                                   '4' => {
                                                            'name' => 'def_num',
                                                            'offset' => '22',
                                                            'type' => '140'
                                                          },
                                                   '5' => {
                                                            'name' => 'def_index',
                                                            'offset' => '36',
                                                            'type' => '6820'
                                                          },
                                                   '6' => {
                                                            'name' => 'vdn_num',
                                                            'offset' => '50',
                                                            'type' => '140'
                                                          },
                                                   '7' => {
                                                            'name' => 'vdn_handle',
                                                            'offset' => '64',
                                                            'type' => '50181'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_table_attr_entry_enum_info',
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '50169' => {
                                       'BaseType' => '50052',
                                       'Name' => 'struct pldm_bios_table_attr_entry_enum_info const',
                                       'Size' => '48',
                                       'Type' => 'Const'
                                     },
                          '50181' => {
                                       'BaseType' => '12640',
                                       'Name' => 'uint16_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '50191' => {
                                       'Header' => 'bios_table.h',
                                       'Line' => '349',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'name_handle',
                                                            'offset' => '0',
                                                            'type' => '5576'
                                                          },
                                                   '1' => {
                                                            'name' => 'read_only',
                                                            'offset' => '2',
                                                            'type' => '5126'
                                                          },
                                                   '2' => {
                                                            'name' => 'string_type',
                                                            'offset' => '3',
                                                            'type' => '140'
                                                          },
                                                   '3' => {
                                                            'name' => 'min_length',
                                                            'offset' => '4',
                                                            'type' => '5576'
                                                          },
                                                   '4' => {
                                                            'name' => 'max_length',
                                                            'offset' => '6',
                                                            'type' => '5576'
                                                          },
                                                   '5' => {
                                                            'name' => 'def_length',
                                                            'offset' => '8',
                                                            'type' => '5576'
                                                          },
                                                   '6' => {
                                                            'name' => 'def_string',
                                                            'offset' => '22',
                                                            'type' => '13445'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_table_attr_entry_string_info',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '50303' => {
                                       'BaseType' => '50191',
                                       'Name' => 'struct pldm_bios_table_attr_entry_string_info const',
                                       'Size' => '24',
                                       'Type' => 'Const'
                                     },
                          '50313' => {
                                       'Header' => 'bios_table.h',
                                       'Line' => '439',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'name_handle',
                                                            'offset' => '0',
                                                            'type' => '5576'
                                                          },
                                                   '1' => {
                                                            'name' => 'read_only',
                                                            'offset' => '2',
                                                            'type' => '5126'
                                                          },
                                                   '2' => {
                                                            'name' => 'lower_bound',
                                                            'offset' => '8',
                                                            'type' => '49608'
                                                          },
                                                   '3' => {
                                                            'name' => 'upper_bound',
                                                            'offset' => '22',
                                                            'type' => '49608'
                                                          },
                                                   '4' => {
                                                            'name' => 'scalar_increment',
                                                            'offset' => '36',
                                                            'type' => '152'
                                                          },
                                                   '5' => {
                                                            'name' => 'default_value',
                                                            'offset' => '50',
                                                            'type' => '49608'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_table_attr_entry_integer_info',
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '50411' => {
                                       'BaseType' => '50313',
                                       'Name' => 'struct pldm_bios_table_attr_entry_integer_info const',
                                       'Size' => '40',
                                       'Type' => 'Const'
                                     },
                          '50694' => {
                                       'Name' => 'ssize_t(*)(void const*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '5345'
                                                           }
                                                  },
                                       'Return' => '13450',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '50764' => {
                                       'Line' => '1041',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'table_data',
                                                            'offset' => '0',
                                                            'type' => '6820'
                                                          },
                                                   '1' => {
                                                            'name' => 'table_len',
                                                            'offset' => '8',
                                                            'type' => '453'
                                                          },
                                                   '2' => {
                                                            'name' => 'current_pos',
                                                            'offset' => '22',
                                                            'type' => '453'
                                                          },
                                                   '3' => {
                                                            'name' => 'entry_length_handler',
                                                            'offset' => '36',
                                                            'type' => '50694'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_table_iter',
                                       'PrivateABI' => 1,
                                       'Size' => '32',
                                       'Source' => 'bios_table.c',
                                       'Type' => 'Struct'
                                     },
                          '50834' => {
                                       'BaseType' => '50764',
                                       'Name' => 'struct pldm_bios_table_iter const',
                                       'Size' => '32',
                                       'Type' => 'Const'
                                     },
                          '51904' => {
                                       'BaseType' => '50764',
                                       'Name' => 'struct pldm_bios_table_iter*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '51909' => {
                                       'BaseType' => '49983',
                                       'Name' => 'struct pldm_bios_attr_val_table_entry const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '52323' => {
                                       'BaseType' => '49926',
                                       'Name' => 'struct pldm_bios_attr_table_entry const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '52926' => {
                                       'BaseType' => '49840',
                                       'Name' => 'struct pldm_bios_string_table_entry const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '54089' => {
                                       'BaseType' => '50834',
                                       'Name' => 'struct pldm_bios_table_iter const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '58362' => {
                                       'BaseType' => '49608',
                                       'Name' => 'uint64_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '58639' => {
                                       'BaseType' => '50411',
                                       'Name' => 'struct pldm_bios_table_attr_entry_integer_info const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '58948' => {
                                       'BaseType' => '13445',
                                       'Name' => 'char const**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '60120' => {
                                       'BaseType' => '50303',
                                       'Name' => 'struct pldm_bios_table_attr_entry_string_info const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '62280' => {
                                       'BaseType' => '50169',
                                       'Name' => 'struct pldm_bios_table_attr_entry_enum_info const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '64854' => {
                                       'Header' => 'pldm_types.h',
                                       'Line' => '36',
                                       'Name' => 'anon-struct-pldm_types.h-36',
                                       'Size' => '2',
                                       'Type' => 'Struct'
                                     },
                          '65116' => {
                                       'Header' => 'pldm_types.h',
                                       'Line' => '54',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'value',
                                                            'offset' => '0',
                                                            'type' => '5576'
                                                          },
                                                   '1' => {
                                                            'name' => 'bits',
                                                            'offset' => '0',
                                                            'type' => '64854'
                                                          }
                                                 },
                                       'Name' => 'union bitfield16_t',
                                       'Size' => '2',
                                       'Type' => 'Union'
                                     },
                          '65128' => {
                                       'Header' => 'pldm_types.h',
                                       'Line' => '58',
                                       'Name' => 'anon-struct-pldm_types.h-58',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '65614' => {
                                       'Header' => 'pldm_types.h',
                                       'Line' => '92',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'value',
                                                            'offset' => '0',
                                                            'type' => '152'
                                                          },
                                                   '1' => {
                                                            'name' => 'bits',
                                                            'offset' => '0',
                                                            'type' => '65128'
                                                          }
                                                 },
                                       'Name' => 'union bitfield32_t',
                                       'Size' => '4',
                                       'Type' => 'Union'
                                     },
                          '65626' => {
                                       'Header' => 'pldm_types.h',
                                       'Line' => '96',
                                       'Name' => 'anon-struct-pldm_types.h-96',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '66560' => {
                                       'Header' => 'pldm_types.h',
                                       'Line' => '162',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'value',
                                                            'offset' => '0',
                                                            'type' => '49608'
                                                          },
                                                   '1' => {
                                                            'name' => 'bits',
                                                            'offset' => '0',
                                                            'type' => '65626'
                                                          }
                                                 },
                                       'Name' => 'union bitfield64_t',
                                       'Size' => '8',
                                       'Type' => 'Union'
                                     },
                          '68175' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '331',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'uuid',
                                                            'offset' => '0',
                                                            'type' => '68279'
                                                          },
                                                   '1' => {
                                                            'name' => 'package_header_format_version',
                                                            'offset' => '22',
                                                            'type' => '140'
                                                          },
                                                   '2' => {
                                                            'name' => 'package_header_size',
                                                            'offset' => '23',
                                                            'type' => '5576'
                                                          },
                                                   '3' => {
                                                            'name' => 'package_release_date_time',
                                                            'offset' => '25',
                                                            'type' => '15938'
                                                          },
                                                   '4' => {
                                                            'name' => 'component_bitmap_bit_length',
                                                            'offset' => '50',
                                                            'type' => '5576'
                                                          },
                                                   '5' => {
                                                            'name' => 'package_version_string_type',
                                                            'offset' => '52',
                                                            'type' => '140'
                                                          },
                                                   '6' => {
                                                            'name' => 'package_version_string_length',
                                                            'offset' => '53',
                                                            'type' => '140'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_package_header_information',
                                       'Size' => '36',
                                       'Type' => 'Struct'
                                     },
                          '68279' => {
                                       'BaseType' => '140',
                                       'Name' => 'uint8_t[16]',
                                       'Size' => '16',
                                       'Type' => 'Array'
                                     },
                          '68311' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '345',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'record_length',
                                                            'offset' => '0',
                                                            'type' => '5576'
                                                          },
                                                   '1' => {
                                                            'name' => 'descriptor_count',
                                                            'offset' => '2',
                                                            'type' => '140'
                                                          },
                                                   '2' => {
                                                            'name' => 'device_update_option_flags',
                                                            'offset' => '3',
                                                            'type' => '65614'
                                                          },
                                                   '3' => {
                                                            'name' => 'comp_image_set_version_string_type',
                                                            'offset' => '7',
                                                            'type' => '140'
                                                          },
                                                   '4' => {
                                                            'name' => 'comp_image_set_version_string_length',
                                                            'offset' => '8',
                                                            'type' => '140'
                                                          },
                                                   '5' => {
                                                            'name' => 'fw_device_pkg_data_length',
                                                            'offset' => '9',
                                                            'type' => '5576'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_firmware_device_id_record',
                                       'Size' => '11',
                                       'Type' => 'Struct'
                                     },
                          '68506' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '379',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_classification',
                                                            'offset' => '0',
                                                            'type' => '5576'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_identifier',
                                                            'offset' => '2',
                                                            'type' => '5576'
                                                          },
                                                   '2' => {
                                                            'name' => 'comp_comparison_stamp',
                                                            'offset' => '4',
                                                            'type' => '152'
                                                          },
                                                   '3' => {
                                                            'name' => 'comp_options',
                                                            'offset' => '8',
                                                            'type' => '65116'
                                                          },
                                                   '4' => {
                                                            'name' => 'requested_comp_activation_method',
                                                            'offset' => '16',
                                                            'type' => '65116'
                                                          },
                                                   '5' => {
                                                            'name' => 'comp_location_offset',
                                                            'offset' => '18',
                                                            'type' => '152'
                                                          },
                                                   '6' => {
                                                            'name' => 'comp_size',
                                                            'offset' => '22',
                                                            'type' => '152'
                                                          },
                                                   '7' => {
                                                            'name' => 'comp_version_string_type',
                                                            'offset' => '32',
                                                            'type' => '140'
                                                          },
                                                   '8' => {
                                                            'name' => 'comp_version_string_length',
                                                            'offset' => '33',
                                                            'type' => '140'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_component_image_information',
                                       'Size' => '22',
                                       'Type' => 'Struct'
                                     },
                          '68688' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '405',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'completion_code',
                                                            'offset' => '0',
                                                            'type' => '140'
                                                          },
                                                   '1' => {
                                                            'name' => 'capabilities_during_update',
                                                            'offset' => '1',
                                                            'type' => '65614'
                                                          },
                                                   '2' => {
                                                            'name' => 'comp_count',
                                                            'offset' => '5',
                                                            'type' => '5576'
                                                          },
                                                   '3' => {
                                                            'name' => 'active_comp_image_set_ver_str_type',
                                                            'offset' => '7',
                                                            'type' => '140'
                                                          },
                                                   '4' => {
                                                            'name' => 'active_comp_image_set_ver_str_len',
                                                            'offset' => '8',
                                                            'type' => '140'
                                                          },
                                                   '5' => {
                                                            'name' => 'pending_comp_image_set_ver_str_type',
                                                            'offset' => '9',
                                                            'type' => '140'
                                                          },
                                                   '6' => {
                                                            'name' => 'pending_comp_image_set_ver_str_len',
                                                            'offset' => '16',
                                                            'type' => '140'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_get_firmware_parameters_resp',
                                       'Size' => '11',
                                       'Type' => 'Struct'
                                     },
                          '68792' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '419',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_classification',
                                                            'offset' => '0',
                                                            'type' => '5576'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_identifier',
                                                            'offset' => '2',
                                                            'type' => '5576'
                                                          },
                                                   '2' => {
                                                            'name' => 'comp_classification_index',
                                                            'offset' => '4',
                                                            'type' => '140'
                                                          },
                                                   '3' => {
                                                            'name' => 'active_comp_comparison_stamp',
                                                            'offset' => '5',
                                                            'type' => '152'
                                                          },
                                                   '4' => {
                                                            'name' => 'active_comp_ver_str_type',
                                                            'offset' => '9',
                                                            'type' => '140'
                                                          },
                                                   '5' => {
                                                            'name' => 'active_comp_ver_str_len',
                                                            'offset' => '16',
                                                            'type' => '140'
                                                          },
                                                   '6' => {
                                                            'name' => 'active_comp_release_date',
                                                            'offset' => '17',
                                                            'type' => '68974'
                                                          },
                                                   '7' => {
                                                            'name' => 'pending_comp_comparison_stamp',
                                                            'offset' => '25',
                                                            'type' => '152'
                                                          },
                                                   '8' => {
                                                            'name' => 'pending_comp_ver_str_type',
                                                            'offset' => '35',
                                                            'type' => '140'
                                                          },
                                                   '9' => {
                                                            'name' => 'pending_comp_ver_str_len',
                                                            'offset' => '36',
                                                            'type' => '140'
                                                          },
                                                   '10' => {
                                                             'name' => 'pending_comp_release_date',
                                                             'offset' => '37',
                                                             'type' => '68974'
                                                           },
                                                   '11' => {
                                                             'name' => 'comp_activation_methods',
                                                             'offset' => '51',
                                                             'type' => '65116'
                                                           },
                                                   '12' => {
                                                             'name' => 'capabilities_during_update',
                                                             'offset' => '53',
                                                             'type' => '65614'
                                                           }
                                                 },
                                       'Name' => 'struct pldm_component_parameter_entry',
                                       'Size' => '39',
                                       'Type' => 'Struct'
                                     },
                          '68974' => {
                                       'BaseType' => '140',
                                       'Name' => 'uint8_t[8]',
                                       'Size' => '8',
                                       'Type' => 'Array'
                                     },
                          '69834' => {
                                       'BaseType' => '6781',
                                       'Name' => 'struct variable_field const',
                                       'Size' => '16',
                                       'Type' => 'Const'
                                     },
                          '70144' => {
                                       'BaseType' => '12828',
                                       'Name' => 'bool8_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '70149' => {
                                       'BaseType' => '66560',
                                       'Name' => 'bitfield64_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '70902' => {
                                       'BaseType' => '65614',
                                       'Name' => 'bitfield32_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '71748' => {
                                       'BaseType' => '65116',
                                       'Name' => 'bitfield16_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '73295' => {
                                       'BaseType' => '69834',
                                       'Name' => 'struct variable_field const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '74889' => {
                                       'BaseType' => '68792',
                                       'Name' => 'struct pldm_component_parameter_entry*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '75119' => {
                                       'BaseType' => '68688',
                                       'Name' => 'struct pldm_get_firmware_parameters_resp*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '75420' => {
                                       'BaseType' => '2079',
                                       'Name' => 'uint8_t**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '75717' => {
                                       'BaseType' => '68506',
                                       'Name' => 'struct pldm_component_image_information*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '76333' => {
                                       'BaseType' => '68311',
                                       'Name' => 'struct pldm_firmware_device_id_record*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '76637' => {
                                       'BaseType' => '68175',
                                       'Name' => 'struct pldm_package_header_information*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '83356' => {
                                       'BaseType' => '83373',
                                       'Header' => 'pdr.h',
                                       'Line' => '16',
                                       'Name' => 'pldm_pdr',
                                       'PrivateABI' => 1,
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '83368' => {
                                       'BaseType' => '83356',
                                       'Name' => 'pldm_pdr const',
                                       'Size' => '24',
                                       'Type' => 'Const'
                                     },
                          '83373' => {
                                       'Line' => '20',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'record_count',
                                                            'offset' => '0',
                                                            'type' => '152'
                                                          },
                                                   '1' => {
                                                            'name' => 'size',
                                                            'offset' => '4',
                                                            'type' => '152'
                                                          },
                                                   '2' => {
                                                            'name' => 'first',
                                                            'offset' => '8',
                                                            'type' => '84489'
                                                          },
                                                   '3' => {
                                                            'name' => 'last',
                                                            'offset' => '22',
                                                            'type' => '84489'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_pdr',
                                       'PrivateABI' => 1,
                                       'Size' => '24',
                                       'Source' => 'pdr.c',
                                       'Type' => 'Struct'
                                     },
                          '83433' => {
                                       'BaseType' => '83450',
                                       'Header' => 'pdr.h',
                                       'Line' => '21',
                                       'Name' => 'pldm_pdr_record',
                                       'PrivateABI' => 1,
                                       'Size' => '32',
                                       'Type' => 'Typedef'
                                     },
                          '83445' => {
                                       'BaseType' => '83433',
                                       'Name' => 'pldm_pdr_record const',
                                       'Size' => '32',
                                       'Type' => 'Const'
                                     },
                          '83450' => {
                                       'Line' => '11',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'record_handle',
                                                            'offset' => '0',
                                                            'type' => '152'
                                                          },
                                                   '1' => {
                                                            'name' => 'size',
                                                            'offset' => '4',
                                                            'type' => '152'
                                                          },
                                                   '2' => {
                                                            'name' => 'data',
                                                            'offset' => '8',
                                                            'type' => '2079'
                                                          },
                                                   '3' => {
                                                            'name' => 'next',
                                                            'offset' => '22',
                                                            'type' => '84477'
                                                          },
                                                   '4' => {
                                                            'name' => 'is_remote',
                                                            'offset' => '36',
                                                            'type' => '5126'
                                                          },
                                                   '5' => {
                                                            'name' => 'terminus_handle',
                                                            'offset' => '38',
                                                            'type' => '5576'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_pdr_record',
                                       'PrivateABI' => 1,
                                       'Size' => '32',
                                       'Source' => 'pdr.c',
                                       'Type' => 'Struct'
                                     },
                          '83534' => {
                                       'Header' => 'pdr.h',
                                       'Line' => '275',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'entity_type',
                                                            'offset' => '0',
                                                            'type' => '5576'
                                                          },
                                                   '1' => {
                                                            'name' => 'entity_instance_num',
                                                            'offset' => '2',
                                                            'type' => '5576'
                                                          },
                                                   '2' => {
                                                            'name' => 'entity_container_id',
                                                            'offset' => '4',
                                                            'type' => '5576'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_entity',
                                       'Size' => '6',
                                       'Type' => 'Struct'
                                     },
                          '83591' => {
                                       'BaseType' => '83534',
                                       'Header' => 'pdr.h',
                                       'Line' => '279',
                                       'Name' => 'pldm_entity',
                                       'Size' => '6',
                                       'Type' => 'Typedef'
                                     },
                          '83635' => {
                                       'BaseType' => '83647',
                                       'Header' => 'pdr.h',
                                       'Line' => '289',
                                       'Name' => 'pldm_entity_association_tree',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Typedef'
                                     },
                          '83647' => {
                                       'Line' => '435',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'root',
                                                            'offset' => '0',
                                                            'type' => '84494'
                                                          },
                                                   '1' => {
                                                            'name' => 'last_used_container_id',
                                                            'offset' => '8',
                                                            'type' => '5576'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_entity_association_tree',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Source' => 'pdr.c',
                                       'Type' => 'Struct'
                                     },
                          '83690' => {
                                       'BaseType' => '83707',
                                       'Header' => 'pdr.h',
                                       'Line' => '294',
                                       'Name' => 'pldm_entity_node',
                                       'PrivateABI' => 1,
                                       'Size' => '40',
                                       'Type' => 'Typedef'
                                     },
                          '83702' => {
                                       'BaseType' => '83690',
                                       'Name' => 'pldm_entity_node const',
                                       'Size' => '40',
                                       'Type' => 'Const'
                                     },
                          '83707' => {
                                       'Line' => '440',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'entity',
                                                            'offset' => '0',
                                                            'type' => '83591'
                                                          },
                                                   '1' => {
                                                            'name' => 'parent',
                                                            'offset' => '6',
                                                            'type' => '83591'
                                                          },
                                                   '2' => {
                                                            'name' => 'remote_container_id',
                                                            'offset' => '18',
                                                            'type' => '5576'
                                                          },
                                                   '3' => {
                                                            'name' => 'first_child',
                                                            'offset' => '22',
                                                            'type' => '84494'
                                                          },
                                                   '4' => {
                                                            'name' => 'next_sibling',
                                                            'offset' => '36',
                                                            'type' => '84494'
                                                          },
                                                   '5' => {
                                                            'name' => 'association_type',
                                                            'offset' => '50',
                                                            'type' => '140'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_entity_node',
                                       'PrivateABI' => 1,
                                       'Size' => '40',
                                       'Source' => 'pdr.c',
                                       'Type' => 'Struct'
                                     },
                          '84477' => {
                                       'BaseType' => '83450',
                                       'Name' => 'struct pldm_pdr_record*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '84489' => {
                                       'BaseType' => '83433',
                                       'Name' => 'pldm_pdr_record*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '84494' => {
                                       'BaseType' => '83690',
                                       'Name' => 'pldm_entity_node*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '84887' => {
                                       'BaseType' => '84892',
                                       'Name' => 'pldm_entity**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '84892' => {
                                       'BaseType' => '83591',
                                       'Name' => 'pldm_entity*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '84956' => {
                                       'BaseType' => '83635',
                                       'Name' => 'pldm_entity_association_tree*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '85403' => {
                                       'BaseType' => '84494',
                                       'Name' => 'pldm_entity_node**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '86192' => {
                                       'BaseType' => '83368',
                                       'Name' => 'pldm_pdr const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '86445' => {
                                       'BaseType' => '83356',
                                       'Name' => 'pldm_pdr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '91554' => {
                                       'BaseType' => '83702',
                                       'Name' => 'pldm_entity_node const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '92718' => {
                                       'BaseType' => '83445',
                                       'Name' => 'pldm_pdr_record const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '95806' => {
                                       'BaseType' => '140',
                                       'Header' => 'base.h',
                                       'Line' => '16',
                                       'Name' => 'pldm_tid_t',
                                       'Size' => '1',
                                       'Type' => 'Typedef'
                                     },
                          '95818' => {
                                       'BaseType' => '140',
                                       'Header' => 'instance-id.h',
                                       'Line' => '13',
                                       'Name' => 'pldm_instance_id_t',
                                       'Size' => '1',
                                       'Type' => 'Typedef'
                                     },
                          '95830' => {
                                       'Header' => 'responder.h',
                                       'Line' => '10',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tid',
                                                            'offset' => '0',
                                                            'type' => '95806'
                                                          },
                                                   '1' => {
                                                            'name' => 'instance_id',
                                                            'offset' => '1',
                                                            'type' => '95818'
                                                          },
                                                   '2' => {
                                                            'name' => 'type',
                                                            'offset' => '2',
                                                            'type' => '140'
                                                          },
                                                   '3' => {
                                                            'name' => 'command',
                                                            'offset' => '3',
                                                            'type' => '140'
                                                          },
                                                   '4' => {
                                                            'name' => 'next',
                                                            'offset' => '8',
                                                            'type' => '95910'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_responder_cookie',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '95910' => {
                                       'BaseType' => '95830',
                                       'Name' => 'struct pldm_responder_cookie*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '95915' => {
                                       'Header' => 'pldm.h',
                                       'Line' => '15',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'PLDM_REQUESTER_SUCCESS',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'PLDM_REQUESTER_OPEN_FAIL',
                                                            'value' => '18446744073709551615 (-1)'
                                                          },
                                                   '2' => {
                                                            'name' => 'PLDM_REQUESTER_NOT_PLDM_MSG',
                                                            'value' => '18446744073709551614 (-2)'
                                                          },
                                                   '3' => {
                                                            'name' => 'PLDM_REQUESTER_NOT_RESP_MSG',
                                                            'value' => '18446744073709551613 (-3)'
                                                          },
                                                   '4' => {
                                                            'name' => 'PLDM_REQUESTER_NOT_REQ_MSG',
                                                            'value' => '18446744073709551612 (-4)'
                                                          },
                                                   '5' => {
                                                            'name' => 'PLDM_REQUESTER_RESP_MSG_TOO_SMALL',
                                                            'value' => '18446744073709551611 (-5)'
                                                          },
                                                   '6' => {
                                                            'name' => 'PLDM_REQUESTER_INSTANCE_ID_MISMATCH',
                                                            'value' => '18446744073709551610 (-6)'
                                                          },
                                                   '7' => {
                                                            'name' => 'PLDM_REQUESTER_SEND_FAIL',
                                                            'value' => '18446744073709551609 (-7)'
                                                          },
                                                   '8' => {
                                                            'name' => 'PLDM_REQUESTER_RECV_FAIL',
                                                            'value' => '18446744073709551608 (-8)'
                                                          },
                                                   '9' => {
                                                            'name' => 'PLDM_REQUESTER_INVALID_RECV_LEN',
                                                            'value' => '18446744073709551607 (-9)'
                                                          },
                                                   '10' => {
                                                             'name' => 'PLDM_REQUESTER_SETUP_FAIL',
                                                             'value' => '18446744073709551606 (-10)'
                                                           },
                                                   '11' => {
                                                             'name' => 'PLDM_REQUESTER_INVALID_SETUP',
                                                             'value' => '18446744073709551605 (-11)'
                                                           },
                                                   '12' => {
                                                             'name' => 'PLDM_REQUESTER_POLL_FAIL',
                                                             'value' => '18446744073709551604 (-12)'
                                                           },
                                                   '13' => {
                                                             'name' => 'PLDM_REQUESTER_TRANSPORT_BUSY',
                                                             'value' => '18446744073709551603 (-13)'
                                                           }
                                                 },
                                       'Name' => 'enum pldm_requester_error_codes',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '98850' => {
                                       'Line' => '20',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'prev',
                                                            'offset' => '0',
                                                            'type' => '95818'
                                                          },
                                                   '1' => {
                                                            'name' => 'allocations',
                                                            'offset' => '4',
                                                            'type' => '152'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_tid_state',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Source' => 'instance-id.c',
                                       'Type' => 'Struct'
                                     },
                          '98889' => {
                                       'Line' => '25',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'state',
                                                            'offset' => '0',
                                                            'type' => '98931'
                                                          },
                                                   '1' => {
                                                            'name' => 'lock_db_fd',
                                                            'offset' => '8264',
                                                            'type' => '100'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_instance_db',
                                       'PrivateABI' => 1,
                                       'Size' => '2052',
                                       'Source' => 'instance-id.c',
                                       'Type' => 'Struct'
                                     },
                          '98931' => {
                                       'BaseType' => '98850',
                                       'Name' => 'struct pldm_tid_state[256]',
                                       'Size' => '2048',
                                       'Type' => 'Array'
                                     },
                          '99401' => {
                                       'BaseType' => '98889',
                                       'Name' => 'struct pldm_instance_db*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '99826' => {
                                       'BaseType' => '95818',
                                       'Name' => 'pldm_instance_id_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '100002' => {
                                        'BaseType' => '99401',
                                        'Name' => 'struct pldm_instance_db**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '100759' => {
                                        'BaseType' => '140',
                                        'Header' => 'pldm.h',
                                        'Line' => '13',
                                        'Name' => 'mctp_eid_t',
                                        'Size' => '1',
                                        'Type' => 'Typedef'
                                      },
                          '100874' => {
                                        'BaseType' => '95915',
                                        'Header' => 'pldm.h',
                                        'Line' => '30',
                                        'Name' => 'pldm_requester_rc_t',
                                        'Size' => '4',
                                        'Type' => 'Typedef'
                                      },
                          '100892' => {
                                        'Line' => '25',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'transport',
                                                             'offset' => '0',
                                                             'type' => '100965'
                                                           },
                                                    '1' => {
                                                             'name' => 'socket',
                                                             'offset' => '64',
                                                             'type' => '100'
                                                           },
                                                    '2' => {
                                                             'name' => 'tid_eid_map',
                                                             'offset' => '68',
                                                             'type' => '104597'
                                                           },
                                                    '3' => {
                                                             'name' => 'socket_send_buf',
                                                             'offset' => '768',
                                                             'type' => '103546'
                                                           }
                                                  },
                                        'Name' => 'struct pldm_transport_mctp_demux',
                                        'PrivateABI' => 1,
                                        'Size' => '312',
                                        'Source' => 'mctp-demux.c',
                                        'Type' => 'Struct'
                                      },
                          '100918' => {
                                        'BaseType' => '100892',
                                        'Name' => 'struct pldm_transport_mctp_demux*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '100960' => {
                                        'BaseType' => '100965',
                                        'Name' => 'struct pldm_transport*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '100965' => {
                                        'Header' => 'transport.h',
                                        'Line' => '18',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'name',
                                                             'offset' => '0',
                                                             'type' => '13445'
                                                           },
                                                    '1' => {
                                                             'name' => 'version',
                                                             'offset' => '8',
                                                             'type' => '140'
                                                           },
                                                    '2' => {
                                                             'name' => 'recv',
                                                             'offset' => '22',
                                                             'type' => '103857'
                                                           },
                                                    '3' => {
                                                             'name' => 'send',
                                                             'offset' => '36',
                                                             'type' => '103898'
                                                           },
                                                    '4' => {
                                                             'name' => 'init_pollfd',
                                                             'offset' => '50',
                                                             'type' => '103978'
                                                           }
                                                  },
                                        'Name' => 'struct pldm_transport',
                                        'PrivateABI' => 1,
                                        'Size' => '40',
                                        'Type' => 'Struct'
                                      },
                          '101101' => {
                                        'BaseType' => '95806',
                                        'Name' => 'pldm_tid_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '101204' => {
                                        'BaseType' => '100918',
                                        'Name' => 'struct pldm_transport_mctp_demux**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '103266' => {
                                        'BaseType' => '46',
                                        'Header' => 'int-ll64.h',
                                        'Line' => '21',
                                        'Name' => '__u8',
                                        'PrivateABI' => 1,
                                        'Size' => '1',
                                        'Type' => 'Typedef'
                                      },
                          '103278' => {
                                        'BaseType' => '53',
                                        'Header' => 'int-ll64.h',
                                        'Line' => '24',
                                        'Name' => '__u16',
                                        'PrivateABI' => 1,
                                        'Size' => '2',
                                        'Type' => 'Typedef'
                                      },
                          '103546' => {
                                        'Header' => 'socket.h',
                                        'Line' => '5',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'size',
                                                             'offset' => '0',
                                                             'type' => '100'
                                                           },
                                                    '1' => {
                                                             'name' => 'socket',
                                                             'offset' => '4',
                                                             'type' => '100'
                                                           },
                                                    '2' => {
                                                             'name' => 'max_size',
                                                             'offset' => '8',
                                                             'type' => '100'
                                                           }
                                                  },
                                        'Name' => 'struct pldm_socket_sndbuf',
                                        'PrivateABI' => 1,
                                        'Size' => '12',
                                        'Type' => 'Struct'
                                      },
                          '103857' => {
                                        'Name' => 'pldm_requester_rc_t(*)(struct pldm_transport*, pldm_tid_t*, void**, size_t*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '100960'
                                                            },
                                                     '1' => {
                                                              'type' => '101101'
                                                            },
                                                     '2' => {
                                                              'type' => '17829'
                                                            },
                                                     '3' => {
                                                              'type' => '9822'
                                                            }
                                                   },
                                        'Return' => '100874',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '103898' => {
                                        'Name' => 'pldm_requester_rc_t(*)(struct pldm_transport*, pldm_tid_t, void const*, size_t)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '100960'
                                                            },
                                                     '1' => {
                                                              'type' => '95806'
                                                            },
                                                     '2' => {
                                                              'type' => '5345'
                                                            },
                                                     '3' => {
                                                              'type' => '453'
                                                            }
                                                   },
                                        'Return' => '100874',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '103923' => {
                                        'BaseType' => '103928',
                                        'Name' => 'struct pollfd*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '103928' => {
                                        'Header' => 'poll.h',
                                        'Line' => '36',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'fd',
                                                             'offset' => '0',
                                                             'type' => '100'
                                                           },
                                                    '1' => {
                                                             'name' => 'events',
                                                             'offset' => '4',
                                                             'type' => '93'
                                                           },
                                                    '2' => {
                                                             'name' => 'revents',
                                                             'offset' => '6',
                                                             'type' => '93'
                                                           }
                                                  },
                                        'Name' => 'struct pollfd',
                                        'PrivateABI' => 1,
                                        'Size' => '8',
                                        'Type' => 'Struct'
                                      },
                          '103978' => {
                                        'Name' => 'int(*)(struct pldm_transport*, struct pollfd*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '100960'
                                                            },
                                                     '1' => {
                                                              'type' => '103923'
                                                            }
                                                   },
                                        'Return' => '100',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '103983' => {
                                        'BaseType' => '53',
                                        'Header' => 'socket.h',
                                        'Line' => '10',
                                        'Name' => '__kernel_sa_family_t',
                                        'PrivateABI' => 1,
                                        'Size' => '2',
                                        'Type' => 'Typedef'
                                      },
                          '104331' => {
                                        'Header' => 'mctp.h',
                                        'Line' => '18',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 's_addr',
                                                             'offset' => '0',
                                                             'type' => '100759'
                                                           }
                                                  },
                                        'Name' => 'struct mctp_addr',
                                        'PrivateABI' => 1,
                                        'Size' => '1',
                                        'Type' => 'Struct'
                                      },
                          '104357' => {
                                        'Header' => 'mctp.h',
                                        'Line' => '22',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'smctp_family',
                                                             'offset' => '0',
                                                             'type' => '103983'
                                                           },
                                                    '1' => {
                                                             'name' => '__smctp_pad0',
                                                             'offset' => '2',
                                                             'type' => '103278'
                                                           },
                                                    '2' => {
                                                             'name' => 'smctp_network',
                                                             'offset' => '4',
                                                             'type' => '60'
                                                           },
                                                    '3' => {
                                                             'name' => 'smctp_addr',
                                                             'offset' => '8',
                                                             'type' => '104331'
                                                           },
                                                    '4' => {
                                                             'name' => 'smctp_type',
                                                             'offset' => '9',
                                                             'type' => '103266'
                                                           },
                                                    '5' => {
                                                             'name' => 'smctp_tag',
                                                             'offset' => '16',
                                                             'type' => '103266'
                                                           },
                                                    '6' => {
                                                             'name' => '__smctp_pad1',
                                                             'offset' => '17',
                                                             'type' => '103266'
                                                           }
                                                  },
                                        'Name' => 'struct sockaddr_mctp',
                                        'PrivateABI' => 1,
                                        'Size' => '12',
                                        'Type' => 'Struct'
                                      },
                          '104461' => {
                                        'BaseType' => '104357',
                                        'Name' => 'struct sockaddr_mctp const',
                                        'Size' => '12',
                                        'Type' => 'Const'
                                      },
                          '104504' => {
                                        'Line' => '34',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'transport',
                                                             'offset' => '0',
                                                             'type' => '100965'
                                                           },
                                                    '1' => {
                                                             'name' => 'socket',
                                                             'offset' => '64',
                                                             'type' => '100'
                                                           },
                                                    '2' => {
                                                             'name' => 'tid_eid_map',
                                                             'offset' => '68',
                                                             'type' => '104597'
                                                           },
                                                    '3' => {
                                                             'name' => 'socket_send_buf',
                                                             'offset' => '768',
                                                             'type' => '103546'
                                                           },
                                                    '4' => {
                                                             'name' => 'bound',
                                                             'offset' => '786',
                                                             'type' => '5126'
                                                           },
                                                    '5' => {
                                                             'name' => 'cookie_jar',
                                                             'offset' => '800',
                                                             'type' => '95830'
                                                           }
                                                  },
                                        'Name' => 'struct pldm_transport_af_mctp',
                                        'PrivateABI' => 1,
                                        'Size' => '336',
                                        'Source' => 'af-mctp.c',
                                        'Type' => 'Struct'
                                      },
                          '104597' => {
                                        'BaseType' => '95806',
                                        'Name' => 'pldm_tid_t[256]',
                                        'Size' => '256',
                                        'Type' => 'Array'
                                      },
                          '105413' => {
                                        'BaseType' => '104504',
                                        'Name' => 'struct pldm_transport_af_mctp*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '105418' => {
                                        'BaseType' => '104461',
                                        'Name' => 'struct sockaddr_mctp const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '105731' => {
                                        'BaseType' => '105413',
                                        'Name' => 'struct pldm_transport_af_mctp**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      }
                        },
          'UndefinedSymbols' => {
                                  'libpldm.so.0.7.0' => {
                                                          '_ITM_deregisterTMCloneTable' => 0,
                                                          '_ITM_registerTMCloneTable' => 0,
                                                          '__assert_fail@GLIBC_2.2.5' => 0,
                                                          '__cxa_finalize@GLIBC_2.2.5' => 0,
                                                          '__errno_location@GLIBC_2.2.5' => 0,
                                                          '__gmon_start__' => 0,
                                                          '__memcpy_chk@GLIBC_2.3.4' => 0,
                                                          '__recv_chk@GLIBC_2.4' => 0,
                                                          '__recvfrom_chk@GLIBC_2.4' => 0,
                                                          '__stack_chk_fail@GLIBC_2.4' => 0,
                                                          'bind@GLIBC_2.2.5' => 0,
                                                          'calloc@GLIBC_2.2.5' => 0,
                                                          'clock_gettime@GLIBC_2.17' => 0,
                                                          'close@GLIBC_2.2.5' => 0,
                                                          'connect@GLIBC_2.2.5' => 0,
                                                          'dup@GLIBC_2.2.5' => 0,
                                                          'fclose@GLIBC_2.2.5' => 0,
                                                          'fcntl64@GLIBC_2.28' => 0,
                                                          'fgets@GLIBC_2.2.5' => 0,
                                                          'fopen64@GLIBC_2.2.5' => 0,
                                                          'free@GLIBC_2.2.5' => 0,
                                                          'getsockopt@GLIBC_2.2.5' => 0,
                                                          'malloc@GLIBC_2.2.5' => 0,
                                                          'memcmp@GLIBC_2.2.5' => 0,
                                                          'memcpy@GLIBC_2.14' => 0,
                                                          'open64@GLIBC_2.2.5' => 0,
                                                          'poll@GLIBC_2.2.5' => 0,
                                                          'ppoll@GLIBC_2.4' => 0,
                                                          'recv@GLIBC_2.2.5' => 0,
                                                          'recvmsg@GLIBC_2.2.5' => 0,
                                                          'sendmsg@GLIBC_2.2.5' => 0,
                                                          'sendto@GLIBC_2.2.5' => 0,
                                                          'setsockopt@GLIBC_2.2.5' => 0,
                                                          'socket@GLIBC_2.2.5' => 0,
                                                          'stat64@GLIBC_2.33' => 0,
                                                          'strlen@GLIBC_2.2.5' => 0,
                                                          'strtol@GLIBC_2.2.5' => 0,
                                                          'timerfd_create@GLIBC_2.8' => 0,
                                                          'timerfd_settime@GLIBC_2.8' => 0,
                                                          'write@GLIBC_2.2.5' => 0
                                                        }
                                },
          'WordSize' => '8'
        };
