$VAR1 = {
  'ABI_DUMPER_VERSION' => '1.4',
  'ABI_DUMP_VERSION' => '3.5',
  'Arch' => 'x86_64',
  'GccVersion' => '15.2.0',
  'Headers' => {
    'af-mctp.h' => 1,
    'base.h' => 1,
    'bcd.h' => 1,
    'bios.h' => 1,
    'bios_table.h' => 1,
    'edac.h' => 1,
    'file.h' => 1,
    'file_io.h' => 1,
    'firmware_update.h' => 1,
    'fru.h' => 1,
    'host.h' => 1,
    'instance-id.h' => 1,
    'mctp-demux.h' => 1,
    'pdr.h' => 1,
    'platform.h' => 1,
    'pldm.h' => 1,
    'pldm_types.h' => 1,
    'transport.h' => 1
  },
  'Language' => 'C',
  'LibraryName' => 'libpldm.so.0.16.0',
  'LibraryVersion' => '0.16.0',
  'NameSpaces' => {},
  'Needed' => {
    'libc.so.6' => 1
  },
  'PublicABI' => '1',
  'Sources' => {
    'bios_table.c' => 1,
    'instance-id.c' => 1,
    'mctp-demux.c' => 1,
    'pdr.c' => 1
  },
  'SymbolInfo' => {
    '186' => {
      'Header' => 'bcd.h',
      'Line' => '44',
      'Param' => {
        '0' => {
          'name' => 'dec',
          'type' => '174'
        }
      },
      'Return' => '174',
      'ShortName' => 'pldm_bcd_dec2bcd32'
    },
    '315' => {
      'Header' => 'bcd.h',
      'Line' => '38',
      'Param' => {
        '0' => {
          'name' => 'bcd',
          'type' => '174'
        }
      },
      'Return' => '174',
      'ShortName' => 'pldm_bcd_bcd2dec32'
    },
    '418' => {
      'Header' => 'bcd.h',
      'Line' => '32',
      'Param' => {
        '0' => {
          'name' => 'dec',
          'type' => '162'

      'pldm_entity_association_tree_destroy' => 1,
      'pldm_entity_association_tree_destroy_root' => 1,
      'pldm_entity_association_tree_find' => 1,
      'pldm_entity_association_tree_find_with_locality' => 1,
      'pldm_entity_association_tree_init' => 1,
      'pldm_entity_association_tree_visit' => 1,
      'pldm_entity_extract' => 1,
      'pldm_entity_get_num_children' => 1,
      'pldm_entity_get_parent' => 1,
      'pldm_entity_is_exist_parent' => 1,
      'pldm_entity_is_node_parent' => 1,
      'pldm_entity_node_get_remote_container_id' => 1,
      'pldm_find_entity_ref_in_tree' => 1,
      'pldm_instance_db_destroy' => 1,
      'pldm_instance_db_init' => 1,
      'pldm_instance_db_init_default' => 1,
      'pldm_instance_id_alloc' => 1,
      'pldm_instance_id_free' => 1,
      'pldm_is_current_parent_child' => 1,
      'pldm_is_empty_entity_assoc_tree' => 1,
      'pldm_msg_hdr_correlate_response' => 1,
      'pldm_oem_meta_file_io_read_resp_data' => 1,
      'pldm_oem_meta_file_io_write_req_data' => 1,
      'pldm_package_component_image_information_iter_init' => 1,
      'pldm_package_downstream_device_id_record_iter_init' => 1,
      'pldm_package_firmware_device_id_record_iter_init' => 1,
      'pldm_pdr_add' => 1,
      'pldm_pdr_add_fru_record_set' => 1,
      'pldm_pdr_delete_by_effecter_id' => 1,
      'pldm_pdr_delete_by_record_handle' => 1,
      'pldm_pdr_delete_by_sensor_id' => 1,
      'pldm_pdr_destroy' => 1,
      'pldm_pdr_find_last_in_range' => 1,
      'pldm_pdr_find_record' => 1,
      'pldm_pdr_find_record_by_type' => 1,
      'pldm_pdr_fru_record_set_find_by_rsi' => 1,
      'pldm_pdr_get_next_record' => 1,
      'pldm_pdr_get_record_count' => 1,
      'pldm_pdr_get_record_handle' => 1,
      'pldm_pdr_get_repo_size' => 1,
      'pldm_pdr_init' => 1,
      'pldm_pdr_record_is_remote' => 1,
      'pldm_pdr_remove_fru_record_set_by_rsi' => 1,
      'pldm_pdr_remove_pdrs_by_terminus_handle' => 1,
      'pldm_pdr_remove_remote_pdrs' => 1,
      'pldm_pdr_update_TL_pdr' => 1,
      'pldm_platform_cper_event_event_data' => 1,
      'pldm_transport_af_mctp_bind' => 1,
      'pldm_transport_af_mctp_core' => 1,
      'pldm_transport_af_mctp_destroy' => 1,
      'pldm_transport_af_mctp_init' => 1,
      'pldm_transport_af_mctp_init_pollfd' => 1,
      'pldm_transport_af_mctp_map_tid' => 1,
      'pldm_transport_af_mctp_map_tid_fqe' => 1,
      'pldm_transport_af_mctp_unmap_tid' => 1,
      'pldm_transport_af_mctp_unmap_tid_fqe' => 1,
      'pldm_transport_mctp_demux_core' => 1,
      'pldm_transport_mctp_demux_destroy' => 1,
      'pldm_transport_mctp_demux_init' => 1,
      'pldm_transport_mctp_demux_init_pollfd' => 1,
      'pldm_transport_mctp_demux_map_tid' => 1,
      'pldm_transport_mctp_demux_unmap_tid' => 1,
      'pldm_transport_poll' => 1,
      'pldm_transport_recv_msg' => 1,
      'pldm_transport_send_msg' => 1,
      'pldm_transport_send_recv_msg' => 1,
      'unpack_pldm_header' => 1
    }
  },
  'Target' => 'unix',
  'TypeInfo' => {
    '1' => {
      'Name' => 'void',
      'Type' => 'Intrinsic'
    },
    '51' => {
      'Name' => 'unsigned char',
      'Size' => '1',
      'Type' => 'Intrinsic'
    },
    '58' => {
      'Name' => 'unsigned short',
      'Size' => '2',
      'Type' => 'Intrinsic'
    },
    '65' => {
      'Name' => 'unsigned int',
      'Size' => '4',
      'Type' => 'Intrinsic'
    },
    '72' => {
      'Name' => 'unsigned long',
      'Size' => '8',
      'Type' => 'Intrinsic'
    },
    '79' => {
      'Name' => 'signed char',
      'Size' => '1',
      'Type' => 'Intrinsic'
    },
    '86' => {
      'BaseType' => '51',
      'Header' => 'types.h',
      'Line' => '38',
      'Name' => '__uint8_t',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '98' => {
      'Name' => 'short',
      'Size' => '2',
      'Type' => 'Intrinsic'
    },
    '105' => {
      'BaseType' => '58',
      'Header' => 'types.h',
      'Line' => '40',
      'Name' => '__uint16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '117' => {
      'Name' => 'int',
      'Size' => '4',
      'Type' => 'Intrinsic'
    },
    '124' => {
      'BaseType' => '65',
      'Header' => 'types.h',
      'Line' => '42',
      'Name' => '__uint32_t',
      'PrivateABI' => 1,
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '136' => {
      'Name' => 'long',
      'Size' => '8',
      'Type' => 'Intrinsic'
    },
    '143' => {
      'Name' => 'char',
      'Size' => '1',
      'Type' => 'Intrinsic'
    },
    '150' => {
      'BaseType' => '86',
      'Header' => 'stdint-uintn.h',
      'Line' => '24',
      'Name' => 'uint8_t',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '162' => {
      'BaseType' => '105',
      'Header' => 'stdint-uintn.h',
      'Line' => '25',
      'Name' => 'uint16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '174' => {
      'BaseType' => '124',
      'Header' => 'stdint-uintn.h',
      'Line' => '26',
      'Name' => 'uint32_t',
      'PrivateABI' => 1,
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '845' => {
      'BaseType' => '1',
      'Name' => 'void*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '878' => {
      'BaseType' => '174',
      'Name' => 'uint32_t const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '883' => {
      'BaseType' => '72',
      'Header' => 'stddef.h',
      'Line' => '229',
      'Name' => 'size_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '930' => {
      'Header' => 'pldm_types.h',
      'Line' => '14',
      'Name' => 'struct bits8',
      'Size' => '1',
      'Type' => 'Struct'
    },
    '1088' => {
      'Header' => 'pldm_types.h',
      'Line' => '24',
      'Memb' => {
        '0' => {
          'name' => 'byte',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'bits',
          'offset' => '0',
          'type' => '930'
        }
      },
      'Name' => 'union bitfield8_t',
      'Size' => '1',
      'Type' => 'Union'
    },
    '1100' => {
      'BaseType' => '1088',
      'Name' => 'bitfield8_t const',
      'Size' => '1',
      'Type' => 'Const'
    },
    '1105' => {
      'Header' => 'pldm_types.h',
      'Line' => '30',
      'Memb' => {
        '0' => {
          'name' => 'alpha',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'update',
          'offset' => '1',
          'type' => '150'
        },
        '2' => {
          'name' => 'minor',
          'offset' => '2',
          'type' => '150'
        },
        '3' => {
          'name' => 'major',
          'offset' => '3',
          'type' => '150'
        }
      },
      'Name' => 'struct pldm_version',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '1171' => {
      'BaseType' => '1105',
      'Header' => 'pldm_types.h',
      'Line' => '35',
      'Name' => 'ver32_t',
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '1183' => {
      'BaseType' => '1171',
      'Name' => 'ver32_t const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '1188' => {
      'Name' => 'float',
      'Size' => '4',
      'Type' => 'Intrinsic'
    },
    '1608' => {
      'Header' => 'base.h',
      'Line' => '137',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_RESPONSE',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_REQUEST',
          'value' => '1'
        },
        '2' => {
          'name' => 'PLDM_RESERVED',
          'value' => '2'
        },
        '3' => {
          'name' => 'PLDM_ASYNC_REQUEST_NOTIFY',
          'value' => '3'
        }
      },
      'Name' => 'enum MessageType',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '1620' => {
      'Header' => 'base.h',
      'Line' => '191',
      'Memb' => {
        '0' => {
          'name' => 'command',
          'offset' => '2',
          'type' => '150'
        }
      },
      'Name' => 'struct pldm_msg_hdr',
      'Size' => '3',
      'Type' => 'Struct'
    },
    '1731' => {
      'BaseType' => '1620',
      'Name' => 'struct pldm_msg_hdr const',
      'Size' => '3',
      'Type' => 'Const'
    },
    '1736' => {
      'Header' => 'base.h',
      'Line' => '218',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '1620'
        },
        '1' => {
          'name' => 'payload',
          'offset' => '3',
          'type' => '1781'
        }
      },
      'Name' => 'struct pldm_msg',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '1776' => {
      'BaseType' => '1736',
      'Name' => 'struct pldm_msg const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '1781' => {
      'BaseType' => '150',
      'Name' => 'uint8_t[1]',
      'Size' => '1',
      'Type' => 'Array'
    },
    '1797' => {
      'Header' => 'base.h',
      'Line' => '298',
      'Memb' => {
        '0' => {
          'name' => 'msg_type',
          'offset' => '0',
          'type' => '1608'
        },
        '1' => {
          'name' => 'instance',
          'offset' => '4',
          'type' => '150'
        },
        '2' => {
          'name' => 'pldm_type',
          'offset' => '5',
          'type' => '150'
        },
        '3' => {
          'name' => 'command',
          'offset' => '6',
          'type' => '150'
        },
        '4' => {
          'name' => 'completion_code',
          'offset' => '7',
          'type' => '150'
        }
      },
      'Name' => 'struct pldm_header_info',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '1875' => {
      'BaseType' => '1797',
      'Name' => 'struct pldm_header_info const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '1880' => {
      'BaseType' => '1088',
      'Name' => 'bitfield8_t[8]',
      'Size' => '8',
      'Type' => 'Array'
    },
    '1896' => {
      'Header' => 'base.h',
      'Line' => '990',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'pldm_types',
          'offset' => '1',
          'type' => '1880'
        }
      },
      'Name' => 'struct pldm_base_get_pldm_types_resp',
      'Size' => '9',
      'Type' => 'Struct'
    },
    '1935' => {
      'BaseType' => '1896',
      'Name' => 'struct pldm_base_get_pldm_types_resp const',
      'Size' => '9',
      'Type' => 'Const'
    },
    '2086' => {
      'BaseType' => '2091',
      'Name' => 'void const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2091' => {
      'BaseType' => '1',
      'Name' => 'void const',
      'Type' => 'Const'
    },
    '2092' => {
      'BaseType' => '1100',
      'Name' => 'bitfield8_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2267' => {
      'BaseType' => '1736',
      'Name' => 'struct pldm_msg*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2346' => {
      'BaseType' => '1776',
      'Name' => 'struct pldm_msg const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2351' => {
      'BaseType' => '150',
      'Name' => 'uint8_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2356' => {
      'BaseType' => '1171',
      'Name' => 'ver32_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2398' => {
      'BaseType' => '1935',
      'Name' => 'struct pldm_base_get_pldm_types_resp const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2403' => {
      'BaseType' => '883',
      'Name' => 'size_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2460' => {
      'BaseType' => '1183',
      'Name' => 'ver32_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2507' => {
      'BaseType' => '174',
      'Name' => 'uint32_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2576' => {
      'BaseType' => '1731',
      'Name' => 'struct pldm_msg_hdr const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2581' => {
      'BaseType' => '1797',
      'Name' => 'struct pldm_header_info*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '3991' => {
      'BaseType' => '1875',
      'Name' => 'struct pldm_header_info const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '5519' => {
      'BaseType' => '150',
      'Name' => 'uint8_t const',
      'Size' => '1',
      'Type' => 'Const'
    },
    '5765' => {
      'BaseType' => '5519',
      'Name' => 'uint8_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '6303' => {
      'BaseType' => '150',
      'Header' => 'base.h',
      'Line' => '19',
      'Name' => 'pldm_tid_t',
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '6315' => {
      'BaseType' => '150',
      'Header' => 'instance-id.h',
      'Line' => '12',
      'Name' => 'pldm_instance_id_t',
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '6327' => {
      'Header' => 'responder.h',
      'Line' => '9',
      'Memb' => {
        '0' => {
          'name' => 'tid',
          'offset' => '0',
          'type' => '6303'
        },
        '1' => {
          'name' => 'instance_id',
          'offset' => '1',
          'type' => '6315'
        },
        '2' => {
          'name' => 'type',
          'offset' => '2',
          'type' => '150'
        },
        '3' => {
          'name' => 'command',
          'offset' => '3',
          'type' => '150'
        },
        '4' => {
          'name' => 'next',
          'offset' => '8',
          'type' => '6407'
        }
      },
      'Name' => 'struct pldm_responder_cookie',
      'PrivateABI' => 1,
      'Size' => '16',
      'Type' => 'Struct'
    },
    '6407' => {
      'BaseType' => '6327',
      'Name' => 'struct pldm_responder_cookie*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '6412' => {
      'Header' => 'pldm.h',
      'Line' => '14',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_REQUESTER_SUCCESS',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_REQUESTER_OPEN_FAIL',
          'value' => '18446744073709551615 (-1)'
        },
        '2' => {
          'name' => 'PLDM_REQUESTER_NOT_PLDM_MSG',
          'value' => '18446744073709551614 (-2)'
        },
        '3' => {
          'name' => 'PLDM_REQUESTER_NOT_RESP_MSG',
          'value' => '18446744073709551613 (-3)'
        },
        '4' => {
          'name' => 'PLDM_REQUESTER_NOT_REQ_MSG',
          'value' => '18446744073709551612 (-4)'
        },
        '5' => {
          'name' => 'PLDM_REQUESTER_RESP_MSG_TOO_SMALL',
          'value' => '18446744073709551611 (-5)'
        },
        '6' => {
          'name' => 'PLDM_REQUESTER_INSTANCE_ID_MISMATCH',
          'value' => '18446744073709551610 (-6)'
        },
        '7' => {
          'name' => 'PLDM_REQUESTER_SEND_FAIL',
          'value' => '18446744073709551609 (-7)'
        },
        '8' => {
          'name' => 'PLDM_REQUESTER_RECV_FAIL',
          'value' => '18446744073709551608 (-8)'
        },
        '9' => {
          'name' => 'PLDM_REQUESTER_INVALID_RECV_LEN',
          'value' => '18446744073709551607 (-9)'
        },
        '10' => {
          'name' => 'PLDM_REQUESTER_SETUP_FAIL',
          'value' => '18446744073709551606 (-10)'
        },
        '11' => {
          'name' => 'PLDM_REQUESTER_INVALID_SETUP',
          'value' => '18446744073709551605 (-11)'
        },
        '12' => {
          'name' => 'PLDM_REQUESTER_POLL_FAIL',
          'value' => '18446744073709551604 (-12)'
        },
        '13' => {
          'name' => 'PLDM_REQUESTER_TRANSPORT_BUSY',
          'value' => '18446744073709551603 (-13)'
        }
      },
      'Name' => 'enum pldm_requester_error_codes',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '6933' => {
      'Name' => '_Bool',
      'Size' => '1',
      'Type' => 'Intrinsic'
    },
    '7555' => {
      'BaseType' => '143',
      'Name' => 'char*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '7567' => {
      'BaseType' => '143',
      'Name' => 'char const',
      'Size' => '1',
      'Type' => 'Const'
    },
    '7711' => {
      'BaseType' => '136',
      'Header' => 'types.h',
      'Line' => '194',
      'Name' => '__ssize_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '7752' => {
      'BaseType' => '162',
      'Name' => 'uint16_t const',
      'Size' => '2',
      'Type' => 'Const'
    },
    '8082' => {
      'Header' => 'pldm_types.h',
      'Line' => '177',
      'Memb' => {
        '0' => {
          'name' => 'ptr',
          'offset' => '0',
          'type' => '5765'
        },
        '1' => {
          'name' => 'length',
          'offset' => '8',
          'type' => '883'
        }
      },
      'Name' => 'struct variable_field',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '8126' => {
      'BaseType' => '7711',
      'Header' => 'types.h',
      'Line' => '108',
      'Name' => 'ssize_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '9308' => {
      'Header' => 'base.h',
      'Line' => '406',
      'Memb' => {
        '0' => {
          'name' => 'pldm_type',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'transfer_opflag',
          'offset' => '1',
          'type' => '150'
        },
        '2' => {
          'name' => 'transfer_ctx',
          'offset' => '4',
          'type' => '174'
        },
        '3' => {
          'name' => 'transfer_handle',
          'offset' => '8',
          'type' => '174'
        },
        '4' => {
          'name' => 'section_offset',
          'offset' => '18',
          'type' => '174'
        },
        '5' => {
          'name' => 'section_length',
          'offset' => '22',
          'type' => '174'
        }
      },
      'Name' => 'struct pldm_base_multipart_receive_req',
      'Size' => '20',
      'Type' => 'Struct'
    },
    '9399' => {
      'BaseType' => '9308',
      'Name' => 'struct pldm_base_multipart_receive_req const',
      'Size' => '20',
      'Type' => 'Const'
    },
    '9404' => {
      'Header' => 'base.h',
      'Line' => '424',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'transfer_flag',
          'offset' => '1',
          'type' => '150'
        },
        '2' => {
          'name' => 'next_transfer_handle',
          'offset' => '4',
          'type' => '174'
        },
        '3' => {
          'name' => 'data',
          'offset' => '8',
          'type' => '8082'
        }
      },
      'Name' => 'struct pldm_base_multipart_receive_resp',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '9474' => {
      'Header' => 'base.h',
      'Line' => '436',
      'Memb' => {
        '0' => {
          'name' => 'requester_part_size',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'requester_protocol_support',
          'offset' => '2',
          'type' => '1880'
        }
      },
      'Name' => 'struct pldm_base_negotiate_transfer_params_req',
      'Size' => '10',
      'Type' => 'Struct'
    },
    '9513' => {
      'BaseType' => '9474',
      'Name' => 'struct pldm_base_negotiate_transfer_params_req const',
      'Size' => '10',
      'Type' => 'Const'
    },
    '9534' => {
      'Header' => 'base.h',
      'Line' => '445',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'responder_part_size',
          'offset' => '2',
          'type' => '162'
        },
        '2' => {
          'name' => 'responder_protocol_support',
          'offset' => '4',
          'type' => '1880'
        }
      },
      'Name' => 'struct pldm_base_negotiate_transfer_params_resp',
      'Size' => '12',
      'Type' => 'Struct'
    },
    '9705' => {
      'BaseType' => '7567',
      'Name' => 'char const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '11306' => {
      'BaseType' => '1896',
      'Name' => 'struct pldm_base_get_pldm_types_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '16370' => {
      'BaseType' => '9534',
      'Name' => 'struct pldm_base_negotiate_transfer_params_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '21861' => {
      'BaseType' => '9513',
      'Name' => 'struct pldm_base_negotiate_transfer_params_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '41917' => {
      'BaseType' => '9404',
      'Name' => 'struct pldm_base_multipart_receive_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '44666' => {
      'BaseType' => '9399',
      'Name' => 'struct pldm_base_multipart_receive_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '50395' => {
      'BaseType' => '1088',
      'Name' => 'bitfield8_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '51836' => {
      'BaseType' => '1620',
      'Name' => 'struct pldm_msg_hdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '56142' => {
      'BaseType' => '8082',
      'Name' => 'struct variable_field*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '58224' => {
      'BaseType' => '162',
      'Name' => 'uint16_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '61522' => {
      'BaseType' => '72',
      'Header' => 'types.h',
      'Line' => '45',
      'Name' => '__uint64_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '61599' => {
      'BaseType' => '61522',
      'Header' => 'stdint-uintn.h',
      'Line' => '27',
      'Name' => 'uint64_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '61869' => {
      'Header' => 'bios.h',
      'Line' => '50',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_BIOS_STRING_TABLE',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_BIOS_ATTR_TABLE',
          'value' => '1'
        },
        '2' => {
          'name' => 'PLDM_BIOS_ATTR_VAL_TABLE',
          'value' => '2'
        }
      },
      'Name' => 'enum pldm_bios_table_types',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '61903' => {
      'Header' => 'bios.h',
      'Line' => '56',
      'Memb' => {
        '0' => {
          'name' => 'string_handle',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'string_length',
          'offset' => '2',
          'type' => '162'
        },
        '2' => {
          'name' => 'name',
          'offset' => '4',
          'type' => '61960'
        }
      },
      'Name' => 'struct pldm_bios_string_table_entry',
      'Size' => '5',
      'Type' => 'Struct'
    },
    '61955' => {
      'BaseType' => '61903',
      'Name' => 'struct pldm_bios_string_table_entry const',
      'Size' => '5',
      'Type' => 'Const'
    },
    '61960' => {
      'BaseType' => '143',
      'Name' => 'char[1]',
      'Size' => '1',
      'Type' => 'Array'
    },
    '61976' => {
      'Header' => 'bios.h',
      'Line' => '62',
      'Memb' => {
        '0' => {
          'name' => 'attr_handle',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'attr_type',
          'offset' => '2',
          'type' => '150'
        },
        '2' => {
          'name' => 'string_handle',
          'offset' => '3',
          'type' => '162'
        },
        '3' => {
          'name' => 'metadata',
          'offset' => '5',
          'type' => '1781'
        }
      },
      'Name' => 'struct pldm_bios_attr_table_entry',
      'Size' => '6',
      'Type' => 'Struct'
    },
    '62041' => {
      'BaseType' => '61976',
      'Name' => 'struct pldm_bios_attr_table_entry const',
      'Size' => '6',
      'Type' => 'Const'
    },
    '62046' => {
      'Header' => 'bios.h',
      'Line' => '74',
      'Memb' => {
        '0' => {
          'name' => 'attr_handle',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'attr_type',
          'offset' => '2',
          'type' => '150'
        },
        '2' => {
          'name' => 'value',
          'offset' => '3',
          'type' => '1781'
        }
      },
      'Name' => 'struct pldm_bios_attr_val_table_entry',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '62098' => {
      'BaseType' => '62046',
      'Name' => 'struct pldm_bios_attr_val_table_entry const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '62167' => {
      'Header' => 'bios_table.h',
      'Line' => '205',
      'Memb' => {
        '0' => {
          'name' => 'name_handle',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'read_only',
          'offset' => '2',
          'type' => '6933'
        },
        '2' => {
          'name' => 'pv_num',
          'offset' => '3',
          'type' => '150'
        },
        '3' => {
          'name' => 'pv_handle',
          'offset' => '8',
          'type' => '62270'
        },
        '4' => {
          'name' => 'def_num',
          'offset' => '22',
          'type' => '150'
        },
        '5' => {
          'name' => 'def_index',
          'offset' => '36',
          'type' => '5765'
        }
      },
      'Name' => 'struct pldm_bios_table_attr_entry_enum_info',
      'Size' => '32',
      'Type' => 'Struct'
    },
    '62258' => {
      'BaseType' => '62167',
      'Name' => 'struct pldm_bios_table_attr_entry_enum_info const',
      'Size' => '32',
      'Type' => 'Const'
    },
    '62270' => {
      'BaseType' => '7752',
      'Name' => 'uint16_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '62275' => {
      'Header' => 'bios_table.h',
      'Line' => '293',
      'Memb' => {
        '0' => {
          'name' => 'name_handle',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'read_only',
          'offset' => '2',
          'type' => '6933'
        },
        '2' => {
          'name' => 'string_type',
          'offset' => '3',
          'type' => '150'
        },
        '3' => {
          'name' => 'min_length',
          'offset' => '4',
          'type' => '162'
        },
        '4' => {
          'name' => 'max_length',
          'offset' => '6',
          'type' => '162'
        },
        '5' => {
          'name' => 'def_length',
          'offset' => '8',
          'type' => '162'
        },
        '6' => {
          'name' => 'def_string',
          'offset' => '22',
          'type' => '9705'
        }
      },
      'Name' => 'struct pldm_bios_table_attr_entry_string_info',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '62387' => {
      'BaseType' => '62275',
      'Name' => 'struct pldm_bios_table_attr_entry_string_info const',
      'Size' => '24',
      'Type' => 'Const'
    },
    '62397' => {
      'Header' => 'bios_table.h',
      'Line' => '383',
      'Memb' => {
        '0' => {
          'name' => 'name_handle',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'read_only',
          'offset' => '2',
          'type' => '6933'
        },
        '2' => {
          'name' => 'lower_bound',
          'offset' => '8',
          'type' => '61599'
        },
        '3' => {
          'name' => 'upper_bound',
          'offset' => '22',
          'type' => '61599'
        },
        '4' => {
          'name' => 'scalar_increment',
          'offset' => '36',
          'type' => '174'
        },
        '5' => {
          'name' => 'default_value',
          'offset' => '50',
          'type' => '61599'
        }
      },
      'Name' => 'struct pldm_bios_table_attr_entry_integer_info',
      'Size' => '40',
      'Type' => 'Struct'
    },
    '62495' => {
      'BaseType' => '62397',
      'Name' => 'struct pldm_bios_table_attr_entry_integer_info const',
      'Size' => '40',
      'Type' => 'Const'
    },
    '62762' => {
      'Name' => 'ssize_t(*)(void const*)',
      'Param' => {
        '0' => {
          'type' => '2086'
        }
      },
      'Return' => '8126',
      'Size' => '8',
      'Type' => 'FuncPtr'
    },
    '62832' => {
      'Line' => '958',
      'Memb' => {
        '0' => {
          'name' => 'table_data',
          'offset' => '0',
          'type' => '5765'
        },
        '1' => {
          'name' => 'table_len',
          'offset' => '8',
          'type' => '883'
        },
        '2' => {
          'name' => 'current_pos',
          'offset' => '22',
          'type' => '883'
        },
        '3' => {
          'name' => 'entry_length_handler',
          'offset' => '36',
          'type' => '62762'
        }
      },
      'Name' => 'struct pldm_bios_table_iter',
      'PrivateABI' => 1,
      'Size' => '32',
      'Source' => 'bios_table.c',
      'Type' => 'Struct'
    },
    '62902' => {
      'BaseType' => '62832',
      'Name' => 'struct pldm_bios_table_iter const',
      'Size' => '32',
      'Type' => 'Const'
    },
    '63972' => {
      'BaseType' => '62832',
      'Name' => 'struct pldm_bios_table_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '63977' => {
      'BaseType' => '62098',
      'Name' => 'struct pldm_bios_attr_val_table_entry const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '64391' => {
      'BaseType' => '62041',
      'Name' => 'struct pldm_bios_attr_table_entry const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '64994' => {
      'BaseType' => '61955',
      'Name' => 'struct pldm_bios_string_table_entry const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '66157' => {
      'BaseType' => '62902',
      'Name' => 'struct pldm_bios_table_iter const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '70340' => {
      'BaseType' => '61599',
      'Name' => 'uint64_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '70617' => {
      'BaseType' => '62495',
      'Name' => 'struct pldm_bios_table_attr_entry_integer_info const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '70884' => {
      'BaseType' => '9705',
      'Name' => 'char const**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '72013' => {
      'BaseType' => '62387',
      'Name' => 'struct pldm_bios_table_attr_entry_string_info const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '73468' => {
      'BaseType' => '62258',
      'Name' => 'struct pldm_bios_table_attr_entry_enum_info const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '75633' => {
      'Header' => 'pldm_types.h',
      'Line' => '41',
      'Name' => 'struct bits16',
      'Size' => '2',
      'Type' => 'Struct'
    },
    '75903' => {
      'Header' => 'pldm_types.h',
      'Line' => '59',
      'Memb' => {
        '0' => {
          'name' => 'value',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'bits',
          'offset' => '0',
          'type' => '75633'
        }
      },
      'Name' => 'union bitfield16_t',
      'Size' => '2',
      'Type' => 'Union'
    },
    '76640' => {
      'Header' => 'file.h',
      'Line' => '52',
      'Memb' => {
        '0' => {
          'name' => 'file_identifier',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'file_attribute',
          'offset' => '2',
          'type' => '75903'
        }
      },
      'Name' => 'struct pldm_file_df_open_req',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '76680' => {
      'BaseType' => '76640',
      'Name' => 'struct pldm_file_df_open_req const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '76685' => {
      'Header' => 'file.h',
      'Line' => '61',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'file_descriptor',
          'offset' => '2',
          'type' => '162'
        }
      },
      'Name' => 'struct pldm_file_df_open_resp',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '76730' => {
      'Header' => 'file.h',
      'Line' => '70',
      'Memb' => {
        '0' => {
          'name' => 'file_descriptor',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'df_close_options',
          'offset' => '2',
          'type' => '75903'
        }
      },
      'Name' => 'struct pldm_file_df_close_req',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '76770' => {
      'BaseType' => '76730',
      'Name' => 'struct pldm_file_df_close_req const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '76775' => {
      'Header' => 'file.h',
      'Line' => '79',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '150'
        }
      },
      'Name' => 'struct pldm_file_df_close_resp',
      'Size' => '1',
      'Type' => 'Struct'
    },
    '76807' => {
      'Header' => 'file.h',
      'Line' => '87',
      'Memb' => {
        '0' => {
          'name' => 'file_descriptor',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'requester_max_interval',
          'offset' => '4',
          'type' => '174'
        }
      },
      'Name' => 'struct pldm_file_df_heartbeat_req',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '76847' => {
      'BaseType' => '76807',
      'Name' => 'struct pldm_file_df_heartbeat_req const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '76852' => {
      'Header' => 'file.h',
      'Line' => '96',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'responder_max_interval',
          'offset' => '4',
          'type' => '174'
        }
      },
      'Name' => 'struct pldm_file_df_heartbeat_resp',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '81555' => {
      'BaseType' => '76852',
      'Name' => 'struct pldm_file_df_heartbeat_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '83125' => {
      'BaseType' => '76847',
      'Name' => 'struct pldm_file_df_heartbeat_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '83251' => {
      'BaseType' => '76775',
      'Name' => 'struct pldm_file_df_close_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '87542' => {
      'BaseType' => '76770',
      'Name' => 'struct pldm_file_df_close_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '89292' => {
      'BaseType' => '76685',
      'Name' => 'struct pldm_file_df_open_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '93878' => {
      'BaseType' => '76680',
      'Name' => 'struct pldm_file_df_open_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '95661' => {
      'BaseType' => '883',
      'Name' => 'size_t const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '95673' => {
      'BaseType' => '150',
      'Header' => 'pldm_types.h',
      'Line' => '37',
      'Name' => 'bool8_t',
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '95965' => {
      'Header' => 'pldm_types.h',
      'Line' => '63',
      'Name' => 'struct bits32',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '96457' => {
      'Header' => 'pldm_types.h',
      'Line' => '97',
      'Memb' => {
        '0' => {
          'name' => 'value',
          'offset' => '0',
          'type' => '174'
        },
        '1' => {
          'name' => 'bits',
          'offset' => '0',
          'type' => '95965'
        }
      },
      'Name' => 'union bitfield32_t',
      'Size' => '4',
      'Type' => 'Union'
    },
    '96469' => {
      'Header' => 'pldm_types.h',
      'Line' => '101',
      'Name' => 'struct bits64',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '97409' => {
      'Header' => 'pldm_types.h',
      'Line' => '167',
      'Memb' => {
        '0' => {
          'name' => 'value',
          'offset' => '0',
          'type' => '61599'
        },
        '1' => {
          'name' => 'bits',
          'offset' => '0',
          'type' => '96469'
        }
      },
      'Name' => 'union bitfield64_t',
      'Size' => '8',
      'Type' => 'Union'
    },
    '97428' => {
      'BaseType' => '97440',
      'Header' => 'pldm_types.h',
      'Line' => '171',
      'Name' => 'pldm_uuid',
      'Size' => '16',
      'Type' => 'Typedef'
    },
    '97440' => {
      'BaseType' => '150',
      'Name' => 'uint8_t[16]',
      'Size' => '16',
      'Type' => 'Array'
    },
    '97456' => {
      'BaseType' => '97440',
      'Name' => 'uint8_t[16] const',
      'Size' => '16',
      'Type' => 'Const'
    },
    '97500' => {
      'BaseType' => '8082',
      'Name' => 'struct variable_field const',
      'Size' => '16',
      'Type' => 'Const'
    },
    '99632' => {
      'BaseType' => '150',
      'Name' => 'uint8_t[8]',
      'Size' => '8',
      'Type' => 'Array'
    },
    '99648' => {
      'Header' => 'firmware_update.h',
      'Line' => '465',
      'Memb' => {
        '0' => {
          'name' => 'uuid',
          'offset' => '0',
          'type' => '97440'
        },
        '1' => {
          'name' => 'package_header_format_version',
          'offset' => '22',
          'type' => '150'
        },
        '2' => {
          'name' => 'package_header_size',
          'offset' => '23',
          'type' => '162'
        },
        '3' => {
          'name' => 'package_release_date_time',
          'offset' => '25',
          'type' => '99761'
        },
        '4' => {
          'name' => 'component_bitmap_bit_length',
          'offset' => '50',
          'type' => '162'
        },
        '5' => {
          'name' => 'package_version_string_type',
          'offset' => '52',
          'type' => '150'
        },
        '6' => {
          'name' => 'package_version_string_length',
          'offset' => '53',
          'type' => '150'
        }
      },
      'Name' => 'struct pldm_package_header_information',
      'Size' => '36',
      'Type' => 'Struct'
    },
    '99761' => {
      'BaseType' => '150',
      'Name' => 'uint8_t[13]',
      'Size' => '13',
      'Type' => 'Array'
    },
    '99777' => {
      'Header' => 'firmware_update.h',
      'Line' => '479',
      'Memb' => {
        '0' => {
          'name' => 'record_length',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'descriptor_count',
          'offset' => '2',
          'type' => '150'
        },
        '2' => {
          'name' => 'device_update_option_flags',
          'offset' => '3',
          'type' => '96457'
        },
        '3' => {
          'name' => 'comp_image_set_version_string_type',
          'offset' => '7',
          'type' => '150'
        },
        '4' => {
          'name' => 'comp_image_set_version_string_length',
          'offset' => '8',
          'type' => '150'
        },
        '5' => {
          'name' => 'fw_device_pkg_data_length',
          'offset' => '9',
          'type' => '162'
        }
      },
      'Name' => 'struct pldm_firmware_device_id_record',
      'Size' => '11',
      'Type' => 'Struct'
    },
    '99990' => {
      'Header' => 'firmware_update.h',
      'Line' => '513',
      'Memb' => {
        '0' => {
          'name' => 'comp_classification',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'comp_identifier',
          'offset' => '2',
          'type' => '162'
        },
        '2' => {
          'name' => 'comp_comparison_stamp',
          'offset' => '4',
          'type' => '174'
        },
        '3' => {
          'name' => 'comp_options',
          'offset' => '8',
          'type' => '75903'
        },
        '4' => {
          'name' => 'requested_comp_activation_method',
          'offset' => '16',
          'type' => '75903'
        },
        '5' => {
          'name' => 'comp_location_offset',
          'offset' => '18',
          'type' => '174'
        },
        '6' => {
          'name' => 'comp_size',
          'offset' => '22',
          'type' => '174'
        },
        '7' => {
          'name' => 'comp_version_string_type',
          'offset' => '32',
          'type' => '150'
        },
        '8' => {
          'name' => 'comp_version_string_length',
          'offset' => '33',
          'type' => '150'
        }
      },
      'Name' => 'struct pldm_component_image_information',
      'Size' => '22',
      'Type' => 'Struct'
    },
    '100188' => {
      'Header' => 'firmware_update.h',
      'Line' => '539',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'capabilities_during_update',
          'offset' => '1',
          'type' => '96457'
        },
        '2' => {
          'name' => 'comp_count',
          'offset' => '5',
          'type' => '162'
        },
        '3' => {
          'name' => 'active_comp_image_set_ver_str_type',
          'offset' => '7',
          'type' => '150'
        },
        '4' => {
          'name' => 'active_comp_image_set_ver_str_len',
          'offset' => '8',
          'type' => '150'
        },
        '5' => {
          'name' => 'pending_comp_image_set_ver_str_type',
          'offset' => '9',
          'type' => '150'
        },
        '6' => {
          'name' => 'pending_comp_image_set_ver_str_len',
          'offset' => '16',
          'type' => '150'
        }
      },
      'Name' => 'struct pldm_get_firmware_parameters_resp',
      'Size' => '11',
      'Type' => 'Struct'
    },
    '100391' => {
      'Header' => 'firmware_update.h',
      'Line' => '567',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'downstream_device_update_supported',
          'offset' => '1',
          'type' => '150'
        },
        '2' => {
          'name' => 'number_of_downstream_devices',
          'offset' => '2',
          'type' => '162'
        },
        '3' => {
          'name' => 'max_number_of_downstream_devices',
          'offset' => '4',
          'type' => '162'
        },
        '4' => {
          'name' => 'capabilities',
          'offset' => '8',
          'type' => '96457'
        }
      },
      'Name' => 'struct pldm_query_downstream_devices_resp',
      'Size' => '12',
      'Type' => 'Struct'
    },
    '100476' => {
      'Header' => 'firmware_update.h',
      'Line' => '579',
      'Memb' => {
        '0' => {
          'name' => 'comp_classification',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'comp_identifier',
          'offset' => '2',
          'type' => '162'
        },
        '2' => {
          'name' => 'comp_classification_index',
          'offset' => '4',
          'type' => '150'
        },
        '3' => {
          'name' => 'active_comp_comparison_stamp',
          'offset' => '5',
          'type' => '174'
        },
        '4' => {
          'name' => 'active_comp_ver_str_type',
          'offset' => '9',
          'type' => '150'
        },
        '5' => {
          'name' => 'active_comp_ver_str_len',
          'offset' => '16',
          'type' => '150'
        },
        '6' => {
          'name' => 'active_comp_release_date',
          'offset' => '17',
          'type' => '99632'
        },
        '7' => {
          'name' => 'pending_comp_comparison_stamp',
          'offset' => '25',
          'type' => '174'
        },
        '8' => {
          'name' => 'pending_comp_ver_str_type',
          'offset' => '35',
          'type' => '150'
        },
        '9' => {
          'name' => 'pending_comp_ver_str_len',
          'offset' => '36',
          'type' => '150'
        },
        '10' => {
          'name' => 'pending_comp_release_date',
          'offset' => '37',
          'type' => '99632'
        },
        '11' => {
          'name' => 'comp_activation_methods',
          'offset' => '51',
          'type' => '75903'
        },
        '12' => {
          'name' => 'capabilities_during_update',
          'offset' => '53',
          'type' => '96457'
        }
      },
      'Name' => 'struct pldm_component_parameter_entry',
      'Size' => '39',
      'Type' => 'Struct'
    },
    '100791' => {
      'Header' => 'firmware_update.h',
      'Line' => '618',
      'Memb' => {
        '0' => {
          'name' => 'data_transfer_handle',
          'offset' => '0',
          'type' => '174'
        },
        '1' => {
          'name' => 'transfer_operation_flag',
          'offset' => '4',
          'type' => '150'
        }
      },
      'Name' => 'struct pldm_query_downstream_identifiers_req',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '100834' => {
      'BaseType' => '100791',
      'Name' => 'struct pldm_query_downstream_identifiers_req const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '100839' => {
      'Header' => 'firmware_update.h',
      'Line' => '632',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'next_data_transfer_handle',
          'offset' => '4',
          'type' => '174'
        },
        '2' => {
          'name' => 'transfer_flag',
          'offset' => '8',
          'type' => '150'
        },
        '3' => {
          'name' => 'downstream_devices_length',
          'offset' => '18',
          'type' => '174'
        },
        '4' => {
          'name' => 'number_of_downstream_devices',
          'offset' => '22',
          'type' => '162'
        }
      },
      'Name' => 'struct pldm_query_downstream_identifiers_resp',
      'Size' => '20',
      'Type' => 'Struct'
    },
    '100924' => {
      'Header' => 'firmware_update.h',
      'Line' => '645',
      'Memb' => {
        '0' => {
          'name' => 'downstream_device_index',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'downstream_descriptor_count',
          'offset' => '2',
          'type' => '150'
        }
      },
      'Name' => 'struct pldm_downstream_device',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '100967' => {
      'Header' => 'firmware_update.h',
      'Line' => '651',
      'Memb' => {
        '0' => {
          'name' => 'field',
          'offset' => '0',
          'type' => '8082'
        },
        '1' => {
          'name' => 'devs',
          'offset' => '22',
          'type' => '883'
        }
      },
      'Name' => 'struct pldm_downstream_device_iter',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '101010' => {
      'Header' => 'firmware_update.h',
      'Line' => '725',
      'Memb' => {
        '0' => {
          'name' => 'descriptor_type',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'descriptor_length',
          'offset' => '2',
          'type' => '162'
        },
        '2' => {
          'name' => 'descriptor_data',
          'offset' => '8',
          'type' => '2086'
        }
      },
      'Name' => 'struct pldm_descriptor',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '101083' => {
      'Header' => 'firmware_update.h',
      'Line' => '731',
      'Memb' => {
        '0' => {
          'name' => 'field',
          'offset' => '0',
          'type' => '56142'
        },
        '1' => {
          'name' => 'count',
          'offset' => '8',
          'type' => '883'
        }
      },
      'Name' => 'struct pldm_descriptor_iter',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '101131' => {
      'Header' => 'firmware_update.h',
      'Line' => '824',
      'Memb' => {
        '0' => {
          'name' => 'data_transfer_handle',
          'offset' => '0',
          'type' => '174'
        },
        '1' => {
          'name' => 'transfer_operation_flag',
          'offset' => '4',
          'type' => '150'
        }
      },
      'Name' => 'struct pldm_get_downstream_firmware_parameters_req',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '101174' => {
      'BaseType' => '101131',
      'Name' => 'struct pldm_get_downstream_firmware_parameters_req const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '101179' => {
      'Header' => 'firmware_update.h',
      'Line' => '839',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'next_data_transfer_handle',
          'offset' => '4',
          'type' => '174'
        },
        '2' => {
          'name' => 'transfer_flag',
          'offset' => '8',
          'type' => '150'
        },
        '3' => {
          'name' => 'fdp_capabilities_during_update',
          'offset' => '18',
          'type' => '96457'
        },
        '4' => {
          'name' => 'downstream_device_count',
          'offset' => '22',
          'type' => '162'
        }
      },
      'Name' => 'struct pldm_get_downstream_firmware_parameters_resp',
      'Size' => '20',
      'Type' => 'Struct'
    },
    '101264' => {
      'Header' => 'firmware_update.h',
      'Line' => '857',
      'Memb' => {
        '0' => {
          'name' => 'downstream_device_index',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'active_comp_comparison_stamp',
          'offset' => '4',
          'type' => '174'
        },
        '2' => {
          'name' => 'active_comp_ver_str_type',
          'offset' => '8',
          'type' => '150'
        },
        '3' => {
          'name' => 'active_comp_ver_str_len',
          'offset' => '9',
          'type' => '150'
        },
        '4' => {
          'name' => 'active_comp_release_date',
          'offset' => '16',
          'type' => '101461'
        },
        '5' => {
          'name' => 'pending_comp_comparison_stamp',
          'offset' => '32',
          'type' => '174'
        },
        '6' => {
          'name' => 'pending_comp_ver_str_type',
          'offset' => '36',
          'type' => '150'
        },
        '7' => {
          'name' => 'pending_comp_ver_str_len',
          'offset' => '37',
          'type' => '150'
        },
        '8' => {
          'name' => 'pending_comp_release_date',
          'offset' => '38',
          'type' => '101461'
        },
        '9' => {
          'name' => 'comp_activation_methods',
          'offset' => '54',
          'type' => '75903'
        },
        '10' => {
          'name' => 'capabilities_during_update',
          'offset' => '64',
          'type' => '96457'
        },
        '11' => {
          'name' => 'active_comp_ver_str',
          'offset' => '72',
          'type' => '2086'
        },
        '12' => {
          'name' => 'pending_comp_ver_str',
          'offset' => '86',
          'type' => '2086'
        }
      },
      'Name' => 'struct pldm_downstream_device_parameters_entry',
      'Size' => '64',
      'Type' => 'Struct'
    },
    '101461' => {
      'BaseType' => '143',
      'Name' => 'char[9]',
      'Size' => '9',
      'Type' => 'Array'
    },
    '102832' => {
      'Header' => 'firmware_update.h',
      'Line' => '1089',
      'Memb' => {
        '0' => {
          'name' => 'component_classification',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'component_identifier',
          'offset' => '2',
          'type' => '162'
        },
        '2' => {
          'name' => 'component_classification_index',
          'offset' => '4',
          'type' => '150'
        }
      },
      'Name' => 'struct pldm_fwup_update_security_revision_req',
      'Size' => '6',
      'Type' => 'Struct'
    },
    '102889' => {
      'BaseType' => '102832',
      'Name' => 'struct pldm_fwup_update_security_revision_req const',
      'Size' => '6',
      'Type' => 'Const'
    },
    '102894' => {
      'Header' => 'firmware_update.h',
      'Line' => '1406',
      'Memb' => {
        '0' => {
          'name' => 'field',
          'offset' => '0',
          'type' => '8082'
        },
        '1' => {
          'name' => 'entries',
          'offset' => '22',
          'type' => '883'
        }
      },
      'Name' => 'struct pldm_downstream_device_parameters_iter',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '102937' => {
      'Header' => 'firmware_update.h',
      'Line' => '2288',
      'Memb' => {
        '0' => {
          'name' => 'magic',
          'offset' => '0',
          'type' => '878'
        },
        '1' => {
          'name' => 'version',
          'offset' => '4',
          'type' => '5519'
        }
      },
      'Name' => 'anon-struct-firmware_update.h-2288',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '102974' => {
      'Header' => 'firmware_update.h',
      'Line' => '2307',
      'Memb' => {
        '0' => {
          'name' => 'identifier',
          'offset' => '0',
          'type' => '97456'
        },
        '1' => {
          'name' => 'revision',
          'offset' => '22',
          'type' => '5519'
        }
      },
      'Name' => 'anon-struct-firmware_update.h-2307',
      'Size' => '17',
      'Type' => 'Struct'
    },
    '103011' => {
      'Header' => 'firmware_update.h',
      'Line' => '2287',
      'Memb' => {
        '0' => {
          'name' => 'meta',
          'offset' => '0',
          'type' => '102937'
        },
        '1' => {
          'name' => 'format',
          'offset' => '8',
          'type' => '102974'
        }
      },
      'Name' => 'struct pldm_package_format_pin',
      'Size' => '28',
      'Type' => 'Struct'
    },
    '103054' => {
      'BaseType' => '103011',
      'Name' => 'struct pldm_package_format_pin const',
      'Size' => '28',
      'Type' => 'Const'
    },
    '103059' => {
      'Header' => 'firmware_update.h',
      'Line' => '2316',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_PACKAGE_PARSE_INIT',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_PACKAGE_PARSE_COMPLETE',
          'value' => '1'
        },
        '2' => {
          'name' => 'PLDM_PACKAGE_PARSE_HEADER',
          'value' => '2'
        },
        '3' => {
          'name' => 'PLDM_PACKAGE_PARSE_FIRMWARE_DEVICES',
          'value' => '3'
        },
        '4' => {
          'name' => 'PLDM_PACKAGE_PARSE_DOWNSTREAM_DEVICES',
          'value' => '4'
        },
        '5' => {
          'name' => 'PLDM_PACKAGE_PARSE_COMPONENT_IMAGE_INFORMATION',
          'value' => '5'
        }
      },
      'Name' => 'enum pldm_package_parse',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '103111' => {
      'Header' => 'firmware_update.h',
      'Line' => '2325',
      'Memb' => {
        '0' => {
          'name' => 'field',
          'offset' => '0',
          'type' => '8082'
        },
        '1' => {
          'name' => 'entries',
          'offset' => '22',
          'type' => '883'
        }
      },
      'Name' => 'struct pldm_package_iter',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '103154' => {
      'Header' => 'firmware_update.h',
      'Line' => '2338',
      'Memb' => {
        '0' => {
          'name' => 'package_header_identifier',
          'offset' => '0',
          'type' => '97428'
        },
        '1' => {
          'name' => 'package_header_format_revision',
          'offset' => '22',
          'type' => '150'
        },
        '2' => {
          'name' => 'package_release_date_time',
          'offset' => '23',
          'type' => '99761'
        },
        '3' => {
          'name' => 'component_bitmap_bit_length',
          'offset' => '48',
          'type' => '162'
        },
        '4' => {
          'name' => 'package_version_string_type',
          'offset' => '50',
          'type' => '150'
        },
        '5' => {
          'name' => 'package_version_string',
          'offset' => '64',
          'type' => '8082'
        }
      },
      'Name' => 'struct pldm__package_header_information',
      'Size' => '56',
      'Type' => 'Struct'
    },
    '103253' => {
      'BaseType' => '103154',
      'Header' => 'firmware_update.h',
      'Line' => '2351',
      'Name' => 'pldm_package_header_information_pad',
      'Size' => '56',
      'Type' => 'Typedef'
    },
    '103266' => {
      'BaseType' => '103253',
      'Name' => 'pldm_package_header_information_pad const',
      'Size' => '56',
      'Type' => 'Const'
    },
    '103271' => {
      'Header' => 'firmware_update.h',
      'Line' => '2354',
      'Memb' => {
        '0' => {
          'name' => 'bitmap',
          'offset' => '0',
          'type' => '8082'
        }
      },
      'Name' => 'struct pldm_package_component_bitmap',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '103300' => {
      'Header' => 'firmware_update.h',
      'Line' => '2366',
      'Memb' => {
        '0' => {
          'name' => 'descriptor_count',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'device_update_option_flags',
          'offset' => '4',
          'type' => '96457'
        },
        '2' => {
          'name' => 'component_image_set_version_string_type',
          'offset' => '8',
          'type' => '150'
        },
        '3' => {
          'name' => 'component_image_set_version_string',
          'offset' => '22',
          'type' => '8082'
        },
        '4' => {
          'name' => 'applicable_components',
          'offset' => '50',
          'type' => '103271'
        },
        '5' => {
          'name' => 'record_descriptors',
          'offset' => '72',
          'type' => '8082'
        },
        '6' => {
          'name' => 'firmware_device_package_data',
          'offset' => '100',
          'type' => '8082'
        },
        '7' => {
          'name' => 'reference_manifest_data',
          'offset' => '128',
          'type' => '8082'
        }
      },
      'Name' => 'struct pldm_package_firmware_device_id_record',
      'Size' => '96',
      'Type' => 'Struct'
    },
    '103427' => {
      'Header' => 'firmware_update.h',
      'Line' => '2417',
      'Memb' => {
        '0' => {
          'name' => 'descriptor_count',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'update_option_flags',
          'offset' => '4',
          'type' => '96457'
        },
        '2' => {
          'name' => 'self_contained_activation_min_version_string_type',
          'offset' => '8',
          'type' => '150'
        },
        '3' => {
          'name' => 'self_contained_activation_min_version_string',
          'offset' => '22',
          'type' => '8082'
        },
        '4' => {
          'name' => 'self_contained_activation_min_version_comparison_stamp',
          'offset' => '50',
          'type' => '174'
        },
        '5' => {
          'name' => 'applicable_components',
          'offset' => '64',
          'type' => '103271'
        },
        '6' => {
          'name' => 'record_descriptors',
          'offset' => '86',
          'type' => '8082'
        },
        '7' => {
          'name' => 'package_data',
          'offset' => '114',
          'type' => '8082'
        },
        '8' => {
          'name' => 'reference_manifest_data',
          'offset' => '136',
          'type' => '8082'
        }
      },
      'Name' => 'struct pldm_package_downstream_device_id_record',
      'Size' => '104',
      'Type' => 'Struct'
    },
    '103568' => {
      'Header' => 'firmware_update.h',
      'Line' => '2467',
      'Memb' => {
        '0' => {
          'name' => 'component_classification',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'component_identifier',
          'offset' => '2',
          'type' => '162'
        },
        '2' => {
          'name' => 'component_comparison_stamp',
          'offset' => '4',
          'type' => '174'
        },
        '3' => {
          'name' => 'component_options',
          'offset' => '8',
          'type' => '75903'
        },
        '4' => {
          'name' => 'requested_component_activation_method',
          'offset' => '16',
          'type' => '75903'
        },
        '5' => {
          'name' => 'component_image',
          'offset' => '22',
          'type' => '8082'
        },
        '6' => {
          'name' => 'component_version_string_type',
          'offset' => '50',
          'type' => '150'
        },
        '7' => {
          'name' => 'component_version_string',
          'offset' => '64',
          'type' => '8082'
        },
        '8' => {
          'name' => 'component_opaque_data',
          'offset' => '86',
          'type' => '8082'
        }
      },
      'Name' => 'struct pldm_package_component_image_information',
      'Size' => '72',
      'Type' => 'Struct'
    },
    '103709' => {
      'Header' => 'firmware_update.h',
      'Line' => '2508',
      'Memb' => {
        '0' => {
          'name' => 'pin',
          'offset' => '0',
          'type' => '103820'
        },
        '1' => {
          'name' => 'hdr',
          'offset' => '8',
          'type' => '103825'
        },
        '2' => {
          'name' => 'state',
          'offset' => '22',
          'type' => '103059'
        },
        '3' => {
          'name' => 'flags',
          'offset' => '32',
          'type' => '174'
        },
        '4' => {
          'name' => 'package',
          'offset' => '36',
          'type' => '8082'
        },
        '5' => {
          'name' => 'areas',
          'offset' => '64',
          'type' => '8082'
        },
        '6' => {
          'name' => 'iter',
          'offset' => '86',
          'type' => '103111'
        }
      },
      'Name' => 'struct pldm_package',
      'Size' => '80',
      'Type' => 'Struct'
    },
    '103820' => {
      'BaseType' => '103054',
      'Name' => 'struct pldm_package_format_pin const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '103825' => {
      'BaseType' => '103266',
      'Name' => 'pldm_package_header_information_pad const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '110705' => {
      'BaseType' => '103709',
      'Name' => 'struct pldm_package*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '110710' => {
      'BaseType' => '103568',
      'Name' => 'struct pldm_package_component_image_information*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '118799' => {
      'BaseType' => '103427',
      'Name' => 'struct pldm_package_downstream_device_id_record*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '120452' => {
      'BaseType' => '103300',
      'Name' => 'struct pldm_package_firmware_device_id_record*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '122204' => {
      'BaseType' => '103253',
      'Name' => 'pldm_package_header_information_pad*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '125144' => {
      'BaseType' => '102889',
      'Name' => 'struct pldm_fwup_update_security_revision_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '127215' => {
      'BaseType' => '95673',
      'Name' => 'bool8_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '127220' => {
      'BaseType' => '97409',
      'Name' => 'bitfield64_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '131281' => {
      'BaseType' => '96457',
      'Name' => 'bitfield32_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '136393' => {
      'BaseType' => '75903',
      'Name' => 'bitfield16_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '149102' => {
      'BaseType' => '97500',
      'Name' => 'struct variable_field const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '175975' => {
      'BaseType' => '102894',
      'Name' => 'struct pldm_downstream_device_parameters_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '175980' => {
      'BaseType' => '101264',
      'Name' => 'struct pldm_downstream_device_parameters_entry*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '179444' => {
      'BaseType' => '101179',
      'Name' => 'struct pldm_get_downstream_firmware_parameters_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '180893' => {
      'BaseType' => '101174',
      'Name' => 'struct pldm_get_downstream_firmware_parameters_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '182459' => {
      'BaseType' => '100967',
      'Name' => 'struct pldm_downstream_device_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '182464' => {
      'BaseType' => '100924',
      'Name' => 'struct pldm_downstream_device*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '185925' => {
      'BaseType' => '100839',
      'Name' => 'struct pldm_query_downstream_identifiers_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '187374' => {
      'BaseType' => '100834',
      'Name' => 'struct pldm_query_downstream_identifiers_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '190747' => {
      'BaseType' => '100391',
      'Name' => 'struct pldm_query_downstream_devices_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '191194' => {
      'BaseType' => '100476',
      'Name' => 'struct pldm_component_parameter_entry*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '201545' => {
      'BaseType' => '100188',
      'Name' => 'struct pldm_get_firmware_parameters_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '205171' => {
      'BaseType' => '2351',
      'Name' => 'uint8_t**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '205513' => {
      'BaseType' => '99990',
      'Name' => 'struct pldm_component_image_information*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '208491' => {
      'BaseType' => '101083',
      'Name' => 'struct pldm_descriptor_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '208496' => {
      'BaseType' => '101010',
      'Name' => 'struct pldm_descriptor*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '208880' => {
      'BaseType' => '99777',
      'Name' => 'struct pldm_firmware_device_id_record*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '217643' => {
      'BaseType' => '845',
      'Name' => 'void**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '218144' => {
      'BaseType' => '99648',
      'Name' => 'struct pldm_package_header_information*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '235711' => {
      'BaseType' => '235728',
      'Header' => 'pdr.h',
      'Line' => '15',
      'Name' => 'pldm_pdr',
      'PrivateABI' => 1,
      'Size' => '24',
      'Type' => 'Typedef'
    },
    '235723' => {
      'BaseType' => '235711',
      'Name' => 'pldm_pdr const',
      'Size' => '24',
      'Type' => 'Const'
    },
    '235728' => {
      'Line' => '32',
      'Memb' => {
        '0' => {
          'name' => 'record_count',
          'offset' => '0',
          'type' => '174'
        },
        '1' => {
          'name' => 'size',
          'offset' => '4',
          'type' => '174'
        },
        '2' => {
          'name' => 'first',
          'offset' => '8',
          'type' => '237198'
        },
        '3' => {
          'name' => 'last',
          'offset' => '22',
          'type' => '237198'
        }
      },
      'Name' => 'struct pldm_pdr',
      'PrivateABI' => 1,
      'Size' => '24',
      'Source' => 'pdr.c',
      'Type' => 'Struct'
    },
    '235794' => {
      'BaseType' => '235811',
      'Header' => 'pdr.h',
      'Line' => '20',
      'Name' => 'pldm_pdr_record',
      'PrivateABI' => 1,
      'Size' => '32',
      'Type' => 'Typedef'
    },
    '235806' => {
      'BaseType' => '235794',
      'Name' => 'pldm_pdr_record const',
      'Size' => '32',
      'Type' => 'Const'
    },
    '235811' => {
      'Line' => '23',
      'Memb' => {
        '0' => {
          'name' => 'record_handle',
          'offset' => '0',
          'type' => '174'
        },
        '1' => {
          'name' => 'size',
          'offset' => '4',
          'type' => '174'
        },
        '2' => {
          'name' => 'data',
          'offset' => '8',
          'type' => '2351'
        },
        '3' => {
          'name' => 'next',
          'offset' => '22',
          'type' => '237186'
        },
        '4' => {
          'name' => 'is_remote',
          'offset' => '36',
          'type' => '6933'
        },
        '5' => {
          'name' => 'terminus_handle',
          'offset' => '38',
          'type' => '162'
        }
      },
      'Name' => 'struct pldm_pdr_record',
      'PrivateABI' => 1,
      'Size' => '32',
      'Source' => 'pdr.c',
      'Type' => 'Struct'
    },
    '235903' => {
      'Header' => 'pdr.h',
      'Line' => '326',
      'Memb' => {
        '0' => {
          'name' => 'entity_type',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'entity_instance_num',
          'offset' => '2',
          'type' => '162'
        },
        '2' => {
          'name' => 'entity_container_id',
          'offset' => '4',
          'type' => '162'
        }
      },
      'Name' => 'struct pldm_entity',
      'Size' => '6',
      'Type' => 'Struct'
    },
    '235965' => {
      'BaseType' => '235903',
      'Header' => 'pdr.h',
      'Line' => '330',
      'Name' => 'pldm_entity',
      'Size' => '6',
      'Type' => 'Typedef'
    },
    '235977' => {
      'BaseType' => '235965',
      'Name' => 'pldm_entity const',
      'Size' => '6',
      'Type' => 'Const'
    },
    '236011' => {
      'BaseType' => '236023',
      'Header' => 'pdr.h',
      'Line' => '340',
      'Name' => 'pldm_entity_association_tree',
      'PrivateABI' => 1,
      'Size' => '16',
      'Type' => 'Typedef'
    },
    '236023' => {
      'Line' => '651',
      'Memb' => {
        '0' => {
          'name' => 'root',
          'offset' => '0',
          'type' => '237203'
        },
        '1' => {
          'name' => 'last_used_container_id',
          'offset' => '8',
          'type' => '162'
        }
      },
      'Name' => 'struct pldm_entity_association_tree',
      'PrivateABI' => 1,
      'Size' => '16',
      'Source' => 'pdr.c',
      'Type' => 'Struct'
    },
    '236066' => {
      'BaseType' => '236083',
      'Header' => 'pdr.h',
      'Line' => '345',
      'Name' => 'pldm_entity_node',
      'PrivateABI' => 1,
      'Size' => '40',
      'Type' => 'Typedef'
    },
    '236078' => {
      'BaseType' => '236066',
      'Name' => 'pldm_entity_node const',
      'Size' => '40',
      'Type' => 'Const'
    },
    '236083' => {
      'Line' => '656',
      'Memb' => {
        '0' => {
          'name' => 'entity',
          'offset' => '0',
          'type' => '235965'
        },
        '1' => {
          'name' => 'parent',
          'offset' => '6',
          'type' => '235965'
        },
        '2' => {
          'name' => 'remote_container_id',
          'offset' => '18',
          'type' => '162'
        },
        '3' => {
          'name' => 'first_child',
          'offset' => '22',
          'type' => '237203'
        },
        '4' => {
          'name' => 'next_sibling',
          'offset' => '36',
          'type' => '237203'
        },
        '5' => {
          'name' => 'association_type',
          'offset' => '50',
          'type' => '150'
        }
      },
      'Name' => 'struct pldm_entity_node',
      'PrivateABI' => 1,
      'Size' => '40',
      'Source' => 'pdr.c',
      'Type' => 'Struct'
    },
    '236404' => {
      'Header' => 'platform.h',
      'Line' => '593',
      'Memb' => {
        '0' => {
          'name' => 'record_handle',
          'offset' => '0',
          'type' => '174'
        },
        '1' => {
          'name' => 'version',
          'offset' => '4',
          'type' => '150'
        },
        '2' => {
          'name' => 'type',
          'offset' => '5',
          'type' => '150'
        },
        '3' => {
          'name' => 'record_change_num',
          'offset' => '6',
          'type' => '162'
        },
        '4' => {
          'name' => 'length',
          'offset' => '8',
          'type' => '162'
        }
      },
      'Name' => 'struct pldm_pdr_hdr',
      'Size' => '10',
      'Type' => 'Struct'
    },
    '236853' => {
      'Header' => 'platform.h',
      'Line' => '668',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '236404'
        },
        '1' => {
          'name' => 'terminus_handle',
          'offset' => '16',
          'type' => '162'
        },
        '2' => {
          'name' => 'sensor_id',
          'offset' => '18',
          'type' => '162'
        },
        '3' => {
          'name' => 'entity_type',
          'offset' => '20',
          'type' => '162'
        },
        '4' => {
          'name' => 'entity_instance',
          'offset' => '22',
          'type' => '162'
        },
        '5' => {
          'name' => 'container_id',
          'offset' => '24',
          'type' => '162'
        },
        '6' => {
          'name' => 'sensor_init',
          'offset' => '32',
          'type' => '150'
        },
        '7' => {
          'name' => 'sensor_auxiliary_names_pdr',
          'offset' => '33',
          'type' => '95673'
        },
        '8' => {
          'name' => 'composite_sensor_count',
          'offset' => '34',
          'type' => '150'
        },
        '9' => {
          'name' => 'possible_states',
          'offset' => '35',
          'type' => '1781'
        }
      },
      'Name' => 'struct pldm_state_sensor_pdr',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '237007' => {
      'Header' => 'platform.h',
      'Line' => '695',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '236404'
        },
        '1' => {
          'name' => 'terminus_handle',
          'offset' => '16',
          'type' => '162'
        },
        '2' => {
          'name' => 'effecter_id',
          'offset' => '18',
          'type' => '162'
        },
        '3' => {
          'name' => 'entity_type',
          'offset' => '20',
          'type' => '162'
        },
        '4' => {
          'name' => 'entity_instance',
          'offset' => '22',
          'type' => '162'
        },
        '5' => {
          'name' => 'container_id',
          'offset' => '24',
          'type' => '162'
        },
        '6' => {
          'name' => 'effecter_semantic_id',
          'offset' => '32',
          'type' => '162'
        },
        '7' => {
          'name' => 'effecter_init',
          'offset' => '34',
          'type' => '150'
        },
        '8' => {
          'name' => 'has_description_pdr',
          'offset' => '35',
          'type' => '95673'
        },
        '9' => {
          'name' => 'composite_effecter_count',
          'offset' => '36',
          'type' => '150'
        },
        '10' => {
          'name' => 'possible_states',
          'offset' => '37',
          'type' => '1781'
        }
      },
      'Name' => 'struct pldm_state_effecter_pdr',
      'Size' => '26',
      'Type' => 'Struct'
    },
    '237186' => {
      'BaseType' => '235811',
      'Name' => 'struct pldm_pdr_record*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '237198' => {
      'BaseType' => '235794',
      'Name' => 'pldm_pdr_record*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '237203' => {
      'BaseType' => '236066',
      'Name' => 'pldm_entity_node*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '237570' => {
      'BaseType' => '236011',
      'Name' => 'pldm_entity_association_tree*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '237575' => {
      'BaseType' => '235977',
      'Name' => 'pldm_entity const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '239059' => {
      'BaseType' => '235711',
      'Name' => 'pldm_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '240714' => {
      'BaseType' => '235806',
      'Name' => 'pldm_pdr_record const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '249433' => {
      'BaseType' => '235965',
      'Name' => 'pldm_entity*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '269310' => {
      'BaseType' => '249433',
      'Name' => 'pldm_entity**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '269957' => {
      'BaseType' => '237203',
      'Name' => 'pldm_entity_node**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '270746' => {
      'BaseType' => '235723',
      'Name' => 'pldm_pdr const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '276406' => {
      'BaseType' => '236078',
      'Name' => 'pldm_entity_node const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '283251' => {
      'BaseType' => '237007',
      'Name' => 'struct pldm_state_effecter_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '288942' => {
      'BaseType' => '236853',
      'Name' => 'struct pldm_state_sensor_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '294219' => {
      'BaseType' => '79',
      'Header' => 'types.h',
      'Line' => '37',
      'Name' => '__int8_t',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '294243' => {
      'BaseType' => '98',
      'Header' => 'types.h',
      'Line' => '39',
      'Name' => '__int16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '294267' => {
      'BaseType' => '117',
      'Header' => 'types.h',
      'Line' => '41',
      'Name' => '__int32_t',
      'PrivateABI' => 1,
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '294291' => {
      'BaseType' => '105',
      'Header' => 'types.h',
      'Line' => '55',
      'Name' => '__uint_least16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '294322' => {
      'BaseType' => '294219',
      'Header' => 'stdint-intn.h',
      'Line' => '24',
      'Name' => 'int8_t',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '294334' => {
      'BaseType' => '294243',
      'Header' => 'stdint-intn.h',
      'Line' => '25',
      'Name' => 'int16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '294346' => {
      'BaseType' => '294267',
      'Header' => 'stdint-intn.h',
      'Line' => '26',
      'Name' => 'int32_t',
      'PrivateABI' => 1,
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '295007' => {
      'BaseType' => '1188',
      'Header' => 'pldm_types.h',
      'Line' => '169',
      'Name' => 'real32_t',
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '295746' => {
      'BaseType' => '294291',
      'Header' => 'uchar.h',
      'Line' => '55',
      'Name' => 'char16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '296669' => {
      'Header' => 'platform.h',
      'Line' => '345',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_SENSOR_OP_STATE',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_STATE_SENSOR_STATE',
          'value' => '1'
        },
        '2' => {
          'name' => 'PLDM_NUMERIC_SENSOR_STATE',
          'value' => '2'
        }
      },
      'Name' => 'enum sensor_event_class_states',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '296703' => {
      'BaseType' => '296669',
      'Name' => 'enum sensor_event_class_states const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '297199' => {
      'Header' => 'platform.h',
      'Line' => '685',
      'Memb' => {
        '0' => {
          'name' => 'state_set_id',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'possible_states_size',
          'offset' => '2',
          'type' => '150'
        },
        '2' => {
          'name' => 'states',
          'offset' => '3',
          'type' => '297261'
        }
      },
      'Name' => 'struct state_sensor_possible_states',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '297256' => {
      'BaseType' => '297199',
      'Name' => 'struct state_sensor_possible_states const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '297261' => {
      'BaseType' => '1088',
      'Name' => 'bitfield8_t[1]',
      'Size' => '1',
      'Type' => 'Array'
    },
    '297639' => {
      'Header' => 'platform.h',
      'Line' => '786',
      'Memb' => {
        '0' => {
          'name' => 'value_u8',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'value_s8',
          'offset' => '0',
          'type' => '294322'
        },
        '2' => {
          'name' => 'value_u16',
          'offset' => '0',
          'type' => '162'
        },
        '3' => {
          'name' => 'value_s16',
          'offset' => '0',
          'type' => '294334'
        },
        '4' => {
          'name' => 'value_u32',
          'offset' => '0',
          'type' => '174'
        },
        '5' => {
          'name' => 'value_s32',
          'offset' => '0',
          'type' => '294346'
        },
        '6' => {
          'name' => 'value_f32',
          'offset' => '0',
          'type' => '295007'
        }
      },
      'Name' => 'union union_range_field_format',
      'Size' => '4',
      'Type' => 'Union'
    },
    '298238' => {
      'Header' => 'platform.h',
      'Line' => '843',
      'Memb' => {
        '0' => {
          'name' => 'value_u8',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'value_s8',
          'offset' => '0',
          'type' => '294322'
        },
        '2' => {
          'name' => 'value_u16',
          'offset' => '0',
          'type' => '162'
        },
        '3' => {
          'name' => 'value_s16',
          'offset' => '0',
          'type' => '294334'
        },
        '4' => {
          'name' => 'value_u32',
          'offset' => '0',
          'type' => '174'
        },
        '5' => {
          'name' => 'value_s32',
          'offset' => '0',
          'type' => '294346'
        }
      },
      'Name' => 'union union_sensor_data_size',
      'Size' => '4',
      'Type' => 'Union'
    },
    '298251' => {
      'Header' => 'platform.h',
      'Line' => '850',
      'Memb' => {
        '0' => {
          'name' => 'record_handle',
          'offset' => '0',
          'type' => '174'
        },
        '1' => {
          'name' => 'version',
          'offset' => '4',
          'type' => '150'
        },
        '2' => {
          'name' => 'type',
          'offset' => '5',
          'type' => '150'
        },
        '3' => {
          'name' => 'record_change_num',
          'offset' => '6',
          'type' => '162'
        },
        '4' => {
          'name' => 'length',
          'offset' => '8',
          'type' => '162'
        }
      },
      'Name' => 'struct pldm_value_pdr_hdr',
      'Size' => '12',
      'Type' => 'Struct'
    },
    '298336' => {
      'Header' => 'platform.h',
      'Line' => '868',
      'Memb' => {
        '0' => {
          'name' => 'entity_instance_num',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'entity_instance',
          'offset' => '0',
          'type' => '162'
        }
      },
      'Name' => 'anon-union-platform.h-868',
      'Size' => '2',
      'Type' => 'Union'
    },
    '298371' => {
      'Header' => 'platform.h',
      'Line' => '863',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '298251'
        },
        '1' => {
          'name' => 'terminus_handle',
          'offset' => '18',
          'type' => '162'
        },
        '2' => {
          'name' => 'sensor_id',
          'offset' => '20',
          'type' => '162'
        },
        '3' => {
          'name' => 'entity_type',
          'offset' => '22',
          'type' => '162'
        },
        '4' => {
          'name' => 'unnamed0',
          'offset' => '24',
          'type' => '298336'
        },
        '5' => {
          'name' => 'container_id',
          'offset' => '32',
          'type' => '162'
        },
        '6' => {
          'name' => 'sensor_init',
          'offset' => '34',
          'type' => '150'
        },
        '7' => {
          'name' => 'sensor_auxiliary_names_pdr',
          'offset' => '35',
          'type' => '95673'
        },
        '8' => {
          'name' => 'base_unit',
          'offset' => '36',
          'type' => '150'
        },
        '9' => {
          'name' => 'unit_modifier',
          'offset' => '37',
          'type' => '294322'
        },
        '10' => {
          'name' => 'rate_unit',
          'offset' => '38',
          'type' => '150'
        },
        '11' => {
          'name' => 'base_oem_unit_handle',
          'offset' => '39',
          'type' => '150'
        },
        '12' => {
          'name' => 'aux_unit',
          'offset' => '40',
          'type' => '150'
        },
        '13' => {
          'name' => 'aux_unit_modifier',
          'offset' => '41',
          'type' => '294322'
        },
        '14' => {
          'name' => 'aux_rate_unit',
          'offset' => '48',
          'type' => '150'
        },
        '15' => {
          'name' => 'rel',
          'offset' => '49',
          'type' => '150'
        },
        '16' => {
          'name' => 'aux_oem_unit_handle',
          'offset' => '50',
          'type' => '150'
        },
        '17' => {
          'name' => 'is_linear',
          'offset' => '51',
          'type' => '95673'
        },
        '18' => {
          'name' => 'sensor_data_size',
          'offset' => '52',
          'type' => '150'
        },
        '19' => {
          'name' => 'resolution',
          'offset' => '54',
          'type' => '295007'
        },
        '20' => {
          'name' => 'offset',
          'offset' => '64',
          'type' => '295007'
        },
        '21' => {
          'name' => 'accuracy',
          'offset' => '68',
          'type' => '162'
        },
        '22' => {
          'name' => 'plus_tolerance',
          'offset' => '70',
          'type' => '150'
        },
        '23' => {
          'name' => 'minus_tolerance',
          'offset' => '71',
          'type' => '150'
        },
        '24' => {
          'name' => 'hysteresis',
          'offset' => '72',
          'type' => '298238'
        },
        '25' => {
          'name' => 'supported_thresholds',
          'offset' => '82',
          'type' => '1088'
        },
        '26' => {
          'name' => 'threshold_and_hysteresis_volatility',
          'offset' => '83',
          'type' => '1088'
        },
        '27' => {
          'name' => 'state_transition_interval',
          'offset' => '86',
          'type' => '295007'
        },
        '28' => {
          'name' => 'update_interval',
          'offset' => '96',
          'type' => '295007'
        },
        '29' => {
          'name' => 'max_readable',
          'offset' => '100',
          'type' => '298238'
        },
        '30' => {
          'name' => 'min_readable',
          'offset' => '104',
          'type' => '298238'
        },
        '31' => {
          'name' => 'range_field_format',
          'offset' => '114',
          'type' => '150'
        },
        '32' => {
          'name' => 'range_field_support',
          'offset' => '115',
          'type' => '1088'
        },
        '33' => {
          'name' => 'nominal_value',
          'offset' => '118',
          'type' => '297639'
        },
        '34' => {
          'name' => 'normal_max',
          'offset' => '128',
          'type' => '297639'
        },
        '35' => {
          'name' => 'normal_min',
          'offset' => '132',
          'type' => '297639'
        },
        '36' => {
          'name' => 'warning_high',
          'offset' => '136',
          'type' => '297639'
        },
        '37' => {
          'name' => 'warning_low',
          'offset' => '146',
          'type' => '297639'
        },
        '38' => {
          'name' => 'critical_high',
          'offset' => '150',
          'type' => '297639'
        },
        '39' => {
          'name' => 'critical_low',
          'offset' => '256',
          'type' => '297639'
        },
        '40' => {
          'name' => 'fatal_high',
          'offset' => '260',
          'type' => '297639'
        },
        '41' => {
          'name' => 'fatal_low',
          'offset' => '264',
          'type' => '297639'
        }
      },
      'Name' => 'struct pldm_numeric_sensor_value_pdr',
      'Size' => '112',
      'Type' => 'Struct'
    },
    '298964' => {
      'BaseType' => '295746',
      'Header' => 'platform.h',
      'Line' => '911',
      'Name' => 'pldm_utf16be',
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '298977' => {
      'Header' => 'platform.h',
      'Line' => '913',
      'Memb' => {
        '0' => {
          'name' => 'tag',
          'offset' => '0',
          'type' => '7555'
        },
        '1' => {
          'name' => 'name',
          'offset' => '8',
          'type' => '299019'
        }
      },
      'Name' => 'struct pldm_entity_auxiliary_name',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '299019' => {
      'BaseType' => '298964',
      'Name' => 'pldm_utf16be*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '299024' => {
      'Header' => 'platform.h',
      'Line' => '923',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '298251'
        },
        '1' => {
          'name' => 'container',
          'offset' => '18',
          'type' => '235965'
        },
        '2' => {
          'name' => 'shared_name_count',
          'offset' => '24',
          'type' => '150'
        },
        '3' => {
          'name' => 'name_string_count',
          'offset' => '25',
          'type' => '150'
        },
        '4' => {
          'name' => 'names',
          'offset' => '36',
          'type' => '299138'
        },
        '5' => {
          'name' => 'auxiliary_name_data_size',
          'offset' => '50',
          'type' => '883'
        },
        '6' => {
          'name' => 'auxiliary_name_data',
          'offset' => '64',
          'type' => '299143'
        }
      },
      'Name' => 'struct pldm_entity_auxiliary_names_pdr',
      'Size' => '40',
      'Type' => 'Struct'
    },
    '299138' => {
      'BaseType' => '298977',
      'Name' => 'struct pldm_entity_auxiliary_name*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '299143' => {
      'BaseType' => '143',
      'Name' => 'char[]',
      'Size' => '8',
      'Type' => 'Array'
    },
    '299158' => {
      'Header' => 'platform.h',
      'Line' => '953',
      'Memb' => {
        '0' => {
          'name' => 'state_set_id',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'possible_states_size',
          'offset' => '2',
          'type' => '150'
        },
        '2' => {
          'name' => 'states',
          'offset' => '3',
          'type' => '297261'
        }
      },
      'Name' => 'struct state_effecter_possible_states',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '299215' => {
      'BaseType' => '299158',
      'Name' => 'struct state_effecter_possible_states const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '299220' => {
      'Header' => 'platform.h',
      'Line' => '977',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '298251'
        },
        '1' => {
          'name' => 'terminus_handle',
          'offset' => '18',
          'type' => '162'
        },
        '2' => {
          'name' => 'file_identifier',
          'offset' => '20',
          'type' => '162'
        },
        '3' => {
          'name' => 'container',
          'offset' => '22',
          'type' => '235965'
        },
        '4' => {
          'name' => 'superior_directory_file_identifier',
          'offset' => '34',
          'type' => '162'
        },
        '5' => {
          'name' => 'file_classification',
          'offset' => '36',
          'type' => '150'
        },
        '6' => {
          'name' => 'oem_file_classification',
          'offset' => '37',
          'type' => '150'
        },
        '7' => {
          'name' => 'file_capabilities',
          'offset' => '38',
          'type' => '75903'
        },
        '8' => {
          'name' => 'file_version',
          'offset' => '40',
          'type' => '1171'
        },
        '9' => {
          'name' => 'file_maximum_size',
          'offset' => '50',
          'type' => '174'
        },
        '10' => {
          'name' => 'file_maximum_file_descriptor_count',
          'offset' => '54',
          'type' => '150'
        },
        '11' => {
          'name' => 'file_name',
          'offset' => '64',
          'type' => '8082'
        },
        '12' => {
          'name' => 'oem_file_classification_name',
          'offset' => '86',
          'type' => '8082'
        }
      },
      'Name' => 'struct pldm_platform_file_descriptor_pdr',
      'Size' => '72',
      'Type' => 'Struct'
    },
    '299421' => {
      'Header' => 'platform.h',
      'Line' => '1023',
      'Memb' => {
        '0' => {
          'name' => 'set_request',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'effecter_state',
          'offset' => '1',
          'type' => '150'
        }
      },
      'Name' => 'struct state_field_for_state_effecter_set',
      'Size' => '2',
      'Type' => 'Struct'
    },
    '299464' => {
      'BaseType' => '299421',
      'Header' => 'platform.h',
      'Line' => '1026',
      'Name' => 'set_effecter_state_field',
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '299477' => {
      'Header' => 'platform.h',
      'Line' => '1032',
      'Memb' => {
        '0' => {
          'name' => 'sensor_op_state',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'present_state',
          'offset' => '1',
          'type' => '150'
        },
        '2' => {
          'name' => 'previous_state',
          'offset' => '2',
          'type' => '150'
        },
        '3' => {
          'name' => 'event_state',
          'offset' => '3',
          'type' => '150'
        }
      },
      'Name' => 'struct state_field_for_get_state_sensor_readings',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '299548' => {
      'BaseType' => '299477',
      'Header' => 'platform.h',
      'Line' => '1040',
      'Name' => 'get_sensor_state_field',
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '299561' => {
      'Header' => 'platform.h',
      'Line' => '1046',
      'Memb' => {
        '0' => {
          'name' => 'effecter_op_state',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'pending_state',
          'offset' => '1',
          'type' => '150'
        },
        '2' => {
          'name' => 'present_state',
          'offset' => '2',
          'type' => '150'
        }
      },
      'Name' => 'struct state_field_for_get_state_effecter_states',
      'Size' => '3',
      'Type' => 'Struct'
    },
    '299618' => {
      'BaseType' => '299561',
      'Header' => 'platform.h',
      'Line' => '1050',
      'Name' => 'get_effecter_state_field',
      'Size' => '3',
      'Type' => 'Typedef'
    },
    '300102' => {
      'Header' => 'platform.h',
      'Line' => '1125',
      'Memb' => {
        '0' => {
          'name' => 'mctp_eid',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'vendor_specific',
          'offset' => '0',
          'type' => '8082'
        }
      },
      'Name' => 'anon-union-platform.h-1125',
      'Size' => '16',
      'Type' => 'Union'
    },
    '300136' => {
      'Header' => 'platform.h',
      'Line' => '1122',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'transport_protocol_type',
          'offset' => '1',
          'type' => '150'
        },
        '2' => {
          'name' => 'event_receiver_address',
          'offset' => '8',
          'type' => '300102'
        }
      },
      'Name' => 'struct pldm_get_event_receiver_resp',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '300438' => {
      'Header' => 'platform.h',
      'Line' => '1210',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'comp_effecter_count',
          'offset' => '1',
          'type' => '150'
        },
        '2' => {
          'name' => 'field',
          'offset' => '2',
          'type' => '300495'
        }
      },
      'Name' => 'struct pldm_get_state_effecter_states_resp',
      'Size' => '26',
      'Type' => 'Struct'
    },
    '300495' => {
      'BaseType' => '299618',
      'Name' => 'get_effecter_state_field[8]',
      'Size' => '24',
      'Type' => 'Array'
    },
    '300511' => {
      'Header' => 'platform.h',
      'Line' => '1220',
      'Memb' => {
        '0' => {
          'name' => 'sensor_id',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'sensor_event_class_type',
          'offset' => '2',
          'type' => '150'
        },
        '2' => {
          'name' => 'event_class',
          'offset' => '3',
          'type' => '1781'
        }
      },
      'Name' => 'struct pldm_sensor_event_data',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '300625' => {
      'Header' => 'platform.h',
      'Line' => '1260',
      'Memb' => {
        '0' => {
          'name' => 'format_version',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'event_id',
          'offset' => '2',
          'type' => '162'
        },
        '2' => {
          'name' => 'data_transfer_handle',
          'offset' => '4',
          'type' => '174'
        }
      },
      'Name' => 'struct pldm_message_poll_event',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '300687' => {
      'Header' => 'platform.h',
      'Line' => '1270',
      'Memb' => {
        '0' => {
          'name' => 'format_version',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'format_type',
          'offset' => '1',
          'type' => '150'
        },
        '2' => {
          'name' => 'event_data_length',
          'offset' => '2',
          'type' => '162'
        },
        '3' => {
          'name' => 'event_data',
          'offset' => '4',
          'type' => '300758'
        }
      },
      'Name' => 'struct pldm_platform_cper_event',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '300758' => {
      'BaseType' => '150',
      'Name' => 'uint8_t[]',
      'Size' => '8',
      'Type' => 'Array'
    },
    '300914' => {
      'Header' => 'platform.h',
      'Line' => '1330',
      'Memb' => {
        '0' => {
          'name' => 'event_data_format',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'number_of_change_records',
          'offset' => '1',
          'type' => '150'
        },
        '2' => {
          'name' => 'change_records',
          'offset' => '2',
          'type' => '1781'
        }
      },
      'Name' => 'struct pldm_pdr_repository_chg_event_data',
      'Size' => '3',
      'Type' => 'Struct'
    },
    '301492' => {
      'Header' => 'platform.h',
      'Line' => '2844',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '298251'
        },
        '1' => {
          'name' => 'resource_id',
          'offset' => '18',
          'type' => '174'
        },
        '2' => {
          'name' => 'resource_flags',
          'offset' => '22',
          'type' => '1088'
        },
        '3' => {
          'name' => 'containing_resource_id',
          'offset' => '32',
          'type' => '174'
        },
        '4' => {
          'name' => 'proposed_containing_resource_name',
          'offset' => '36',
          'type' => '8082'
        },
        '5' => {
          'name' => 'sub_uri',
          'offset' => '64',
          'type' => '8082'
        },
        '6' => {
          'name' => 'additional_resource_id_count',
          'offset' => '86',
          'type' => '162'
        },
        '7' => {
          'name' => 'additional_resources',
          'offset' => '100',
          'type' => '8082'
        },
        '8' => {
          'name' => 'major_schema_version',
          'offset' => '128',
          'type' => '1171'
        },
        '9' => {
          'name' => 'major_schema_dictionary_length_bytes',
          'offset' => '132',
          'type' => '162'
        },
        '10' => {
          'name' => 'major_schema_dictionary_signature',
          'offset' => '136',
          'type' => '174'
        },
        '11' => {
          'name' => 'major_schema_name',
          'offset' => '150',
          'type' => '8082'
        },
        '12' => {
          'name' => 'oem_count',
          'offset' => '274',
          'type' => '162'
        },
        '13' => {
          'name' => 'oem_names',
          'offset' => '288',
          'type' => '8082'
        }
      },
      'Name' => 'struct pldm_platform_redfish_resource_pdr',
      'Size' => '136',
      'Type' => 'Struct'
    },
    '301702' => {
      'Header' => 'platform.h',
      'Line' => '2920',
      'Memb' => {
        '0' => {
          'name' => 'id',
          'offset' => '0',
          'type' => '174'
        },
        '1' => {
          'name' => 'sub_uri',
          'offset' => '8',
          'type' => '8082'
        }
      },
      'Name' => 'struct pldm_platform_redfish_resource_pdr_additional_resource',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '301743' => {
      'Header' => 'platform.h',
      'Line' => '2925',
      'Memb' => {
        '0' => {
          'name' => 'field',
          'offset' => '0',
          'type' => '8082'
        },
        '1' => {
          'name' => 'entries',
          'offset' => '22',
          'type' => '883'
        }
      },
      'Name' => 'struct pldm_platform_redfish_resource_pdr_additional_resource_iter',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '301786' => {
      'Header' => 'platform.h',
      'Line' => '3020',
      'Memb' => {
        '0' => {
          'name' => 'name',
          'offset' => '0',
          'type' => '8082'
        }
      },
      'Name' => 'struct pldm_platform_redfish_resource_pdr_oem_name',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '301815' => {
      'Header' => 'platform.h',
      'Line' => '3024',
      'Memb' => {
        '0' => {
          'name' => 'field',
          'offset' => '0',
          'type' => '8082'
        },
        '1' => {
          'name' => 'entries',
          'offset' => '22',
          'type' => '883'
        }
      },
      'Name' => 'struct pldm_platform_redfish_resource_pdr_oem_name_iter',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '301858' => {
      'Header' => 'platform.h',
      'Line' => '3114',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '298251'
        },
        '1' => {
          'name' => 'action_pdr_index',
          'offset' => '18',
          'type' => '150'
        },
        '2' => {
          'name' => 'related_resource_count',
          'offset' => '20',
          'type' => '162'
        },
        '3' => {
          'name' => 'related_resources',
          'offset' => '22',
          'type' => '8082'
        },
        '4' => {
          'name' => 'action_count',
          'offset' => '50',
          'type' => '150'
        },
        '5' => {
          'name' => 'actions',
          'offset' => '64',
          'type' => '8082'
        }
      },
      'Name' => 'struct pldm_platform_redfish_action_pdr',
      'Size' => '56',
      'Type' => 'Struct'
    },
    '301956' => {
      'Header' => 'platform.h',
      'Line' => '3174',
      'Memb' => {
        '0' => {
          'name' => 'field',
          'offset' => '0',
          'type' => '8082'
        },
        '1' => {
          'name' => 'entries',
          'offset' => '22',
          'type' => '883'
        }
      },
      'Name' => 'struct pldm_platform_redfish_action_pdr_related_resource_id_iter',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '301999' => {
      'Header' => 'platform.h',
      'Line' => '3266',
      'Memb' => {
        '0' => {
          'name' => 'name',
          'offset' => '0',
          'type' => '8082'
        },
        '1' => {
          'name' => 'path',
          'offset' => '22',
          'type' => '8082'
        }
      },
      'Name' => 'struct pldm_platform_redfish_action_pdr_action',
      'Size' => '32',
      'Type' => 'Struct'
    },
    '302042' => {
      'Header' => 'platform.h',
      'Line' => '3271',
      'Memb' => {
        '0' => {
          'name' => 'field',
          'offset' => '0',
          'type' => '8082'
        },
        '1' => {
          'name' => 'entries',
          'offset' => '22',
          'type' => '883'
        }
      },
      'Name' => 'struct pldm_platform_redfish_action_pdr_action_iter',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '308149' => {
      'BaseType' => '302042',
      'Name' => 'struct pldm_platform_redfish_action_pdr_action_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '308154' => {
      'BaseType' => '301999',
      'Name' => 'struct pldm_platform_redfish_action_pdr_action*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '309441' => {
      'BaseType' => '301956',
      'Name' => 'struct pldm_platform_redfish_action_pdr_related_resource_id_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '315555' => {
      'BaseType' => '301858',
      'Name' => 'struct pldm_platform_redfish_action_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '317172' => {
      'BaseType' => '301815',
      'Name' => 'struct pldm_platform_redfish_resource_pdr_oem_name_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '317177' => {
      'BaseType' => '301786',
      'Name' => 'struct pldm_platform_redfish_resource_pdr_oem_name*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '319184' => {
      'BaseType' => '301743',
      'Name' => 'struct pldm_platform_redfish_resource_pdr_additional_resource_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '319189' => {
      'BaseType' => '301702',
      'Name' => 'struct pldm_platform_redfish_resource_pdr_additional_resource*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '330199' => {
      'BaseType' => '301492',
      'Name' => 'struct pldm_platform_redfish_resource_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '337854' => {
      'BaseType' => '2403',
      'Name' => 'size_t*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '346858' => {
      'BaseType' => '299220',
      'Name' => 'struct pldm_platform_file_descriptor_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '346912' => {
      'BaseType' => '300687',
      'Name' => 'struct pldm_platform_cper_event*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '351332' => {
      'BaseType' => '299024',
      'Name' => 'struct pldm_entity_auxiliary_names_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '363238' => {
      'BaseType' => '300438',
      'Name' => 'struct pldm_get_state_effecter_states_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '409945' => {
      'BaseType' => '300136',
      'Name' => 'struct pldm_get_event_receiver_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '432204' => {
      'BaseType' => '300625',
      'Name' => 'struct pldm_message_poll_event*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '433889' => {
      'BaseType' => '433899',
      'Name' => 'uint32_t const*const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '433894' => {
      'BaseType' => '878',
      'Name' => 'uint32_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '433899' => {
      'BaseType' => '433894',
      'Name' => 'uint32_t const*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '433904' => {
      'BaseType' => '300914',
      'Name' => 'struct pldm_pdr_repository_chg_event_data*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '484320' => {
      'BaseType' => '298371',
      'Name' => 'struct pldm_numeric_sensor_value_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '512054' => {
      'BaseType' => '300511',
      'Name' => 'struct pldm_sensor_event_data*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '512059' => {
      'BaseType' => '512054',
      'Name' => 'struct pldm_sensor_event_data*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '517087' => {
      'BaseType' => '299548',
      'Name' => 'get_sensor_state_field*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '545071' => {
      'BaseType' => '299464',
      'Name' => 'set_effecter_state_field*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '546052' => {
      'BaseType' => '288942',
      'Name' => 'struct pldm_state_sensor_pdr*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '546057' => {
      'BaseType' => '297256',
      'Name' => 'struct state_sensor_possible_states const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '546062' => {
      'BaseType' => '546057',
      'Name' => 'struct state_sensor_possible_states const*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '546462' => {
      'BaseType' => '283251',
      'Name' => 'struct pldm_state_effecter_pdr*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '546467' => {
      'BaseType' => '299215',
      'Name' => 'struct state_effecter_possible_states const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '546472' => {
      'BaseType' => '546467',
      'Name' => 'struct state_effecter_possible_states const*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '551032' => {
      'Line' => '20',
      'Memb' => {
        '0' => {
          'name' => 'prev',
          'offset' => '0',
          'type' => '6315'
        },
        '1' => {
          'name' => 'allocations',
          'offset' => '4',
          'type' => '174'
        }
      },
      'Name' => 'struct pldm_tid_state',
      'PrivateABI' => 1,
      'Size' => '8',
      'Source' => 'instance-id.c',
      'Type' => 'Struct'
    },
    '551071' => {
      'Line' => '25',
      'Memb' => {
        '0' => {
          'name' => 'state',
          'offset' => '0',
          'type' => '551113'
        },
        '1' => {
          'name' => 'lock_db_fd',
          'offset' => '8264',
          'type' => '117'
        }
      },
      'Name' => 'struct pldm_instance_db',
      'PrivateABI' => 1,
      'Size' => '2052',
      'Source' => 'instance-id.c',
      'Type' => 'Struct'
    },
    '551113' => {
      'BaseType' => '551032',
      'Name' => 'struct pldm_tid_state[256]',
      'Size' => '2048',
      'Type' => 'Array'
    },
    '551669' => {
      'BaseType' => '551071',
      'Name' => 'struct pldm_instance_db*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '552056' => {
      'BaseType' => '6315',
      'Name' => 'pldm_instance_id_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '552232' => {
      'BaseType' => '551669',
      'Name' => 'struct pldm_instance_db**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '552764' => {
      'Header' => 'socket.h',
      'Line' => '4',
      'Memb' => {
        '0' => {
          'name' => 'size',
          'offset' => '0',
          'type' => '117'
        },
        '1' => {
          'name' => 'socket',
          'offset' => '4',
          'type' => '117'
        },
        '2' => {
          'name' => 'max_size',
          'offset' => '8',
          'type' => '117'
        }
      },
      'Name' => 'struct pldm_socket_sndbuf',
      'PrivateABI' => 1,
      'Size' => '12',
      'Type' => 'Struct'
    },
    '554739' => {
      'BaseType' => '51',
      'Header' => 'int-ll64.h',
      'Line' => '21',
      'Name' => '__u8',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '554765' => {
      'BaseType' => '58',
      'Header' => 'int-ll64.h',
      'Line' => '24',
      'Name' => '__u16',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '555234' => {
      'BaseType' => '150',
      'Header' => 'pldm.h',
      'Line' => '12',
      'Name' => 'mctp_eid_t',
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '555348' => {
      'BaseType' => '6412',
      'Header' => 'pldm.h',
      'Line' => '29',
      'Name' => 'pldm_requester_rc_t',
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '555360' => {
      'Header' => 'transport.h',
      'Line' => '17',
      'Memb' => {
        '0' => {
          'name' => 'name',
          'offset' => '0',
          'type' => '9705'
        },
        '1' => {
          'name' => 'version',
          'offset' => '8',
          'type' => '150'
        },
        '2' => {
          'name' => 'recv',
          'offset' => '22',
          'type' => '555494'
        },
        '3' => {
          'name' => 'send',
          'offset' => '36',
          'type' => '555535'
        },
        '4' => {
          'name' => 'init_pollfd',
          'offset' => '50',
          'type' => '555617'
        }
      },
      'Name' => 'struct pldm_transport',
      'PrivateABI' => 1,
      'Size' => '40',
      'Type' => 'Struct'
    },
    '555474' => {
      'BaseType' => '555360',
      'Name' => 'struct pldm_transport*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '555479' => {
      'BaseType' => '6303',
      'Name' => 'pldm_tid_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '555494' => {
      'Name' => 'pldm_requester_rc_t(*)(struct pldm_transport*, pldm_tid_t*, void**, size_t*)',
      'Param' => {
        '0' => {
          'type' => '555474'
        },
        '1' => {
          'type' => '555479'
        },
        '2' => {
          'type' => '217643'
        },
        '3' => {
          'type' => '2403'
        }
      },
      'Return' => '555348',
      'Size' => '8',
      'Type' => 'FuncPtr'
    },
    '555535' => {
      'Name' => 'pldm_requester_rc_t(*)(struct pldm_transport*, pldm_tid_t, void const*, size_t)',
      'Param' => {
        '0' => {
          'type' => '555474'
        },
        '1' => {
          'type' => '6303'
        },
        '2' => {
          'type' => '2086'
        },
        '3' => {
          'type' => '883'
        }
      },
      'Return' => '555348',
      'Size' => '8',
      'Type' => 'FuncPtr'
    },
    '555560' => {
      'BaseType' => '555565',
      'Name' => 'struct pollfd*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '555565' => {
      'Header' => 'poll.h',
      'Line' => '36',
      'Memb' => {
        '0' => {
          'name' => 'fd',
          'offset' => '0',
          'type' => '117'
        },
        '1' => {
          'name' => 'events',
          'offset' => '4',
          'type' => '98'
        },
        '2' => {
          'name' => 'revents',
          'offset' => '6',
          'type' => '98'
        }
      },
      'Name' => 'struct pollfd',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Struct'
    },
    '555617' => {
      'Name' => 'int(*)(struct pldm_transport*, struct pollfd*)',
      'Param' => {
        '0' => {
          'type' => '555474'
        },
        '1' => {
          'type' => '555560'
        }
      },
      'Return' => '117',
      'Size' => '8',
      'Type' => 'FuncPtr'
    },
    '555622' => {
      'BaseType' => '58',
      'Header' => 'socket.h',
      'Line' => '10',
      'Name' => '__kernel_sa_family_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '555997' => {
      'Header' => 'mctp.h',
      'Line' => '18',
      'Memb' => {
        '0' => {
          'name' => 's_addr',
          'offset' => '0',
          'type' => '555234'
        }
      },
      'Name' => 'struct mctp_addr',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Struct'
    },
    '556024' => {
      'Header' => 'mctp.h',
      'Line' => '22',
      'Memb' => {
        '0' => {
          'name' => 'smctp_family',
          'offset' => '0',
          'type' => '555622'
        },
        '1' => {
          'name' => '__smctp_pad0',
          'offset' => '2',
          'type' => '554765'
        },
        '2' => {
          'name' => 'smctp_network',
          'offset' => '4',
          'type' => '65'
        },
        '3' => {
          'name' => 'smctp_addr',
          'offset' => '8',
          'type' => '555997'
        },
        '4' => {
          'name' => 'smctp_type',
          'offset' => '9',
          'type' => '554739'
        },
        '5' => {
          'name' => 'smctp_tag',
          'offset' => '16',
          'type' => '554739'
        },
        '6' => {
          'name' => '__smctp_pad1',
          'offset' => '17',
          'type' => '554739'
        }
      },
      'Name' => 'struct sockaddr_mctp',
      'PrivateABI' => 1,
      'Size' => '12',
      'Type' => 'Struct'
    },
    '556129' => {
      'BaseType' => '556024',
      'Name' => 'struct sockaddr_mctp const',
      'Size' => '12',
      'Type' => 'Const'
    },
    '556134' => {
      'Header' => 'mctp.h',
      'Line' => '43',
      'Memb' => {
        '0' => {
          'name' => 'net',
          'offset' => '0',
          'type' => '65'
        },
        '1' => {
          'name' => 'eid',
          'offset' => '4',
          'type' => '555234'
        }
      },
      'Name' => 'struct mctp_fq_addr',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Struct'
    },
    '556174' => {
      'Header' => 'af-mctp-internal.h',
      'Line' => '24',
      'Memb' => {
        '0' => {
          'name' => 'transport',
          'offset' => '0',
          'type' => '555360'
        },
        '1' => {
          'name' => 'socket',
          'offset' => '64',
          'type' => '117'
        },
        '2' => {
          'name' => 'tid_map',
          'offset' => '68',
          'type' => '556267'
        },
        '3' => {
          'name' => 'socket_send_buf',
          'offset' => '8338',
          'type' => '552764'
        },
        '4' => {
          'name' => 'bound',
          'offset' => '8452',
          'type' => '6933'
        },
        '5' => {
          'name' => 'cookie_jar',
          'offset' => '8466',
          'type' => '6327'
        }
      },
      'Name' => 'struct pldm_transport_af_mctp',
      'PrivateABI' => 1,
      'Size' => '2128',
      'Type' => 'Struct'
    },
    '556267' => {
      'BaseType' => '556134',
      'Name' => 'struct mctp_fq_addr[256]',
      'Size' => '2048',
      'Type' => 'Array'
    },
    '557143' => {
      'BaseType' => '556174',
      'Name' => 'struct pldm_transport_af_mctp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '557148' => {
      'BaseType' => '556129',
      'Name' => 'struct sockaddr_mctp const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '557465' => {
      'BaseType' => '557143',
      'Name' => 'struct pldm_transport_af_mctp**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '561031' => {
      'Line' => '27',
      'Memb' => {
        '0' => {
          'name' => 'transport',
          'offset' => '0',
          'type' => '555360'
        },
        '1' => {
          'name' => 'socket',
          'offset' => '64',
          'type' => '117'
        },
        '2' => {
          'name' => 'tid_eid_map',
          'offset' => '68',
          'type' => '561099'
        },
        '3' => {
          'name' => 'socket_send_buf',
          'offset' => '768',
          'type' => '552764'
        }
      },
      'Name' => 'struct pldm_transport_mctp_demux',
      'PrivateABI' => 1,
      'Size' => '312',
      'Source' => 'mctp-demux.c',
      'Type' => 'Struct'
    },
    '561099' => {
      'BaseType' => '6303',
      'Name' => 'pldm_tid_t[256]',
      'Size' => '256',
      'Type' => 'Array'
    },
    '561636' => {
      'BaseType' => '561031',
      'Name' => 'struct pldm_transport_mctp_demux*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '562142' => {
      'BaseType' => '561636',
      'Name' => 'struct pldm_transport_mctp_demux**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '583568' => {
      'Header' => 'file_io.h',
      'Line' => '32',
      'Memb' => {
        '0' => {
          'name' => 'handle',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'length',
          'offset' => '4',
          'type' => '174'
        },
        '2' => {
          'name' => 'data',
          'offset' => '8',
          'type' => '300758'
        }
      },
      'Name' => 'struct pldm_oem_meta_file_io_write_req',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '583635' => {
      'Header' => 'file_io.h',
      'Line' => '45',
      'Memb' => {
        '0' => {
          'name' => 'transferFlag',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'offset',
          'offset' => '2',
          'type' => '162'
        }
      },
      'Name' => 'struct pldm_oem_meta_file_io_read_data_info',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '583674' => {
      'Header' => 'file_io.h',
      'Line' => '55',
      'Memb' => {
        '0' => {
          'name' => 'size',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'crc32',
          'offset' => '4',
          'type' => '174'
        }
      },
      'Name' => 'struct pldm_oem_meta_file_io_read_attr_info',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '583713' => {
      'Header' => 'file_io.h',
      'Line' => '70',
      'Memb' => {
        '0' => {
          'name' => 'data',
          'offset' => '0',
          'type' => '583635'
        }
      },
      'Name' => 'anon-union-file_io.h-70',
      'Size' => '4',
      'Type' => 'Union'
    },
    '583731' => {
      'Header' => 'file_io.h',
      'Line' => '65',
      'Memb' => {
        '0' => {
          'name' => 'version',
          'offset' => '0',
          'type' => '883'
        },
        '1' => {
          'name' => 'handle',
          'offset' => '8',
          'type' => '150'
        },
        '2' => {
          'name' => 'option',
          'offset' => '9',
          'type' => '150'
        },
        '3' => {
          'name' => 'length',
          'offset' => '16',
          'type' => '150'
        },
        '4' => {
          'name' => 'info',
          'offset' => '18',
          'type' => '583713'
        }
      },
      'Name' => 'struct pldm_oem_meta_file_io_read_req',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '583809' => {
      'Header' => 'file_io.h',
      'Line' => '86',
      'Memb' => {
        '0' => {
          'name' => 'attr',
          'offset' => '0',
          'type' => '583674'
        },
        '1' => {
          'name' => 'data',
          'offset' => '0',
          'type' => '583635'
        }
      },
      'Name' => 'anon-union-file_io.h-86',
      'Size' => '8',
      'Type' => 'Union'
    },
    '583837' => {
      'Header' => 'file_io.h',
      'Line' => '80',
      'Memb' => {
        '0' => {
          'name' => 'version',
          'offset' => '0',
          'type' => '883'
        },
        '1' => {
          'name' => 'completion_code',
          'offset' => '8',
          'type' => '150'
        },
        '2' => {
          'name' => 'handle',
          'offset' => '9',
          'type' => '150'
        },
        '3' => {
          'name' => 'option',
          'offset' => '16',
          'type' => '150'
        },
        '4' => {
          'name' => 'length',
          'offset' => '17',
          'type' => '150'
        },
        '5' => {
          'name' => 'info',
          'offset' => '18',
          'type' => '583809'
        },
        '6' => {
          'name' => 'data',
          'offset' => '32',
          'type' => '300758'
        }
      },
      'Name' => 'struct pldm_oem_meta_file_io_read_resp',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '588124' => {
      'BaseType' => '583837',
      'Name' => 'struct pldm_oem_meta_file_io_read_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '591009' => {
      'BaseType' => '583731',
      'Name' => 'struct pldm_oem_meta_file_io_read_req*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '591448' => {
      'BaseType' => '583568',
      'Name' => 'struct pldm_oem_meta_file_io_write_req*',
      'Size' => '8',
      'Type' => 'Pointer'
    }
  },
  'UndefinedSymbols' => {
    'libpldm.so.0.16.0' => {
      '_ITM_deregisterTMCloneTable' => 0,
      '_ITM_registerTMCloneTable' => 0,
      '__assert_fail@GLIBC_2.2.5' => 0,
      '__cxa_finalize@GLIBC_2.2.5' => 0,
      '__errno_location@GLIBC_2.2.5' => 0,
      '__gmon_start__' => 0,
      '__isoc23_strtol@GLIBC_2.38' => 0,
      '__memcpy_chk@GLIBC_2.3.4' => 0,
      '__recv_chk@GLIBC_2.4' => 0,
      '__recvfrom_chk@GLIBC_2.4' => 0,
      '__stack_chk_fail@GLIBC_2.4' => 0,
      'bind@GLIBC_2.2.5' => 0,
      'calloc@GLIBC_2.2.5' => 0,
      'clock_gettime@GLIBC_2.17' => 0,
      'close@GLIBC_2.2.5' => 0,
      'connect@GLIBC_2.2.5' => 0,
      'dup@GLIBC_2.2.5' => 0,
      'fclose@GLIBC_2.2.5' => 0,
      'fcntl64@GLIBC_2.28' => 0,
      'fgets@GLIBC_2.2.5' => 0,
      'fopen64@GLIBC_2.2.5' => 0,
      'free@GLIBC_2.2.5' => 0,
      'getsockopt@GLIBC_2.2.5' => 0,
      'malloc@GLIBC_2.2.5' => 0,
      'memcmp@GLIBC_2.2.5' => 0,
      'memcpy@GLIBC_2.14' => 0,
      'memmem@GLIBC_2.2.5' => 0,
      'open64@GLIBC_2.2.5' => 0,
      'poll@GLIBC_2.2.5' => 0,
      'ppoll@GLIBC_2.4' => 0,
      'recv@GLIBC_2.2.5' => 0,
      'recvmsg@GLIBC_2.2.5' => 0,
      'sendmsg@GLIBC_2.2.5' => 0,
      'sendto@GLIBC_2.2.5' => 0,
      'setsockopt@GLIBC_2.2.5' => 0,
      'socket@GLIBC_2.2.5' => 0,
      'stat64@GLIBC_2.33' => 0,
      'strlen@GLIBC_2.2.5' => 0,
      'strnlen@GLIBC_2.2.5' => 0,
      'timerfd_create@GLIBC_2.8' => 0,
      'timerfd_settime@GLIBC_2.8' => 0,
      'write@GLIBC_2.2.5' => 0
    }
  },
  'WordSize' => '8'
};
