$VAR1 = {
          'ABI_DUMPER_VERSION' => '1.2',
          'ABI_DUMP_VERSION' => '3.5',
          'Arch' => 'x86_64',
          'GccVersion' => '13.2.0',
          'Headers' => {
                         'af-mctp.h' => 1,
                         'base.h' => 1,
                         'bios.h' => 1,
                         'bios_table.h' => 1,
                         'file_io.h' => 1,
                         'firmware_update.h' => 1,
                         'fru.h' => 1,
                         'host.h' => 1,
                         'instance-id.h' => 1,
                         'mctp-demux.h' => 1,
                         'pdr.h' => 1,
                         'platform.h' => 1,
                         'pldm.h' => 1,
                         'pldm_types.h' => 1,
                         'transport.h' => 1,
                         'utils.h' => 1
                       },
          'Language' => 'C',
          'LibraryName' => 'libpldm.so.0.7.0',
          'LibraryVersion' => '0.7.0',
          'NameSpaces' => {},
          'Needed' => {
                        'libc.so.6' => 1
                      },
          'PublicABI' => '1',
          'Sources' => {
                         'af-mctp.c' => 1,
                         'bios_table.c' => 1,
                         'instance-id.c' => 1,
                         'mctp-demux.c' => 1,
                         'pdr.c' => 1
                       },
          'SymbolInfo' => {
                            '1434' => {

                                                 'pldm_pdr_find_record' => 1,
                                                 'pldm_pdr_find_record_by_type' => 1,
                                                 'pldm_pdr_fru_record_set_find_by_rsi' => 1,
                                                 'pldm_pdr_get_next_record' => 1,
                                                 'pldm_pdr_get_record_count' => 1,
                                                 'pldm_pdr_get_record_handle' => 1,
                                                 'pldm_pdr_get_repo_size' => 1,
                                                 'pldm_pdr_init' => 1,
                                                 'pldm_pdr_record_is_remote' => 1,
                                                 'pldm_pdr_remove_pdrs_by_terminus_handle' => 1,
                                                 'pldm_pdr_remove_remote_pdrs' => 1,
                                                 'pldm_pdr_update_TL_pdr' => 1,
                                                 'pldm_recv' => 1,
                                                 'pldm_recv_any' => 1,
                                                 'pldm_send' => 1,
                                                 'pldm_send_recv' => 1,
                                                 'pldm_transport_af_mctp_bind' => 1,
                                                 'pldm_transport_af_mctp_core' => 1,
                                                 'pldm_transport_af_mctp_destroy' => 1,
                                                 'pldm_transport_af_mctp_init' => 1,
                                                 'pldm_transport_af_mctp_init_pollfd' => 1,
                                                 'pldm_transport_af_mctp_map_tid' => 1,
                                                 'pldm_transport_af_mctp_unmap_tid' => 1,
                                                 'pldm_transport_mctp_demux_core' => 1,
                                                 'pldm_transport_mctp_demux_destroy' => 1,
                                                 'pldm_transport_mctp_demux_init' => 1,
                                                 'pldm_transport_mctp_demux_init_pollfd' => 1,
                                                 'pldm_transport_mctp_demux_map_tid' => 1,
                                                 'pldm_transport_mctp_demux_unmap_tid' => 1,
                                                 'pldm_transport_poll' => 1,
                                                 'pldm_transport_recv_msg' => 1,
                                                 'pldm_transport_send_msg' => 1,
                                                 'pldm_transport_send_recv_msg' => 1,
                                                 'unpack_pldm_header' => 1,
                                                 'ver2str' => 1
                                               }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '46' => {
                                    'Name' => 'signed char',
                                    'Size' => '1',
                                    'Type' => 'Intrinsic'
                                  },
                          '53' => {
                                    'Name' => 'unsigned char',
                                    'Size' => '1',
                                    'Type' => 'Intrinsic'
                                  },
                          '60' => {
                                    'Name' => 'short',
                                    'Size' => '2',
                                    'Type' => 'Intrinsic'
                                  },
                          '67' => {
                                    'Name' => 'unsigned short',
                                    'Size' => '2',
                                    'Type' => 'Intrinsic'
                                  },
                          '74' => {
                                    'Name' => 'int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  },
                          '81' => {
                                    'Name' => 'unsigned int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  },
                          '102' => {
                                     'Name' => 'unsigned long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '109' => {
                                     'Name' => 'long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '116' => {
                                     'Name' => 'char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '137' => {
                                     'BaseType' => '102',
                                     'Header' => 'stddef.h',
                                     'Line' => '214',
                                     'Name' => 'size_t',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '156' => {
                                     'BaseType' => '53',
                                     'Header' => 'types.h',
                                     'Line' => '38',
                                     'Name' => '__uint8_t',
                                     'PrivateABI' => 1,
                                     'Size' => '1',
                                     'Type' => 'Typedef'
                                   },
                          '168' => {
                                     'BaseType' => '81',
                                     'Header' => 'types.h',
                                     'Line' => '42',
                                     'Name' => '__uint32_t',
                                     'PrivateABI' => 1,
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '180' => {
                                     'BaseType' => '1',
                                     'Name' => 'void*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '187' => {
                                     'BaseType' => '156',
                                     'Header' => 'stdint-uintn.h',
                                     'Line' => '24',
                                     'Name' => 'uint8_t',
                                     'PrivateABI' => 1,
                                     'Size' => '1',
                                     'Type' => 'Typedef'
                                   },
                          '199' => {
                                     'BaseType' => '168',
                                     'Header' => 'stdint-uintn.h',
                                     'Line' => '26',
                                     'Name' => 'uint32_t',
                                     'PrivateABI' => 1,
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '211' => {
                                     'Header' => 'pldm_types.h',
                                     'Line' => '9',
                                     'Name' => 'anon-struct-pldm_types.h-9',
                                     'Size' => '1',
                                     'Type' => 'Struct'
                                   },
                          '365' => {
                                     'Header' => 'pldm_types.h',
                                     'Line' => '19',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'byte',
                                                          'offset' => '0',
                                                          'type' => '187'
                                                        },
                                                 '1' => {
                                                          'name' => 'bits',
                                                          'offset' => '0',
                                                          'type' => '211'
                                                        }
                                               },
                                     'Name' => 'union bitfield8_t',
                                     'Size' => '1',
                                     'Type' => 'Union'
                                   },
                          '377' => {
                                     'BaseType' => '365',
                                     'Name' => 'bitfield8_t const',
                                     'Size' => '1',
                                     'Type' => 'Const'
                                   },
                          '382' => {
                                     'Header' => 'pldm_types.h',
                                     'Line' => '25',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'alpha',
                                                          'offset' => '0',
                                                          'type' => '187'
                                                        },
                                                 '1' => {
                                                          'name' => 'update',
                                                          'offset' => '1',
                                                          'type' => '187'
                                                        },
                                                 '2' => {
                                                          'name' => 'minor',
                                                          'offset' => '2',
                                                          'type' => '187'
                                                        },
                                                 '3' => {
                                                          'name' => 'major',
                                                          'offset' => '3',
                                                          'type' => '187'
                                                        }
                                               },
                                     'Name' => 'struct pldm_version',
                                     'Size' => '4',
                                     'Type' => 'Struct'
                                   },
                          '448' => {
                                     'BaseType' => '382',
                                     'Header' => 'pldm_types.h',
                                     'Line' => '30',
                                     'Name' => 'ver32_t',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '460' => {
                                     'BaseType' => '448',
                                     'Name' => 'ver32_t const',
                                     'Size' => '4',
                                     'Type' => 'Const'
                                   },
                          '465' => {
                                     'Name' => 'float',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '733' => {
                                     'Header' => 'base.h',
                                     'Line' => '92',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'PLDM_RESPONSE',
                                                          'value' => '0'
                                                        },
                                                 '1' => {
                                                          'name' => 'PLDM_REQUEST',
                                                          'value' => '1'
                                                        },
                                                 '2' => {
                                                          'name' => 'PLDM_RESERVED',
                                                          'value' => '2'
                                                        },
                                                 '3' => {
                                                          'name' => 'PLDM_ASYNC_REQUEST_NOTIFY',
                                                          'value' => '3'
                                                        }
                                               },
                                     'Name' => 'enum MessageType',
                                     'Size' => '4',
                                     'Type' => 'Enum'
                                   },
                          '745' => {
                                     'Header' => 'base.h',
                                     'Line' => '121',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'command',
                                                          'offset' => '2',
                                                          'type' => '187'
                                                        }
                                               },
                                     'Name' => 'struct pldm_msg_hdr',
                                     'Size' => '3',
                                     'Type' => 'Struct'
                                   },
                          '856' => {
                                     'BaseType' => '745',
                                     'Name' => 'struct pldm_msg_hdr const',
                                     'Size' => '3',
                                     'Type' => 'Const'
                                   },
                          '861' => {
                                     'Header' => 'base.h',
                                     'Line' => '154',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'hdr',
                                                          'offset' => '0',
                                                          'type' => '745'
                                                        },
                                                 '1' => {
                                                          'name' => 'payload',
                                                          'offset' => '3',
                                                          'type' => '904'
                                                        }
                                               },
                                     'Name' => 'struct pldm_msg',
                                     'Size' => '4',
                                     'Type' => 'Struct'
                                   },
                          '899' => {
                                     'BaseType' => '861',
                                     'Name' => 'struct pldm_msg const',
                                     'Size' => '4',
                                     'Type' => 'Const'
                                   },
                          '904' => {
                                     'BaseType' => '187',
                                     'Name' => 'uint8_t[1]',
                                     'Size' => '1',
                                     'Type' => 'Array'
                                   },
                          '920' => {
                                     'Header' => 'base.h',
                                     'Line' => '180',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'msg_type',
                                                          'offset' => '0',
                                                          'type' => '733'
                                                        },
                                                 '1' => {
                                                          'name' => 'instance',
                                                          'offset' => '4',
                                                          'type' => '187'
                                                        },
                                                 '2' => {
                                                          'name' => 'pldm_type',
                                                          'offset' => '5',
                                                          'type' => '187'
                                                        },
                                                 '3' => {
                                                          'name' => 'command',
                                                          'offset' => '6',
                                                          'type' => '187'
                                                        },
                                                 '4' => {
                                                          'name' => 'completion_code',
                                                          'offset' => '7',
                                                          'type' => '187'
                                                        }
                                               },
                                     'Name' => 'struct pldm_header_info',
                                     'Size' => '8',
                                     'Type' => 'Struct'
                                   },
                          '999' => {
                                     'BaseType' => '920',
                                     'Name' => 'struct pldm_header_info const',
                                     'Size' => '8',
                                     'Type' => 'Const'
                                   },
                          '1627' => {
                                      'BaseType' => '861',
                                      'Name' => 'struct pldm_msg*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2074' => {
                                      'BaseType' => '899',
                                      'Name' => 'struct pldm_msg const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2079' => {
                                      'BaseType' => '187',
                                      'Name' => 'uint8_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2084' => {
                                      'BaseType' => '199',
                                      'Name' => 'uint32_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2979' => {
                                      'BaseType' => '448',
                                      'Name' => 'ver32_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '3484' => {
                                      'BaseType' => '460',
                                      'Name' => 'ver32_t const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '3892' => {
                                      'BaseType' => '365',
                                      'Name' => 'bitfield8_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4350' => {
                                      'BaseType' => '377',
                                      'Name' => 'bitfield8_t const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '5126' => {
                                      'Name' => '_Bool',
                                      'Size' => '1',
                                      'Type' => 'Intrinsic'
                                    },
                          '5133' => {
                                      'BaseType' => '856',
                                      'Name' => 'struct pldm_msg_hdr const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '5199' => {
                                      'BaseType' => '920',
                                      'Name' => 'struct pldm_header_info*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '5290' => {
                                      'BaseType' => '999',
                                      'Name' => 'struct pldm_header_info const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '5295' => {
                                      'BaseType' => '745',
                                      'Name' => 'struct pldm_msg_hdr*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '5345' => {
                                      'BaseType' => '5355',
                                      'Name' => 'void const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '5355' => {
                                      'BaseType' => '1',
                                      'Name' => 'void const',
                                      'Type' => 'Const'
                                    },
                          '5575' => {
                                      'BaseType' => '67',
                                      'Header' => 'types.h',
                                      'Line' => '40',
                                      'Name' => '__uint16_t',
                                      'PrivateABI' => 1,
                                      'Size' => '2',
                                      'Type' => 'Typedef'
                                    },
                          '5618' => {
                                      'BaseType' => '187',
                                      'Name' => 'uint8_t const',
                                      'Size' => '1',
                                      'Type' => 'Const'
                                    },
                          '5623' => {
                                      'BaseType' => '5575',
                                      'Header' => 'stdint-uintn.h',
                                      'Line' => '25',
                                      'Name' => 'uint16_t',
                                      'PrivateABI' => 1,
                                      'Size' => '2',
                                      'Type' => 'Typedef'
                                    },
                          '6781' => {
                                      'Header' => 'utils.h',
                                      'Line' => '19',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ptr',
                                                           'offset' => '0',
                                                           'type' => '6820'
                                                         },
                                                  '1' => {
                                                           'name' => 'length',
                                                           'offset' => '8',
                                                           'type' => '137'
                                                         }
                                                },
                                      'Name' => 'struct variable_field',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '6820' => {
                                      'BaseType' => '5618',
                                      'Name' => 'uint8_t const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7177' => {
                                      'BaseType' => '6781',
                                      'Name' => 'struct variable_field*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '9259' => {
                                      'BaseType' => '5623',
                                      'Name' => 'uint16_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '9822' => {
                                      'BaseType' => '137',
                                      'Name' => 'size_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '12476' => {
                                       'BaseType' => '116',
                                       'Name' => 'char*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '12493' => {
                                       'BaseType' => '116',
                                       'Name' => 'char const',
                                       'Size' => '1',
                                       'Type' => 'Const'
                                     },
                          '12524' => {
                                       'BaseType' => '137',
                                       'Name' => 'size_t const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '12536' => {
                                       'BaseType' => '46',
                                       'Header' => 'types.h',
                                       'Line' => '37',
                                       'Name' => '__int8_t',
                                       'PrivateABI' => 1,
                                       'Size' => '1',
                                       'Type' => 'Typedef'
                                     },
                          '12560' => {
                                       'BaseType' => '60',
                                       'Header' => 'types.h',
                                       'Line' => '39',
                                       'Name' => '__int16_t',
                                       'PrivateABI' => 1,
                                       'Size' => '2',
                                       'Type' => 'Typedef'
                                     },
                          '12584' => {
                                       'BaseType' => '74',
                                       'Header' => 'types.h',
                                       'Line' => '41',
                                       'Name' => '__int32_t',
                                       'PrivateABI' => 1,
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '12615' => {
                                       'BaseType' => '109',
                                       'Header' => 'types.h',
                                       'Line' => '194',
                                       'Name' => '__ssize_t',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '12627' => {
                                       'BaseType' => '12536',
                                       'Header' => 'stdint-intn.h',
                                       'Line' => '24',
                                       'Name' => 'int8_t',
                                       'PrivateABI' => 1,
                                       'Size' => '1',
                                       'Type' => 'Typedef'
                                     },
                          '12639' => {
                                       'BaseType' => '12560',
                                       'Header' => 'stdint-intn.h',
                                       'Line' => '25',
                                       'Name' => 'int16_t',
                                       'PrivateABI' => 1,
                                       'Size' => '2',
                                       'Type' => 'Typedef'
                                     },
                          '12651' => {
                                       'BaseType' => '12584',
                                       'Header' => 'stdint-intn.h',
                                       'Line' => '26',
                                       'Name' => 'int32_t',
                                       'PrivateABI' => 1,
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '12692' => {
                                       'BaseType' => '5623',
                                       'Name' => 'uint16_t const',
                                       'Size' => '2',
                                       'Type' => 'Const'
                                     },
                          '12709' => {
                                       'BaseType' => '199',
                                       'Name' => 'uint32_t const',
                                       'Size' => '4',
                                       'Type' => 'Const'
                                     },
                          '12880' => {
                                       'BaseType' => '187',
                                       'Header' => 'pldm_types.h',
                                       'Line' => '32',
                                       'Name' => 'bool8_t',
                                       'Size' => '1',
                                       'Type' => 'Typedef'
                                     },
                          '12892' => {
                                       'BaseType' => '465',
                                       'Header' => 'pldm_types.h',
                                       'Line' => '164',
                                       'Name' => 'real32_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '13445' => {
                                       'BaseType' => '12493',
                                       'Name' => 'char const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '13450' => {
                                       'BaseType' => '12615',
                                       'Header' => 'types.h',
                                       'Line' => '108',
                                       'Name' => 'ssize_t',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '13986' => {
                                       'Header' => 'platform.h',
                                       'Line' => '238',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'PLDM_SENSOR_OP_STATE',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'PLDM_STATE_SENSOR_STATE',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'PLDM_NUMERIC_SENSOR_STATE',
                                                            'value' => '2'
                                                          }
                                                 },
                                       'Name' => 'enum sensor_event_class_states',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '14020' => {
                                       'BaseType' => '13986',
                                       'Name' => 'enum sensor_event_class_states const',
                                       'Size' => '4',
                                       'Type' => 'Const'
                                     },
                          '14243' => {
                                       'Header' => 'platform.h',
                                       'Line' => '455',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'record_handle',
                                                            'offset' => '0',
                                                            'type' => '199'
                                                          },
                                                   '1' => {
                                                            'name' => 'version',
                                                            'offset' => '4',
                                                            'type' => '187'
                                                          },
                                                   '2' => {
                                                            'name' => 'type',
                                                            'offset' => '5',
                                                            'type' => '187'
                                                          },
                                                   '3' => {
                                                            'name' => 'record_change_num',
                                                            'offset' => '6',
                                                            'type' => '5623'
                                                          },
                                                   '4' => {
                                                            'name' => 'length',
                                                            'offset' => '8',
                                                            'type' => '5623'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_pdr_hdr',
                                       'Size' => '10',
                                       'Type' => 'Struct'
                                     },
                          '14322' => {
                                       'Header' => 'platform.h',
                                       'Line' => '530',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '14243'
                                                          },
                                                   '1' => {
                                                            'name' => 'terminus_handle',
                                                            'offset' => '16',
                                                            'type' => '5623'
                                                          },
                                                   '2' => {
                                                            'name' => 'sensor_id',
                                                            'offset' => '18',
                                                            'type' => '5623'
                                                          },
                                                   '3' => {
                                                            'name' => 'entity_type',
                                                            'offset' => '20',
                                                            'type' => '5623'
                                                          },
                                                   '4' => {
                                                            'name' => 'entity_instance',
                                                            'offset' => '22',
                                                            'type' => '5623'
                                                          },
                                                   '5' => {
                                                            'name' => 'container_id',
                                                            'offset' => '24',
                                                            'type' => '5623'
                                                          },
                                                   '6' => {
                                                            'name' => 'sensor_init',
                                                            'offset' => '32',
                                                            'type' => '187'
                                                          },
                                                   '7' => {
                                                            'name' => 'sensor_auxiliary_names_pdr',
                                                            'offset' => '33',
                                                            'type' => '12880'
                                                          },
                                                   '8' => {
                                                            'name' => 'composite_sensor_count',
                                                            'offset' => '34',
                                                            'type' => '187'
                                                          },
                                                   '9' => {
                                                            'name' => 'possible_states',
                                                            'offset' => '35',
                                                            'type' => '904'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_state_sensor_pdr',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '14466' => {
                                       'Header' => 'platform.h',
                                       'Line' => '547',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'state_set_id',
                                                            'offset' => '0',
                                                            'type' => '5623'
                                                          },
                                                   '1' => {
                                                            'name' => 'possible_states_size',
                                                            'offset' => '2',
                                                            'type' => '187'
                                                          },
                                                   '2' => {
                                                            'name' => 'states',
                                                            'offset' => '3',
                                                            'type' => '14524'
                                                          }
                                                 },
                                       'Name' => 'struct state_sensor_possible_states',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '14519' => {
                                       'BaseType' => '14466',
                                       'Name' => 'struct state_sensor_possible_states const',
                                       'Size' => '4',
                                       'Type' => 'Const'
                                     },
                          '14524' => {
                                       'BaseType' => '365',
                                       'Name' => 'bitfield8_t[1]',
                                       'Size' => '1',
                                       'Type' => 'Array'
                                     },
                          '14540' => {
                                       'Header' => 'platform.h',
                                       'Line' => '557',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '14243'
                                                          },
                                                   '1' => {
                                                            'name' => 'terminus_handle',
                                                            'offset' => '16',
                                                            'type' => '5623'
                                                          },
                                                   '2' => {
                                                            'name' => 'effecter_id',
                                                            'offset' => '18',
                                                            'type' => '5623'
                                                          },
                                                   '3' => {
                                                            'name' => 'entity_type',
                                                            'offset' => '20',
                                                            'type' => '5623'
                                                          },
                                                   '4' => {
                                                            'name' => 'entity_instance',
                                                            'offset' => '22',
                                                            'type' => '5623'
                                                          },
                                                   '5' => {
                                                            'name' => 'container_id',
                                                            'offset' => '24',
                                                            'type' => '5623'
                                                          },
                                                   '6' => {
                                                            'name' => 'effecter_semantic_id',
                                                            'offset' => '32',
                                                            'type' => '5623'
                                                          },
                                                   '7' => {
                                                            'name' => 'effecter_init',
                                                            'offset' => '34',
                                                            'type' => '187'
                                                          },
                                                   '8' => {
                                                            'name' => 'has_description_pdr',
                                                            'offset' => '35',
                                                            'type' => '12880'
                                                          },
                                                   '9' => {
                                                            'name' => 'composite_effecter_count',
                                                            'offset' => '36',
                                                            'type' => '187'
                                                          },
                                                   '10' => {
                                                             'name' => 'possible_states',
                                                             'offset' => '37',
                                                             'type' => '904'
                                                           }
                                                 },
                                       'Name' => 'struct pldm_state_effecter_pdr',
                                       'Size' => '26',
                                       'Type' => 'Struct'
                                     },
                          '14791' => {
                                       'Header' => 'platform.h',
                                       'Line' => '648',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'value_u8',
                                                            'offset' => '0',
                                                            'type' => '187'
                                                          },
                                                   '1' => {
                                                            'name' => 'value_s8',
                                                            'offset' => '0',
                                                            'type' => '12627'
                                                          },
                                                   '2' => {
                                                            'name' => 'value_u16',
                                                            'offset' => '0',
                                                            'type' => '5623'
                                                          },
                                                   '3' => {
                                                            'name' => 'value_s16',
                                                            'offset' => '0',
                                                            'type' => '12639'
                                                          },
                                                   '4' => {
                                                            'name' => 'value_u32',
                                                            'offset' => '0',
                                                            'type' => '199'
                                                          },
                                                   '5' => {
                                                            'name' => 'value_s32',
                                                            'offset' => '0',
                                                            'type' => '12651'
                                                          },
                                                   '6' => {
                                                            'name' => 'value_f32',
                                                            'offset' => '0',
                                                            'type' => '12892'
                                                          }
                                                 },
                                       'Name' => 'union union_range_field_format',
                                       'Size' => '4',
                                       'Type' => 'Union'
                                     },
                          '14885' => {
                                       'Header' => 'platform.h',
                                       'Line' => '705',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'value_u8',
                                                            'offset' => '0',
                                                            'type' => '187'
                                                          },
                                                   '1' => {
                                                            'name' => 'value_s8',
                                                            'offset' => '0',
                                                            'type' => '12627'
                                                          },
                                                   '2' => {
                                                            'name' => 'value_u16',
                                                            'offset' => '0',
                                                            'type' => '5623'
                                                          },
                                                   '3' => {
                                                            'name' => 'value_s16',
                                                            'offset' => '0',
                                                            'type' => '12639'
                                                          },
                                                   '4' => {
                                                            'name' => 'value_u32',
                                                            'offset' => '0',
                                                            'type' => '199'
                                                          },
                                                   '5' => {
                                                            'name' => 'value_s32',
                                                            'offset' => '0',
                                                            'type' => '12651'
                                                          }
                                                 },
                                       'Name' => 'union union_sensor_data_size',
                                       'Size' => '4',
                                       'Type' => 'Union'
                                     },
                          '14897' => {
                                       'Header' => 'platform.h',
                                       'Line' => '712',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'record_handle',
                                                            'offset' => '0',
                                                            'type' => '199'
                                                          },
                                                   '1' => {
                                                            'name' => 'version',
                                                            'offset' => '4',
                                                            'type' => '187'
                                                          },
                                                   '2' => {
                                                            'name' => 'type',
                                                            'offset' => '5',
                                                            'type' => '187'
                                                          },
                                                   '3' => {
                                                            'name' => 'record_change_num',
                                                            'offset' => '6',
                                                            'type' => '5623'
                                                          },
                                                   '4' => {
                                                            'name' => 'length',
                                                            'offset' => '8',
                                                            'type' => '5623'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_value_pdr_hdr',
                                       'Size' => '12',
                                       'Type' => 'Struct'
                                     },
                          '14976' => {
                                       'Header' => 'platform.h',
                                       'Line' => '730',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'entity_instance_num',
                                                            'offset' => '0',
                                                            'type' => '5623'
                                                          },
                                                   '1' => {
                                                            'name' => 'entity_instance',
                                                            'offset' => '0',
                                                            'type' => '5623'
                                                          }
                                                 },
                                       'Name' => 'anon-union-platform.h-730',
                                       'Size' => '2',
                                       'Type' => 'Union'
                                     },
                          '15010' => {
                                       'Header' => 'platform.h',
                                       'Line' => '725',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '14897'
                                                          },
                                                   '1' => {
                                                            'name' => 'terminus_handle',
                                                            'offset' => '18',
                                                            'type' => '5623'
                                                          },
                                                   '2' => {
                                                            'name' => 'sensor_id',
                                                            'offset' => '20',
                                                            'type' => '5623'
                                                          },
                                                   '3' => {
                                                            'name' => 'entity_type',
                                                            'offset' => '22',
                                                            'type' => '5623'
                                                          },
                                                   '4' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '24',
                                                            'type' => '14976'
                                                          },
                                                   '5' => {
                                                            'name' => 'container_id',
                                                            'offset' => '32',
                                                            'type' => '5623'
                                                          },
                                                   '6' => {
                                                            'name' => 'sensor_init',
                                                            'offset' => '34',
                                                            'type' => '187'
                                                          },
                                                   '7' => {
                                                            'name' => 'sensor_auxiliary_names_pdr',
                                                            'offset' => '35',
                                                            'type' => '12880'
                                                          },
                                                   '8' => {
                                                            'name' => 'base_unit',
                                                            'offset' => '36',
                                                            'type' => '187'
                                                          },
                                                   '9' => {
                                                            'name' => 'unit_modifier',
                                                            'offset' => '37',
                                                            'type' => '12627'
                                                          },
                                                   '10' => {
                                                             'name' => 'rate_unit',
                                                             'offset' => '38',
                                                             'type' => '187'
                                                           },
                                                   '11' => {
                                                             'name' => 'base_oem_unit_handle',
                                                             'offset' => '39',
                                                             'type' => '187'
                                                           },
                                                   '12' => {
                                                             'name' => 'aux_unit',
                                                             'offset' => '40',
                                                             'type' => '187'
                                                           },
                                                   '13' => {
                                                             'name' => 'aux_unit_modifier',
                                                             'offset' => '41',
                                                             'type' => '12627'
                                                           },
                                                   '14' => {
                                                             'name' => 'aux_rate_unit',
                                                             'offset' => '48',
                                                             'type' => '187'
                                                           },
                                                   '15' => {
                                                             'name' => 'rel',
                                                             'offset' => '49',
                                                             'type' => '187'
                                                           },
                                                   '16' => {
                                                             'name' => 'aux_oem_unit_handle',
                                                             'offset' => '50',
                                                             'type' => '187'
                                                           },
                                                   '17' => {
                                                             'name' => 'is_linear',
                                                             'offset' => '51',
                                                             'type' => '12880'
                                                           },
                                                   '18' => {
                                                             'name' => 'sensor_data_size',
                                                             'offset' => '52',
                                                             'type' => '187'
                                                           },
                                                   '19' => {
                                                             'name' => 'resolution',
                                                             'offset' => '54',
                                                             'type' => '12892'
                                                           },
                                                   '20' => {
                                                             'name' => 'offset',
                                                             'offset' => '64',
                                                             'type' => '12892'
                                                           },
                                                   '21' => {
                                                             'name' => 'accuracy',
                                                             'offset' => '68',
                                                             'type' => '5623'
                                                           },
                                                   '22' => {
                                                             'name' => 'plus_tolerance',
                                                             'offset' => '70',
                                                             'type' => '187'
                                                           },
                                                   '23' => {
                                                             'name' => 'minus_tolerance',
                                                             'offset' => '71',
                                                             'type' => '187'
                                                           },
                                                   '24' => {
                                                             'name' => 'hysteresis',
                                                             'offset' => '72',
                                                             'type' => '14885'
                                                           },
                                                   '25' => {
                                                             'name' => 'supported_thresholds',
                                                             'offset' => '82',
                                                             'type' => '365'
                                                           },
                                                   '26' => {
                                                             'name' => 'threshold_and_hysteresis_volatility',
                                                             'offset' => '83',
                                                             'type' => '365'
                                                           },
                                                   '27' => {
                                                             'name' => 'state_transition_interval',
                                                             'offset' => '86',
                                                             'type' => '12892'
                                                           },
                                                   '28' => {
                                                             'name' => 'update_interval',
                                                             'offset' => '96',
                                                             'type' => '12892'
                                                           },
                                                   '29' => {
                                                             'name' => 'max_readable',
                                                             'offset' => '100',
                                                             'type' => '14885'
                                                           },
                                                   '30' => {
                                                             'name' => 'min_readable',
                                                             'offset' => '104',
                                                             'type' => '14885'
                                                           },
                                                   '31' => {
                                                             'name' => 'range_field_format',
                                                             'offset' => '114',
                                                             'type' => '187'
                                                           },
                                                   '32' => {
                                                             'name' => 'range_field_support',
                                                             'offset' => '115',
                                                             'type' => '365'
                                                           },
                                                   '33' => {
                                                             'name' => 'nominal_value',
                                                             'offset' => '118',
                                                             'type' => '14791'
                                                           },
                                                   '34' => {
                                                             'name' => 'normal_max',
                                                             'offset' => '128',
                                                             'type' => '14791'
                                                           },
                                                   '35' => {
                                                             'name' => 'normal_min',
                                                             'offset' => '132',
                                                             'type' => '14791'
                                                           },
                                                   '36' => {
                                                             'name' => 'warning_high',
                                                             'offset' => '136',
                                                             'type' => '14791'
                                                           },
                                                   '37' => {
                                                             'name' => 'warning_low',
                                                             'offset' => '146',
                                                             'type' => '14791'
                                                           },
                                                   '38' => {
                                                             'name' => 'critical_high',
                                                             'offset' => '150',
                                                             'type' => '14791'
                                                           },
                                                   '39' => {
                                                             'name' => 'critical_low',
                                                             'offset' => '256',
                                                             'type' => '14791'
                                                           },
                                                   '40' => {
                                                             'name' => 'fatal_high',
                                                             'offset' => '260',
                                                             'type' => '14791'
                                                           },
                                                   '41' => {
                                                             'name' => 'fatal_low',
                                                             'offset' => '264',
                                                             'type' => '14791'
                                                           }
                                                 },
                                       'Name' => 'struct pldm_numeric_sensor_value_pdr',
                                       'Size' => '112',
                                       'Type' => 'Struct'
                                     },
                          '15563' => {
                                       'Header' => 'platform.h',
                                       'Line' => '777',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'state_set_id',
                                                            'offset' => '0',
                                                            'type' => '5623'
                                                          },
                                                   '1' => {
                                                            'name' => 'possible_states_size',
                                                            'offset' => '2',
                                                            'type' => '187'
                                                          },
                                                   '2' => {
                                                            'name' => 'states',
                                                            'offset' => '3',
                                                            'type' => '14524'
                                                          }
                                                 },
                                       'Name' => 'struct state_effecter_possible_states',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '15616' => {
                                       'BaseType' => '15563',
                                       'Name' => 'struct state_effecter_possible_states const',
                                       'Size' => '4',
                                       'Type' => 'Const'
                                     },
                          '15621' => {
                                       'Header' => 'platform.h',
                                       'Line' => '825',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'set_request',
                                                            'offset' => '0',
                                                            'type' => '187'
                                                          },
                                                   '1' => {
                                                            'name' => 'effecter_state',
                                                            'offset' => '1',
                                                            'type' => '187'
                                                          }
                                                 },
                                       'Name' => 'struct state_field_for_state_effecter_set',
                                       'Size' => '2',
                                       'Type' => 'Struct'
                                     },
                          '15661' => {
                                       'BaseType' => '15621',
                                       'Header' => 'platform.h',
                                       'Line' => '828',
                                       'Name' => 'set_effecter_state_field',
                                       'Size' => '2',
                                       'Type' => 'Typedef'
                                     },
                          '15673' => {
                                       'Header' => 'platform.h',
                                       'Line' => '834',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'sensor_op_state',
                                                            'offset' => '0',
                                                            'type' => '187'
                                                          },
                                                   '1' => {
                                                            'name' => 'present_state',
                                                            'offset' => '1',
                                                            'type' => '187'
                                                          },
                                                   '2' => {
                                                            'name' => 'previous_state',
                                                            'offset' => '2',
                                                            'type' => '187'
                                                          },
                                                   '3' => {
                                                            'name' => 'event_state',
                                                            'offset' => '3',
                                                            'type' => '187'
                                                          }
                                                 },
                                       'Name' => 'struct state_field_for_get_state_sensor_readings',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '15739' => {
                                       'BaseType' => '15673',
                                       'Header' => 'platform.h',
                                       'Line' => '842',
                                       'Name' => 'get_sensor_state_field',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '15938' => {
                                       'BaseType' => '187',
                                       'Name' => 'uint8_t[13]',
                                       'Size' => '13',
                                       'Type' => 'Array'
                                     },
                          '16420' => {
                                       'Header' => 'platform.h',
                                       'Line' => '979',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'sensor_id',
                                                            'offset' => '0',
                                                            'type' => '5623'
                                                          },
                                                   '1' => {
                                                            'name' => 'sensor_event_class_type',
                                                            'offset' => '2',
                                                            'type' => '187'
                                                          },
                                                   '2' => {
                                                            'name' => 'event_class',
                                                            'offset' => '3',
                                                            'type' => '904'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_sensor_event_data',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '16632' => {
                                       'Header' => 'platform.h',
                                       'Line' => '1060',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'event_data_format',
                                                            'offset' => '0',
                                                            'type' => '187'
                                                          },
                                                   '1' => {
                                                            'name' => 'number_of_change_records',
                                                            'offset' => '1',
                                                            'type' => '187'
                                                          },
                                                   '2' => {
                                                            'name' => 'change_records',
                                                            'offset' => '2',
                                                            'type' => '904'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_pdr_repository_chg_event_data',
                                       'Size' => '3',
                                       'Type' => 'Struct'
                                     },
                          '17831' => {
                                       'BaseType' => '180',
                                       'Name' => 'void**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '22154' => {
                                       'BaseType' => '9822',
                                       'Name' => 'size_t*const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '23780' => {
                                       'BaseType' => '23790',
                                       'Name' => 'uint32_t const*const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '23785' => {
                                       'BaseType' => '12709',
                                       'Name' => 'uint32_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '23790' => {
                                       'BaseType' => '23785',
                                       'Name' => 'uint32_t const*const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '23795' => {
                                       'BaseType' => '16632',
                                       'Name' => 'struct pldm_pdr_repository_chg_event_data*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '30510' => {
                                       'BaseType' => '15010',
                                       'Name' => 'struct pldm_numeric_sensor_value_pdr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '37173' => {
                                       'BaseType' => '16420',
                                       'Name' => 'struct pldm_sensor_event_data*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '37178' => {
                                       'BaseType' => '37173',
                                       'Name' => 'struct pldm_sensor_event_data*const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '38184' => {
                                       'BaseType' => '15739',
                                       'Name' => 'get_sensor_state_field*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '43804' => {
                                       'BaseType' => '15661',
                                       'Name' => 'set_effecter_state_field*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '44787' => {
                                       'BaseType' => '14322',
                                       'Name' => 'struct pldm_state_sensor_pdr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '44792' => {
                                       'BaseType' => '44787',
                                       'Name' => 'struct pldm_state_sensor_pdr*const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '44797' => {
                                       'BaseType' => '14519',
                                       'Name' => 'struct state_sensor_possible_states const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '44802' => {
                                       'BaseType' => '44797',
                                       'Name' => 'struct state_sensor_possible_states const*const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '45199' => {
                                       'BaseType' => '14540',
                                       'Name' => 'struct pldm_state_effecter_pdr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '45204' => {
                                       'BaseType' => '45199',
                                       'Name' => 'struct pldm_state_effecter_pdr*const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '45209' => {
                                       'BaseType' => '15616',
                                       'Name' => 'struct state_effecter_possible_states const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '45214' => {
                                       'BaseType' => '45209',
                                       'Name' => 'struct state_effecter_possible_states const*const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '49704' => {
                                       'BaseType' => '102',
                                       'Header' => 'types.h',
                                       'Line' => '45',
                                       'Name' => '__uint64_t',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '49781' => {
                                       'BaseType' => '49704',
                                       'Header' => 'stdint-uintn.h',
                                       'Line' => '27',
                                       'Name' => 'uint64_t',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '49880' => {
                                       'Header' => 'bios.h',
                                       'Line' => '39',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'PLDM_BIOS_STRING_TABLE',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'PLDM_BIOS_ATTR_TABLE',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'PLDM_BIOS_ATTR_VAL_TABLE',
                                                            'value' => '2'
                                                          }
                                                 },
                                       'Name' => 'enum pldm_bios_table_types',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '49914' => {
                                       'Header' => 'bios.h',
                                       'Line' => '48',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'string_handle',
                                                            'offset' => '0',
                                                            'type' => '5623'
                                                          },
                                                   '1' => {
                                                            'name' => 'string_length',
                                                            'offset' => '2',
                                                            'type' => '5623'
                                                          },
                                                   '2' => {
                                                            'name' => 'name',
                                                            'offset' => '4',
                                                            'type' => '49971'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_string_table_entry',
                                       'Size' => '5',
                                       'Type' => 'Struct'
                                     },
                          '49966' => {
                                       'BaseType' => '49914',
                                       'Name' => 'struct pldm_bios_string_table_entry const',
                                       'Size' => '5',
                                       'Type' => 'Const'
                                     },
                          '49971' => {
                                       'BaseType' => '116',
                                       'Name' => 'char[1]',
                                       'Size' => '1',
                                       'Type' => 'Array'
                                     },
                          '49987' => {
                                       'Header' => 'bios.h',
                                       'Line' => '54',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'attr_handle',
                                                            'offset' => '0',
                                                            'type' => '5623'
                                                          },
                                                   '1' => {
                                                            'name' => 'attr_type',
                                                            'offset' => '2',
                                                            'type' => '187'
                                                          },
                                                   '2' => {
                                                            'name' => 'string_handle',
                                                            'offset' => '3',
                                                            'type' => '5623'
                                                          },
                                                   '3' => {
                                                            'name' => 'metadata',
                                                            'offset' => '5',
                                                            'type' => '904'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_attr_table_entry',
                                       'Size' => '6',
                                       'Type' => 'Struct'
                                     },
                          '50052' => {
                                       'BaseType' => '49987',
                                       'Name' => 'struct pldm_bios_attr_table_entry const',
                                       'Size' => '6',
                                       'Type' => 'Const'
                                     },
                          '50057' => {
                                       'Header' => 'bios.h',
                                       'Line' => '66',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'attr_handle',
                                                            'offset' => '0',
                                                            'type' => '5623'
                                                          },
                                                   '1' => {
                                                            'name' => 'attr_type',
                                                            'offset' => '2',
                                                            'type' => '187'
                                                          },
                                                   '2' => {
                                                            'name' => 'value',
                                                            'offset' => '3',
                                                            'type' => '904'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_attr_val_table_entry',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '50109' => {
                                       'BaseType' => '50057',
                                       'Name' => 'struct pldm_bios_attr_val_table_entry const',
                                       'Size' => '4',
                                       'Type' => 'Const'
                                     },
                          '50178' => {
                                       'Header' => 'bios_table.h',
                                       'Line' => '205',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'name_handle',
                                                            'offset' => '0',
                                                            'type' => '5623'
                                                          },
                                                   '1' => {
                                                            'name' => 'read_only',
                                                            'offset' => '2',
                                                            'type' => '5126'
                                                          },
                                                   '2' => {
                                                            'name' => 'pv_num',
                                                            'offset' => '3',
                                                            'type' => '187'
                                                          },
                                                   '3' => {
                                                            'name' => 'pv_handle',
                                                            'offset' => '8',
                                                            'type' => '50281'
                                                          },
                                                   '4' => {
                                                            'name' => 'def_num',
                                                            'offset' => '22',
                                                            'type' => '187'
                                                          },
                                                   '5' => {
                                                            'name' => 'def_index',
                                                            'offset' => '36',
                                                            'type' => '6820'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_table_attr_entry_enum_info',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '50269' => {
                                       'BaseType' => '50178',
                                       'Name' => 'struct pldm_bios_table_attr_entry_enum_info const',
                                       'Size' => '32',
                                       'Type' => 'Const'
                                     },
                          '50281' => {
                                       'BaseType' => '12692',
                                       'Name' => 'uint16_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '50291' => {
                                       'Header' => 'bios_table.h',
                                       'Line' => '293',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'name_handle',
                                                            'offset' => '0',
                                                            'type' => '5623'
                                                          },
                                                   '1' => {
                                                            'name' => 'read_only',
                                                            'offset' => '2',
                                                            'type' => '5126'
                                                          },
                                                   '2' => {
                                                            'name' => 'string_type',
                                                            'offset' => '3',
                                                            'type' => '187'
                                                          },
                                                   '3' => {
                                                            'name' => 'min_length',
                                                            'offset' => '4',
                                                            'type' => '5623'
                                                          },
                                                   '4' => {
                                                            'name' => 'max_length',
                                                            'offset' => '6',
                                                            'type' => '5623'
                                                          },
                                                   '5' => {
                                                            'name' => 'def_length',
                                                            'offset' => '8',
                                                            'type' => '5623'
                                                          },
                                                   '6' => {
                                                            'name' => 'def_string',
                                                            'offset' => '22',
                                                            'type' => '13445'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_table_attr_entry_string_info',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '50403' => {
                                       'BaseType' => '50291',
                                       'Name' => 'struct pldm_bios_table_attr_entry_string_info const',
                                       'Size' => '24',
                                       'Type' => 'Const'
                                     },
                          '50413' => {
                                       'Header' => 'bios_table.h',
                                       'Line' => '383',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'name_handle',
                                                            'offset' => '0',
                                                            'type' => '5623'
                                                          },
                                                   '1' => {
                                                            'name' => 'read_only',
                                                            'offset' => '2',
                                                            'type' => '5126'
                                                          },
                                                   '2' => {
                                                            'name' => 'lower_bound',
                                                            'offset' => '8',
                                                            'type' => '49781'
                                                          },
                                                   '3' => {
                                                            'name' => 'upper_bound',
                                                            'offset' => '22',
                                                            'type' => '49781'
                                                          },
                                                   '4' => {
                                                            'name' => 'scalar_increment',
                                                            'offset' => '36',
                                                            'type' => '199'
                                                          },
                                                   '5' => {
                                                            'name' => 'default_value',
                                                            'offset' => '50',
                                                            'type' => '49781'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_table_attr_entry_integer_info',
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '50511' => {
                                       'BaseType' => '50413',
                                       'Name' => 'struct pldm_bios_table_attr_entry_integer_info const',
                                       'Size' => '40',
                                       'Type' => 'Const'
                                     },
                          '50794' => {
                                       'Name' => 'ssize_t(*)(void const*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '5345'
                                                           }
                                                  },
                                       'Return' => '13450',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '50864' => {
                                       'Line' => '938',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'table_data',
                                                            'offset' => '0',
                                                            'type' => '6820'
                                                          },
                                                   '1' => {
                                                            'name' => 'table_len',
                                                            'offset' => '8',
                                                            'type' => '137'
                                                          },
                                                   '2' => {
                                                            'name' => 'current_pos',
                                                            'offset' => '22',
                                                            'type' => '137'
                                                          },
                                                   '3' => {
                                                            'name' => 'entry_length_handler',
                                                            'offset' => '36',
                                                            'type' => '50794'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_table_iter',
                                       'PrivateABI' => 1,
                                       'Size' => '32',
                                       'Source' => 'bios_table.c',
                                       'Type' => 'Struct'
                                     },
                          '50934' => {
                                       'BaseType' => '50864',
                                       'Name' => 'struct pldm_bios_table_iter const',
                                       'Size' => '32',
                                       'Type' => 'Const'
                                     },
                          '52004' => {
                                       'BaseType' => '50864',
                                       'Name' => 'struct pldm_bios_table_iter*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '52009' => {
                                       'BaseType' => '50109',
                                       'Name' => 'struct pldm_bios_attr_val_table_entry const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '52423' => {
                                       'BaseType' => '50052',
                                       'Name' => 'struct pldm_bios_attr_table_entry const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '53027' => {
                                       'BaseType' => '49966',
                                       'Name' => 'struct pldm_bios_string_table_entry const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '54190' => {
                                       'BaseType' => '50934',
                                       'Name' => 'struct pldm_bios_table_iter const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '58463' => {
                                       'BaseType' => '49781',
                                       'Name' => 'uint64_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '58740' => {
                                       'BaseType' => '50511',
                                       'Name' => 'struct pldm_bios_table_attr_entry_integer_info const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '59049' => {
                                       'BaseType' => '13445',
                                       'Name' => 'char const**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '60221' => {
                                       'BaseType' => '50403',
                                       'Name' => 'struct pldm_bios_table_attr_entry_string_info const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '61721' => {
                                       'BaseType' => '50269',
                                       'Name' => 'struct pldm_bios_table_attr_entry_enum_info const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '63945' => {
                                       'Header' => 'pldm_types.h',
                                       'Line' => '36',
                                       'Name' => 'anon-struct-pldm_types.h-36',
                                       'Size' => '2',
                                       'Type' => 'Struct'
                                     },
                          '64207' => {
                                       'Header' => 'pldm_types.h',
                                       'Line' => '54',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'value',
                                                            'offset' => '0',
                                                            'type' => '5623'
                                                          },
                                                   '1' => {
                                                            'name' => 'bits',
                                                            'offset' => '0',
                                                            'type' => '63945'
                                                          }
                                                 },
                                       'Name' => 'union bitfield16_t',
                                       'Size' => '2',
                                       'Type' => 'Union'
                                     },
                          '64219' => {
                                       'Header' => 'pldm_types.h',
                                       'Line' => '58',
                                       'Name' => 'anon-struct-pldm_types.h-58',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '64705' => {
                                       'Header' => 'pldm_types.h',
                                       'Line' => '92',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'value',
                                                            'offset' => '0',
                                                            'type' => '199'
                                                          },
                                                   '1' => {
                                                            'name' => 'bits',
                                                            'offset' => '0',
                                                            'type' => '64219'
                                                          }
                                                 },
                                       'Name' => 'union bitfield32_t',
                                       'Size' => '4',
                                       'Type' => 'Union'
                                     },
                          '64717' => {
                                       'Header' => 'pldm_types.h',
                                       'Line' => '96',
                                       'Name' => 'anon-struct-pldm_types.h-96',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '65651' => {
                                       'Header' => 'pldm_types.h',
                                       'Line' => '162',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'value',
                                                            'offset' => '0',
                                                            'type' => '49781'
                                                          },
                                                   '1' => {
                                                            'name' => 'bits',
                                                            'offset' => '0',
                                                            'type' => '64717'
                                                          }
                                                 },
                                       'Name' => 'union bitfield64_t',
                                       'Size' => '8',
                                       'Type' => 'Union'
                                     },
                          '67214' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '330',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'uuid',
                                                            'offset' => '0',
                                                            'type' => '67318'
                                                          },
                                                   '1' => {
                                                            'name' => 'package_header_format_version',
                                                            'offset' => '22',
                                                            'type' => '187'
                                                          },
                                                   '2' => {
                                                            'name' => 'package_header_size',
                                                            'offset' => '23',
                                                            'type' => '5623'
                                                          },
                                                   '3' => {
                                                            'name' => 'package_release_date_time',
                                                            'offset' => '25',
                                                            'type' => '15938'
                                                          },
                                                   '4' => {
                                                            'name' => 'component_bitmap_bit_length',
                                                            'offset' => '50',
                                                            'type' => '5623'
                                                          },
                                                   '5' => {
                                                            'name' => 'package_version_string_type',
                                                            'offset' => '52',
                                                            'type' => '187'
                                                          },
                                                   '6' => {
                                                            'name' => 'package_version_string_length',
                                                            'offset' => '53',
                                                            'type' => '187'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_package_header_information',
                                       'Size' => '36',
                                       'Type' => 'Struct'
                                     },
                          '67318' => {
                                       'BaseType' => '187',
                                       'Name' => 'uint8_t[16]',
                                       'Size' => '16',
                                       'Type' => 'Array'
                                     },
                          '67350' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '344',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'record_length',
                                                            'offset' => '0',
                                                            'type' => '5623'
                                                          },
                                                   '1' => {
                                                            'name' => 'descriptor_count',
                                                            'offset' => '2',
                                                            'type' => '187'
                                                          },
                                                   '2' => {
                                                            'name' => 'device_update_option_flags',
                                                            'offset' => '3',
                                                            'type' => '64705'
                                                          },
                                                   '3' => {
                                                            'name' => 'comp_image_set_version_string_type',
                                                            'offset' => '7',
                                                            'type' => '187'
                                                          },
                                                   '4' => {
                                                            'name' => 'comp_image_set_version_string_length',
                                                            'offset' => '8',
                                                            'type' => '187'
                                                          },
                                                   '5' => {
                                                            'name' => 'fw_device_pkg_data_length',
                                                            'offset' => '9',
                                                            'type' => '5623'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_firmware_device_id_record',
                                       'Size' => '11',
                                       'Type' => 'Struct'
                                     },
                          '67545' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '378',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_classification',
                                                            'offset' => '0',
                                                            'type' => '5623'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_identifier',
                                                            'offset' => '2',
                                                            'type' => '5623'
                                                          },
                                                   '2' => {
                                                            'name' => 'comp_comparison_stamp',
                                                            'offset' => '4',
                                                            'type' => '199'
                                                          },
                                                   '3' => {
                                                            'name' => 'comp_options',
                                                            'offset' => '8',
                                                            'type' => '64207'
                                                          },
                                                   '4' => {
                                                            'name' => 'requested_comp_activation_method',
                                                            'offset' => '16',
                                                            'type' => '64207'
                                                          },
                                                   '5' => {
                                                            'name' => 'comp_location_offset',
                                                            'offset' => '18',
                                                            'type' => '199'
                                                          },
                                                   '6' => {
                                                            'name' => 'comp_size',
                                                            'offset' => '22',
                                                            'type' => '199'
                                                          },
                                                   '7' => {
                                                            'name' => 'comp_version_string_type',
                                                            'offset' => '32',
                                                            'type' => '187'
                                                          },
                                                   '8' => {
                                                            'name' => 'comp_version_string_length',
                                                            'offset' => '33',
                                                            'type' => '187'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_component_image_information',
                                       'Size' => '22',
                                       'Type' => 'Struct'
                                     },
                          '67727' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '404',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'completion_code',
                                                            'offset' => '0',
                                                            'type' => '187'
                                                          },
                                                   '1' => {
                                                            'name' => 'capabilities_during_update',
                                                            'offset' => '1',
                                                            'type' => '64705'
                                                          },
                                                   '2' => {
                                                            'name' => 'comp_count',
                                                            'offset' => '5',
                                                            'type' => '5623'
                                                          },
                                                   '3' => {
                                                            'name' => 'active_comp_image_set_ver_str_type',
                                                            'offset' => '7',
                                                            'type' => '187'
                                                          },
                                                   '4' => {
                                                            'name' => 'active_comp_image_set_ver_str_len',
                                                            'offset' => '8',
                                                            'type' => '187'
                                                          },
                                                   '5' => {
                                                            'name' => 'pending_comp_image_set_ver_str_type',
                                                            'offset' => '9',
                                                            'type' => '187'
                                                          },
                                                   '6' => {
                                                            'name' => 'pending_comp_image_set_ver_str_len',
                                                            'offset' => '16',
                                                            'type' => '187'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_get_firmware_parameters_resp',
                                       'Size' => '11',
                                       'Type' => 'Struct'
                                     },
                          '67831' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '418',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_classification',
                                                            'offset' => '0',
                                                            'type' => '5623'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_identifier',
                                                            'offset' => '2',
                                                            'type' => '5623'
                                                          },
                                                   '2' => {
                                                            'name' => 'comp_classification_index',
                                                            'offset' => '4',
                                                            'type' => '187'
                                                          },
                                                   '3' => {
                                                            'name' => 'active_comp_comparison_stamp',
                                                            'offset' => '5',
                                                            'type' => '199'
                                                          },
                                                   '4' => {
                                                            'name' => 'active_comp_ver_str_type',
                                                            'offset' => '9',
                                                            'type' => '187'
                                                          },
                                                   '5' => {
                                                            'name' => 'active_comp_ver_str_len',
                                                            'offset' => '16',
                                                            'type' => '187'
                                                          },
                                                   '6' => {
                                                            'name' => 'active_comp_release_date',
                                                            'offset' => '17',
                                                            'type' => '68013'
                                                          },
                                                   '7' => {
                                                            'name' => 'pending_comp_comparison_stamp',
                                                            'offset' => '25',
                                                            'type' => '199'
                                                          },
                                                   '8' => {
                                                            'name' => 'pending_comp_ver_str_type',
                                                            'offset' => '35',
                                                            'type' => '187'
                                                          },
                                                   '9' => {
                                                            'name' => 'pending_comp_ver_str_len',
                                                            'offset' => '36',
                                                            'type' => '187'
                                                          },
                                                   '10' => {
                                                             'name' => 'pending_comp_release_date',
                                                             'offset' => '37',
                                                             'type' => '68013'
                                                           },
                                                   '11' => {
                                                             'name' => 'comp_activation_methods',
                                                             'offset' => '51',
                                                             'type' => '64207'
                                                           },
                                                   '12' => {
                                                             'name' => 'capabilities_during_update',
                                                             'offset' => '53',
                                                             'type' => '64705'
                                                           }
                                                 },
                                       'Name' => 'struct pldm_component_parameter_entry',
                                       'Size' => '39',
                                       'Type' => 'Struct'
                                     },
                          '68013' => {
                                       'BaseType' => '187',
                                       'Name' => 'uint8_t[8]',
                                       'Size' => '8',
                                       'Type' => 'Array'
                                     },
                          '68873' => {
                                       'BaseType' => '6781',
                                       'Name' => 'struct variable_field const',
                                       'Size' => '16',
                                       'Type' => 'Const'
                                     },
                          '69183' => {
                                       'BaseType' => '12880',
                                       'Name' => 'bool8_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '69188' => {
                                       'BaseType' => '65651',
                                       'Name' => 'bitfield64_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '69941' => {
                                       'BaseType' => '64705',
                                       'Name' => 'bitfield32_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '70787' => {
                                       'BaseType' => '64207',
                                       'Name' => 'bitfield16_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '72334' => {
                                       'BaseType' => '68873',
                                       'Name' => 'struct variable_field const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '73928' => {
                                       'BaseType' => '67831',
                                       'Name' => 'struct pldm_component_parameter_entry*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '74158' => {
                                       'BaseType' => '67727',
                                       'Name' => 'struct pldm_get_firmware_parameters_resp*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '74459' => {
                                       'BaseType' => '2079',
                                       'Name' => 'uint8_t**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '74756' => {
                                       'BaseType' => '67545',
                                       'Name' => 'struct pldm_component_image_information*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '75372' => {
                                       'BaseType' => '67350',
                                       'Name' => 'struct pldm_firmware_device_id_record*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '75676' => {
                                       'BaseType' => '67214',
                                       'Name' => 'struct pldm_package_header_information*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '82395' => {
                                       'BaseType' => '82412',
                                       'Header' => 'pdr.h',
                                       'Line' => '16',
                                       'Name' => 'pldm_pdr',
                                       'PrivateABI' => 1,
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '82407' => {
                                       'BaseType' => '82395',
                                       'Name' => 'pldm_pdr const',
                                       'Size' => '24',
                                       'Type' => 'Const'
                                     },
                          '82412' => {
                                       'Line' => '20',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'record_count',
                                                            'offset' => '0',
                                                            'type' => '199'
                                                          },
                                                   '1' => {
                                                            'name' => 'size',
                                                            'offset' => '4',
                                                            'type' => '199'
                                                          },
                                                   '2' => {
                                                            'name' => 'first',
                                                            'offset' => '8',
                                                            'type' => '83528'
                                                          },
                                                   '3' => {
                                                            'name' => 'last',
                                                            'offset' => '22',
                                                            'type' => '83528'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_pdr',
                                       'PrivateABI' => 1,
                                       'Size' => '24',
                                       'Source' => 'pdr.c',
                                       'Type' => 'Struct'
                                     },
                          '82472' => {
                                       'BaseType' => '82489',
                                       'Header' => 'pdr.h',
                                       'Line' => '21',
                                       'Name' => 'pldm_pdr_record',
                                       'PrivateABI' => 1,
                                       'Size' => '32',
                                       'Type' => 'Typedef'
                                     },
                          '82484' => {
                                       'BaseType' => '82472',
                                       'Name' => 'pldm_pdr_record const',
                                       'Size' => '32',
                                       'Type' => 'Const'
                                     },
                          '82489' => {
                                       'Line' => '11',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'record_handle',
                                                            'offset' => '0',
                                                            'type' => '199'
                                                          },
                                                   '1' => {
                                                            'name' => 'size',
                                                            'offset' => '4',
                                                            'type' => '199'
                                                          },
                                                   '2' => {
                                                            'name' => 'data',
                                                            'offset' => '8',
                                                            'type' => '2079'
                                                          },
                                                   '3' => {
                                                            'name' => 'next',
                                                            'offset' => '22',
                                                            'type' => '83516'
                                                          },
                                                   '4' => {
                                                            'name' => 'is_remote',
                                                            'offset' => '36',
                                                            'type' => '5126'
                                                          },
                                                   '5' => {
                                                            'name' => 'terminus_handle',
                                                            'offset' => '38',
                                                            'type' => '5623'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_pdr_record',
                                       'PrivateABI' => 1,
                                       'Size' => '32',
                                       'Source' => 'pdr.c',
                                       'Type' => 'Struct'
                                     },
                          '82573' => {
                                       'Header' => 'pdr.h',
                                       'Line' => '275',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'entity_type',
                                                            'offset' => '0',
                                                            'type' => '5623'
                                                          },
                                                   '1' => {
                                                            'name' => 'entity_instance_num',
                                                            'offset' => '2',
                                                            'type' => '5623'
                                                          },
                                                   '2' => {
                                                            'name' => 'entity_container_id',
                                                            'offset' => '4',
                                                            'type' => '5623'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_entity',
                                       'Size' => '6',
                                       'Type' => 'Struct'
                                     },
                          '82630' => {
                                       'BaseType' => '82573',
                                       'Header' => 'pdr.h',
                                       'Line' => '279',
                                       'Name' => 'pldm_entity',
                                       'Size' => '6',
                                       'Type' => 'Typedef'
                                     },
                          '82674' => {
                                       'BaseType' => '82686',
                                       'Header' => 'pdr.h',
                                       'Line' => '289',
                                       'Name' => 'pldm_entity_association_tree',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Typedef'
                                     },
                          '82686' => {
                                       'Line' => '435',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'root',
                                                            'offset' => '0',
                                                            'type' => '83533'
                                                          },
                                                   '1' => {
                                                            'name' => 'last_used_container_id',
                                                            'offset' => '8',
                                                            'type' => '5623'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_entity_association_tree',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Source' => 'pdr.c',
                                       'Type' => 'Struct'
                                     },
                          '82729' => {
                                       'BaseType' => '82746',
                                       'Header' => 'pdr.h',
                                       'Line' => '294',
                                       'Name' => 'pldm_entity_node',
                                       'PrivateABI' => 1,
                                       'Size' => '40',
                                       'Type' => 'Typedef'
                                     },
                          '82741' => {
                                       'BaseType' => '82729',
                                       'Name' => 'pldm_entity_node const',
                                       'Size' => '40',
                                       'Type' => 'Const'
                                     },
                          '82746' => {
                                       'Line' => '440',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'entity',
                                                            'offset' => '0',
                                                            'type' => '82630'
                                                          },
                                                   '1' => {
                                                            'name' => 'parent',
                                                            'offset' => '6',
                                                            'type' => '82630'
                                                          },
                                                   '2' => {
                                                            'name' => 'remote_container_id',
                                                            'offset' => '18',
                                                            'type' => '5623'
                                                          },
                                                   '3' => {
                                                            'name' => 'first_child',
                                                            'offset' => '22',
                                                            'type' => '83533'
                                                          },
                                                   '4' => {
                                                            'name' => 'next_sibling',
                                                            'offset' => '36',
                                                            'type' => '83533'
                                                          },
                                                   '5' => {
                                                            'name' => 'association_type',
                                                            'offset' => '50',
                                                            'type' => '187'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_entity_node',
                                       'PrivateABI' => 1,
                                       'Size' => '40',
                                       'Source' => 'pdr.c',
                                       'Type' => 'Struct'
                                     },
                          '83516' => {
                                       'BaseType' => '82489',
                                       'Name' => 'struct pldm_pdr_record*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '83528' => {
                                       'BaseType' => '82472',
                                       'Name' => 'pldm_pdr_record*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '83533' => {
                                       'BaseType' => '82729',
                                       'Name' => 'pldm_entity_node*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '83926' => {
                                       'BaseType' => '83931',
                                       'Name' => 'pldm_entity**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '83931' => {
                                       'BaseType' => '82630',
                                       'Name' => 'pldm_entity*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '83995' => {
                                       'BaseType' => '82674',
                                       'Name' => 'pldm_entity_association_tree*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '84274' => {
                                       'BaseType' => '83533',
                                       'Name' => 'pldm_entity_node**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '85063' => {
                                       'BaseType' => '82407',
                                       'Name' => 'pldm_pdr const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '85316' => {
                                       'BaseType' => '82395',
                                       'Name' => 'pldm_pdr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '90425' => {
                                       'BaseType' => '82741',
                                       'Name' => 'pldm_entity_node const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '91589' => {
                                       'BaseType' => '82484',
                                       'Name' => 'pldm_pdr_record const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '94669' => {
                                       'BaseType' => '187',
                                       'Header' => 'base.h',
                                       'Line' => '16',
                                       'Name' => 'pldm_tid_t',
                                       'Size' => '1',
                                       'Type' => 'Typedef'
                                     },
                          '94681' => {
                                       'BaseType' => '187',
                                       'Header' => 'instance-id.h',
                                       'Line' => '12',
                                       'Name' => 'pldm_instance_id_t',
                                       'Size' => '1',
                                       'Type' => 'Typedef'
                                     },
                          '94693' => {
                                       'Header' => 'responder.h',
                                       'Line' => '10',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tid',
                                                            'offset' => '0',
                                                            'type' => '94669'
                                                          },
                                                   '1' => {
                                                            'name' => 'instance_id',
                                                            'offset' => '1',
                                                            'type' => '94681'
                                                          },
                                                   '2' => {
                                                            'name' => 'type',
                                                            'offset' => '2',
                                                            'type' => '187'
                                                          },
                                                   '3' => {
                                                            'name' => 'command',
                                                            'offset' => '3',
                                                            'type' => '187'
                                                          },
                                                   '4' => {
                                                            'name' => 'next',
                                                            'offset' => '8',
                                                            'type' => '94773'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_responder_cookie',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '94773' => {
                                       'BaseType' => '94693',
                                       'Name' => 'struct pldm_responder_cookie*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '94778' => {
                                       'Header' => 'pldm.h',
                                       'Line' => '15',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'PLDM_REQUESTER_SUCCESS',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'PLDM_REQUESTER_OPEN_FAIL',
                                                            'value' => '18446744073709551615 (-1)'
                                                          },
                                                   '2' => {
                                                            'name' => 'PLDM_REQUESTER_NOT_PLDM_MSG',
                                                            'value' => '18446744073709551614 (-2)'
                                                          },
                                                   '3' => {
                                                            'name' => 'PLDM_REQUESTER_NOT_RESP_MSG',
                                                            'value' => '18446744073709551613 (-3)'
                                                          },
                                                   '4' => {
                                                            'name' => 'PLDM_REQUESTER_NOT_REQ_MSG',
                                                            'value' => '18446744073709551612 (-4)'
                                                          },
                                                   '5' => {
                                                            'name' => 'PLDM_REQUESTER_RESP_MSG_TOO_SMALL',
                                                            'value' => '18446744073709551611 (-5)'
                                                          },
                                                   '6' => {
                                                            'name' => 'PLDM_REQUESTER_INSTANCE_ID_MISMATCH',
                                                            'value' => '18446744073709551610 (-6)'
                                                          },
                                                   '7' => {
                                                            'name' => 'PLDM_REQUESTER_SEND_FAIL',
                                                            'value' => '18446744073709551609 (-7)'
                                                          },
                                                   '8' => {
                                                            'name' => 'PLDM_REQUESTER_RECV_FAIL',
                                                            'value' => '18446744073709551608 (-8)'
                                                          },
                                                   '9' => {
                                                            'name' => 'PLDM_REQUESTER_INVALID_RECV_LEN',
                                                            'value' => '18446744073709551607 (-9)'
                                                          },
                                                   '10' => {
                                                             'name' => 'PLDM_REQUESTER_SETUP_FAIL',
                                                             'value' => '18446744073709551606 (-10)'
                                                           },
                                                   '11' => {
                                                             'name' => 'PLDM_REQUESTER_INVALID_SETUP',
                                                             'value' => '18446744073709551605 (-11)'
                                                           },
                                                   '12' => {
                                                             'name' => 'PLDM_REQUESTER_POLL_FAIL',
                                                             'value' => '18446744073709551604 (-12)'
                                                           },
                                                   '13' => {
                                                             'name' => 'PLDM_REQUESTER_TRANSPORT_BUSY',
                                                             'value' => '18446744073709551603 (-13)'
                                                           }
                                                 },
                                       'Name' => 'enum pldm_requester_error_codes',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '97713' => {
                                       'Line' => '20',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'prev',
                                                            'offset' => '0',
                                                            'type' => '94681'
                                                          },
                                                   '1' => {
                                                            'name' => 'allocations',
                                                            'offset' => '4',
                                                            'type' => '199'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_tid_state',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Source' => 'instance-id.c',
                                       'Type' => 'Struct'
                                     },
                          '97752' => {
                                       'Line' => '25',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'state',
                                                            'offset' => '0',
                                                            'type' => '97794'
                                                          },
                                                   '1' => {
                                                            'name' => 'lock_db_fd',
                                                            'offset' => '8264',
                                                            'type' => '74'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_instance_db',
                                       'PrivateABI' => 1,
                                       'Size' => '2052',
                                       'Source' => 'instance-id.c',
                                       'Type' => 'Struct'
                                     },
                          '97794' => {
                                       'BaseType' => '97713',
                                       'Name' => 'struct pldm_tid_state[256]',
                                       'Size' => '2048',
                                       'Type' => 'Array'
                                     },
                          '98264' => {
                                       'BaseType' => '97752',
                                       'Name' => 'struct pldm_instance_db*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '98689' => {
                                       'BaseType' => '94681',
                                       'Name' => 'pldm_instance_id_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '98865' => {
                                       'BaseType' => '98264',
                                       'Name' => 'struct pldm_instance_db**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '99622' => {
                                       'BaseType' => '187',
                                       'Header' => 'pldm.h',
                                       'Line' => '13',
                                       'Name' => 'mctp_eid_t',
                                       'Size' => '1',
                                       'Type' => 'Typedef'
                                     },
                          '99737' => {
                                       'BaseType' => '94778',
                                       'Header' => 'pldm.h',
                                       'Line' => '30',
                                       'Name' => 'pldm_requester_rc_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '99755' => {
                                       'Line' => '25',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'transport',
                                                            'offset' => '0',
                                                            'type' => '99828'
                                                          },
                                                   '1' => {
                                                            'name' => 'socket',
                                                            'offset' => '64',
                                                            'type' => '74'
                                                          },
                                                   '2' => {
                                                            'name' => 'tid_eid_map',
                                                            'offset' => '68',
                                                            'type' => '103460'
                                                          },
                                                   '3' => {
                                                            'name' => 'socket_send_buf',
                                                            'offset' => '768',
                                                            'type' => '102409'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_transport_mctp_demux',
                                       'PrivateABI' => 1,
                                       'Size' => '312',
                                       'Source' => 'mctp-demux.c',
                                       'Type' => 'Struct'
                                     },
                          '99781' => {
                                       'BaseType' => '99755',
                                       'Name' => 'struct pldm_transport_mctp_demux*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '99823' => {
                                       'BaseType' => '99828',
                                       'Name' => 'struct pldm_transport*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '99828' => {
                                       'Header' => 'transport.h',
                                       'Line' => '18',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'name',
                                                            'offset' => '0',
                                                            'type' => '13445'
                                                          },
                                                   '1' => {
                                                            'name' => 'version',
                                                            'offset' => '8',
                                                            'type' => '187'
                                                          },
                                                   '2' => {
                                                            'name' => 'recv',
                                                            'offset' => '22',
                                                            'type' => '102720'
                                                          },
                                                   '3' => {
                                                            'name' => 'send',
                                                            'offset' => '36',
                                                            'type' => '102761'
                                                          },
                                                   '4' => {
                                                            'name' => 'init_pollfd',
                                                            'offset' => '50',
                                                            'type' => '102841'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_transport',
                                       'PrivateABI' => 1,
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '99964' => {
                                       'BaseType' => '94669',
                                       'Name' => 'pldm_tid_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '100067' => {
                                        'BaseType' => '99781',
                                        'Name' => 'struct pldm_transport_mctp_demux**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '102006' => {
                                        'BaseType' => '53',
                                        'Header' => 'int-ll64.h',
                                        'Line' => '21',
                                        'Name' => '__u8',
                                        'PrivateABI' => 1,
                                        'Size' => '1',
                                        'Type' => 'Typedef'
                                      },
                          '102032' => {
                                        'BaseType' => '67',
                                        'Header' => 'int-ll64.h',
                                        'Line' => '24',
                                        'Name' => '__u16',
                                        'PrivateABI' => 1,
                                        'Size' => '2',
                                        'Type' => 'Typedef'
                                      },
                          '102409' => {
                                        'Header' => 'socket.h',
                                        'Line' => '5',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'size',
                                                             'offset' => '0',
                                                             'type' => '74'
                                                           },
                                                    '1' => {
                                                             'name' => 'socket',
                                                             'offset' => '4',
                                                             'type' => '74'
                                                           },
                                                    '2' => {
                                                             'name' => 'max_size',
                                                             'offset' => '8',
                                                             'type' => '74'
                                                           }
                                                  },
                                        'Name' => 'struct pldm_socket_sndbuf',
                                        'PrivateABI' => 1,
                                        'Size' => '12',
                                        'Type' => 'Struct'
                                      },
                          '102720' => {
                                        'Name' => 'pldm_requester_rc_t(*)(struct pldm_transport*, pldm_tid_t*, void**, size_t*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '99823'
                                                            },
                                                     '1' => {
                                                              'type' => '99964'
                                                            },
                                                     '2' => {
                                                              'type' => '17831'
                                                            },
                                                     '3' => {
                                                              'type' => '9822'
                                                            }
                                                   },
                                        'Return' => '99737',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '102761' => {
                                        'Name' => 'pldm_requester_rc_t(*)(struct pldm_transport*, pldm_tid_t, void const*, size_t)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '99823'
                                                            },
                                                     '1' => {
                                                              'type' => '94669'
                                                            },
                                                     '2' => {
                                                              'type' => '5345'
                                                            },
                                                     '3' => {
                                                              'type' => '137'
                                                            }
                                                   },
                                        'Return' => '99737',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '102786' => {
                                        'BaseType' => '102791',
                                        'Name' => 'struct pollfd*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '102791' => {
                                        'Header' => 'poll.h',
                                        'Line' => '36',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'fd',
                                                             'offset' => '0',
                                                             'type' => '74'
                                                           },
                                                    '1' => {
                                                             'name' => 'events',
                                                             'offset' => '4',
                                                             'type' => '60'
                                                           },
                                                    '2' => {
                                                             'name' => 'revents',
                                                             'offset' => '6',
                                                             'type' => '60'
                                                           }
                                                  },
                                        'Name' => 'struct pollfd',
                                        'PrivateABI' => 1,
                                        'Size' => '8',
                                        'Type' => 'Struct'
                                      },
                          '102841' => {
                                        'Name' => 'int(*)(struct pldm_transport*, struct pollfd*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '99823'
                                                            },
                                                     '1' => {
                                                              'type' => '102786'
                                                            }
                                                   },
                                        'Return' => '74',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '102846' => {
                                        'BaseType' => '67',
                                        'Header' => 'socket.h',
                                        'Line' => '10',
                                        'Name' => '__kernel_sa_family_t',
                                        'PrivateABI' => 1,
                                        'Size' => '2',
                                        'Type' => 'Typedef'
                                      },
                          '103194' => {
                                        'Header' => 'mctp.h',
                                        'Line' => '18',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 's_addr',
                                                             'offset' => '0',
                                                             'type' => '99622'
                                                           }
                                                  },
                                        'Name' => 'struct mctp_addr',
                                        'PrivateABI' => 1,
                                        'Size' => '1',
                                        'Type' => 'Struct'
                                      },
                          '103220' => {
                                        'Header' => 'mctp.h',
                                        'Line' => '22',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'smctp_family',
                                                             'offset' => '0',
                                                             'type' => '102846'
                                                           },
                                                    '1' => {
                                                             'name' => '__smctp_pad0',
                                                             'offset' => '2',
                                                             'type' => '102032'
                                                           },
                                                    '2' => {
                                                             'name' => 'smctp_network',
                                                             'offset' => '4',
                                                             'type' => '81'
                                                           },
                                                    '3' => {
                                                             'name' => 'smctp_addr',
                                                             'offset' => '8',
                                                             'type' => '103194'
                                                           },
                                                    '4' => {
                                                             'name' => 'smctp_type',
                                                             'offset' => '9',
                                                             'type' => '102006'
                                                           },
                                                    '5' => {
                                                             'name' => 'smctp_tag',
                                                             'offset' => '16',
                                                             'type' => '102006'
                                                           },
                                                    '6' => {
                                                             'name' => '__smctp_pad1',
                                                             'offset' => '17',
                                                             'type' => '102006'
                                                           }
                                                  },
                                        'Name' => 'struct sockaddr_mctp',
                                        'PrivateABI' => 1,
                                        'Size' => '12',
                                        'Type' => 'Struct'
                                      },
                          '103324' => {
                                        'BaseType' => '103220',
                                        'Name' => 'struct sockaddr_mctp const',
                                        'Size' => '12',
                                        'Type' => 'Const'
                                      },
                          '103367' => {
                                        'Line' => '34',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'transport',
                                                             'offset' => '0',
                                                             'type' => '99828'
                                                           },
                                                    '1' => {
                                                             'name' => 'socket',
                                                             'offset' => '64',
                                                             'type' => '74'
                                                           },
                                                    '2' => {
                                                             'name' => 'tid_eid_map',
                                                             'offset' => '68',
                                                             'type' => '103460'
                                                           },
                                                    '3' => {
                                                             'name' => 'socket_send_buf',
                                                             'offset' => '768',
                                                             'type' => '102409'
                                                           },
                                                    '4' => {
                                                             'name' => 'bound',
                                                             'offset' => '786',
                                                             'type' => '5126'
                                                           },
                                                    '5' => {
                                                             'name' => 'cookie_jar',
                                                             'offset' => '800',
                                                             'type' => '94693'
                                                           }
                                                  },
                                        'Name' => 'struct pldm_transport_af_mctp',
                                        'PrivateABI' => 1,
                                        'Size' => '336',
                                        'Source' => 'af-mctp.c',
                                        'Type' => 'Struct'
                                      },
                          '103460' => {
                                        'BaseType' => '94669',
                                        'Name' => 'pldm_tid_t[256]',
                                        'Size' => '256',
                                        'Type' => 'Array'
                                      },
                          '104276' => {
                                        'BaseType' => '103367',
                                        'Name' => 'struct pldm_transport_af_mctp*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '104281' => {
                                        'BaseType' => '103324',
                                        'Name' => 'struct sockaddr_mctp const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '104594' => {
                                        'BaseType' => '104276',
                                        'Name' => 'struct pldm_transport_af_mctp**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      }
                        },
          'UndefinedSymbols' => {
                                  'libpldm.so.0.7.0' => {
                                                          '_ITM_deregisterTMCloneTable' => 0,
                                                          '_ITM_registerTMCloneTable' => 0,
                                                          '__assert_fail@GLIBC_2.2.5' => 0,
                                                          '__cxa_finalize@GLIBC_2.2.5' => 0,
                                                          '__errno_location@GLIBC_2.2.5' => 0,
                                                          '__gmon_start__' => 0,
                                                          '__stack_chk_fail@GLIBC_2.4' => 0,
                                                          'bind@GLIBC_2.2.5' => 0,
                                                          'calloc@GLIBC_2.2.5' => 0,
                                                          'clock_gettime@GLIBC_2.17' => 0,
                                                          'close@GLIBC_2.2.5' => 0,
                                                          'connect@GLIBC_2.2.5' => 0,
                                                          'dup@GLIBC_2.2.5' => 0,
                                                          'fclose@GLIBC_2.2.5' => 0,
                                                          'fcntl64@GLIBC_2.28' => 0,
                                                          'fgets@GLIBC_2.2.5' => 0,
                                                          'fopen64@GLIBC_2.2.5' => 0,
                                                          'free@GLIBC_2.2.5' => 0,
                                                          'getsockopt@GLIBC_2.2.5' => 0,
                                                          'malloc@GLIBC_2.2.5' => 0,
                                                          'memcmp@GLIBC_2.2.5' => 0,
                                                          'memcpy@GLIBC_2.14' => 0,
                                                          'open64@GLIBC_2.2.5' => 0,
                                                          'poll@GLIBC_2.2.5' => 0,
                                                          'ppoll@GLIBC_2.4' => 0,
                                                          'recv@GLIBC_2.2.5' => 0,
                                                          'recvfrom@GLIBC_2.2.5' => 0,
                                                          'recvmsg@GLIBC_2.2.5' => 0,
                                                          'sendmsg@GLIBC_2.2.5' => 0,
                                                          'sendto@GLIBC_2.2.5' => 0,
                                                          'setsockopt@GLIBC_2.2.5' => 0,
                                                          'socket@GLIBC_2.2.5' => 0,
                                                          'stat64@GLIBC_2.33' => 0,
                                                          'strlen@GLIBC_2.2.5' => 0,
                                                          'strtol@GLIBC_2.2.5' => 0,
                                                          'timerfd_create@GLIBC_2.8' => 0,
                                                          'timerfd_settime@GLIBC_2.8' => 0,
                                                          'write@GLIBC_2.2.5' => 0
                                                        }
                                },
          'WordSize' => '8'
        };
