$VAR1 = {
  'ABI_DUMPER_VERSION' => '1.2',
  'ABI_DUMP_VERSION' => '3.5',
  'Arch' => 'x86_64',
  'GccVersion' => '13.2.0',
  'Headers' => {
    'af-mctp.h' => 1,
    'base.h' => 1,
    'bios.h' => 1,
    'bios_table.h' => 1,
    'file_io.h' => 1,
    'firmware_update.h' => 1,
    'fru.h' => 1,
    'host.h' => 1,
    'instance-id.h' => 1,
    'mctp-demux.h' => 1,
    'pdr.h' => 1,
    'platform.h' => 1,
    'pldm.h' => 1,
    'pldm_types.h' => 1,
    'transport.h' => 1,
    'utils.h' => 1
  },
  'Language' => 'C',
  'LibraryName' => 'libpldm.so.0.8.0',
  'LibraryVersion' => '0.8.0',
  'NameSpaces' => {},
  'Needed' => {
    'libc.so.6' => 1
  },
  'PublicABI' => '1',
  'Sources' => {
    'af-mctp.c' => 1,
    'bios_table.c' => 1,
    'instance-id.c' => 1,
    'mctp-demux.c' => 1,
    'pdr.c' => 1
  },
  'SymbolInfo' => {
    '1431' => {
      'Header' => 'base.h',
      'Line' => '607',
      'Param' => {
        '0' => {
          'name' => 'msg_type',
          'type' => '140'
        },
        '1' => {
          'name' => 'instance_id',
          'type' => '140'
        },
        '2' => {
          'name' => 'pldm_type',
          'type' => '140'
        },
        '3' => {
          'name' => 'command',
          'type' => '140'
        },
        '4' => {
          'name' => 'msg',
          'type' => '1624'
        }
      },
      'Return' => '100',
      'ShortName' => 'encode_pldm_header_only'
    },
    '1629' => {
      'Header' => 'base.h',

      'pldm_bios_table_string_find_by_string' => 1,
      'pldm_close' => 1,
      'pldm_entity_association_pdr_add_check' => 1,
      'pldm_entity_association_pdr_add_from_node_check' => 1,
      'pldm_entity_association_pdr_add_from_node_with_record_handle' => 1,
      'pldm_entity_association_pdr_extract' => 1,
      'pldm_entity_association_tree_add' => 1,
      'pldm_entity_association_tree_add_entity' => 1,
      'pldm_entity_association_tree_copy_root' => 1,
      'pldm_entity_association_tree_destroy' => 1,
      'pldm_entity_association_tree_destroy_root' => 1,
      'pldm_entity_association_tree_find' => 1,
      'pldm_entity_association_tree_find_with_locality' => 1,
      'pldm_entity_association_tree_init' => 1,
      'pldm_entity_association_tree_visit' => 1,
      'pldm_entity_extract' => 1,
      'pldm_entity_get_num_children' => 1,
      'pldm_entity_get_parent' => 1,
      'pldm_entity_is_exist_parent' => 1,
      'pldm_entity_is_node_parent' => 1,
      'pldm_entity_node_get_remote_container_id' => 1,
      'pldm_find_entity_ref_in_tree' => 1,
      'pldm_instance_db_destroy' => 1,
      'pldm_instance_db_init' => 1,
      'pldm_instance_db_init_default' => 1,
      'pldm_instance_id_alloc' => 1,
      'pldm_instance_id_free' => 1,
      'pldm_is_current_parent_child' => 1,
      'pldm_is_empty_entity_assoc_tree' => 1,
      'pldm_msg_hdr_correlate_response' => 1,
      'pldm_open' => 1,
      'pldm_pdr_add_check' => 1,
      'pldm_pdr_add_fru_record_set_check' => 1,
      'pldm_pdr_destroy' => 1,
      'pldm_pdr_find_last_in_range' => 1,
      'pldm_pdr_find_record' => 1,
      'pldm_pdr_find_record_by_type' => 1,
      'pldm_pdr_fru_record_set_find_by_rsi' => 1,
      'pldm_pdr_get_next_record' => 1,
      'pldm_pdr_get_record_count' => 1,
      'pldm_pdr_get_record_handle' => 1,
      'pldm_pdr_get_repo_size' => 1,
      'pldm_pdr_init' => 1,
      'pldm_pdr_record_is_remote' => 1,
      'pldm_pdr_remove_pdrs_by_terminus_handle' => 1,
      'pldm_pdr_remove_remote_pdrs' => 1,
      'pldm_pdr_update_TL_pdr' => 1,
      'pldm_recv' => 1,
      'pldm_recv_any' => 1,
      'pldm_send' => 1,
      'pldm_send_recv' => 1,
      'pldm_transport_af_mctp_bind' => 1,
      'pldm_transport_af_mctp_core' => 1,
      'pldm_transport_af_mctp_destroy' => 1,
      'pldm_transport_af_mctp_init' => 1,
      'pldm_transport_af_mctp_init_pollfd' => 1,
      'pldm_transport_af_mctp_map_tid' => 1,
      'pldm_transport_af_mctp_unmap_tid' => 1,
      'pldm_transport_mctp_demux_core' => 1,
      'pldm_transport_mctp_demux_destroy' => 1,
      'pldm_transport_mctp_demux_init' => 1,
      'pldm_transport_mctp_demux_init_pollfd' => 1,
      'pldm_transport_mctp_demux_map_tid' => 1,
      'pldm_transport_mctp_demux_unmap_tid' => 1,
      'pldm_transport_poll' => 1,
      'pldm_transport_recv_msg' => 1,
      'pldm_transport_send_msg' => 1,
      'pldm_transport_send_recv_msg' => 1,
      'unpack_pldm_header' => 1,
      'ver2str' => 1
    }
  },
  'Target' => 'unix',
  'TypeInfo' => {
    '1' => {
      'Name' => 'void',
      'Type' => 'Intrinsic'
    },
    '46' => {
      'Name' => 'unsigned char',
      'Size' => '1',
      'Type' => 'Intrinsic'
    },
    '53' => {
      'Name' => 'unsigned short',
      'Size' => '2',
      'Type' => 'Intrinsic'
    },
    '60' => {
      'Name' => 'unsigned int',
      'Size' => '4',
      'Type' => 'Intrinsic'
    },
    '67' => {
      'Name' => 'unsigned long',
      'Size' => '8',
      'Type' => 'Intrinsic'
    },
    '74' => {
      'Name' => 'signed char',
      'Size' => '1',
      'Type' => 'Intrinsic'
    },
    '81' => {
      'BaseType' => '46',
      'Header' => 'types.h',
      'Line' => '38',
      'Name' => '__uint8_t',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '93' => {
      'Name' => 'short',
      'Size' => '2',
      'Type' => 'Intrinsic'
    },
    '100' => {
      'Name' => 'int',
      'Size' => '4',
      'Type' => 'Intrinsic'
    },
    '107' => {
      'BaseType' => '60',
      'Header' => 'types.h',
      'Line' => '42',
      'Name' => '__uint32_t',
      'PrivateABI' => 1,
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '119' => {
      'Name' => 'long',
      'Size' => '8',
      'Type' => 'Intrinsic'
    },
    '126' => {
      'BaseType' => '1',
      'Name' => 'void*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '133' => {
      'Name' => 'char',
      'Size' => '1',
      'Type' => 'Intrinsic'
    },
    '140' => {
      'BaseType' => '81',
      'Header' => 'stdint-uintn.h',
      'Line' => '24',
      'Name' => 'uint8_t',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '152' => {
      'BaseType' => '107',
      'Header' => 'stdint-uintn.h',
      'Line' => '26',
      'Name' => 'uint32_t',
      'PrivateABI' => 1,
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '164' => {
      'Header' => 'pldm_types.h',
      'Line' => '9',
      'Name' => 'anon-struct-pldm_types.h-9',
      'Size' => '1',
      'Type' => 'Struct'
    },
    '318' => {
      'Header' => 'pldm_types.h',
      'Line' => '19',
      'Memb' => {
        '0' => {
          'name' => 'byte',
          'offset' => '0',
          'type' => '140'
        },
        '1' => {
          'name' => 'bits',
          'offset' => '0',
          'type' => '164'
        }
      },
      'Name' => 'union bitfield8_t',
      'Size' => '1',
      'Type' => 'Union'
    },
    '330' => {
      'BaseType' => '318',
      'Name' => 'bitfield8_t const',
      'Size' => '1',
      'Type' => 'Const'
    },
    '335' => {
      'Header' => 'pldm_types.h',
      'Line' => '25',
      'Memb' => {
        '0' => {
          'name' => 'alpha',
          'offset' => '0',
          'type' => '140'
        },
        '1' => {
          'name' => 'update',
          'offset' => '1',
          'type' => '140'
        },
        '2' => {
          'name' => 'minor',
          'offset' => '2',
          'type' => '140'
        },
        '3' => {
          'name' => 'major',
          'offset' => '3',
          'type' => '140'
        }
      },
      'Name' => 'struct pldm_version',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '401' => {
      'BaseType' => '335',
      'Header' => 'pldm_types.h',
      'Line' => '30',
      'Name' => 'ver32_t',
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '413' => {
      'BaseType' => '401',
      'Name' => 'ver32_t const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '418' => {
      'Name' => 'float',
      'Size' => '4',
      'Type' => 'Intrinsic'
    },
    '453' => {
      'BaseType' => '67',
      'Header' => 'stddef.h',
      'Line' => '214',
      'Name' => 'size_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '733' => {
      'Header' => 'base.h',
      'Line' => '92',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_RESPONSE',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_REQUEST',
          'value' => '1'
        },
        '2' => {
          'name' => 'PLDM_RESERVED',
          'value' => '2'
        },
        '3' => {
          'name' => 'PLDM_ASYNC_REQUEST_NOTIFY',
          'value' => '3'
        }
      },
      'Name' => 'enum MessageType',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '745' => {
      'Header' => 'base.h',
      'Line' => '136',
      'Memb' => {
        '0' => {
          'name' => 'command',
          'offset' => '2',
          'type' => '140'
        }
      },
      'Name' => 'struct pldm_msg_hdr',
      'Size' => '3',
      'Type' => 'Struct'
    },
    '856' => {
      'BaseType' => '745',
      'Name' => 'struct pldm_msg_hdr const',
      'Size' => '3',
      'Type' => 'Const'
    },
    '861' => {
      'Header' => 'base.h',
      'Line' => '169',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '745'
        },
        '1' => {
          'name' => 'payload',
          'offset' => '3',
          'type' => '906'
        }
      },
      'Name' => 'struct pldm_msg',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '901' => {
      'BaseType' => '861',
      'Name' => 'struct pldm_msg const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '906' => {
      'BaseType' => '140',
      'Name' => 'uint8_t[1]',
      'Size' => '1',
      'Type' => 'Array'
    },
    '922' => {
      'Header' => 'base.h',
      'Line' => '195',
      'Memb' => {
        '0' => {
          'name' => 'msg_type',
          'offset' => '0',
          'type' => '733'
        },
        '1' => {
          'name' => 'instance',
          'offset' => '4',
          'type' => '140'
        },
        '2' => {
          'name' => 'pldm_type',
          'offset' => '5',
          'type' => '140'
        },
        '3' => {
          'name' => 'command',
          'offset' => '6',
          'type' => '140'
        },
        '4' => {
          'name' => 'completion_code',
          'offset' => '7',
          'type' => '140'
        }
      },
      'Name' => 'struct pldm_header_info',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '1001' => {
      'BaseType' => '922',
      'Name' => 'struct pldm_header_info const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '1624' => {
      'BaseType' => '861',
      'Name' => 'struct pldm_msg*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2071' => {
      'BaseType' => '901',
      'Name' => 'struct pldm_msg const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2076' => {
      'BaseType' => '140',
      'Name' => 'uint8_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2081' => {
      'BaseType' => '152',
      'Name' => 'uint32_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2976' => {
      'BaseType' => '401',
      'Name' => 'ver32_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '3481' => {
      'BaseType' => '413',
      'Name' => 'ver32_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '3889' => {
      'BaseType' => '318',
      'Name' => 'bitfield8_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '4347' => {
      'BaseType' => '330',
      'Name' => 'bitfield8_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '5123' => {
      'Name' => '_Bool',
      'Size' => '1',
      'Type' => 'Intrinsic'
    },
    '5130' => {
      'BaseType' => '856',
      'Name' => 'struct pldm_msg_hdr const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '5196' => {
      'BaseType' => '922',
      'Name' => 'struct pldm_header_info*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '5287' => {
      'BaseType' => '1001',
      'Name' => 'struct pldm_header_info const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '5292' => {
      'BaseType' => '745',
      'Name' => 'struct pldm_msg_hdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '5342' => {
      'BaseType' => '5352',
      'Name' => 'void const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '5352' => {
      'BaseType' => '1',
      'Name' => 'void const',
      'Type' => 'Const'
    },
    '5504' => {
      'BaseType' => '53',
      'Header' => 'types.h',
      'Line' => '40',
      'Name' => '__uint16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '5568' => {
      'BaseType' => '140',
      'Name' => 'uint8_t const',
      'Size' => '1',
      'Type' => 'Const'
    },
    '5573' => {
      'BaseType' => '5504',
      'Header' => 'stdint-uintn.h',
      'Line' => '25',
      'Name' => 'uint16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '6778' => {
      'Header' => 'utils.h',
      'Line' => '20',
      'Memb' => {
        '0' => {
          'name' => 'ptr',
          'offset' => '0',
          'type' => '6817'
        },
        '1' => {
          'name' => 'length',
          'offset' => '8',
          'type' => '453'
        }
      },
      'Name' => 'struct variable_field',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '6817' => {
      'BaseType' => '5568',
      'Name' => 'uint8_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '7174' => {
      'BaseType' => '6778',
      'Name' => 'struct variable_field*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '9256' => {
      'BaseType' => '5573',
      'Name' => 'uint16_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '9819' => {
      'BaseType' => '453',
      'Name' => 'size_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '12431' => {
      'BaseType' => '74',
      'Header' => 'types.h',
      'Line' => '37',
      'Name' => '__int8_t',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '12462' => {
      'BaseType' => '93',
      'Header' => 'types.h',
      'Line' => '39',
      'Name' => '__int16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '12493' => {
      'BaseType' => '100',
      'Header' => 'types.h',
      'Line' => '41',
      'Name' => '__int32_t',
      'PrivateABI' => 1,
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '12550' => {
      'BaseType' => '133',
      'Name' => 'char*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '12567' => {
      'BaseType' => '133',
      'Name' => 'char const',
      'Size' => '1',
      'Type' => 'Const'
    },
    '12572' => {
      'BaseType' => '12431',
      'Header' => 'stdint-intn.h',
      'Line' => '24',
      'Name' => 'int8_t',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '12584' => {
      'BaseType' => '12462',
      'Header' => 'stdint-intn.h',
      'Line' => '25',
      'Name' => 'int16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '12596' => {
      'BaseType' => '12493',
      'Header' => 'stdint-intn.h',
      'Line' => '26',
      'Name' => 'int32_t',
      'PrivateABI' => 1,
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '12637' => {
      'BaseType' => '5573',
      'Name' => 'uint16_t const',
      'Size' => '2',
      'Type' => 'Const'
    },
    '12654' => {
      'BaseType' => '152',
      'Name' => 'uint32_t const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '12849' => {
      'BaseType' => '140',
      'Header' => 'pldm_types.h',
      'Line' => '32',
      'Name' => 'bool8_t',
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '12861' => {
      'BaseType' => '418',
      'Header' => 'pldm_types.h',
      'Line' => '164',
      'Name' => 'real32_t',
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '12920' => {
      'BaseType' => '453',
      'Name' => 'size_t const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '13466' => {
      'BaseType' => '12567',
      'Name' => 'char const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '14047' => {
      'Header' => 'platform.h',
      'Line' => '250',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_SENSOR_OP_STATE',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_STATE_SENSOR_STATE',
          'value' => '1'
        },
        '2' => {
          'name' => 'PLDM_NUMERIC_SENSOR_STATE',
          'value' => '2'
        }
      },
      'Name' => 'enum sensor_event_class_states',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '14081' => {
      'BaseType' => '14047',
      'Name' => 'enum sensor_event_class_states const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '14304' => {
      'Header' => 'platform.h',
      'Line' => '472',
      'Memb' => {
        '0' => {
          'name' => 'record_handle',
          'offset' => '0',
          'type' => '152'
        },
        '1' => {
          'name' => 'version',
          'offset' => '4',
          'type' => '140'
        },
        '2' => {
          'name' => 'type',
          'offset' => '5',
          'type' => '140'
        },
        '3' => {
          'name' => 'record_change_num',
          'offset' => '6',
          'type' => '5573'
        },
        '4' => {
          'name' => 'length',
          'offset' => '8',
          'type' => '5573'
        }
      },
      'Name' => 'struct pldm_pdr_hdr',
      'Size' => '10',
      'Type' => 'Struct'
    },
    '14383' => {
      'Header' => 'platform.h',
      'Line' => '547',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '14304'
        },
        '1' => {
          'name' => 'terminus_handle',
          'offset' => '16',
          'type' => '5573'
        },
        '2' => {
          'name' => 'sensor_id',
          'offset' => '18',
          'type' => '5573'
        },
        '3' => {
          'name' => 'entity_type',
          'offset' => '20',
          'type' => '5573'
        },
        '4' => {
          'name' => 'entity_instance',
          'offset' => '22',
          'type' => '5573'
        },
        '5' => {
          'name' => 'container_id',
          'offset' => '24',
          'type' => '5573'
        },
        '6' => {
          'name' => 'sensor_init',
          'offset' => '32',
          'type' => '140'
        },
        '7' => {
          'name' => 'sensor_auxiliary_names_pdr',
          'offset' => '33',
          'type' => '12849'
        },
        '8' => {
          'name' => 'composite_sensor_count',
          'offset' => '34',
          'type' => '140'
        },
        '9' => {
          'name' => 'possible_states',
          'offset' => '35',
          'type' => '906'
        }
      },
      'Name' => 'struct pldm_state_sensor_pdr',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '14527' => {
      'Header' => 'platform.h',
      'Line' => '564',
      'Memb' => {
        '0' => {
          'name' => 'state_set_id',
          'offset' => '0',
          'type' => '5573'
        },
        '1' => {
          'name' => 'possible_states_size',
          'offset' => '2',
          'type' => '140'
        },
        '2' => {
          'name' => 'states',
          'offset' => '3',
          'type' => '14585'
        }
      },
      'Name' => 'struct state_sensor_possible_states',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '14580' => {
      'BaseType' => '14527',
      'Name' => 'struct state_sensor_possible_states const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '14585' => {
      'BaseType' => '318',
      'Name' => 'bitfield8_t[1]',
      'Size' => '1',
      'Type' => 'Array'
    },
    '14601' => {
      'Header' => 'platform.h',
      'Line' => '574',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '14304'
        },
        '1' => {
          'name' => 'terminus_handle',
          'offset' => '16',
          'type' => '5573'
        },
        '2' => {
          'name' => 'effecter_id',
          'offset' => '18',
          'type' => '5573'
        },
        '3' => {
          'name' => 'entity_type',
          'offset' => '20',
          'type' => '5573'
        },
        '4' => {
          'name' => 'entity_instance',
          'offset' => '22',
          'type' => '5573'
        },
        '5' => {
          'name' => 'container_id',
          'offset' => '24',
          'type' => '5573'
        },
        '6' => {
          'name' => 'effecter_semantic_id',
          'offset' => '32',
          'type' => '5573'
        },
        '7' => {
          'name' => 'effecter_init',
          'offset' => '34',
          'type' => '140'
        },
        '8' => {
          'name' => 'has_description_pdr',
          'offset' => '35',
          'type' => '12849'
        },
        '9' => {
          'name' => 'composite_effecter_count',
          'offset' => '36',
          'type' => '140'
        },
        '10' => {
          'name' => 'possible_states',
          'offset' => '37',
          'type' => '906'
        }
      },
      'Name' => 'struct pldm_state_effecter_pdr',
      'Size' => '26',
      'Type' => 'Struct'
    },
    '14946' => {
      'Header' => 'platform.h',
      'Line' => '665',
      'Memb' => {
        '0' => {
          'name' => 'value_u8',
          'offset' => '0',
          'type' => '140'
        },
        '1' => {
          'name' => 'value_s8',
          'offset' => '0',
          'type' => '12572'
        },
        '2' => {
          'name' => 'value_u16',
          'offset' => '0',
          'type' => '5573'
        },
        '3' => {
          'name' => 'value_s16',
          'offset' => '0',
          'type' => '12584'
        },
        '4' => {
          'name' => 'value_u32',
          'offset' => '0',
          'type' => '152'
        },
        '5' => {
          'name' => 'value_s32',
          'offset' => '0',
          'type' => '12596'
        },
        '6' => {
          'name' => 'value_f32',
          'offset' => '0',
          'type' => '12861'
        }
      },
      'Name' => 'union union_range_field_format',
      'Size' => '4',
      'Type' => 'Union'
    },
    '15509' => {
      'Header' => 'platform.h',
      'Line' => '722',
      'Memb' => {
        '0' => {
          'name' => 'value_u8',
          'offset' => '0',
          'type' => '140'
        },
        '1' => {
          'name' => 'value_s8',
          'offset' => '0',
          'type' => '12572'
        },
        '2' => {
          'name' => 'value_u16',
          'offset' => '0',
          'type' => '5573'
        },
        '3' => {
          'name' => 'value_s16',
          'offset' => '0',
          'type' => '12584'
        },
        '4' => {
          'name' => 'value_u32',
          'offset' => '0',
          'type' => '152'
        },
        '5' => {
          'name' => 'value_s32',
          'offset' => '0',
          'type' => '12596'
        }
      },
      'Name' => 'union union_sensor_data_size',
      'Size' => '4',
      'Type' => 'Union'
    },
    '15521' => {
      'Header' => 'platform.h',
      'Line' => '729',
      'Memb' => {
        '0' => {
          'name' => 'record_handle',
          'offset' => '0',
          'type' => '152'
        },
        '1' => {
          'name' => 'version',
          'offset' => '4',
          'type' => '140'
        },
        '2' => {
          'name' => 'type',
          'offset' => '5',
          'type' => '140'
        },
        '3' => {
          'name' => 'record_change_num',
          'offset' => '6',
          'type' => '5573'
        },
        '4' => {
          'name' => 'length',
          'offset' => '8',
          'type' => '5573'
        }
      },
      'Name' => 'struct pldm_value_pdr_hdr',
      'Size' => '12',
      'Type' => 'Struct'
    },
    '15600' => {
      'Header' => 'platform.h',
      'Line' => '747',
      'Memb' => {
        '0' => {
          'name' => 'entity_instance_num',
          'offset' => '0',
          'type' => '5573'
        },
        '1' => {
          'name' => 'entity_instance',
          'offset' => '0',
          'type' => '5573'
        }
      },
      'Name' => 'anon-union-platform.h-747',
      'Size' => '2',
      'Type' => 'Union'
    },
    '15634' => {
      'Header' => 'platform.h',
      'Line' => '742',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '15521'
        },
        '1' => {
          'name' => 'terminus_handle',
          'offset' => '18',
          'type' => '5573'
        },
        '2' => {
          'name' => 'sensor_id',
          'offset' => '20',
          'type' => '5573'
        },
        '3' => {
          'name' => 'entity_type',
          'offset' => '22',
          'type' => '5573'
        },
        '4' => {
          'name' => 'unnamed0',
          'offset' => '24',
          'type' => '15600'
        },
        '5' => {
          'name' => 'container_id',
          'offset' => '32',
          'type' => '5573'
        },
        '6' => {
          'name' => 'sensor_init',
          'offset' => '34',
          'type' => '140'
        },
        '7' => {
          'name' => 'sensor_auxiliary_names_pdr',
          'offset' => '35',
          'type' => '12849'
        },
        '8' => {
          'name' => 'base_unit',
          'offset' => '36',
          'type' => '140'
        },
        '9' => {
          'name' => 'unit_modifier',
          'offset' => '37',
          'type' => '12572'
        },
        '10' => {
          'name' => 'rate_unit',
          'offset' => '38',
          'type' => '140'
        },
        '11' => {
          'name' => 'base_oem_unit_handle',
          'offset' => '39',
          'type' => '140'
        },
        '12' => {
          'name' => 'aux_unit',
          'offset' => '40',
          'type' => '140'
        },
        '13' => {
          'name' => 'aux_unit_modifier',
          'offset' => '41',
          'type' => '12572'
        },
        '14' => {
          'name' => 'aux_rate_unit',
          'offset' => '48',
          'type' => '140'
        },
        '15' => {
          'name' => 'rel',
          'offset' => '49',
          'type' => '140'
        },
        '16' => {
          'name' => 'aux_oem_unit_handle',
          'offset' => '50',
          'type' => '140'
        },
        '17' => {
          'name' => 'is_linear',
          'offset' => '51',
          'type' => '12849'
        },
        '18' => {
          'name' => 'sensor_data_size',
          'offset' => '52',
          'type' => '140'
        },
        '19' => {
          'name' => 'resolution',
          'offset' => '54',
          'type' => '12861'
        },
        '20' => {
          'name' => 'offset',
          'offset' => '64',
          'type' => '12861'
        },
        '21' => {
          'name' => 'accuracy',
          'offset' => '68',
          'type' => '5573'
        },
        '22' => {
          'name' => 'plus_tolerance',
          'offset' => '70',
          'type' => '140'
        },
        '23' => {
          'name' => 'minus_tolerance',
          'offset' => '71',
          'type' => '140'
        },
        '24' => {
          'name' => 'hysteresis',
          'offset' => '72',
          'type' => '15509'
        },
        '25' => {
          'name' => 'supported_thresholds',
          'offset' => '82',
          'type' => '318'
        },
        '26' => {
          'name' => 'threshold_and_hysteresis_volatility',
          'offset' => '83',
          'type' => '318'
        },
        '27' => {
          'name' => 'state_transition_interval',
          'offset' => '86',
          'type' => '12861'
        },
        '28' => {
          'name' => 'update_interval',
          'offset' => '96',
          'type' => '12861'
        },
        '29' => {
          'name' => 'max_readable',
          'offset' => '100',
          'type' => '15509'
        },
        '30' => {
          'name' => 'min_readable',
          'offset' => '104',
          'type' => '15509'
        },
        '31' => {
          'name' => 'range_field_format',
          'offset' => '114',
          'type' => '140'
        },
        '32' => {
          'name' => 'range_field_support',
          'offset' => '115',
          'type' => '318'
        },
        '33' => {
          'name' => 'nominal_value',
          'offset' => '118',
          'type' => '14946'
        },
        '34' => {
          'name' => 'normal_max',
          'offset' => '128',
          'type' => '14946'
        },
        '35' => {
          'name' => 'normal_min',
          'offset' => '132',
          'type' => '14946'
        },
        '36' => {
          'name' => 'warning_high',
          'offset' => '136',
          'type' => '14946'
        },
        '37' => {
          'name' => 'warning_low',
          'offset' => '146',
          'type' => '14946'
        },
        '38' => {
          'name' => 'critical_high',
          'offset' => '150',
          'type' => '14946'
        },
        '39' => {
          'name' => 'critical_low',
          'offset' => '256',
          'type' => '14946'
        },
        '40' => {
          'name' => 'fatal_high',
          'offset' => '260',
          'type' => '14946'
        },
        '41' => {
          'name' => 'fatal_low',
          'offset' => '264',
          'type' => '14946'
        }
      },
      'Name' => 'struct pldm_numeric_sensor_value_pdr',
      'Size' => '112',
      'Type' => 'Struct'
    },
    '16187' => {
      'Header' => 'platform.h',
      'Line' => '794',
      'Memb' => {
        '0' => {
          'name' => 'state_set_id',
          'offset' => '0',
          'type' => '5573'
        },
        '1' => {
          'name' => 'possible_states_size',
          'offset' => '2',
          'type' => '140'
        },
        '2' => {
          'name' => 'states',
          'offset' => '3',
          'type' => '14585'
        }
      },
      'Name' => 'struct state_effecter_possible_states',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '16240' => {
      'BaseType' => '16187',
      'Name' => 'struct state_effecter_possible_states const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '16245' => {
      'Header' => 'platform.h',
      'Line' => '842',
      'Memb' => {
        '0' => {
          'name' => 'set_request',
          'offset' => '0',
          'type' => '140'
        },
        '1' => {
          'name' => 'effecter_state',
          'offset' => '1',
          'type' => '140'
        }
      },
      'Name' => 'struct state_field_for_state_effecter_set',
      'Size' => '2',
      'Type' => 'Struct'
    },
    '16285' => {
      'BaseType' => '16245',
      'Header' => 'platform.h',
      'Line' => '845',
      'Name' => 'set_effecter_state_field',
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '16297' => {
      'Header' => 'platform.h',
      'Line' => '851',
      'Memb' => {
        '0' => {
          'name' => 'sensor_op_state',
          'offset' => '0',
          'type' => '140'
        },
        '1' => {
          'name' => 'present_state',
          'offset' => '1',
          'type' => '140'
        },
        '2' => {
          'name' => 'previous_state',
          'offset' => '2',
          'type' => '140'
        },
        '3' => {
          'name' => 'event_state',
          'offset' => '3',
          'type' => '140'
        }
      },
      'Name' => 'struct state_field_for_get_state_sensor_readings',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '16363' => {
      'BaseType' => '16297',
      'Header' => 'platform.h',
      'Line' => '859',
      'Name' => 'get_sensor_state_field',
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '16562' => {
      'BaseType' => '140',
      'Name' => 'uint8_t[13]',
      'Size' => '13',
      'Type' => 'Array'
    },
    '17044' => {
      'Header' => 'platform.h',
      'Line' => '996',
      'Memb' => {
        '0' => {
          'name' => 'sensor_id',
          'offset' => '0',
          'type' => '5573'
        },
        '1' => {
          'name' => 'sensor_event_class_type',
          'offset' => '2',
          'type' => '140'
        },
        '2' => {
          'name' => 'event_class',
          'offset' => '3',
          'type' => '906'
        }
      },
      'Name' => 'struct pldm_sensor_event_data',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '17256' => {
      'Header' => 'platform.h',
      'Line' => '1077',
      'Memb' => {
        '0' => {
          'name' => 'event_data_format',
          'offset' => '0',
          'type' => '140'
        },
        '1' => {
          'name' => 'number_of_change_records',
          'offset' => '1',
          'type' => '140'
        },
        '2' => {
          'name' => 'change_records',
          'offset' => '2',
          'type' => '906'
        }
      },
      'Name' => 'struct pldm_pdr_repository_chg_event_data',
      'Size' => '3',
      'Type' => 'Struct'
    },
    '21344' => {
      'BaseType' => '126',
      'Name' => 'void**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '25643' => {
      'BaseType' => '9819',
      'Name' => 'size_t*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '27258' => {
      'BaseType' => '27268',
      'Name' => 'uint32_t const*const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '27263' => {
      'BaseType' => '12654',
      'Name' => 'uint32_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '27268' => {
      'BaseType' => '27263',
      'Name' => 'uint32_t const*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '27273' => {
      'BaseType' => '17256',
      'Name' => 'struct pldm_pdr_repository_chg_event_data*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '33537' => {
      'BaseType' => '15634',
      'Name' => 'struct pldm_numeric_sensor_value_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '40169' => {
      'BaseType' => '17044',
      'Name' => 'struct pldm_sensor_event_data*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '40174' => {
      'BaseType' => '40169',
      'Name' => 'struct pldm_sensor_event_data*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '41175' => {
      'BaseType' => '16363',
      'Name' => 'get_sensor_state_field*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '46768' => {
      'BaseType' => '16285',
      'Name' => 'set_effecter_state_field*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '47735' => {
      'BaseType' => '14383',
      'Name' => 'struct pldm_state_sensor_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '47740' => {
      'BaseType' => '47735',
      'Name' => 'struct pldm_state_sensor_pdr*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '47745' => {
      'BaseType' => '14580',
      'Name' => 'struct state_sensor_possible_states const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '47750' => {
      'BaseType' => '47745',
      'Name' => 'struct state_sensor_possible_states const*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '48137' => {
      'BaseType' => '14601',
      'Name' => 'struct pldm_state_effecter_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '48142' => {
      'BaseType' => '48137',
      'Name' => 'struct pldm_state_effecter_pdr*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '48147' => {
      'BaseType' => '16240',
      'Name' => 'struct state_effecter_possible_states const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '48152' => {
      'BaseType' => '48147',
      'Name' => 'struct state_effecter_possible_states const*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '53685' => {
      'BaseType' => '67',
      'Header' => 'types.h',
      'Line' => '45',
      'Name' => '__uint64_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '53704' => {
      'BaseType' => '119',
      'Header' => 'types.h',
      'Line' => '194',
      'Name' => '__ssize_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '53779' => {
      'BaseType' => '53685',
      'Header' => 'stdint-uintn.h',
      'Line' => '27',
      'Name' => 'uint64_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '53925' => {
      'Header' => 'bios.h',
      'Line' => '39',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_BIOS_STRING_TABLE',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_BIOS_ATTR_TABLE',
          'value' => '1'
        },
        '2' => {
          'name' => 'PLDM_BIOS_ATTR_VAL_TABLE',
          'value' => '2'
        }
      },
      'Name' => 'enum pldm_bios_table_types',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '53959' => {
      'Header' => 'bios.h',
      'Line' => '48',
      'Memb' => {
        '0' => {
          'name' => 'string_handle',
          'offset' => '0',
          'type' => '5573'
        },
        '1' => {
          'name' => 'string_length',
          'offset' => '2',
          'type' => '5573'
        },
        '2' => {
          'name' => 'name',
          'offset' => '4',
          'type' => '54016'
        }
      },
      'Name' => 'struct pldm_bios_string_table_entry',
      'Size' => '5',
      'Type' => 'Struct'
    },
    '54011' => {
      'BaseType' => '53959',
      'Name' => 'struct pldm_bios_string_table_entry const',
      'Size' => '5',
      'Type' => 'Const'
    },
    '54016' => {
      'BaseType' => '133',
      'Name' => 'char[1]',
      'Size' => '1',
      'Type' => 'Array'
    },
    '54032' => {
      'Header' => 'bios.h',
      'Line' => '54',
      'Memb' => {
        '0' => {
          'name' => 'attr_handle',
          'offset' => '0',
          'type' => '5573'
        },
        '1' => {
          'name' => 'attr_type',
          'offset' => '2',
          'type' => '140'
        },
        '2' => {
          'name' => 'string_handle',
          'offset' => '3',
          'type' => '5573'
        },
        '3' => {
          'name' => 'metadata',
          'offset' => '5',
          'type' => '906'
        }
      },
      'Name' => 'struct pldm_bios_attr_table_entry',
      'Size' => '6',
      'Type' => 'Struct'
    },
    '54097' => {
      'BaseType' => '54032',
      'Name' => 'struct pldm_bios_attr_table_entry const',
      'Size' => '6',
      'Type' => 'Const'
    },
    '54102' => {
      'Header' => 'bios.h',
      'Line' => '66',
      'Memb' => {
        '0' => {
          'name' => 'attr_handle',
          'offset' => '0',
          'type' => '5573'
        },
        '1' => {
          'name' => 'attr_type',
          'offset' => '2',
          'type' => '140'
        },
        '2' => {
          'name' => 'value',
          'offset' => '3',
          'type' => '906'
        }
      },
      'Name' => 'struct pldm_bios_attr_val_table_entry',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '54154' => {
      'BaseType' => '54102',
      'Name' => 'struct pldm_bios_attr_val_table_entry const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '54223' => {
      'Header' => 'bios_table.h',
      'Line' => '206',
      'Memb' => {
        '0' => {
          'name' => 'name_handle',
          'offset' => '0',
          'type' => '5573'
        },
        '1' => {
          'name' => 'read_only',
          'offset' => '2',
          'type' => '5123'
        },
        '2' => {
          'name' => 'pv_num',
          'offset' => '3',
          'type' => '140'
        },
        '3' => {
          'name' => 'pv_handle',
          'offset' => '8',
          'type' => '54326'
        },
        '4' => {
          'name' => 'def_num',
          'offset' => '22',
          'type' => '140'
        },
        '5' => {
          'name' => 'def_index',
          'offset' => '36',
          'type' => '6817'
        }
      },
      'Name' => 'struct pldm_bios_table_attr_entry_enum_info',
      'Size' => '32',
      'Type' => 'Struct'
    },
    '54314' => {
      'BaseType' => '54223',
      'Name' => 'struct pldm_bios_table_attr_entry_enum_info const',
      'Size' => '32',
      'Type' => 'Const'
    },
    '54326' => {
      'BaseType' => '12637',
      'Name' => 'uint16_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '54336' => {
      'Header' => 'bios_table.h',
      'Line' => '294',
      'Memb' => {
        '0' => {
          'name' => 'name_handle',
          'offset' => '0',
          'type' => '5573'
        },
        '1' => {
          'name' => 'read_only',
          'offset' => '2',
          'type' => '5123'
        },
        '2' => {
          'name' => 'string_type',
          'offset' => '3',
          'type' => '140'
        },
        '3' => {
          'name' => 'min_length',
          'offset' => '4',
          'type' => '5573'
        },
        '4' => {
          'name' => 'max_length',
          'offset' => '6',
          'type' => '5573'
        },
        '5' => {
          'name' => 'def_length',
          'offset' => '8',
          'type' => '5573'
        },
        '6' => {
          'name' => 'def_string',
          'offset' => '22',
          'type' => '13466'
        }
      },
      'Name' => 'struct pldm_bios_table_attr_entry_string_info',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '54448' => {
      'BaseType' => '54336',
      'Name' => 'struct pldm_bios_table_attr_entry_string_info const',
      'Size' => '24',
      'Type' => 'Const'
    },
    '54458' => {
      'Header' => 'bios_table.h',
      'Line' => '384',
      'Memb' => {
        '0' => {
          'name' => 'name_handle',
          'offset' => '0',
          'type' => '5573'
        },
        '1' => {
          'name' => 'read_only',
          'offset' => '2',
          'type' => '5123'
        },
        '2' => {
          'name' => 'lower_bound',
          'offset' => '8',
          'type' => '53779'
        },
        '3' => {
          'name' => 'upper_bound',
          'offset' => '22',
          'type' => '53779'
        },
        '4' => {
          'name' => 'scalar_increment',
          'offset' => '36',
          'type' => '152'
        },
        '5' => {
          'name' => 'default_value',
          'offset' => '50',
          'type' => '53779'
        }
      },
      'Name' => 'struct pldm_bios_table_attr_entry_integer_info',
      'Size' => '40',
      'Type' => 'Struct'
    },
    '54556' => {
      'BaseType' => '54458',
      'Name' => 'struct pldm_bios_table_attr_entry_integer_info const',
      'Size' => '40',
      'Type' => 'Const'
    },
    '54561' => {
      'BaseType' => '53704',
      'Header' => 'types.h',
      'Line' => '108',
      'Name' => 'ssize_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '54839' => {
      'Name' => 'ssize_t(*)(void const*)',
      'Param' => {
        '0' => {
          'type' => '5342'
        }
      },
      'Return' => '54561',
      'Size' => '8',
      'Type' => 'FuncPtr'
    },
    '54909' => {
      'Line' => '938',
      'Memb' => {
        '0' => {
          'name' => 'table_data',
          'offset' => '0',
          'type' => '6817'
        },
        '1' => {
          'name' => 'table_len',
          'offset' => '8',
          'type' => '453'
        },
        '2' => {
          'name' => 'current_pos',
          'offset' => '22',
          'type' => '453'
        },
        '3' => {
          'name' => 'entry_length_handler',
          'offset' => '36',
          'type' => '54839'
        }
      },
      'Name' => 'struct pldm_bios_table_iter',
      'PrivateABI' => 1,
      'Size' => '32',
      'Source' => 'bios_table.c',
      'Type' => 'Struct'
    },
    '54979' => {
      'BaseType' => '54909',
      'Name' => 'struct pldm_bios_table_iter const',
      'Size' => '32',
      'Type' => 'Const'
    },
    '56049' => {
      'BaseType' => '54909',
      'Name' => 'struct pldm_bios_table_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '56054' => {
      'BaseType' => '54154',
      'Name' => 'struct pldm_bios_attr_val_table_entry const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '56468' => {
      'BaseType' => '54097',
      'Name' => 'struct pldm_bios_attr_table_entry const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '57072' => {
      'BaseType' => '54011',
      'Name' => 'struct pldm_bios_string_table_entry const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '58235' => {
      'BaseType' => '54979',
      'Name' => 'struct pldm_bios_table_iter const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '62508' => {
      'BaseType' => '53779',
      'Name' => 'uint64_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '62785' => {
      'BaseType' => '54556',
      'Name' => 'struct pldm_bios_table_attr_entry_integer_info const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '63094' => {
      'BaseType' => '13466',
      'Name' => 'char const**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '64266' => {
      'BaseType' => '54448',
      'Name' => 'struct pldm_bios_table_attr_entry_string_info const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '65766' => {
      'BaseType' => '54314',
      'Name' => 'struct pldm_bios_table_attr_entry_enum_info const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '67984' => {
      'Header' => 'pldm_types.h',
      'Line' => '36',
      'Name' => 'anon-struct-pldm_types.h-36',
      'Size' => '2',
      'Type' => 'Struct'
    },
    '68248' => {
      'Header' => 'pldm_types.h',
      'Line' => '54',
      'Memb' => {
        '0' => {
          'name' => 'value',
          'offset' => '0',
          'type' => '5573'
        },
        '1' => {
          'name' => 'bits',
          'offset' => '0',
          'type' => '67984'
        }
      },
      'Name' => 'union bitfield16_t',
      'Size' => '2',
      'Type' => 'Union'
    },
    '68260' => {
      'Header' => 'pldm_types.h',
      'Line' => '58',
      'Name' => 'anon-struct-pldm_types.h-58',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '68748' => {
      'Header' => 'pldm_types.h',
      'Line' => '92',
      'Memb' => {
        '0' => {
          'name' => 'value',
          'offset' => '0',
          'type' => '152'
        },
        '1' => {
          'name' => 'bits',
          'offset' => '0',
          'type' => '68260'
        }
      },
      'Name' => 'union bitfield32_t',
      'Size' => '4',
      'Type' => 'Union'
    },
    '68760' => {
      'Header' => 'pldm_types.h',
      'Line' => '96',
      'Name' => 'anon-struct-pldm_types.h-96',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '69696' => {
      'Header' => 'pldm_types.h',
      'Line' => '162',
      'Memb' => {
        '0' => {
          'name' => 'value',
          'offset' => '0',
          'type' => '53779'
        },
        '1' => {
          'name' => 'bits',
          'offset' => '0',
          'type' => '68760'
        }
      },
      'Name' => 'union bitfield64_t',
      'Size' => '8',
      'Type' => 'Union'
    },
    '71468' => {
      'Header' => 'firmware_update.h',
      'Line' => '372',
      'Memb' => {
        '0' => {
          'name' => 'uuid',
          'offset' => '0',
          'type' => '71572'
        },
        '1' => {
          'name' => 'package_header_format_version',
          'offset' => '22',
          'type' => '140'
        },
        '2' => {
          'name' => 'package_header_size',
          'offset' => '23',
          'type' => '5573'
        },
        '3' => {
          'name' => 'package_release_date_time',
          'offset' => '25',
          'type' => '16562'
        },
        '4' => {
          'name' => 'component_bitmap_bit_length',
          'offset' => '50',
          'type' => '5573'
        },
        '5' => {
          'name' => 'package_version_string_type',
          'offset' => '52',
          'type' => '140'
        },
        '6' => {
          'name' => 'package_version_string_length',
          'offset' => '53',
          'type' => '140'
        }
      },
      'Name' => 'struct pldm_package_header_information',
      'Size' => '36',
      'Type' => 'Struct'
    },
    '71572' => {
      'BaseType' => '140',
      'Name' => 'uint8_t[16]',
      'Size' => '16',
      'Type' => 'Array'
    },
    '71604' => {
      'Header' => 'firmware_update.h',
      'Line' => '386',
      'Memb' => {
        '0' => {
          'name' => 'record_length',
          'offset' => '0',
          'type' => '5573'
        },
        '1' => {
          'name' => 'descriptor_count',
          'offset' => '2',
          'type' => '140'
        },
        '2' => {
          'name' => 'device_update_option_flags',
          'offset' => '3',
          'type' => '68748'
        },
        '3' => {
          'name' => 'comp_image_set_version_string_type',
          'offset' => '7',
          'type' => '140'
        },
        '4' => {
          'name' => 'comp_image_set_version_string_length',
          'offset' => '8',
          'type' => '140'
        },
        '5' => {
          'name' => 'fw_device_pkg_data_length',
          'offset' => '9',
          'type' => '5573'
        }
      },
      'Name' => 'struct pldm_firmware_device_id_record',
      'Size' => '11',
      'Type' => 'Struct'
    },
    '71799' => {
      'Header' => 'firmware_update.h',
      'Line' => '420',
      'Memb' => {
        '0' => {
          'name' => 'comp_classification',
          'offset' => '0',
          'type' => '5573'
        },
        '1' => {
          'name' => 'comp_identifier',
          'offset' => '2',
          'type' => '5573'
        },
        '2' => {
          'name' => 'comp_comparison_stamp',
          'offset' => '4',
          'type' => '152'
        },
        '3' => {
          'name' => 'comp_options',
          'offset' => '8',
          'type' => '68248'
        },
        '4' => {
          'name' => 'requested_comp_activation_method',
          'offset' => '16',
          'type' => '68248'
        },
        '5' => {
          'name' => 'comp_location_offset',
          'offset' => '18',
          'type' => '152'
        },
        '6' => {
          'name' => 'comp_size',
          'offset' => '22',
          'type' => '152'
        },
        '7' => {
          'name' => 'comp_version_string_type',
          'offset' => '32',
          'type' => '140'
        },
        '8' => {
          'name' => 'comp_version_string_length',
          'offset' => '33',
          'type' => '140'
        }
      },
      'Name' => 'struct pldm_component_image_information',
      'Size' => '22',
      'Type' => 'Struct'
    },
    '71981' => {
      'Header' => 'firmware_update.h',
      'Line' => '446',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '140'
        },
        '1' => {
          'name' => 'capabilities_during_update',
          'offset' => '1',
          'type' => '68748'
        },
        '2' => {
          'name' => 'comp_count',
          'offset' => '5',
          'type' => '5573'
        },
        '3' => {
          'name' => 'active_comp_image_set_ver_str_type',
          'offset' => '7',
          'type' => '140'
        },
        '4' => {
          'name' => 'active_comp_image_set_ver_str_len',
          'offset' => '8',
          'type' => '140'
        },
        '5' => {
          'name' => 'pending_comp_image_set_ver_str_type',
          'offset' => '9',
          'type' => '140'
        },
        '6' => {
          'name' => 'pending_comp_image_set_ver_str_len',
          'offset' => '16',
          'type' => '140'
        }
      },
      'Name' => 'struct pldm_get_firmware_parameters_resp',
      'Size' => '11',
      'Type' => 'Struct'
    },
    '72163' => {
      'Header' => 'firmware_update.h',
      'Line' => '474',
      'Memb' => {
        '0' => {
          'name' => 'comp_classification',
          'offset' => '0',
          'type' => '5573'
        },
        '1' => {
          'name' => 'comp_identifier',
          'offset' => '2',
          'type' => '5573'
        },
        '2' => {
          'name' => 'comp_classification_index',
          'offset' => '4',
          'type' => '140'
        },
        '3' => {
          'name' => 'active_comp_comparison_stamp',
          'offset' => '5',
          'type' => '152'
        },
        '4' => {
          'name' => 'active_comp_ver_str_type',
          'offset' => '9',
          'type' => '140'
        },
        '5' => {
          'name' => 'active_comp_ver_str_len',
          'offset' => '16',
          'type' => '140'
        },
        '6' => {
          'name' => 'active_comp_release_date',
          'offset' => '17',
          'type' => '72345'
        },
        '7' => {
          'name' => 'pending_comp_comparison_stamp',
          'offset' => '25',
          'type' => '152'
        },
        '8' => {
          'name' => 'pending_comp_ver_str_type',
          'offset' => '35',
          'type' => '140'
        },
        '9' => {
          'name' => 'pending_comp_ver_str_len',
          'offset' => '36',
          'type' => '140'
        },
        '10' => {
          'name' => 'pending_comp_release_date',
          'offset' => '37',
          'type' => '72345'
        },
        '11' => {
          'name' => 'comp_activation_methods',
          'offset' => '51',
          'type' => '68248'
        },
        '12' => {
          'name' => 'capabilities_during_update',
          'offset' => '53',
          'type' => '68748'
        }
      },
      'Name' => 'struct pldm_component_parameter_entry',
      'Size' => '39',
      'Type' => 'Struct'
    },
    '72345' => {
      'BaseType' => '140',
      'Name' => 'uint8_t[8]',
      'Size' => '8',
      'Type' => 'Array'
    },
    '73283' => {
      'BaseType' => '6778',
      'Name' => 'struct variable_field const',
      'Size' => '16',
      'Type' => 'Const'
    },
    '73626' => {
      'BaseType' => '12849',
      'Name' => 'bool8_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '73631' => {
      'BaseType' => '69696',
      'Name' => 'bitfield64_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '74402' => {
      'BaseType' => '68748',
      'Name' => 'bitfield32_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '75269' => {
      'BaseType' => '68248',
      'Name' => 'bitfield16_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '76853' => {
      'BaseType' => '73283',
      'Name' => 'struct variable_field const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '80062' => {
      'BaseType' => '72163',
      'Name' => 'struct pldm_component_parameter_entry*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '80293' => {
      'BaseType' => '71981',
      'Name' => 'struct pldm_get_firmware_parameters_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '80600' => {
      'BaseType' => '2076',
      'Name' => 'uint8_t**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '80904' => {
      'BaseType' => '71799',
      'Name' => 'struct pldm_component_image_information*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '81535' => {
      'BaseType' => '71604',
      'Name' => 'struct pldm_firmware_device_id_record*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '81845' => {
      'BaseType' => '71468',
      'Name' => 'struct pldm_package_header_information*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '90932' => {
      'BaseType' => '90949',
      'Header' => 'pdr.h',
      'Line' => '16',
      'Name' => 'pldm_pdr',
      'PrivateABI' => 1,
      'Size' => '24',
      'Type' => 'Typedef'
    },
    '90944' => {
      'BaseType' => '90932',
      'Name' => 'pldm_pdr const',
      'Size' => '24',
      'Type' => 'Const'
    },
    '90949' => {
      'Line' => '20',
      'Memb' => {
        '0' => {
          'name' => 'record_count',
          'offset' => '0',
          'type' => '152'
        },
        '1' => {
          'name' => 'size',
          'offset' => '4',
          'type' => '152'
        },
        '2' => {
          'name' => 'first',
          'offset' => '8',
          'type' => '92083'
        },
        '3' => {
          'name' => 'last',
          'offset' => '22',
          'type' => '92083'
        }
      },
      'Name' => 'struct pldm_pdr',
      'PrivateABI' => 1,
      'Size' => '24',
      'Source' => 'pdr.c',
      'Type' => 'Struct'
    },
    '91009' => {
      'BaseType' => '91026',
      'Header' => 'pdr.h',
      'Line' => '21',
      'Name' => 'pldm_pdr_record',
      'PrivateABI' => 1,
      'Size' => '32',
      'Type' => 'Typedef'
    },
    '91021' => {
      'BaseType' => '91009',
      'Name' => 'pldm_pdr_record const',
      'Size' => '32',
      'Type' => 'Const'
    },
    '91026' => {
      'Line' => '11',
      'Memb' => {
        '0' => {
          'name' => 'record_handle',
          'offset' => '0',
          'type' => '152'
        },
        '1' => {
          'name' => 'size',
          'offset' => '4',
          'type' => '152'
        },
        '2' => {
          'name' => 'data',
          'offset' => '8',
          'type' => '2076'
        },
        '3' => {
          'name' => 'next',
          'offset' => '22',
          'type' => '92071'
        },
        '4' => {
          'name' => 'is_remote',
          'offset' => '36',
          'type' => '5123'
        },
        '5' => {
          'name' => 'terminus_handle',
          'offset' => '38',
          'type' => '5573'
        }
      },
      'Name' => 'struct pldm_pdr_record',
      'PrivateABI' => 1,
      'Size' => '32',
      'Source' => 'pdr.c',
      'Type' => 'Struct'
    },
    '91110' => {
      'Header' => 'pdr.h',
      'Line' => '275',
      'Memb' => {
        '0' => {
          'name' => 'entity_type',
          'offset' => '0',
          'type' => '5573'
        },
        '1' => {
          'name' => 'entity_instance_num',
          'offset' => '2',
          'type' => '5573'
        },
        '2' => {
          'name' => 'entity_container_id',
          'offset' => '4',
          'type' => '5573'
        }
      },
      'Name' => 'struct pldm_entity',
      'Size' => '6',
      'Type' => 'Struct'
    },
    '91167' => {
      'BaseType' => '91110',
      'Header' => 'pdr.h',
      'Line' => '279',
      'Name' => 'pldm_entity',
      'Size' => '6',
      'Type' => 'Typedef'
    },
    '91211' => {
      'BaseType' => '91223',
      'Header' => 'pdr.h',
      'Line' => '289',
      'Name' => 'pldm_entity_association_tree',
      'PrivateABI' => 1,
      'Size' => '16',
      'Type' => 'Typedef'
    },
    '91223' => {
      'Line' => '435',
      'Memb' => {
        '0' => {
          'name' => 'root',
          'offset' => '0',
          'type' => '92088'
        },
        '1' => {
          'name' => 'last_used_container_id',
          'offset' => '8',
          'type' => '5573'
        }
      },
      'Name' => 'struct pldm_entity_association_tree',
      'PrivateABI' => 1,
      'Size' => '16',
      'Source' => 'pdr.c',
      'Type' => 'Struct'
    },
    '91266' => {
      'BaseType' => '91283',
      'Header' => 'pdr.h',
      'Line' => '294',
      'Name' => 'pldm_entity_node',
      'PrivateABI' => 1,
      'Size' => '40',
      'Type' => 'Typedef'
    },
    '91278' => {
      'BaseType' => '91266',
      'Name' => 'pldm_entity_node const',
      'Size' => '40',
      'Type' => 'Const'
    },
    '91283' => {
      'Line' => '440',
      'Memb' => {
        '0' => {
          'name' => 'entity',
          'offset' => '0',
          'type' => '91167'
        },
        '1' => {
          'name' => 'parent',
          'offset' => '6',
          'type' => '91167'
        },
        '2' => {
          'name' => 'remote_container_id',
          'offset' => '18',
          'type' => '5573'
        },
        '3' => {
          'name' => 'first_child',
          'offset' => '22',
          'type' => '92088'
        },
        '4' => {
          'name' => 'next_sibling',
          'offset' => '36',
          'type' => '92088'
        },
        '5' => {
          'name' => 'association_type',
          'offset' => '50',
          'type' => '140'
        }
      },
      'Name' => 'struct pldm_entity_node',
      'PrivateABI' => 1,
      'Size' => '40',
      'Source' => 'pdr.c',
      'Type' => 'Struct'
    },
    '92071' => {
      'BaseType' => '91026',
      'Name' => 'struct pldm_pdr_record*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '92083' => {
      'BaseType' => '91009',
      'Name' => 'pldm_pdr_record*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '92088' => {
      'BaseType' => '91266',
      'Name' => 'pldm_entity_node*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '92481' => {
      'BaseType' => '92486',
      'Name' => 'pldm_entity**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '92486' => {
      'BaseType' => '91167',
      'Name' => 'pldm_entity*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '92550' => {
      'BaseType' => '91211',
      'Name' => 'pldm_entity_association_tree*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '92997' => {
      'BaseType' => '92088',
      'Name' => 'pldm_entity_node**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '93786' => {
      'BaseType' => '90944',
      'Name' => 'pldm_pdr const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '94039' => {
      'BaseType' => '90932',
      'Name' => 'pldm_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '99148' => {
      'BaseType' => '91278',
      'Name' => 'pldm_entity_node const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '100312' => {
      'BaseType' => '91021',
      'Name' => 'pldm_pdr_record const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '103400' => {
      'BaseType' => '140',
      'Header' => 'base.h',
      'Line' => '16',
      'Name' => 'pldm_tid_t',
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '103412' => {
      'BaseType' => '140',
      'Header' => 'instance-id.h',
      'Line' => '13',
      'Name' => 'pldm_instance_id_t',
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '103424' => {
      'Header' => 'responder.h',
      'Line' => '10',
      'Memb' => {
        '0' => {
          'name' => 'tid',
          'offset' => '0',
          'type' => '103400'
        },
        '1' => {
          'name' => 'instance_id',
          'offset' => '1',
          'type' => '103412'
        },
        '2' => {
          'name' => 'type',
          'offset' => '2',
          'type' => '140'
        },
        '3' => {
          'name' => 'command',
          'offset' => '3',
          'type' => '140'
        },
        '4' => {
          'name' => 'next',
          'offset' => '8',
          'type' => '103504'
        }
      },
      'Name' => 'struct pldm_responder_cookie',
      'PrivateABI' => 1,
      'Size' => '16',
      'Type' => 'Struct'
    },
    '103504' => {
      'BaseType' => '103424',
      'Name' => 'struct pldm_responder_cookie*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '103509' => {
      'Header' => 'pldm.h',
      'Line' => '15',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_REQUESTER_SUCCESS',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_REQUESTER_OPEN_FAIL',
          'value' => '18446744073709551615 (-1)'
        },
        '2' => {
          'name' => 'PLDM_REQUESTER_NOT_PLDM_MSG',
          'value' => '18446744073709551614 (-2)'
        },
        '3' => {
          'name' => 'PLDM_REQUESTER_NOT_RESP_MSG',
          'value' => '18446744073709551613 (-3)'
        },
        '4' => {
          'name' => 'PLDM_REQUESTER_NOT_REQ_MSG',
          'value' => '18446744073709551612 (-4)'
        },
        '5' => {
          'name' => 'PLDM_REQUESTER_RESP_MSG_TOO_SMALL',
          'value' => '18446744073709551611 (-5)'
        },
        '6' => {
          'name' => 'PLDM_REQUESTER_INSTANCE_ID_MISMATCH',
          'value' => '18446744073709551610 (-6)'
        },
        '7' => {
          'name' => 'PLDM_REQUESTER_SEND_FAIL',
          'value' => '18446744073709551609 (-7)'
        },
        '8' => {
          'name' => 'PLDM_REQUESTER_RECV_FAIL',
          'value' => '18446744073709551608 (-8)'
        },
        '9' => {
          'name' => 'PLDM_REQUESTER_INVALID_RECV_LEN',
          'value' => '18446744073709551607 (-9)'
        },
        '10' => {
          'name' => 'PLDM_REQUESTER_SETUP_FAIL',
          'value' => '18446744073709551606 (-10)'
        },
        '11' => {
          'name' => 'PLDM_REQUESTER_INVALID_SETUP',
          'value' => '18446744073709551605 (-11)'
        },
        '12' => {
          'name' => 'PLDM_REQUESTER_POLL_FAIL',
          'value' => '18446744073709551604 (-12)'
        },
        '13' => {
          'name' => 'PLDM_REQUESTER_TRANSPORT_BUSY',
          'value' => '18446744073709551603 (-13)'
        }
      },
      'Name' => 'enum pldm_requester_error_codes',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '106444' => {
      'Line' => '20',
      'Memb' => {
        '0' => {
          'name' => 'prev',
          'offset' => '0',
          'type' => '103412'
        },
        '1' => {
          'name' => 'allocations',
          'offset' => '4',
          'type' => '152'
        }
      },
      'Name' => 'struct pldm_tid_state',
      'PrivateABI' => 1,
      'Size' => '8',
      'Source' => 'instance-id.c',
      'Type' => 'Struct'
    },
    '106483' => {
      'Line' => '25',
      'Memb' => {
        '0' => {
          'name' => 'state',
          'offset' => '0',
          'type' => '106525'
        },
        '1' => {
          'name' => 'lock_db_fd',
          'offset' => '8264',
          'type' => '100'
        }
      },
      'Name' => 'struct pldm_instance_db',
      'PrivateABI' => 1,
      'Size' => '2052',
      'Source' => 'instance-id.c',
      'Type' => 'Struct'
    },
    '106525' => {
      'BaseType' => '106444',
      'Name' => 'struct pldm_tid_state[256]',
      'Size' => '2048',
      'Type' => 'Array'
    },
    '106995' => {
      'BaseType' => '106483',
      'Name' => 'struct pldm_instance_db*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '107420' => {
      'BaseType' => '103412',
      'Name' => 'pldm_instance_id_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '107596' => {
      'BaseType' => '106995',
      'Name' => 'struct pldm_instance_db**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '108353' => {
      'BaseType' => '140',
      'Header' => 'pldm.h',
      'Line' => '13',
      'Name' => 'mctp_eid_t',
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '108468' => {
      'BaseType' => '103509',
      'Header' => 'pldm.h',
      'Line' => '30',
      'Name' => 'pldm_requester_rc_t',
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '108486' => {
      'Line' => '25',
      'Memb' => {
        '0' => {
          'name' => 'transport',
          'offset' => '0',
          'type' => '108559'
        },
        '1' => {
          'name' => 'socket',
          'offset' => '64',
          'type' => '100'
        },
        '2' => {
          'name' => 'tid_eid_map',
          'offset' => '68',
          'type' => '112191'
        },
        '3' => {
          'name' => 'socket_send_buf',
          'offset' => '768',
          'type' => '111140'
        }
      },
      'Name' => 'struct pldm_transport_mctp_demux',
      'PrivateABI' => 1,
      'Size' => '312',
      'Source' => 'mctp-demux.c',
      'Type' => 'Struct'
    },
    '108512' => {
      'BaseType' => '108486',
      'Name' => 'struct pldm_transport_mctp_demux*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '108554' => {
      'BaseType' => '108559',
      'Name' => 'struct pldm_transport*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '108559' => {
      'Header' => 'transport.h',
      'Line' => '18',
      'Memb' => {
        '0' => {
          'name' => 'name',
          'offset' => '0',
          'type' => '13466'
        },
        '1' => {
          'name' => 'version',
          'offset' => '8',
          'type' => '140'
        },
        '2' => {
          'name' => 'recv',
          'offset' => '22',
          'type' => '111451'
        },
        '3' => {
          'name' => 'send',
          'offset' => '36',
          'type' => '111492'
        },
        '4' => {
          'name' => 'init_pollfd',
          'offset' => '50',
          'type' => '111572'
        }
      },
      'Name' => 'struct pldm_transport',
      'PrivateABI' => 1,
      'Size' => '40',
      'Type' => 'Struct'
    },
    '108695' => {
      'BaseType' => '103400',
      'Name' => 'pldm_tid_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '108798' => {
      'BaseType' => '108512',
      'Name' => 'struct pldm_transport_mctp_demux**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '110860' => {
      'BaseType' => '46',
      'Header' => 'int-ll64.h',
      'Line' => '21',
      'Name' => '__u8',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '110872' => {
      'BaseType' => '53',
      'Header' => 'int-ll64.h',
      'Line' => '24',
      'Name' => '__u16',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '111140' => {
      'Header' => 'socket.h',
      'Line' => '5',
      'Memb' => {
        '0' => {
          'name' => 'size',
          'offset' => '0',
          'type' => '100'
        },
        '1' => {
          'name' => 'socket',
          'offset' => '4',
          'type' => '100'
        },
        '2' => {
          'name' => 'max_size',
          'offset' => '8',
          'type' => '100'
        }
      },
      'Name' => 'struct pldm_socket_sndbuf',
      'PrivateABI' => 1,
      'Size' => '12',
      'Type' => 'Struct'
    },
    '111451' => {
      'Name' => 'pldm_requester_rc_t(*)(struct pldm_transport*, pldm_tid_t*, void**, size_t*)',
      'Param' => {
        '0' => {
          'type' => '108554'
        },
        '1' => {
          'type' => '108695'
        },
        '2' => {
          'type' => '21344'
        },
        '3' => {
          'type' => '9819'
        }
      },
      'Return' => '108468',
      'Size' => '8',
      'Type' => 'FuncPtr'
    },
    '111492' => {
      'Name' => 'pldm_requester_rc_t(*)(struct pldm_transport*, pldm_tid_t, void const*, size_t)',
      'Param' => {
        '0' => {
          'type' => '108554'
        },
        '1' => {
          'type' => '103400'
        },
        '2' => {
          'type' => '5342'
        },
        '3' => {
          'type' => '453'
        }
      },
      'Return' => '108468',
      'Size' => '8',
      'Type' => 'FuncPtr'
    },
    '111517' => {
      'BaseType' => '111522',
      'Name' => 'struct pollfd*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '111522' => {
      'Header' => 'poll.h',
      'Line' => '36',
      'Memb' => {
        '0' => {
          'name' => 'fd',
          'offset' => '0',
          'type' => '100'
        },
        '1' => {
          'name' => 'events',
          'offset' => '4',
          'type' => '93'
        },
        '2' => {
          'name' => 'revents',
          'offset' => '6',
          'type' => '93'
        }
      },
      'Name' => 'struct pollfd',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Struct'
    },
    '111572' => {
      'Name' => 'int(*)(struct pldm_transport*, struct pollfd*)',
      'Param' => {
        '0' => {
          'type' => '108554'
        },
        '1' => {
          'type' => '111517'
        }
      },
      'Return' => '100',
      'Size' => '8',
      'Type' => 'FuncPtr'
    },
    '111577' => {
      'BaseType' => '53',
      'Header' => 'socket.h',
      'Line' => '10',
      'Name' => '__kernel_sa_family_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '111925' => {
      'Header' => 'mctp.h',
      'Line' => '18',
      'Memb' => {
        '0' => {
          'name' => 's_addr',
          'offset' => '0',
          'type' => '108353'
        }
      },
      'Name' => 'struct mctp_addr',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Struct'
    },
    '111951' => {
      'Header' => 'mctp.h',
      'Line' => '22',
      'Memb' => {
        '0' => {
          'name' => 'smctp_family',
          'offset' => '0',
          'type' => '111577'
        },
        '1' => {
          'name' => '__smctp_pad0',
          'offset' => '2',
          'type' => '110872'
        },
        '2' => {
          'name' => 'smctp_network',
          'offset' => '4',
          'type' => '60'
        },
        '3' => {
          'name' => 'smctp_addr',
          'offset' => '8',
          'type' => '111925'
        },
        '4' => {
          'name' => 'smctp_type',
          'offset' => '9',
          'type' => '110860'
        },
        '5' => {
          'name' => 'smctp_tag',
          'offset' => '16',
          'type' => '110860'
        },
        '6' => {
          'name' => '__smctp_pad1',
          'offset' => '17',
          'type' => '110860'
        }
      },
      'Name' => 'struct sockaddr_mctp',
      'PrivateABI' => 1,
      'Size' => '12',
      'Type' => 'Struct'
    },
    '112055' => {
      'BaseType' => '111951',
      'Name' => 'struct sockaddr_mctp const',
      'Size' => '12',
      'Type' => 'Const'
    },
    '112098' => {
      'Line' => '34',
      'Memb' => {
        '0' => {
          'name' => 'transport',
          'offset' => '0',
          'type' => '108559'
        },
        '1' => {
          'name' => 'socket',
          'offset' => '64',
          'type' => '100'
        },
        '2' => {
          'name' => 'tid_eid_map',
          'offset' => '68',
          'type' => '112191'
        },
        '3' => {
          'name' => 'socket_send_buf',
          'offset' => '768',
          'type' => '111140'
        },
        '4' => {
          'name' => 'bound',
          'offset' => '786',
          'type' => '5123'
        },
        '5' => {
          'name' => 'cookie_jar',
          'offset' => '800',
          'type' => '103424'
        }
      },
      'Name' => 'struct pldm_transport_af_mctp',
      'PrivateABI' => 1,
      'Size' => '336',
      'Source' => 'af-mctp.c',
      'Type' => 'Struct'
    },
    '112191' => {
      'BaseType' => '103400',
      'Name' => 'pldm_tid_t[256]',
      'Size' => '256',
      'Type' => 'Array'
    },
    '113007' => {
      'BaseType' => '112098',
      'Name' => 'struct pldm_transport_af_mctp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '113012' => {
      'BaseType' => '112055',
      'Name' => 'struct sockaddr_mctp const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '113325' => {
      'BaseType' => '113007',
      'Name' => 'struct pldm_transport_af_mctp**',
      'Size' => '8',
      'Type' => 'Pointer'
    }
  },
  'UndefinedSymbols' => {
    'libpldm.so.0.8.0' => {
      '_ITM_deregisterTMCloneTable' => 0,
      '_ITM_registerTMCloneTable' => 0,
      '__assert_fail@GLIBC_2.2.5' => 0,
      '__cxa_finalize@GLIBC_2.2.5' => 0,
      '__errno_location@GLIBC_2.2.5' => 0,
      '__gmon_start__' => 0,
      '__memcpy_chk@GLIBC_2.3.4' => 0,
      '__recv_chk@GLIBC_2.4' => 0,
      '__recvfrom_chk@GLIBC_2.4' => 0,
      '__stack_chk_fail@GLIBC_2.4' => 0,
      'bind@GLIBC_2.2.5' => 0,
      'calloc@GLIBC_2.2.5' => 0,
      'clock_gettime@GLIBC_2.17' => 0,
      'close@GLIBC_2.2.5' => 0,
      'connect@GLIBC_2.2.5' => 0,
      'dup@GLIBC_2.2.5' => 0,
      'fclose@GLIBC_2.2.5' => 0,
      'fcntl64@GLIBC_2.28' => 0,
      'fgets@GLIBC_2.2.5' => 0,
      'fopen64@GLIBC_2.2.5' => 0,
      'free@GLIBC_2.2.5' => 0,
      'getsockopt@GLIBC_2.2.5' => 0,
      'malloc@GLIBC_2.2.5' => 0,
      'memcmp@GLIBC_2.2.5' => 0,
      'memcpy@GLIBC_2.14' => 0,
      'open64@GLIBC_2.2.5' => 0,
      'poll@GLIBC_2.2.5' => 0,
      'ppoll@GLIBC_2.4' => 0,
      'recv@GLIBC_2.2.5' => 0,
      'recvmsg@GLIBC_2.2.5' => 0,
      'sendmsg@GLIBC_2.2.5' => 0,
      'sendto@GLIBC_2.2.5' => 0,
      'setsockopt@GLIBC_2.2.5' => 0,
      'socket@GLIBC_2.2.5' => 0,
      'stat64@GLIBC_2.33' => 0,
      'strlen@GLIBC_2.2.5' => 0,
      'strtol@GLIBC_2.2.5' => 0,
      'timerfd_create@GLIBC_2.8' => 0,
      'timerfd_settime@GLIBC_2.8' => 0,
      'write@GLIBC_2.2.5' => 0
    }
  },
  'WordSize' => '8'
};
