$VAR1 = {
  'ABI_DUMPER_VERSION' => '1.2',
  'ABI_DUMP_VERSION' => '3.5',
  'Arch' => 'x86_64',
  'GccVersion' => '13.3.0',
  'Headers' => {
    'af-mctp.h' => 1,
    'base.h' => 1,
    'bcd.h' => 1,
    'bios.h' => 1,
    'bios_table.h' => 1,
    'edac.h' => 1,
    'file.h' => 1,
    'file_io.h' => 1,
    'firmware_update.h' => 1,
    'fru.h' => 1,
    'host.h' => 1,
    'instance-id.h' => 1,
    'mctp-demux.h' => 1,
    'pdr.h' => 1,
    'platform.h' => 1,
    'pldm.h' => 1,
    'pldm_types.h' => 1,
    'transport.h' => 1
  },
  'Language' => 'C',
  'LibraryName' => 'libpldm.so.0.15.0',
  'LibraryVersion' => '0.15.0',
  'NameSpaces' => {},
  'Needed' => {
    'libc.so.6' => 1
  },
  'PublicABI' => '1',
  'Sources' => {
    'af-mctp.c' => 1,
    'bios_table.c' => 1,
    'instance-id.c' => 1,
    'mctp-demux.c' => 1,
    'pdr.c' => 1
  },
  'SymbolInfo' => {
    '181' => {
      'Header' => 'bcd.h',
      'Line' => '45',
      'Param' => {
        '0' => {
          'name' => 'dec',
          'type' => '169'
        }
      },
      'Return' => '169',
      'ShortName' => 'pldm_bcd_dec2bcd32'
    },
    '310' => {
      'Header' => 'bcd.h',
      'Line' => '39',
      'Param' => {
        '0' => {
          'name' => 'bcd',
          'type' => '169'
        }
      },
      'Return' => '169',
      'ShortName' => 'pldm_bcd_bcd2dec32'
    },
    '413' => {
      'Header' => 'bcd.h',
      'Line' => '33',
      'Param' => {
        '0' => {
          'name' => 'dec',

      'pldm_entity_association_tree_destroy' => 1,
      'pldm_entity_association_tree_destroy_root' => 1,
      'pldm_entity_association_tree_find' => 1,
      'pldm_entity_association_tree_find_with_locality' => 1,
      'pldm_entity_association_tree_init' => 1,
      'pldm_entity_association_tree_visit' => 1,
      'pldm_entity_extract' => 1,
      'pldm_entity_get_num_children' => 1,
      'pldm_entity_get_parent' => 1,
      'pldm_entity_is_exist_parent' => 1,
      'pldm_entity_is_node_parent' => 1,
      'pldm_entity_node_get_remote_container_id' => 1,
      'pldm_find_entity_ref_in_tree' => 1,
      'pldm_instance_db_destroy' => 1,
      'pldm_instance_db_init' => 1,
      'pldm_instance_db_init_default' => 1,
      'pldm_instance_id_alloc' => 1,
      'pldm_instance_id_free' => 1,
      'pldm_is_current_parent_child' => 1,
      'pldm_is_empty_entity_assoc_tree' => 1,
      'pldm_msg_hdr_correlate_response' => 1,
      'pldm_oem_meta_file_io_read_resp_data' => 1,
      'pldm_oem_meta_file_io_write_req_data' => 1,
      'pldm_package_component_image_information_iter_init' => 1,
      'pldm_package_downstream_device_id_record_iter_init' => 1,
      'pldm_package_firmware_device_id_record_iter_init' => 1,
      'pldm_pdr_add' => 1,
      'pldm_pdr_add_fru_record_set' => 1,
      'pldm_pdr_delete_by_effecter_id' => 1,
      'pldm_pdr_delete_by_record_handle' => 1,
      'pldm_pdr_delete_by_sensor_id' => 1,
      'pldm_pdr_destroy' => 1,
      'pldm_pdr_find_last_in_range' => 1,
      'pldm_pdr_find_record' => 1,
      'pldm_pdr_find_record_by_type' => 1,
      'pldm_pdr_fru_record_set_find_by_rsi' => 1,
      'pldm_pdr_get_next_record' => 1,
      'pldm_pdr_get_record_count' => 1,
      'pldm_pdr_get_record_handle' => 1,
      'pldm_pdr_get_repo_size' => 1,
      'pldm_pdr_init' => 1,
      'pldm_pdr_record_is_remote' => 1,
      'pldm_pdr_remove_fru_record_set_by_rsi' => 1,
      'pldm_pdr_remove_pdrs_by_terminus_handle' => 1,
      'pldm_pdr_remove_remote_pdrs' => 1,
      'pldm_pdr_update_TL_pdr' => 1,
      'pldm_platform_cper_event_event_data' => 1,
      'pldm_transport_af_mctp_bind' => 1,
      'pldm_transport_af_mctp_core' => 1,
      'pldm_transport_af_mctp_destroy' => 1,
      'pldm_transport_af_mctp_init' => 1,
      'pldm_transport_af_mctp_init_pollfd' => 1,
      'pldm_transport_af_mctp_map_tid' => 1,
      'pldm_transport_af_mctp_map_tid_fqe' => 1,
      'pldm_transport_af_mctp_unmap_tid' => 1,
      'pldm_transport_af_mctp_unmap_tid_fqe' => 1,
      'pldm_transport_mctp_demux_core' => 1,
      'pldm_transport_mctp_demux_destroy' => 1,
      'pldm_transport_mctp_demux_init' => 1,
      'pldm_transport_mctp_demux_init_pollfd' => 1,
      'pldm_transport_mctp_demux_map_tid' => 1,
      'pldm_transport_mctp_demux_unmap_tid' => 1,
      'pldm_transport_poll' => 1,
      'pldm_transport_recv_msg' => 1,
      'pldm_transport_send_msg' => 1,
      'pldm_transport_send_recv_msg' => 1,
      'unpack_pldm_header' => 1
    }
  },
  'Target' => 'unix',
  'TypeInfo' => {
    '1' => {
      'Name' => 'void',
      'Type' => 'Intrinsic'
    },
    '46' => {
      'Name' => 'unsigned char',
      'Size' => '1',
      'Type' => 'Intrinsic'
    },
    '53' => {
      'Name' => 'unsigned short',
      'Size' => '2',
      'Type' => 'Intrinsic'
    },
    '60' => {
      'Name' => 'unsigned int',
      'Size' => '4',
      'Type' => 'Intrinsic'
    },
    '67' => {
      'Name' => 'unsigned long',
      'Size' => '8',
      'Type' => 'Intrinsic'
    },
    '74' => {
      'Name' => 'signed char',
      'Size' => '1',
      'Type' => 'Intrinsic'
    },
    '81' => {
      'BaseType' => '46',
      'Header' => 'types.h',
      'Line' => '38',
      'Name' => '__uint8_t',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '93' => {
      'Name' => 'short',
      'Size' => '2',
      'Type' => 'Intrinsic'
    },
    '100' => {
      'BaseType' => '53',
      'Header' => 'types.h',
      'Line' => '40',
      'Name' => '__uint16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '112' => {
      'Name' => 'int',
      'Size' => '4',
      'Type' => 'Intrinsic'
    },
    '119' => {
      'BaseType' => '60',
      'Header' => 'types.h',
      'Line' => '42',
      'Name' => '__uint32_t',
      'PrivateABI' => 1,
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '131' => {
      'Name' => 'long',
      'Size' => '8',
      'Type' => 'Intrinsic'
    },
    '138' => {
      'Name' => 'char',
      'Size' => '1',
      'Type' => 'Intrinsic'
    },
    '145' => {
      'BaseType' => '81',
      'Header' => 'stdint-uintn.h',
      'Line' => '24',
      'Name' => 'uint8_t',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '157' => {
      'BaseType' => '100',
      'Header' => 'stdint-uintn.h',
      'Line' => '25',
      'Name' => 'uint16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '169' => {
      'BaseType' => '119',
      'Header' => 'stdint-uintn.h',
      'Line' => '26',
      'Name' => 'uint32_t',
      'PrivateABI' => 1,
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '869' => {
      'BaseType' => '1',
      'Name' => 'void*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '895' => {
      'BaseType' => '169',
      'Name' => 'uint32_t const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '900' => {
      'BaseType' => '67',
      'Header' => 'stddef.h',
      'Line' => '214',
      'Name' => 'size_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '926' => {
      'Header' => 'pldm_types.h',
      'Line' => '15',
      'Name' => 'struct bits8',
      'Size' => '1',
      'Type' => 'Struct'
    },
    '1084' => {
      'Header' => 'pldm_types.h',
      'Line' => '25',
      'Memb' => {
        '0' => {
          'name' => 'byte',
          'offset' => '0',
          'type' => '145'
        },
        '1' => {
          'name' => 'bits',
          'offset' => '0',
          'type' => '926'
        }
      },
      'Name' => 'union bitfield8_t',
      'Size' => '1',
      'Type' => 'Union'
    },
    '1096' => {
      'BaseType' => '1084',
      'Name' => 'bitfield8_t const',
      'Size' => '1',
      'Type' => 'Const'
    },
    '1101' => {
      'Header' => 'pldm_types.h',
      'Line' => '31',
      'Memb' => {
        '0' => {
          'name' => 'alpha',
          'offset' => '0',
          'type' => '145'
        },
        '1' => {
          'name' => 'update',
          'offset' => '1',
          'type' => '145'
        },
        '2' => {
          'name' => 'minor',
          'offset' => '2',
          'type' => '145'
        },
        '3' => {
          'name' => 'major',
          'offset' => '3',
          'type' => '145'
        }
      },
      'Name' => 'struct pldm_version',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '1167' => {
      'BaseType' => '1101',
      'Header' => 'pldm_types.h',
      'Line' => '36',
      'Name' => 'ver32_t',
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '1179' => {
      'BaseType' => '1167',
      'Name' => 'ver32_t const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '1184' => {
      'Name' => 'float',
      'Size' => '4',
      'Type' => 'Intrinsic'
    },
    '1625' => {
      'Header' => 'base.h',
      'Line' => '130',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_RESPONSE',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_REQUEST',
          'value' => '1'
        },
        '2' => {
          'name' => 'PLDM_RESERVED',
          'value' => '2'
        },
        '3' => {
          'name' => 'PLDM_ASYNC_REQUEST_NOTIFY',
          'value' => '3'
        }
      },
      'Name' => 'enum MessageType',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '1637' => {
      'Header' => 'base.h',
      'Line' => '183',
      'Memb' => {
        '0' => {
          'name' => 'command',
          'offset' => '2',
          'type' => '145'
        }
      },
      'Name' => 'struct pldm_msg_hdr',
      'Size' => '3',
      'Type' => 'Struct'
    },
    '1748' => {
      'BaseType' => '1637',
      'Name' => 'struct pldm_msg_hdr const',
      'Size' => '3',
      'Type' => 'Const'
    },
    '1753' => {
      'Header' => 'base.h',
      'Line' => '216',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '1637'
        },
        '1' => {
          'name' => 'payload',
          'offset' => '3',
          'type' => '1798'
        }
      },
      'Name' => 'struct pldm_msg',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '1793' => {
      'BaseType' => '1753',
      'Name' => 'struct pldm_msg const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '1798' => {
      'BaseType' => '145',
      'Name' => 'uint8_t[1]',
      'Size' => '1',
      'Type' => 'Array'
    },
    '1814' => {
      'Header' => 'base.h',
      'Line' => '296',
      'Memb' => {
        '0' => {
          'name' => 'msg_type',
          'offset' => '0',
          'type' => '1625'
        },
        '1' => {
          'name' => 'instance',
          'offset' => '4',
          'type' => '145'
        },
        '2' => {
          'name' => 'pldm_type',
          'offset' => '5',
          'type' => '145'
        },
        '3' => {
          'name' => 'command',
          'offset' => '6',
          'type' => '145'
        },
        '4' => {
          'name' => 'completion_code',
          'offset' => '7',
          'type' => '145'
        }
      },
      'Name' => 'struct pldm_header_info',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '1894' => {
      'BaseType' => '1814',
      'Name' => 'struct pldm_header_info const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '1899' => {
      'BaseType' => '1084',
      'Name' => 'bitfield8_t[8]',
      'Size' => '8',
      'Type' => 'Array'
    },
    '2061' => {
      'BaseType' => '2066',
      'Name' => 'void const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2066' => {
      'BaseType' => '1',
      'Name' => 'void const',
      'Type' => 'Const'
    },
    '2067' => {
      'BaseType' => '1096',
      'Name' => 'bitfield8_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2242' => {
      'BaseType' => '1753',
      'Name' => 'struct pldm_msg*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2321' => {
      'BaseType' => '1793',
      'Name' => 'struct pldm_msg const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2326' => {
      'BaseType' => '145',
      'Name' => 'uint8_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2331' => {
      'BaseType' => '1167',
      'Name' => 'ver32_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2425' => {
      'BaseType' => '1179',
      'Name' => 'ver32_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2472' => {
      'BaseType' => '169',
      'Name' => 'uint32_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2541' => {
      'BaseType' => '1748',
      'Name' => 'struct pldm_msg_hdr const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2546' => {
      'BaseType' => '1814',
      'Name' => 'struct pldm_header_info*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '3501' => {
      'BaseType' => '900',
      'Name' => 'size_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '3961' => {
      'BaseType' => '1894',
      'Name' => 'struct pldm_header_info const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '5629' => {
      'BaseType' => '145',
      'Name' => 'uint8_t const',
      'Size' => '1',
      'Type' => 'Const'
    },
    '5840' => {
      'BaseType' => '5629',
      'Name' => 'uint8_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '6373' => {
      'BaseType' => '145',
      'Header' => 'base.h',
      'Line' => '19',
      'Name' => 'pldm_tid_t',
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '6385' => {
      'BaseType' => '145',
      'Header' => 'instance-id.h',
      'Line' => '13',
      'Name' => 'pldm_instance_id_t',
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '6397' => {
      'Header' => 'responder.h',
      'Line' => '10',
      'Memb' => {
        '0' => {
          'name' => 'tid',
          'offset' => '0',
          'type' => '6373'
        },
        '1' => {
          'name' => 'instance_id',
          'offset' => '1',
          'type' => '6385'
        },
        '2' => {
          'name' => 'type',
          'offset' => '2',
          'type' => '145'
        },
        '3' => {
          'name' => 'command',
          'offset' => '3',
          'type' => '145'
        },
        '4' => {
          'name' => 'next',
          'offset' => '8',
          'type' => '6477'
        }
      },
      'Name' => 'struct pldm_responder_cookie',
      'PrivateABI' => 1,
      'Size' => '16',
      'Type' => 'Struct'
    },
    '6477' => {
      'BaseType' => '6397',
      'Name' => 'struct pldm_responder_cookie*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '6482' => {
      'Header' => 'pldm.h',
      'Line' => '15',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_REQUESTER_SUCCESS',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_REQUESTER_OPEN_FAIL',
          'value' => '18446744073709551615 (-1)'
        },
        '2' => {
          'name' => 'PLDM_REQUESTER_NOT_PLDM_MSG',
          'value' => '18446744073709551614 (-2)'
        },
        '3' => {
          'name' => 'PLDM_REQUESTER_NOT_RESP_MSG',
          'value' => '18446744073709551613 (-3)'
        },
        '4' => {
          'name' => 'PLDM_REQUESTER_NOT_REQ_MSG',
          'value' => '18446744073709551612 (-4)'
        },
        '5' => {
          'name' => 'PLDM_REQUESTER_RESP_MSG_TOO_SMALL',
          'value' => '18446744073709551611 (-5)'
        },
        '6' => {
          'name' => 'PLDM_REQUESTER_INSTANCE_ID_MISMATCH',
          'value' => '18446744073709551610 (-6)'
        },
        '7' => {
          'name' => 'PLDM_REQUESTER_SEND_FAIL',
          'value' => '18446744073709551609 (-7)'
        },
        '8' => {
          'name' => 'PLDM_REQUESTER_RECV_FAIL',
          'value' => '18446744073709551608 (-8)'
        },
        '9' => {
          'name' => 'PLDM_REQUESTER_INVALID_RECV_LEN',
          'value' => '18446744073709551607 (-9)'
        },
        '10' => {
          'name' => 'PLDM_REQUESTER_SETUP_FAIL',
          'value' => '18446744073709551606 (-10)'
        },
        '11' => {
          'name' => 'PLDM_REQUESTER_INVALID_SETUP',
          'value' => '18446744073709551605 (-11)'
        },
        '12' => {
          'name' => 'PLDM_REQUESTER_POLL_FAIL',
          'value' => '18446744073709551604 (-12)'
        },
        '13' => {
          'name' => 'PLDM_REQUESTER_TRANSPORT_BUSY',
          'value' => '18446744073709551603 (-13)'
        }
      },
      'Name' => 'enum pldm_requester_error_codes',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '7003' => {
      'Name' => '_Bool',
      'Size' => '1',
      'Type' => 'Intrinsic'
    },
    '7731' => {
      'BaseType' => '131',
      'Header' => 'types.h',
      'Line' => '194',
      'Name' => '__ssize_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '7743' => {
      'BaseType' => '138',
      'Name' => 'char*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '7755' => {
      'BaseType' => '138',
      'Name' => 'char const',
      'Size' => '1',
      'Type' => 'Const'
    },
    '7789' => {
      'BaseType' => '157',
      'Name' => 'uint16_t const',
      'Size' => '2',
      'Type' => 'Const'
    },
    '8126' => {
      'Header' => 'pldm_types.h',
      'Line' => '178',
      'Memb' => {
        '0' => {
          'name' => 'ptr',
          'offset' => '0',
          'type' => '5840'
        },
        '1' => {
          'name' => 'length',
          'offset' => '8',
          'type' => '900'
        }
      },
      'Name' => 'struct variable_field',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '8191' => {
      'BaseType' => '7731',
      'Header' => 'types.h',
      'Line' => '108',
      'Name' => 'ssize_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '9223' => {
      'Header' => 'base.h',
      'Line' => '380',
      'Memb' => {
        '0' => {
          'name' => 'pldm_type',
          'offset' => '0',
          'type' => '145'
        },
        '1' => {
          'name' => 'transfer_opflag',
          'offset' => '1',
          'type' => '145'
        },
        '2' => {
          'name' => 'transfer_ctx',
          'offset' => '4',
          'type' => '169'
        },
        '3' => {
          'name' => 'transfer_handle',
          'offset' => '8',
          'type' => '169'
        },
        '4' => {
          'name' => 'section_offset',
          'offset' => '18',
          'type' => '169'
        },
        '5' => {
          'name' => 'section_length',
          'offset' => '22',
          'type' => '169'
        }
      },
      'Name' => 'struct pldm_base_multipart_receive_req',
      'Size' => '20',
      'Type' => 'Struct'
    },
    '9314' => {
      'BaseType' => '9223',
      'Name' => 'struct pldm_base_multipart_receive_req const',
      'Size' => '20',
      'Type' => 'Const'
    },
    '9319' => {
      'Header' => 'base.h',
      'Line' => '398',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '145'
        },
        '1' => {
          'name' => 'transfer_flag',
          'offset' => '1',
          'type' => '145'
        },
        '2' => {
          'name' => 'next_transfer_handle',
          'offset' => '4',
          'type' => '169'
        },
        '3' => {
          'name' => 'data',
          'offset' => '8',
          'type' => '8126'
        }
      },
      'Name' => 'struct pldm_base_multipart_receive_resp',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '9389' => {
      'Header' => 'base.h',
      'Line' => '410',
      'Memb' => {
        '0' => {
          'name' => 'requester_part_size',
          'offset' => '0',
          'type' => '157'
        },
        '1' => {
          'name' => 'requester_protocol_support',
          'offset' => '2',
          'type' => '1899'
        }
      },
      'Name' => 'struct pldm_base_negotiate_transfer_params_req',
      'Size' => '10',
      'Type' => 'Struct'
    },
    '9428' => {
      'BaseType' => '9389',
      'Name' => 'struct pldm_base_negotiate_transfer_params_req const',
      'Size' => '10',
      'Type' => 'Const'
    },
    '9433' => {
      'Header' => 'base.h',
      'Line' => '419',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '145'
        },
        '1' => {
          'name' => 'responder_part_size',
          'offset' => '2',
          'type' => '157'
        },
        '2' => {
          'name' => 'responder_protocol_support',
          'offset' => '4',
          'type' => '1899'
        }
      },
      'Name' => 'struct pldm_base_negotiate_transfer_params_resp',
      'Size' => '12',
      'Type' => 'Struct'
    },
    '9522' => {
      'BaseType' => '7755',
      'Name' => 'char const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '11739' => {
      'BaseType' => '9433',
      'Name' => 'struct pldm_base_negotiate_transfer_params_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '17423' => {
      'BaseType' => '9428',
      'Name' => 'struct pldm_base_negotiate_transfer_params_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '25192' => {
      'BaseType' => '9319',
      'Name' => 'struct pldm_base_multipart_receive_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '28057' => {
      'BaseType' => '9314',
      'Name' => 'struct pldm_base_multipart_receive_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '34066' => {
      'BaseType' => '1084',
      'Name' => 'bitfield8_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '35979' => {
      'BaseType' => '1637',
      'Name' => 'struct pldm_msg_hdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '40220' => {
      'BaseType' => '8126',
      'Name' => 'struct variable_field*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '42302' => {
      'BaseType' => '157',
      'Name' => 'uint16_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '45544' => {
      'BaseType' => '67',
      'Header' => 'types.h',
      'Line' => '45',
      'Name' => '__uint64_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '45638' => {
      'BaseType' => '45544',
      'Header' => 'stdint-uintn.h',
      'Line' => '27',
      'Name' => 'uint64_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '45936' => {
      'Header' => 'bios.h',
      'Line' => '39',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_BIOS_STRING_TABLE',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_BIOS_ATTR_TABLE',
          'value' => '1'
        },
        '2' => {
          'name' => 'PLDM_BIOS_ATTR_VAL_TABLE',
          'value' => '2'
        }
      },
      'Name' => 'enum pldm_bios_table_types',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '45970' => {
      'Header' => 'bios.h',
      'Line' => '48',
      'Memb' => {
        '0' => {
          'name' => 'string_handle',
          'offset' => '0',
          'type' => '157'
        },
        '1' => {
          'name' => 'string_length',
          'offset' => '2',
          'type' => '157'
        },
        '2' => {
          'name' => 'name',
          'offset' => '4',
          'type' => '46027'
        }
      },
      'Name' => 'struct pldm_bios_string_table_entry',
      'Size' => '5',
      'Type' => 'Struct'
    },
    '46022' => {
      'BaseType' => '45970',
      'Name' => 'struct pldm_bios_string_table_entry const',
      'Size' => '5',
      'Type' => 'Const'
    },
    '46027' => {
      'BaseType' => '138',
      'Name' => 'char[1]',
      'Size' => '1',
      'Type' => 'Array'
    },
    '46043' => {
      'Header' => 'bios.h',
      'Line' => '54',
      'Memb' => {
        '0' => {
          'name' => 'attr_handle',
          'offset' => '0',
          'type' => '157'
        },
        '1' => {
          'name' => 'attr_type',
          'offset' => '2',
          'type' => '145'
        },
        '2' => {
          'name' => 'string_handle',
          'offset' => '3',
          'type' => '157'
        },
        '3' => {
          'name' => 'metadata',
          'offset' => '5',
          'type' => '1798'
        }
      },
      'Name' => 'struct pldm_bios_attr_table_entry',
      'Size' => '6',
      'Type' => 'Struct'
    },
    '46108' => {
      'BaseType' => '46043',
      'Name' => 'struct pldm_bios_attr_table_entry const',
      'Size' => '6',
      'Type' => 'Const'
    },
    '46113' => {
      'Header' => 'bios.h',
      'Line' => '66',
      'Memb' => {
        '0' => {
          'name' => 'attr_handle',
          'offset' => '0',
          'type' => '157'
        },
        '1' => {
          'name' => 'attr_type',
          'offset' => '2',
          'type' => '145'
        },
        '2' => {
          'name' => 'value',
          'offset' => '3',
          'type' => '1798'
        }
      },
      'Name' => 'struct pldm_bios_attr_val_table_entry',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '46165' => {
      'BaseType' => '46113',
      'Name' => 'struct pldm_bios_attr_val_table_entry const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '46234' => {
      'Header' => 'bios_table.h',
      'Line' => '206',
      'Memb' => {
        '0' => {
          'name' => 'name_handle',
          'offset' => '0',
          'type' => '157'
        },
        '1' => {
          'name' => 'read_only',
          'offset' => '2',
          'type' => '7003'
        },
        '2' => {
          'name' => 'pv_num',
          'offset' => '3',
          'type' => '145'
        },
        '3' => {
          'name' => 'pv_handle',
          'offset' => '8',
          'type' => '46337'
        },
        '4' => {
          'name' => 'def_num',
          'offset' => '22',
          'type' => '145'
        },
        '5' => {
          'name' => 'def_index',
          'offset' => '36',
          'type' => '5840'
        }
      },
      'Name' => 'struct pldm_bios_table_attr_entry_enum_info',
      'Size' => '32',
      'Type' => 'Struct'
    },
    '46325' => {
      'BaseType' => '46234',
      'Name' => 'struct pldm_bios_table_attr_entry_enum_info const',
      'Size' => '32',
      'Type' => 'Const'
    },
    '46337' => {
      'BaseType' => '7789',
      'Name' => 'uint16_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '46342' => {
      'Header' => 'bios_table.h',
      'Line' => '294',
      'Memb' => {
        '0' => {
          'name' => 'name_handle',
          'offset' => '0',
          'type' => '157'
        },
        '1' => {
          'name' => 'read_only',
          'offset' => '2',
          'type' => '7003'
        },
        '2' => {
          'name' => 'string_type',
          'offset' => '3',
          'type' => '145'
        },
        '3' => {
          'name' => 'min_length',
          'offset' => '4',
          'type' => '157'
        },
        '4' => {
          'name' => 'max_length',
          'offset' => '6',
          'type' => '157'
        },
        '5' => {
          'name' => 'def_length',
          'offset' => '8',
          'type' => '157'
        },
        '6' => {
          'name' => 'def_string',
          'offset' => '22',
          'type' => '9522'
        }
      },
      'Name' => 'struct pldm_bios_table_attr_entry_string_info',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '46454' => {
      'BaseType' => '46342',
      'Name' => 'struct pldm_bios_table_attr_entry_string_info const',
      'Size' => '24',
      'Type' => 'Const'
    },
    '46464' => {
      'Header' => 'bios_table.h',
      'Line' => '384',
      'Memb' => {
        '0' => {
          'name' => 'name_handle',
          'offset' => '0',
          'type' => '157'
        },
        '1' => {
          'name' => 'read_only',
          'offset' => '2',
          'type' => '7003'
        },
        '2' => {
          'name' => 'lower_bound',
          'offset' => '8',
          'type' => '45638'
        },
        '3' => {
          'name' => 'upper_bound',
          'offset' => '22',
          'type' => '45638'
        },
        '4' => {
          'name' => 'scalar_increment',
          'offset' => '36',
          'type' => '169'
        },
        '5' => {
          'name' => 'default_value',
          'offset' => '50',
          'type' => '45638'
        }
      },
      'Name' => 'struct pldm_bios_table_attr_entry_integer_info',
      'Size' => '40',
      'Type' => 'Struct'
    },
    '46562' => {
      'BaseType' => '46464',
      'Name' => 'struct pldm_bios_table_attr_entry_integer_info const',
      'Size' => '40',
      'Type' => 'Const'
    },
    '46794' => {
      'Name' => 'ssize_t(*)(void const*)',
      'Param' => {
        '0' => {
          'type' => '2061'
        }
      },
      'Return' => '8191',
      'Size' => '8',
      'Type' => 'FuncPtr'
    },
    '46864' => {
      'Line' => '957',
      'Memb' => {
        '0' => {
          'name' => 'table_data',
          'offset' => '0',
          'type' => '5840'
        },
        '1' => {
          'name' => 'table_len',
          'offset' => '8',
          'type' => '900'
        },
        '2' => {
          'name' => 'current_pos',
          'offset' => '22',
          'type' => '900'
        },
        '3' => {
          'name' => 'entry_length_handler',
          'offset' => '36',
          'type' => '46794'
        }
      },
      'Name' => 'struct pldm_bios_table_iter',
      'PrivateABI' => 1,
      'Size' => '32',
      'Source' => 'bios_table.c',
      'Type' => 'Struct'
    },
    '46934' => {
      'BaseType' => '46864',
      'Name' => 'struct pldm_bios_table_iter const',
      'Size' => '32',
      'Type' => 'Const'
    },
    '48004' => {
      'BaseType' => '46864',
      'Name' => 'struct pldm_bios_table_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '48009' => {
      'BaseType' => '46165',
      'Name' => 'struct pldm_bios_attr_val_table_entry const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '48423' => {
      'BaseType' => '46108',
      'Name' => 'struct pldm_bios_attr_table_entry const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '49026' => {
      'BaseType' => '46022',
      'Name' => 'struct pldm_bios_string_table_entry const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '50189' => {
      'BaseType' => '46934',
      'Name' => 'struct pldm_bios_table_iter const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '54372' => {
      'BaseType' => '45638',
      'Name' => 'uint64_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '54649' => {
      'BaseType' => '46562',
      'Name' => 'struct pldm_bios_table_attr_entry_integer_info const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '54958' => {
      'BaseType' => '9522',
      'Name' => 'char const**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '56087' => {
      'BaseType' => '46454',
      'Name' => 'struct pldm_bios_table_attr_entry_string_info const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '57541' => {
      'BaseType' => '46325',
      'Name' => 'struct pldm_bios_table_attr_entry_enum_info const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '59782' => {
      'Header' => 'pldm_types.h',
      'Line' => '42',
      'Name' => 'struct bits16',
      'Size' => '2',
      'Type' => 'Struct'
    },
    '60052' => {
      'Header' => 'pldm_types.h',
      'Line' => '60',
      'Memb' => {
        '0' => {
          'name' => 'value',
          'offset' => '0',
          'type' => '157'
        },
        '1' => {
          'name' => 'bits',
          'offset' => '0',
          'type' => '59782'
        }
      },
      'Name' => 'union bitfield16_t',
      'Size' => '2',
      'Type' => 'Union'
    },
    '60809' => {
      'Header' => 'file.h',
      'Line' => '53',
      'Memb' => {
        '0' => {
          'name' => 'file_identifier',
          'offset' => '0',
          'type' => '157'
        },
        '1' => {
          'name' => 'file_attribute',
          'offset' => '2',
          'type' => '60052'
        }
      },
      'Name' => 'struct pldm_file_df_open_req',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '60849' => {
      'BaseType' => '60809',
      'Name' => 'struct pldm_file_df_open_req const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '60854' => {
      'Header' => 'file.h',
      'Line' => '62',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '145'
        },
        '1' => {
          'name' => 'file_descriptor',
          'offset' => '2',
          'type' => '157'
        }
      },
      'Name' => 'struct pldm_file_df_open_resp',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '60899' => {
      'Header' => 'file.h',
      'Line' => '71',
      'Memb' => {
        '0' => {
          'name' => 'file_descriptor',
          'offset' => '0',
          'type' => '157'
        },
        '1' => {
          'name' => 'df_close_options',
          'offset' => '2',
          'type' => '60052'
        }
      },
      'Name' => 'struct pldm_file_df_close_req',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '60939' => {
      'BaseType' => '60899',
      'Name' => 'struct pldm_file_df_close_req const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '60944' => {
      'Header' => 'file.h',
      'Line' => '80',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '145'
        }
      },
      'Name' => 'struct pldm_file_df_close_resp',
      'Size' => '1',
      'Type' => 'Struct'
    },
    '60976' => {
      'Header' => 'file.h',
      'Line' => '88',
      'Memb' => {
        '0' => {
          'name' => 'file_descriptor',
          'offset' => '0',
          'type' => '157'
        },
        '1' => {
          'name' => 'requester_max_interval',
          'offset' => '4',
          'type' => '169'
        }
      },
      'Name' => 'struct pldm_file_df_heartbeat_req',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '61016' => {
      'BaseType' => '60976',
      'Name' => 'struct pldm_file_df_heartbeat_req const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '61021' => {
      'Header' => 'file.h',
      'Line' => '97',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '145'
        },
        '1' => {
          'name' => 'responder_max_interval',
          'offset' => '4',
          'type' => '169'
        }
      },
      'Name' => 'struct pldm_file_df_heartbeat_resp',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '62691' => {
      'BaseType' => '61021',
      'Name' => 'struct pldm_file_df_heartbeat_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '64332' => {
      'BaseType' => '61016',
      'Name' => 'struct pldm_file_df_heartbeat_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '64485' => {
      'BaseType' => '60944',
      'Name' => 'struct pldm_file_df_close_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '68957' => {
      'BaseType' => '60939',
      'Name' => 'struct pldm_file_df_close_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '70775' => {
      'BaseType' => '60854',
      'Name' => 'struct pldm_file_df_open_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '75550' => {
      'BaseType' => '60849',
      'Name' => 'struct pldm_file_df_open_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '77296' => {
      'BaseType' => '900',
      'Name' => 'size_t const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '77315' => {
      'BaseType' => '145',
      'Header' => 'pldm_types.h',
      'Line' => '38',
      'Name' => 'bool8_t',
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '77607' => {
      'Header' => 'pldm_types.h',
      'Line' => '64',
      'Name' => 'struct bits32',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '78099' => {
      'Header' => 'pldm_types.h',
      'Line' => '98',
      'Memb' => {
        '0' => {
          'name' => 'value',
          'offset' => '0',
          'type' => '169'
        },
        '1' => {
          'name' => 'bits',
          'offset' => '0',
          'type' => '77607'
        }
      },
      'Name' => 'union bitfield32_t',
      'Size' => '4',
      'Type' => 'Union'
    },
    '78111' => {
      'Header' => 'pldm_types.h',
      'Line' => '102',
      'Name' => 'struct bits64',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '79051' => {
      'Header' => 'pldm_types.h',
      'Line' => '168',
      'Memb' => {
        '0' => {
          'name' => 'value',
          'offset' => '0',
          'type' => '45638'
        },
        '1' => {
          'name' => 'bits',
          'offset' => '0',
          'type' => '78111'
        }
      },
      'Name' => 'union bitfield64_t',
      'Size' => '8',
      'Type' => 'Union'
    },
    '79070' => {
      'BaseType' => '79082',
      'Header' => 'pldm_types.h',
      'Line' => '172',
      'Name' => 'pldm_uuid',
      'Size' => '16',
      'Type' => 'Typedef'
    },
    '79082' => {
      'BaseType' => '145',
      'Name' => 'uint8_t[16]',
      'Size' => '16',
      'Type' => 'Array'
    },
    '79098' => {
      'BaseType' => '79082',
      'Name' => 'uint8_t[16] const',
      'Size' => '16',
      'Type' => 'Const'
    },
    '79142' => {
      'BaseType' => '8126',
      'Name' => 'struct variable_field const',
      'Size' => '16',
      'Type' => 'Const'
    },
    '81289' => {
      'BaseType' => '145',
      'Name' => 'uint8_t[8]',
      'Size' => '8',
      'Type' => 'Array'
    },
    '81305' => {
      'Header' => 'firmware_update.h',
      'Line' => '465',
      'Memb' => {
        '0' => {
          'name' => 'uuid',
          'offset' => '0',
          'type' => '79082'
        },
        '1' => {
          'name' => 'package_header_format_version',
          'offset' => '22',
          'type' => '145'
        },
        '2' => {
          'name' => 'package_header_size',
          'offset' => '23',
          'type' => '157'
        },
        '3' => {
          'name' => 'package_release_date_time',
          'offset' => '25',
          'type' => '81418'
        },
        '4' => {
          'name' => 'component_bitmap_bit_length',
          'offset' => '50',
          'type' => '157'
        },
        '5' => {
          'name' => 'package_version_string_type',
          'offset' => '52',
          'type' => '145'
        },
        '6' => {
          'name' => 'package_version_string_length',
          'offset' => '53',
          'type' => '145'
        }
      },
      'Name' => 'struct pldm_package_header_information',
      'Size' => '36',
      'Type' => 'Struct'
    },
    '81418' => {
      'BaseType' => '145',
      'Name' => 'uint8_t[13]',
      'Size' => '13',
      'Type' => 'Array'
    },
    '81434' => {
      'Header' => 'firmware_update.h',
      'Line' => '479',
      'Memb' => {
        '0' => {
          'name' => 'record_length',
          'offset' => '0',
          'type' => '157'
        },
        '1' => {
          'name' => 'descriptor_count',
          'offset' => '2',
          'type' => '145'
        },
        '2' => {
          'name' => 'device_update_option_flags',
          'offset' => '3',
          'type' => '78099'
        },
        '3' => {
          'name' => 'comp_image_set_version_string_type',
          'offset' => '7',
          'type' => '145'
        },
        '4' => {
          'name' => 'comp_image_set_version_string_length',
          'offset' => '8',
          'type' => '145'
        },
        '5' => {
          'name' => 'fw_device_pkg_data_length',
          'offset' => '9',
          'type' => '157'
        }
      },
      'Name' => 'struct pldm_firmware_device_id_record',
      'Size' => '11',
      'Type' => 'Struct'
    },
    '81647' => {
      'Header' => 'firmware_update.h',
      'Line' => '513',
      'Memb' => {
        '0' => {
          'name' => 'comp_classification',
          'offset' => '0',
          'type' => '157'
        },
        '1' => {
          'name' => 'comp_identifier',
          'offset' => '2',
          'type' => '157'
        },
        '2' => {
          'name' => 'comp_comparison_stamp',
          'offset' => '4',
          'type' => '169'
        },
        '3' => {
          'name' => 'comp_options',
          'offset' => '8',
          'type' => '60052'
        },
        '4' => {
          'name' => 'requested_comp_activation_method',
          'offset' => '16',
          'type' => '60052'
        },
        '5' => {
          'name' => 'comp_location_offset',
          'offset' => '18',
          'type' => '169'
        },
        '6' => {
          'name' => 'comp_size',
          'offset' => '22',
          'type' => '169'
        },
        '7' => {
          'name' => 'comp_version_string_type',
          'offset' => '32',
          'type' => '145'
        },
        '8' => {
          'name' => 'comp_version_string_length',
          'offset' => '33',
          'type' => '145'
        }
      },
      'Name' => 'struct pldm_component_image_information',
      'Size' => '22',
      'Type' => 'Struct'
    },
    '81845' => {
      'Header' => 'firmware_update.h',
      'Line' => '539',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '145'
        },
        '1' => {
          'name' => 'capabilities_during_update',
          'offset' => '1',
          'type' => '78099'
        },
        '2' => {
          'name' => 'comp_count',
          'offset' => '5',
          'type' => '157'
        },
        '3' => {
          'name' => 'active_comp_image_set_ver_str_type',
          'offset' => '7',
          'type' => '145'
        },
        '4' => {
          'name' => 'active_comp_image_set_ver_str_len',
          'offset' => '8',
          'type' => '145'
        },
        '5' => {
          'name' => 'pending_comp_image_set_ver_str_type',
          'offset' => '9',
          'type' => '145'
        },
        '6' => {
          'name' => 'pending_comp_image_set_ver_str_len',
          'offset' => '16',
          'type' => '145'
        }
      },
      'Name' => 'struct pldm_get_firmware_parameters_resp',
      'Size' => '11',
      'Type' => 'Struct'
    },
    '82048' => {
      'Header' => 'firmware_update.h',
      'Line' => '567',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '145'
        },
        '1' => {
          'name' => 'downstream_device_update_supported',
          'offset' => '1',
          'type' => '145'
        },
        '2' => {
          'name' => 'number_of_downstream_devices',
          'offset' => '2',
          'type' => '157'
        },
        '3' => {
          'name' => 'max_number_of_downstream_devices',
          'offset' => '4',
          'type' => '157'
        },
        '4' => {
          'name' => 'capabilities',
          'offset' => '8',
          'type' => '78099'
        }
      },
      'Name' => 'struct pldm_query_downstream_devices_resp',
      'Size' => '12',
      'Type' => 'Struct'
    },
    '82133' => {
      'Header' => 'firmware_update.h',
      'Line' => '579',
      'Memb' => {
        '0' => {
          'name' => 'comp_classification',
          'offset' => '0',
          'type' => '157'
        },
        '1' => {
          'name' => 'comp_identifier',
          'offset' => '2',
          'type' => '157'
        },
        '2' => {
          'name' => 'comp_classification_index',
          'offset' => '4',
          'type' => '145'
        },
        '3' => {
          'name' => 'active_comp_comparison_stamp',
          'offset' => '5',
          'type' => '169'
        },
        '4' => {
          'name' => 'active_comp_ver_str_type',
          'offset' => '9',
          'type' => '145'
        },
        '5' => {
          'name' => 'active_comp_ver_str_len',
          'offset' => '16',
          'type' => '145'
        },
        '6' => {
          'name' => 'active_comp_release_date',
          'offset' => '17',
          'type' => '81289'
        },
        '7' => {
          'name' => 'pending_comp_comparison_stamp',
          'offset' => '25',
          'type' => '169'
        },
        '8' => {
          'name' => 'pending_comp_ver_str_type',
          'offset' => '35',
          'type' => '145'
        },
        '9' => {
          'name' => 'pending_comp_ver_str_len',
          'offset' => '36',
          'type' => '145'
        },
        '10' => {
          'name' => 'pending_comp_release_date',
          'offset' => '37',
          'type' => '81289'
        },
        '11' => {
          'name' => 'comp_activation_methods',
          'offset' => '51',
          'type' => '60052'
        },
        '12' => {
          'name' => 'capabilities_during_update',
          'offset' => '53',
          'type' => '78099'
        }
      },
      'Name' => 'struct pldm_component_parameter_entry',
      'Size' => '39',
      'Type' => 'Struct'
    },
    '82448' => {
      'Header' => 'firmware_update.h',
      'Line' => '618',
      'Memb' => {
        '0' => {
          'name' => 'data_transfer_handle',
          'offset' => '0',
          'type' => '169'
        },
        '1' => {
          'name' => 'transfer_operation_flag',
          'offset' => '4',
          'type' => '145'
        }
      },
      'Name' => 'struct pldm_query_downstream_identifiers_req',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '82491' => {
      'BaseType' => '82448',
      'Name' => 'struct pldm_query_downstream_identifiers_req const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '82496' => {
      'Header' => 'firmware_update.h',
      'Line' => '632',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '145'
        },
        '1' => {
          'name' => 'next_data_transfer_handle',
          'offset' => '4',
          'type' => '169'
        },
        '2' => {
          'name' => 'transfer_flag',
          'offset' => '8',
          'type' => '145'
        },
        '3' => {
          'name' => 'downstream_devices_length',
          'offset' => '18',
          'type' => '169'
        },
        '4' => {
          'name' => 'number_of_downstream_devices',
          'offset' => '22',
          'type' => '157'
        }
      },
      'Name' => 'struct pldm_query_downstream_identifiers_resp',
      'Size' => '20',
      'Type' => 'Struct'
    },
    '82581' => {
      'Header' => 'firmware_update.h',
      'Line' => '645',
      'Memb' => {
        '0' => {
          'name' => 'downstream_device_index',
          'offset' => '0',
          'type' => '157'
        },
        '1' => {
          'name' => 'downstream_descriptor_count',
          'offset' => '2',
          'type' => '145'
        }
      },
      'Name' => 'struct pldm_downstream_device',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '82624' => {
      'Header' => 'firmware_update.h',
      'Line' => '651',
      'Memb' => {
        '0' => {
          'name' => 'field',
          'offset' => '0',
          'type' => '8126'
        },
        '1' => {
          'name' => 'devs',
          'offset' => '22',
          'type' => '900'
        }
      },
      'Name' => 'struct pldm_downstream_device_iter',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '82667' => {
      'Header' => 'firmware_update.h',
      'Line' => '725',
      'Memb' => {
        '0' => {
          'name' => 'descriptor_type',
          'offset' => '0',
          'type' => '157'
        },
        '1' => {
          'name' => 'descriptor_length',
          'offset' => '2',
          'type' => '157'
        },
        '2' => {
          'name' => 'descriptor_data',
          'offset' => '8',
          'type' => '2061'
        }
      },
      'Name' => 'struct pldm_descriptor',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '82740' => {
      'Header' => 'firmware_update.h',
      'Line' => '731',
      'Memb' => {
        '0' => {
          'name' => 'field',
          'offset' => '0',
          'type' => '40220'
        },
        '1' => {
          'name' => 'count',
          'offset' => '8',
          'type' => '900'
        }
      },
      'Name' => 'struct pldm_descriptor_iter',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '82788' => {
      'Header' => 'firmware_update.h',
      'Line' => '824',
      'Memb' => {
        '0' => {
          'name' => 'data_transfer_handle',
          'offset' => '0',
          'type' => '169'
        },
        '1' => {
          'name' => 'transfer_operation_flag',
          'offset' => '4',
          'type' => '145'
        }
      },
      'Name' => 'struct pldm_get_downstream_firmware_parameters_req',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '82831' => {
      'BaseType' => '82788',
      'Name' => 'struct pldm_get_downstream_firmware_parameters_req const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '82836' => {
      'Header' => 'firmware_update.h',
      'Line' => '839',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '145'
        },
        '1' => {
          'name' => 'next_data_transfer_handle',
          'offset' => '4',
          'type' => '169'
        },
        '2' => {
          'name' => 'transfer_flag',
          'offset' => '8',
          'type' => '145'
        },
        '3' => {
          'name' => 'fdp_capabilities_during_update',
          'offset' => '18',
          'type' => '78099'
        },
        '4' => {
          'name' => 'downstream_device_count',
          'offset' => '22',
          'type' => '157'
        }
      },
      'Name' => 'struct pldm_get_downstream_firmware_parameters_resp',
      'Size' => '20',
      'Type' => 'Struct'
    },
    '82921' => {
      'Header' => 'firmware_update.h',
      'Line' => '857',
      'Memb' => {
        '0' => {
          'name' => 'downstream_device_index',
          'offset' => '0',
          'type' => '157'
        },
        '1' => {
          'name' => 'active_comp_comparison_stamp',
          'offset' => '4',
          'type' => '169'
        },
        '2' => {
          'name' => 'active_comp_ver_str_type',
          'offset' => '8',
          'type' => '145'
        },
        '3' => {
          'name' => 'active_comp_ver_str_len',
          'offset' => '9',
          'type' => '145'
        },
        '4' => {
          'name' => 'active_comp_release_date',
          'offset' => '16',
          'type' => '83118'
        },
        '5' => {
          'name' => 'pending_comp_comparison_stamp',
          'offset' => '32',
          'type' => '169'
        },
        '6' => {
          'name' => 'pending_comp_ver_str_type',
          'offset' => '36',
          'type' => '145'
        },
        '7' => {
          'name' => 'pending_comp_ver_str_len',
          'offset' => '37',
          'type' => '145'
        },
        '8' => {
          'name' => 'pending_comp_release_date',
          'offset' => '38',
          'type' => '83118'
        },
        '9' => {
          'name' => 'comp_activation_methods',
          'offset' => '54',
          'type' => '60052'
        },
        '10' => {
          'name' => 'capabilities_during_update',
          'offset' => '64',
          'type' => '78099'
        },
        '11' => {
          'name' => 'active_comp_ver_str',
          'offset' => '72',
          'type' => '2061'
        },
        '12' => {
          'name' => 'pending_comp_ver_str',
          'offset' => '86',
          'type' => '2061'
        }
      },
      'Name' => 'struct pldm_downstream_device_parameters_entry',
      'Size' => '64',
      'Type' => 'Struct'
    },
    '83118' => {
      'BaseType' => '138',
      'Name' => 'char[9]',
      'Size' => '9',
      'Type' => 'Array'
    },
    '84489' => {
      'Header' => 'firmware_update.h',
      'Line' => '1394',
      'Memb' => {
        '0' => {
          'name' => 'field',
          'offset' => '0',
          'type' => '8126'
        },
        '1' => {
          'name' => 'entries',
          'offset' => '22',
          'type' => '900'
        }
      },
      'Name' => 'struct pldm_downstream_device_parameters_iter',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '84532' => {
      'Header' => 'firmware_update.h',
      'Line' => '2248',
      'Memb' => {
        '0' => {
          'name' => 'magic',
          'offset' => '0',
          'type' => '895'
        },
        '1' => {
          'name' => 'version',
          'offset' => '4',
          'type' => '5629'
        }
      },
      'Name' => 'anon-struct-firmware_update.h-2248',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '84569' => {
      'Header' => 'firmware_update.h',
      'Line' => '2267',
      'Memb' => {
        '0' => {
          'name' => 'identifier',
          'offset' => '0',
          'type' => '79098'
        },
        '1' => {
          'name' => 'revision',
          'offset' => '22',
          'type' => '5629'
        }
      },
      'Name' => 'anon-struct-firmware_update.h-2267',
      'Size' => '17',
      'Type' => 'Struct'
    },
    '84606' => {
      'Header' => 'firmware_update.h',
      'Line' => '2247',
      'Memb' => {
        '0' => {
          'name' => 'meta',
          'offset' => '0',
          'type' => '84532'
        },
        '1' => {
          'name' => 'format',
          'offset' => '8',
          'type' => '84569'
        }
      },
      'Name' => 'struct pldm_package_format_pin',
      'Size' => '28',
      'Type' => 'Struct'
    },
    '84649' => {
      'BaseType' => '84606',
      'Name' => 'struct pldm_package_format_pin const',
      'Size' => '28',
      'Type' => 'Const'
    },
    '84654' => {
      'Header' => 'firmware_update.h',
      'Line' => '2276',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_PACKAGE_PARSE_INIT',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_PACKAGE_PARSE_COMPLETE',
          'value' => '1'
        },
        '2' => {
          'name' => 'PLDM_PACKAGE_PARSE_HEADER',
          'value' => '2'
        },
        '3' => {
          'name' => 'PLDM_PACKAGE_PARSE_FIRMWARE_DEVICES',
          'value' => '3'
        },
        '4' => {
          'name' => 'PLDM_PACKAGE_PARSE_DOWNSTREAM_DEVICES',
          'value' => '4'
        },
        '5' => {
          'name' => 'PLDM_PACKAGE_PARSE_COMPONENT_IMAGE_INFORMATION',
          'value' => '5'
        }
      },
      'Name' => 'enum pldm_package_parse',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '84706' => {
      'Header' => 'firmware_update.h',
      'Line' => '2285',
      'Memb' => {
        '0' => {
          'name' => 'field',
          'offset' => '0',
          'type' => '8126'
        },
        '1' => {
          'name' => 'entries',
          'offset' => '22',
          'type' => '900'
        }
      },
      'Name' => 'struct pldm_package_iter',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '84749' => {
      'Header' => 'firmware_update.h',
      'Line' => '2298',
      'Memb' => {
        '0' => {
          'name' => 'package_header_identifier',
          'offset' => '0',
          'type' => '79070'
        },
        '1' => {
          'name' => 'package_header_format_revision',
          'offset' => '22',
          'type' => '145'
        },
        '2' => {
          'name' => 'package_release_date_time',
          'offset' => '23',
          'type' => '81418'
        },
        '3' => {
          'name' => 'component_bitmap_bit_length',
          'offset' => '48',
          'type' => '157'
        },
        '4' => {
          'name' => 'package_version_string_type',
          'offset' => '50',
          'type' => '145'
        },
        '5' => {
          'name' => 'package_version_string',
          'offset' => '64',
          'type' => '8126'
        }
      },
      'Name' => 'struct pldm__package_header_information',
      'Size' => '56',
      'Type' => 'Struct'
    },
    '84848' => {
      'BaseType' => '84749',
      'Header' => 'firmware_update.h',
      'Line' => '2311',
      'Name' => 'pldm_package_header_information_pad',
      'Size' => '56',
      'Type' => 'Typedef'
    },
    '84861' => {
      'BaseType' => '84848',
      'Name' => 'pldm_package_header_information_pad const',
      'Size' => '56',
      'Type' => 'Const'
    },
    '84866' => {
      'Header' => 'firmware_update.h',
      'Line' => '2314',
      'Memb' => {
        '0' => {
          'name' => 'bitmap',
          'offset' => '0',
          'type' => '8126'
        }
      },
      'Name' => 'struct pldm_package_component_bitmap',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '84895' => {
      'Header' => 'firmware_update.h',
      'Line' => '2326',
      'Memb' => {
        '0' => {
          'name' => 'descriptor_count',
          'offset' => '0',
          'type' => '145'
        },
        '1' => {
          'name' => 'device_update_option_flags',
          'offset' => '4',
          'type' => '78099'
        },
        '2' => {
          'name' => 'component_image_set_version_string_type',
          'offset' => '8',
          'type' => '145'
        },
        '3' => {
          'name' => 'component_image_set_version_string',
          'offset' => '22',
          'type' => '8126'
        },
        '4' => {
          'name' => 'applicable_components',
          'offset' => '50',
          'type' => '84866'
        },
        '5' => {
          'name' => 'record_descriptors',
          'offset' => '72',
          'type' => '8126'
        },
        '6' => {
          'name' => 'firmware_device_package_data',
          'offset' => '100',
          'type' => '8126'
        },
        '7' => {
          'name' => 'reference_manifest_data',
          'offset' => '128',
          'type' => '8126'
        }
      },
      'Name' => 'struct pldm_package_firmware_device_id_record',
      'Size' => '96',
      'Type' => 'Struct'
    },
    '85022' => {
      'Header' => 'firmware_update.h',
      'Line' => '2377',
      'Memb' => {
        '0' => {
          'name' => 'descriptor_count',
          'offset' => '0',
          'type' => '145'
        },
        '1' => {
          'name' => 'update_option_flags',
          'offset' => '4',
          'type' => '78099'
        },
        '2' => {
          'name' => 'self_contained_activation_min_version_string_type',
          'offset' => '8',
          'type' => '145'
        },
        '3' => {
          'name' => 'self_contained_activation_min_version_string',
          'offset' => '22',
          'type' => '8126'
        },
        '4' => {
          'name' => 'self_contained_activation_min_version_comparison_stamp',
          'offset' => '50',
          'type' => '169'
        },
        '5' => {
          'name' => 'applicable_components',
          'offset' => '64',
          'type' => '84866'
        },
        '6' => {
          'name' => 'record_descriptors',
          'offset' => '86',
          'type' => '8126'
        },
        '7' => {
          'name' => 'package_data',
          'offset' => '114',
          'type' => '8126'
        },
        '8' => {
          'name' => 'reference_manifest_data',
          'offset' => '136',
          'type' => '8126'
        }
      },
      'Name' => 'struct pldm_package_downstream_device_id_record',
      'Size' => '104',
      'Type' => 'Struct'
    },
    '85163' => {
      'Header' => 'firmware_update.h',
      'Line' => '2427',
      'Memb' => {
        '0' => {
          'name' => 'component_classification',
          'offset' => '0',
          'type' => '157'
        },
        '1' => {
          'name' => 'component_identifier',
          'offset' => '2',
          'type' => '157'
        },
        '2' => {
          'name' => 'component_comparison_stamp',
          'offset' => '4',
          'type' => '169'
        },
        '3' => {
          'name' => 'component_options',
          'offset' => '8',
          'type' => '60052'
        },
        '4' => {
          'name' => 'requested_component_activation_method',
          'offset' => '16',
          'type' => '60052'
        },
        '5' => {
          'name' => 'component_image',
          'offset' => '22',
          'type' => '8126'
        },
        '6' => {
          'name' => 'component_version_string_type',
          'offset' => '50',
          'type' => '145'
        },
        '7' => {
          'name' => 'component_version_string',
          'offset' => '64',
          'type' => '8126'
        },
        '8' => {
          'name' => 'component_opaque_data',
          'offset' => '86',
          'type' => '8126'
        }
      },
      'Name' => 'struct pldm_package_component_image_information',
      'Size' => '72',
      'Type' => 'Struct'
    },
    '85304' => {
      'Header' => 'firmware_update.h',
      'Line' => '2468',
      'Memb' => {
        '0' => {
          'name' => 'pin',
          'offset' => '0',
          'type' => '85415'
        },
        '1' => {
          'name' => 'hdr',
          'offset' => '8',
          'type' => '85420'
        },
        '2' => {
          'name' => 'state',
          'offset' => '22',
          'type' => '84654'
        },
        '3' => {
          'name' => 'flags',
          'offset' => '32',
          'type' => '169'
        },
        '4' => {
          'name' => 'package',
          'offset' => '36',
          'type' => '8126'
        },
        '5' => {
          'name' => 'areas',
          'offset' => '64',
          'type' => '8126'
        },
        '6' => {
          'name' => 'iter',
          'offset' => '86',
          'type' => '84706'
        }
      },
      'Name' => 'struct pldm_package',
      'Size' => '80',
      'Type' => 'Struct'
    },
    '85415' => {
      'BaseType' => '84649',
      'Name' => 'struct pldm_package_format_pin const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '85420' => {
      'BaseType' => '84861',
      'Name' => 'pldm_package_header_information_pad const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '92511' => {
      'BaseType' => '85304',
      'Name' => 'struct pldm_package*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '92516' => {
      'BaseType' => '85163',
      'Name' => 'struct pldm_package_component_image_information*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '100738' => {
      'BaseType' => '85022',
      'Name' => 'struct pldm_package_downstream_device_id_record*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '102446' => {
      'BaseType' => '84895',
      'Name' => 'struct pldm_package_firmware_device_id_record*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '104253' => {
      'BaseType' => '84848',
      'Name' => 'pldm_package_header_information_pad*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '106398' => {
      'BaseType' => '77315',
      'Name' => 'bool8_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '106403' => {
      'BaseType' => '79051',
      'Name' => 'bitfield64_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '110603' => {
      'BaseType' => '78099',
      'Name' => 'bitfield32_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '115876' => {
      'BaseType' => '60052',
      'Name' => 'bitfield16_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '128974' => {
      'BaseType' => '79142',
      'Name' => 'struct variable_field const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '156759' => {
      'BaseType' => '84489',
      'Name' => 'struct pldm_downstream_device_parameters_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '156764' => {
      'BaseType' => '82921',
      'Name' => 'struct pldm_downstream_device_parameters_entry*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '160357' => {
      'BaseType' => '82836',
      'Name' => 'struct pldm_get_downstream_firmware_parameters_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '161863' => {
      'BaseType' => '82831',
      'Name' => 'struct pldm_get_downstream_firmware_parameters_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '163492' => {
      'BaseType' => '82624',
      'Name' => 'struct pldm_downstream_device_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '163497' => {
      'BaseType' => '82581',
      'Name' => 'struct pldm_downstream_device*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '167031' => {
      'BaseType' => '82496',
      'Name' => 'struct pldm_query_downstream_identifiers_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '168537' => {
      'BaseType' => '82491',
      'Name' => 'struct pldm_query_downstream_identifiers_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '171993' => {
      'BaseType' => '82048',
      'Name' => 'struct pldm_query_downstream_devices_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '172440' => {
      'BaseType' => '82133',
      'Name' => 'struct pldm_component_parameter_entry*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '183232' => {
      'BaseType' => '81845',
      'Name' => 'struct pldm_get_firmware_parameters_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '186963' => {
      'BaseType' => '2326',
      'Name' => 'uint8_t**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '187305' => {
      'BaseType' => '81647',
      'Name' => 'struct pldm_component_image_information*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '190352' => {
      'BaseType' => '82740',
      'Name' => 'struct pldm_descriptor_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '190357' => {
      'BaseType' => '82667',
      'Name' => 'struct pldm_descriptor*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '190741' => {
      'BaseType' => '81434',
      'Name' => 'struct pldm_firmware_device_id_record*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '199612' => {
      'BaseType' => '869',
      'Name' => 'void**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '200113' => {
      'BaseType' => '81305',
      'Name' => 'struct pldm_package_header_information*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '217533' => {
      'BaseType' => '217550',
      'Header' => 'pdr.h',
      'Line' => '16',
      'Name' => 'pldm_pdr',
      'PrivateABI' => 1,
      'Size' => '24',
      'Type' => 'Typedef'
    },
    '217545' => {
      'BaseType' => '217533',
      'Name' => 'pldm_pdr const',
      'Size' => '24',
      'Type' => 'Const'
    },
    '217550' => {
      'Line' => '31',
      'Memb' => {
        '0' => {
          'name' => 'record_count',
          'offset' => '0',
          'type' => '169'
        },
        '1' => {
          'name' => 'size',
          'offset' => '4',
          'type' => '169'
        },
        '2' => {
          'name' => 'first',
          'offset' => '8',
          'type' => '219014'
        },
        '3' => {
          'name' => 'last',
          'offset' => '22',
          'type' => '219014'
        }
      },
      'Name' => 'struct pldm_pdr',
      'PrivateABI' => 1,
      'Size' => '24',
      'Source' => 'pdr.c',
      'Type' => 'Struct'
    },
    '217616' => {
      'BaseType' => '217633',
      'Header' => 'pdr.h',
      'Line' => '21',
      'Name' => 'pldm_pdr_record',
      'PrivateABI' => 1,
      'Size' => '32',
      'Type' => 'Typedef'
    },
    '217628' => {
      'BaseType' => '217616',
      'Name' => 'pldm_pdr_record const',
      'Size' => '32',
      'Type' => 'Const'
    },
    '217633' => {
      'Line' => '22',
      'Memb' => {
        '0' => {
          'name' => 'record_handle',
          'offset' => '0',
          'type' => '169'
        },
        '1' => {
          'name' => 'size',
          'offset' => '4',
          'type' => '169'
        },
        '2' => {
          'name' => 'data',
          'offset' => '8',
          'type' => '2326'
        },
        '3' => {
          'name' => 'next',
          'offset' => '22',
          'type' => '219002'
        },
        '4' => {
          'name' => 'is_remote',
          'offset' => '36',
          'type' => '7003'
        },
        '5' => {
          'name' => 'terminus_handle',
          'offset' => '38',
          'type' => '157'
        }
      },
      'Name' => 'struct pldm_pdr_record',
      'PrivateABI' => 1,
      'Size' => '32',
      'Source' => 'pdr.c',
      'Type' => 'Struct'
    },
    '217725' => {
      'Header' => 'pdr.h',
      'Line' => '327',
      'Memb' => {
        '0' => {
          'name' => 'entity_type',
          'offset' => '0',
          'type' => '157'
        },
        '1' => {
          'name' => 'entity_instance_num',
          'offset' => '2',
          'type' => '157'
        },
        '2' => {
          'name' => 'entity_container_id',
          'offset' => '4',
          'type' => '157'
        }
      },
      'Name' => 'struct pldm_entity',
      'Size' => '6',
      'Type' => 'Struct'
    },
    '217787' => {
      'BaseType' => '217725',
      'Header' => 'pdr.h',
      'Line' => '331',
      'Name' => 'pldm_entity',
      'Size' => '6',
      'Type' => 'Typedef'
    },
    '217799' => {
      'BaseType' => '217787',
      'Name' => 'pldm_entity const',
      'Size' => '6',
      'Type' => 'Const'
    },
    '217833' => {
      'BaseType' => '217845',
      'Header' => 'pdr.h',
      'Line' => '341',
      'Name' => 'pldm_entity_association_tree',
      'PrivateABI' => 1,
      'Size' => '16',
      'Type' => 'Typedef'
    },
    '217845' => {
      'Line' => '648',
      'Memb' => {
        '0' => {
          'name' => 'root',
          'offset' => '0',
          'type' => '219019'
        },
        '1' => {
          'name' => 'last_used_container_id',
          'offset' => '8',
          'type' => '157'
        }
      },
      'Name' => 'struct pldm_entity_association_tree',
      'PrivateABI' => 1,
      'Size' => '16',
      'Source' => 'pdr.c',
      'Type' => 'Struct'
    },
    '217888' => {
      'BaseType' => '217905',
      'Header' => 'pdr.h',
      'Line' => '346',
      'Name' => 'pldm_entity_node',
      'PrivateABI' => 1,
      'Size' => '40',
      'Type' => 'Typedef'
    },
    '217900' => {
      'BaseType' => '217888',
      'Name' => 'pldm_entity_node const',
      'Size' => '40',
      'Type' => 'Const'
    },
    '217905' => {
      'Line' => '653',
      'Memb' => {
        '0' => {
          'name' => 'entity',
          'offset' => '0',
          'type' => '217787'
        },
        '1' => {
          'name' => 'parent',
          'offset' => '6',
          'type' => '217787'
        },
        '2' => {
          'name' => 'remote_container_id',
          'offset' => '18',
          'type' => '157'
        },
        '3' => {
          'name' => 'first_child',
          'offset' => '22',
          'type' => '219019'
        },
        '4' => {
          'name' => 'next_sibling',
          'offset' => '36',
          'type' => '219019'
        },
        '5' => {
          'name' => 'association_type',
          'offset' => '50',
          'type' => '145'
        }
      },
      'Name' => 'struct pldm_entity_node',
      'PrivateABI' => 1,
      'Size' => '40',
      'Source' => 'pdr.c',
      'Type' => 'Struct'
    },
    '218220' => {
      'Header' => 'platform.h',
      'Line' => '575',
      'Memb' => {
        '0' => {
          'name' => 'record_handle',
          'offset' => '0',
          'type' => '169'
        },
        '1' => {
          'name' => 'version',
          'offset' => '4',
          'type' => '145'
        },
        '2' => {
          'name' => 'type',
          'offset' => '5',
          'type' => '145'
        },
        '3' => {
          'name' => 'record_change_num',
          'offset' => '6',
          'type' => '157'
        },
        '4' => {
          'name' => 'length',
          'offset' => '8',
          'type' => '157'
        }
      },
      'Name' => 'struct pldm_pdr_hdr',
      'Size' => '10',
      'Type' => 'Struct'
    },
    '218669' => {
      'Header' => 'platform.h',
      'Line' => '650',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '218220'
        },
        '1' => {
          'name' => 'terminus_handle',
          'offset' => '16',
          'type' => '157'
        },
        '2' => {
          'name' => 'sensor_id',
          'offset' => '18',
          'type' => '157'
        },
        '3' => {
          'name' => 'entity_type',
          'offset' => '20',
          'type' => '157'
        },
        '4' => {
          'name' => 'entity_instance',
          'offset' => '22',
          'type' => '157'
        },
        '5' => {
          'name' => 'container_id',
          'offset' => '24',
          'type' => '157'
        },
        '6' => {
          'name' => 'sensor_init',
          'offset' => '32',
          'type' => '145'
        },
        '7' => {
          'name' => 'sensor_auxiliary_names_pdr',
          'offset' => '33',
          'type' => '77315'
        },
        '8' => {
          'name' => 'composite_sensor_count',
          'offset' => '34',
          'type' => '145'
        },
        '9' => {
          'name' => 'possible_states',
          'offset' => '35',
          'type' => '1798'
        }
      },
      'Name' => 'struct pldm_state_sensor_pdr',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '218823' => {
      'Header' => 'platform.h',
      'Line' => '677',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '218220'
        },
        '1' => {
          'name' => 'terminus_handle',
          'offset' => '16',
          'type' => '157'
        },
        '2' => {
          'name' => 'effecter_id',
          'offset' => '18',
          'type' => '157'
        },
        '3' => {
          'name' => 'entity_type',
          'offset' => '20',
          'type' => '157'
        },
        '4' => {
          'name' => 'entity_instance',
          'offset' => '22',
          'type' => '157'
        },
        '5' => {
          'name' => 'container_id',
          'offset' => '24',
          'type' => '157'
        },
        '6' => {
          'name' => 'effecter_semantic_id',
          'offset' => '32',
          'type' => '157'
        },
        '7' => {
          'name' => 'effecter_init',
          'offset' => '34',
          'type' => '145'
        },
        '8' => {
          'name' => 'has_description_pdr',
          'offset' => '35',
          'type' => '77315'
        },
        '9' => {
          'name' => 'composite_effecter_count',
          'offset' => '36',
          'type' => '145'
        },
        '10' => {
          'name' => 'possible_states',
          'offset' => '37',
          'type' => '1798'
        }
      },
      'Name' => 'struct pldm_state_effecter_pdr',
      'Size' => '26',
      'Type' => 'Struct'
    },
    '219002' => {
      'BaseType' => '217633',
      'Name' => 'struct pldm_pdr_record*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '219014' => {
      'BaseType' => '217616',
      'Name' => 'pldm_pdr_record*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '219019' => {
      'BaseType' => '217888',
      'Name' => 'pldm_entity_node*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '219386' => {
      'BaseType' => '217833',
      'Name' => 'pldm_entity_association_tree*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '219391' => {
      'BaseType' => '217799',
      'Name' => 'pldm_entity const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '220932' => {
      'BaseType' => '217533',
      'Name' => 'pldm_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '222644' => {
      'BaseType' => '217628',
      'Name' => 'pldm_pdr_record const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '231730' => {
      'BaseType' => '217787',
      'Name' => 'pldm_entity*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '252285' => {
      'BaseType' => '231730',
      'Name' => 'pldm_entity**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '252932' => {
      'BaseType' => '219019',
      'Name' => 'pldm_entity_node**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '253721' => {
      'BaseType' => '217545',
      'Name' => 'pldm_pdr const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '259194' => {
      'BaseType' => '217900',
      'Name' => 'pldm_entity_node const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '266258' => {
      'BaseType' => '218823',
      'Name' => 'struct pldm_state_effecter_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '272148' => {
      'BaseType' => '218669',
      'Name' => 'struct pldm_state_sensor_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '277367' => {
      'BaseType' => '74',
      'Header' => 'types.h',
      'Line' => '37',
      'Name' => '__int8_t',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '277398' => {
      'BaseType' => '93',
      'Header' => 'types.h',
      'Line' => '39',
      'Name' => '__int16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '277429' => {
      'BaseType' => '112',
      'Header' => 'types.h',
      'Line' => '41',
      'Name' => '__int32_t',
      'PrivateABI' => 1,
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '277467' => {
      'BaseType' => '100',
      'Header' => 'types.h',
      'Line' => '55',
      'Name' => '__uint_least16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '277520' => {
      'BaseType' => '277367',
      'Header' => 'stdint-intn.h',
      'Line' => '24',
      'Name' => 'int8_t',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '277532' => {
      'BaseType' => '277398',
      'Header' => 'stdint-intn.h',
      'Line' => '25',
      'Name' => 'int16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '277544' => {
      'BaseType' => '277429',
      'Header' => 'stdint-intn.h',
      'Line' => '26',
      'Name' => 'int32_t',
      'PrivateABI' => 1,
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '278212' => {
      'BaseType' => '1184',
      'Header' => 'pldm_types.h',
      'Line' => '170',
      'Name' => 'real32_t',
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '278972' => {
      'BaseType' => '277467',
      'Header' => 'uchar.h',
      'Line' => '51',
      'Name' => 'char16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '279889' => {
      'Header' => 'platform.h',
      'Line' => '344',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_SENSOR_OP_STATE',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_STATE_SENSOR_STATE',
          'value' => '1'
        },
        '2' => {
          'name' => 'PLDM_NUMERIC_SENSOR_STATE',
          'value' => '2'
        }
      },
      'Name' => 'enum sensor_event_class_states',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '279923' => {
      'BaseType' => '279889',
      'Name' => 'enum sensor_event_class_states const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '280419' => {
      'Header' => 'platform.h',
      'Line' => '667',
      'Memb' => {
        '0' => {
          'name' => 'state_set_id',
          'offset' => '0',
          'type' => '157'
        },
        '1' => {
          'name' => 'possible_states_size',
          'offset' => '2',
          'type' => '145'
        },
        '2' => {
          'name' => 'states',
          'offset' => '3',
          'type' => '280481'
        }
      },
      'Name' => 'struct state_sensor_possible_states',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '280476' => {
      'BaseType' => '280419',
      'Name' => 'struct state_sensor_possible_states const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '280481' => {
      'BaseType' => '1084',
      'Name' => 'bitfield8_t[1]',
      'Size' => '1',
      'Type' => 'Array'
    },
    '280854' => {
      'Header' => 'platform.h',
      'Line' => '768',
      'Memb' => {
        '0' => {
          'name' => 'value_u8',
          'offset' => '0',
          'type' => '145'
        },
        '1' => {
          'name' => 'value_s8',
          'offset' => '0',
          'type' => '277520'
        },
        '2' => {
          'name' => 'value_u16',
          'offset' => '0',
          'type' => '157'
        },
        '3' => {
          'name' => 'value_s16',
          'offset' => '0',
          'type' => '277532'
        },
        '4' => {
          'name' => 'value_u32',
          'offset' => '0',
          'type' => '169'
        },
        '5' => {
          'name' => 'value_s32',
          'offset' => '0',
          'type' => '277544'
        },
        '6' => {
          'name' => 'value_f32',
          'offset' => '0',
          'type' => '278212'
        }
      },
      'Name' => 'union union_range_field_format',
      'Size' => '4',
      'Type' => 'Union'
    },
    '281453' => {
      'Header' => 'platform.h',
      'Line' => '825',
      'Memb' => {
        '0' => {
          'name' => 'value_u8',
          'offset' => '0',
          'type' => '145'
        },
        '1' => {
          'name' => 'value_s8',
          'offset' => '0',
          'type' => '277520'
        },
        '2' => {
          'name' => 'value_u16',
          'offset' => '0',
          'type' => '157'
        },
        '3' => {
          'name' => 'value_s16',
          'offset' => '0',
          'type' => '277532'
        },
        '4' => {
          'name' => 'value_u32',
          'offset' => '0',
          'type' => '169'
        },
        '5' => {
          'name' => 'value_s32',
          'offset' => '0',
          'type' => '277544'
        }
      },
      'Name' => 'union union_sensor_data_size',
      'Size' => '4',
      'Type' => 'Union'
    },
    '281466' => {
      'Header' => 'platform.h',
      'Line' => '832',
      'Memb' => {
        '0' => {
          'name' => 'record_handle',
          'offset' => '0',
          'type' => '169'
        },
        '1' => {
          'name' => 'version',
          'offset' => '4',
          'type' => '145'
        },
        '2' => {
          'name' => 'type',
          'offset' => '5',
          'type' => '145'
        },
        '3' => {
          'name' => 'record_change_num',
          'offset' => '6',
          'type' => '157'
        },
        '4' => {
          'name' => 'length',
          'offset' => '8',
          'type' => '157'
        }
      },
      'Name' => 'struct pldm_value_pdr_hdr',
      'Size' => '12',
      'Type' => 'Struct'
    },
    '281551' => {
      'Header' => 'platform.h',
      'Line' => '850',
      'Memb' => {
        '0' => {
          'name' => 'entity_instance_num',
          'offset' => '0',
          'type' => '157'
        },
        '1' => {
          'name' => 'entity_instance',
          'offset' => '0',
          'type' => '157'
        }
      },
      'Name' => 'anon-union-platform.h-850',
      'Size' => '2',
      'Type' => 'Union'
    },
    '281585' => {
      'Header' => 'platform.h',
      'Line' => '845',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '281466'
        },
        '1' => {
          'name' => 'terminus_handle',
          'offset' => '18',
          'type' => '157'
        },
        '2' => {
          'name' => 'sensor_id',
          'offset' => '20',
          'type' => '157'
        },
        '3' => {
          'name' => 'entity_type',
          'offset' => '22',
          'type' => '157'
        },
        '4' => {
          'name' => 'unnamed0',
          'offset' => '24',
          'type' => '281551'
        },
        '5' => {
          'name' => 'container_id',
          'offset' => '32',
          'type' => '157'
        },
        '6' => {
          'name' => 'sensor_init',
          'offset' => '34',
          'type' => '145'
        },
        '7' => {
          'name' => 'sensor_auxiliary_names_pdr',
          'offset' => '35',
          'type' => '77315'
        },
        '8' => {
          'name' => 'base_unit',
          'offset' => '36',
          'type' => '145'
        },
        '9' => {
          'name' => 'unit_modifier',
          'offset' => '37',
          'type' => '277520'
        },
        '10' => {
          'name' => 'rate_unit',
          'offset' => '38',
          'type' => '145'
        },
        '11' => {
          'name' => 'base_oem_unit_handle',
          'offset' => '39',
          'type' => '145'
        },
        '12' => {
          'name' => 'aux_unit',
          'offset' => '40',
          'type' => '145'
        },
        '13' => {
          'name' => 'aux_unit_modifier',
          'offset' => '41',
          'type' => '277520'
        },
        '14' => {
          'name' => 'aux_rate_unit',
          'offset' => '48',
          'type' => '145'
        },
        '15' => {
          'name' => 'rel',
          'offset' => '49',
          'type' => '145'
        },
        '16' => {
          'name' => 'aux_oem_unit_handle',
          'offset' => '50',
          'type' => '145'
        },
        '17' => {
          'name' => 'is_linear',
          'offset' => '51',
          'type' => '77315'
        },
        '18' => {
          'name' => 'sensor_data_size',
          'offset' => '52',
          'type' => '145'
        },
        '19' => {
          'name' => 'resolution',
          'offset' => '54',
          'type' => '278212'
        },
        '20' => {
          'name' => 'offset',
          'offset' => '64',
          'type' => '278212'
        },
        '21' => {
          'name' => 'accuracy',
          'offset' => '68',
          'type' => '157'
        },
        '22' => {
          'name' => 'plus_tolerance',
          'offset' => '70',
          'type' => '145'
        },
        '23' => {
          'name' => 'minus_tolerance',
          'offset' => '71',
          'type' => '145'
        },
        '24' => {
          'name' => 'hysteresis',
          'offset' => '72',
          'type' => '281453'
        },
        '25' => {
          'name' => 'supported_thresholds',
          'offset' => '82',
          'type' => '1084'
        },
        '26' => {
          'name' => 'threshold_and_hysteresis_volatility',
          'offset' => '83',
          'type' => '1084'
        },
        '27' => {
          'name' => 'state_transition_interval',
          'offset' => '86',
          'type' => '278212'
        },
        '28' => {
          'name' => 'update_interval',
          'offset' => '96',
          'type' => '278212'
        },
        '29' => {
          'name' => 'max_readable',
          'offset' => '100',
          'type' => '281453'
        },
        '30' => {
          'name' => 'min_readable',
          'offset' => '104',
          'type' => '281453'
        },
        '31' => {
          'name' => 'range_field_format',
          'offset' => '114',
          'type' => '145'
        },
        '32' => {
          'name' => 'range_field_support',
          'offset' => '115',
          'type' => '1084'
        },
        '33' => {
          'name' => 'nominal_value',
          'offset' => '118',
          'type' => '280854'
        },
        '34' => {
          'name' => 'normal_max',
          'offset' => '128',
          'type' => '280854'
        },
        '35' => {
          'name' => 'normal_min',
          'offset' => '132',
          'type' => '280854'
        },
        '36' => {
          'name' => 'warning_high',
          'offset' => '136',
          'type' => '280854'
        },
        '37' => {
          'name' => 'warning_low',
          'offset' => '146',
          'type' => '280854'
        },
        '38' => {
          'name' => 'critical_high',
          'offset' => '150',
          'type' => '280854'
        },
        '39' => {
          'name' => 'critical_low',
          'offset' => '256',
          'type' => '280854'
        },
        '40' => {
          'name' => 'fatal_high',
          'offset' => '260',
          'type' => '280854'
        },
        '41' => {
          'name' => 'fatal_low',
          'offset' => '264',
          'type' => '280854'
        }
      },
      'Name' => 'struct pldm_numeric_sensor_value_pdr',
      'Size' => '112',
      'Type' => 'Struct'
    },
    '282178' => {
      'BaseType' => '278972',
      'Header' => 'platform.h',
      'Line' => '893',
      'Name' => 'pldm_utf16be',
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '282191' => {
      'Header' => 'platform.h',
      'Line' => '895',
      'Memb' => {
        '0' => {
          'name' => 'tag',
          'offset' => '0',
          'type' => '7743'
        },
        '1' => {
          'name' => 'name',
          'offset' => '8',
          'type' => '282233'
        }
      },
      'Name' => 'struct pldm_entity_auxiliary_name',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '282233' => {
      'BaseType' => '282178',
      'Name' => 'pldm_utf16be*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '282238' => {
      'Header' => 'platform.h',
      'Line' => '905',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '281466'
        },
        '1' => {
          'name' => 'container',
          'offset' => '18',
          'type' => '217787'
        },
        '2' => {
          'name' => 'shared_name_count',
          'offset' => '24',
          'type' => '145'
        },
        '3' => {
          'name' => 'name_string_count',
          'offset' => '25',
          'type' => '145'
        },
        '4' => {
          'name' => 'names',
          'offset' => '36',
          'type' => '282352'
        },
        '5' => {
          'name' => 'auxiliary_name_data_size',
          'offset' => '50',
          'type' => '900'
        },
        '6' => {
          'name' => 'auxiliary_name_data',
          'offset' => '64',
          'type' => '282357'
        }
      },
      'Name' => 'struct pldm_entity_auxiliary_names_pdr',
      'Size' => '40',
      'Type' => 'Struct'
    },
    '282352' => {
      'BaseType' => '282191',
      'Name' => 'struct pldm_entity_auxiliary_name*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '282357' => {
      'BaseType' => '138',
      'Name' => 'char[]',
      'Size' => '8',
      'Type' => 'Array'
    },
    '282372' => {
      'Header' => 'platform.h',
      'Line' => '935',
      'Memb' => {
        '0' => {
          'name' => 'state_set_id',
          'offset' => '0',
          'type' => '157'
        },
        '1' => {
          'name' => 'possible_states_size',
          'offset' => '2',
          'type' => '145'
        },
        '2' => {
          'name' => 'states',
          'offset' => '3',
          'type' => '280481'
        }
      },
      'Name' => 'struct state_effecter_possible_states',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '282429' => {
      'BaseType' => '282372',
      'Name' => 'struct state_effecter_possible_states const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '282434' => {
      'Header' => 'platform.h',
      'Line' => '959',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '281466'
        },
        '1' => {
          'name' => 'terminus_handle',
          'offset' => '18',
          'type' => '157'
        },
        '2' => {
          'name' => 'file_identifier',
          'offset' => '20',
          'type' => '157'
        },
        '3' => {
          'name' => 'container',
          'offset' => '22',
          'type' => '217787'
        },
        '4' => {
          'name' => 'superior_directory_file_identifier',
          'offset' => '34',
          'type' => '157'
        },
        '5' => {
          'name' => 'file_classification',
          'offset' => '36',
          'type' => '145'
        },
        '6' => {
          'name' => 'oem_file_classification',
          'offset' => '37',
          'type' => '145'
        },
        '7' => {
          'name' => 'file_capabilities',
          'offset' => '38',
          'type' => '60052'
        },
        '8' => {
          'name' => 'file_version',
          'offset' => '40',
          'type' => '1167'
        },
        '9' => {
          'name' => 'file_maximum_size',
          'offset' => '50',
          'type' => '169'
        },
        '10' => {
          'name' => 'file_maximum_file_descriptor_count',
          'offset' => '54',
          'type' => '145'
        },
        '11' => {
          'name' => 'file_name',
          'offset' => '64',
          'type' => '8126'
        },
        '12' => {
          'name' => 'oem_file_classification_name',
          'offset' => '86',
          'type' => '8126'
        }
      },
      'Name' => 'struct pldm_platform_file_descriptor_pdr',
      'Size' => '72',
      'Type' => 'Struct'
    },
    '282635' => {
      'Header' => 'platform.h',
      'Line' => '1005',
      'Memb' => {
        '0' => {
          'name' => 'set_request',
          'offset' => '0',
          'type' => '145'
        },
        '1' => {
          'name' => 'effecter_state',
          'offset' => '1',
          'type' => '145'
        }
      },
      'Name' => 'struct state_field_for_state_effecter_set',
      'Size' => '2',
      'Type' => 'Struct'
    },
    '282678' => {
      'BaseType' => '282635',
      'Header' => 'platform.h',
      'Line' => '1008',
      'Name' => 'set_effecter_state_field',
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '282691' => {
      'Header' => 'platform.h',
      'Line' => '1014',
      'Memb' => {
        '0' => {
          'name' => 'sensor_op_state',
          'offset' => '0',
          'type' => '145'
        },
        '1' => {
          'name' => 'present_state',
          'offset' => '1',
          'type' => '145'
        },
        '2' => {
          'name' => 'previous_state',
          'offset' => '2',
          'type' => '145'
        },
        '3' => {
          'name' => 'event_state',
          'offset' => '3',
          'type' => '145'
        }
      },
      'Name' => 'struct state_field_for_get_state_sensor_readings',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '282762' => {
      'BaseType' => '282691',
      'Header' => 'platform.h',
      'Line' => '1022',
      'Name' => 'get_sensor_state_field',
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '282775' => {
      'Header' => 'platform.h',
      'Line' => '1028',
      'Memb' => {
        '0' => {
          'name' => 'effecter_op_state',
          'offset' => '0',
          'type' => '145'
        },
        '1' => {
          'name' => 'pending_state',
          'offset' => '1',
          'type' => '145'
        },
        '2' => {
          'name' => 'present_state',
          'offset' => '2',
          'type' => '145'
        }
      },
      'Name' => 'struct state_field_for_get_state_effecter_states',
      'Size' => '3',
      'Type' => 'Struct'
    },
    '282832' => {
      'BaseType' => '282775',
      'Header' => 'platform.h',
      'Line' => '1032',
      'Name' => 'get_effecter_state_field',
      'Size' => '3',
      'Type' => 'Typedef'
    },
    '283316' => {
      'Header' => 'platform.h',
      'Line' => '1105',
      'Memb' => {
        '0' => {
          'name' => 'mctp_eid',
          'offset' => '0',
          'type' => '145'
        },
        '1' => {
          'name' => 'vendor_specific',
          'offset' => '0',
          'type' => '8126'
        }
      },
      'Name' => 'anon-union-platform.h-1105',
      'Size' => '16',
      'Type' => 'Union'
    },
    '283350' => {
      'Header' => 'platform.h',
      'Line' => '1102',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '145'
        },
        '1' => {
          'name' => 'transport_protocol_type',
          'offset' => '1',
          'type' => '145'
        },
        '2' => {
          'name' => 'event_receiver_address',
          'offset' => '8',
          'type' => '283316'
        }
      },
      'Name' => 'struct pldm_get_event_receiver_resp',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '283652' => {
      'Header' => 'platform.h',
      'Line' => '1190',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '145'
        },
        '1' => {
          'name' => 'comp_effecter_count',
          'offset' => '1',
          'type' => '145'
        },
        '2' => {
          'name' => 'field',
          'offset' => '2',
          'type' => '283709'
        }
      },
      'Name' => 'struct pldm_get_state_effecter_states_resp',
      'Size' => '26',
      'Type' => 'Struct'
    },
    '283709' => {
      'BaseType' => '282832',
      'Name' => 'get_effecter_state_field[8]',
      'Size' => '24',
      'Type' => 'Array'
    },
    '283725' => {
      'Header' => 'platform.h',
      'Line' => '1200',
      'Memb' => {
        '0' => {
          'name' => 'sensor_id',
          'offset' => '0',
          'type' => '157'
        },
        '1' => {
          'name' => 'sensor_event_class_type',
          'offset' => '2',
          'type' => '145'
        },
        '2' => {
          'name' => 'event_class',
          'offset' => '3',
          'type' => '1798'
        }
      },
      'Name' => 'struct pldm_sensor_event_data',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '283839' => {
      'Header' => 'platform.h',
      'Line' => '1240',
      'Memb' => {
        '0' => {
          'name' => 'format_version',
          'offset' => '0',
          'type' => '145'
        },
        '1' => {
          'name' => 'event_id',
          'offset' => '2',
          'type' => '157'
        },
        '2' => {
          'name' => 'data_transfer_handle',
          'offset' => '4',
          'type' => '169'
        }
      },
      'Name' => 'struct pldm_message_poll_event',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '283901' => {
      'Header' => 'platform.h',
      'Line' => '1250',
      'Memb' => {
        '0' => {
          'name' => 'format_version',
          'offset' => '0',
          'type' => '145'
        },
        '1' => {
          'name' => 'format_type',
          'offset' => '1',
          'type' => '145'
        },
        '2' => {
          'name' => 'event_data_length',
          'offset' => '2',
          'type' => '157'
        },
        '3' => {
          'name' => 'event_data',
          'offset' => '4',
          'type' => '283972'
        }
      },
      'Name' => 'struct pldm_platform_cper_event',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '283972' => {
      'BaseType' => '145',
      'Name' => 'uint8_t[]',
      'Size' => '8',
      'Type' => 'Array'
    },
    '284128' => {
      'Header' => 'platform.h',
      'Line' => '1310',
      'Memb' => {
        '0' => {
          'name' => 'event_data_format',
          'offset' => '0',
          'type' => '145'
        },
        '1' => {
          'name' => 'number_of_change_records',
          'offset' => '1',
          'type' => '145'
        },
        '2' => {
          'name' => 'change_records',
          'offset' => '2',
          'type' => '1798'
        }
      },
      'Name' => 'struct pldm_pdr_repository_chg_event_data',
      'Size' => '3',
      'Type' => 'Struct'
    },
    '292851' => {
      'BaseType' => '3501',
      'Name' => 'size_t*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '302278' => {
      'BaseType' => '282434',
      'Name' => 'struct pldm_platform_file_descriptor_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '302337' => {
      'BaseType' => '283901',
      'Name' => 'struct pldm_platform_cper_event*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '306919' => {
      'BaseType' => '282238',
      'Name' => 'struct pldm_entity_auxiliary_names_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '319512' => {
      'BaseType' => '283652',
      'Name' => 'struct pldm_get_state_effecter_states_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '367951' => {
      'BaseType' => '283350',
      'Name' => 'struct pldm_get_event_receiver_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '388166' => {
      'BaseType' => '283839',
      'Name' => 'struct pldm_message_poll_event*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '389972' => {
      'BaseType' => '389982',
      'Name' => 'uint32_t const*const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '389977' => {
      'BaseType' => '895',
      'Name' => 'uint32_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '389982' => {
      'BaseType' => '389977',
      'Name' => 'uint32_t const*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '389987' => {
      'BaseType' => '284128',
      'Name' => 'struct pldm_pdr_repository_chg_event_data*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '443140' => {
      'BaseType' => '281585',
      'Name' => 'struct pldm_numeric_sensor_value_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '471883' => {
      'BaseType' => '283725',
      'Name' => 'struct pldm_sensor_event_data*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '471888' => {
      'BaseType' => '471883',
      'Name' => 'struct pldm_sensor_event_data*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '477092' => {
      'BaseType' => '282762',
      'Name' => 'get_sensor_state_field*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '505766' => {
      'BaseType' => '282678',
      'Name' => 'set_effecter_state_field*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '506747' => {
      'BaseType' => '272148',
      'Name' => 'struct pldm_state_sensor_pdr*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '506752' => {
      'BaseType' => '280476',
      'Name' => 'struct state_sensor_possible_states const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '506757' => {
      'BaseType' => '506752',
      'Name' => 'struct state_sensor_possible_states const*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '507157' => {
      'BaseType' => '266258',
      'Name' => 'struct pldm_state_effecter_pdr*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '507162' => {
      'BaseType' => '282429',
      'Name' => 'struct state_effecter_possible_states const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '507167' => {
      'BaseType' => '507162',
      'Name' => 'struct state_effecter_possible_states const*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '511616' => {
      'Line' => '19',
      'Memb' => {
        '0' => {
          'name' => 'prev',
          'offset' => '0',
          'type' => '6385'
        },
        '1' => {
          'name' => 'allocations',
          'offset' => '4',
          'type' => '169'
        }
      },
      'Name' => 'struct pldm_tid_state',
      'PrivateABI' => 1,
      'Size' => '8',
      'Source' => 'instance-id.c',
      'Type' => 'Struct'
    },
    '511655' => {
      'Line' => '24',
      'Memb' => {
        '0' => {
          'name' => 'state',
          'offset' => '0',
          'type' => '511697'
        },
        '1' => {
          'name' => 'lock_db_fd',
          'offset' => '8264',
          'type' => '112'
        }
      },
      'Name' => 'struct pldm_instance_db',
      'PrivateABI' => 1,
      'Size' => '2052',
      'Source' => 'instance-id.c',
      'Type' => 'Struct'
    },
    '511697' => {
      'BaseType' => '511616',
      'Name' => 'struct pldm_tid_state[256]',
      'Size' => '2048',
      'Type' => 'Array'
    },
    '512253' => {
      'BaseType' => '511655',
      'Name' => 'struct pldm_instance_db*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '512640' => {
      'BaseType' => '6385',
      'Name' => 'pldm_instance_id_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '512816' => {
      'BaseType' => '512253',
      'Name' => 'struct pldm_instance_db**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '513529' => {
      'BaseType' => '46',
      'Header' => 'int-ll64.h',
      'Line' => '21',
      'Name' => '__u8',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '513541' => {
      'BaseType' => '53',
      'Header' => 'int-ll64.h',
      'Line' => '24',
      'Name' => '__u16',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '513796' => {
      'Header' => 'socket.h',
      'Line' => '5',
      'Memb' => {
        '0' => {
          'name' => 'size',
          'offset' => '0',
          'type' => '112'
        },
        '1' => {
          'name' => 'socket',
          'offset' => '4',
          'type' => '112'
        },
        '2' => {
          'name' => 'max_size',
          'offset' => '8',
          'type' => '112'
        }
      },
      'Name' => 'struct pldm_socket_sndbuf',
      'PrivateABI' => 1,
      'Size' => '12',
      'Type' => 'Struct'
    },
    '513848' => {
      'BaseType' => '145',
      'Header' => 'pldm.h',
      'Line' => '13',
      'Name' => 'mctp_eid_t',
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '513962' => {
      'BaseType' => '6482',
      'Header' => 'pldm.h',
      'Line' => '30',
      'Name' => 'pldm_requester_rc_t',
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '513974' => {
      'Header' => 'transport.h',
      'Line' => '18',
      'Memb' => {
        '0' => {
          'name' => 'name',
          'offset' => '0',
          'type' => '9522'
        },
        '1' => {
          'name' => 'version',
          'offset' => '8',
          'type' => '145'
        },
        '2' => {
          'name' => 'recv',
          'offset' => '22',
          'type' => '514107'
        },
        '3' => {
          'name' => 'send',
          'offset' => '36',
          'type' => '514148'
        },
        '4' => {
          'name' => 'init_pollfd',
          'offset' => '50',
          'type' => '514229'
        }
      },
      'Name' => 'struct pldm_transport',
      'PrivateABI' => 1,
      'Size' => '40',
      'Type' => 'Struct'
    },
    '514087' => {
      'BaseType' => '513974',
      'Name' => 'struct pldm_transport*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '514092' => {
      'BaseType' => '6373',
      'Name' => 'pldm_tid_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '514107' => {
      'Name' => 'pldm_requester_rc_t(*)(struct pldm_transport*, pldm_tid_t*, void**, size_t*)',
      'Param' => {
        '0' => {
          'type' => '514087'
        },
        '1' => {
          'type' => '514092'
        },
        '2' => {
          'type' => '199612'
        },
        '3' => {
          'type' => '3501'
        }
      },
      'Return' => '513962',
      'Size' => '8',
      'Type' => 'FuncPtr'
    },
    '514148' => {
      'Name' => 'pldm_requester_rc_t(*)(struct pldm_transport*, pldm_tid_t, void const*, size_t)',
      'Param' => {
        '0' => {
          'type' => '514087'
        },
        '1' => {
          'type' => '6373'
        },
        '2' => {
          'type' => '2061'
        },
        '3' => {
          'type' => '900'
        }
      },
      'Return' => '513962',
      'Size' => '8',
      'Type' => 'FuncPtr'
    },
    '514173' => {
      'BaseType' => '514178',
      'Name' => 'struct pollfd*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '514178' => {
      'Header' => 'poll.h',
      'Line' => '36',
      'Memb' => {
        '0' => {
          'name' => 'fd',
          'offset' => '0',
          'type' => '112'
        },
        '1' => {
          'name' => 'events',
          'offset' => '4',
          'type' => '93'
        },
        '2' => {
          'name' => 'revents',
          'offset' => '6',
          'type' => '93'
        }
      },
      'Name' => 'struct pollfd',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Struct'
    },
    '514229' => {
      'Name' => 'int(*)(struct pldm_transport*, struct pollfd*)',
      'Param' => {
        '0' => {
          'type' => '514087'
        },
        '1' => {
          'type' => '514173'
        }
      },
      'Return' => '112',
      'Size' => '8',
      'Type' => 'FuncPtr'
    },
    '514234' => {
      'BaseType' => '53',
      'Header' => 'socket.h',
      'Line' => '10',
      'Name' => '__kernel_sa_family_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '514599' => {
      'Header' => 'mctp.h',
      'Line' => '18',
      'Memb' => {
        '0' => {
          'name' => 's_addr',
          'offset' => '0',
          'type' => '513848'
        }
      },
      'Name' => 'struct mctp_addr',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Struct'
    },
    '514625' => {
      'Header' => 'mctp.h',
      'Line' => '22',
      'Memb' => {
        '0' => {
          'name' => 'smctp_family',
          'offset' => '0',
          'type' => '514234'
        },
        '1' => {
          'name' => '__smctp_pad0',
          'offset' => '2',
          'type' => '513541'
        },
        '2' => {
          'name' => 'smctp_network',
          'offset' => '4',
          'type' => '60'
        },
        '3' => {
          'name' => 'smctp_addr',
          'offset' => '8',
          'type' => '514599'
        },
        '4' => {
          'name' => 'smctp_type',
          'offset' => '9',
          'type' => '513529'
        },
        '5' => {
          'name' => 'smctp_tag',
          'offset' => '16',
          'type' => '513529'
        },
        '6' => {
          'name' => '__smctp_pad1',
          'offset' => '17',
          'type' => '513529'
        }
      },
      'Name' => 'struct sockaddr_mctp',
      'PrivateABI' => 1,
      'Size' => '12',
      'Type' => 'Struct'
    },
    '514729' => {
      'BaseType' => '514625',
      'Name' => 'struct sockaddr_mctp const',
      'Size' => '12',
      'Type' => 'Const'
    },
    '514773' => {
      'Line' => '37',
      'Memb' => {
        '0' => {
          'name' => 'net',
          'offset' => '0',
          'type' => '60'
        },
        '1' => {
          'name' => 'eid',
          'offset' => '4',
          'type' => '513848'
        }
      },
      'Name' => 'struct mctp_fq_addr',
      'PrivateABI' => 1,
      'Size' => '8',
      'Source' => 'af-mctp.c',
      'Type' => 'Struct'
    },
    '514812' => {
      'Line' => '43',
      'Memb' => {
        '0' => {
          'name' => 'transport',
          'offset' => '0',
          'type' => '513974'
        },
        '1' => {
          'name' => 'socket',
          'offset' => '64',
          'type' => '112'
        },
        '2' => {
          'name' => 'tid_map',
          'offset' => '68',
          'type' => '514905'
        },
        '3' => {
          'name' => 'socket_send_buf',
          'offset' => '8338',
          'type' => '513796'
        },
        '4' => {
          'name' => 'bound',
          'offset' => '8452',
          'type' => '7003'
        },
        '5' => {
          'name' => 'cookie_jar',
          'offset' => '8466',
          'type' => '6397'
        }
      },
      'Name' => 'struct pldm_transport_af_mctp',
      'PrivateABI' => 1,
      'Size' => '2128',
      'Source' => 'af-mctp.c',
      'Type' => 'Struct'
    },
    '514905' => {
      'BaseType' => '514773',
      'Name' => 'struct mctp_fq_addr[256]',
      'Size' => '2048',
      'Type' => 'Array'
    },
    '515705' => {
      'BaseType' => '514812',
      'Name' => 'struct pldm_transport_af_mctp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '515710' => {
      'BaseType' => '514729',
      'Name' => 'struct sockaddr_mctp const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '516026' => {
      'BaseType' => '515705',
      'Name' => 'struct pldm_transport_af_mctp**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '519384' => {
      'Line' => '26',
      'Memb' => {
        '0' => {
          'name' => 'transport',
          'offset' => '0',
          'type' => '513974'
        },
        '1' => {
          'name' => 'socket',
          'offset' => '64',
          'type' => '112'
        },
        '2' => {
          'name' => 'tid_eid_map',
          'offset' => '68',
          'type' => '519452'
        },
        '3' => {
          'name' => 'socket_send_buf',
          'offset' => '768',
          'type' => '513796'
        }
      },
      'Name' => 'struct pldm_transport_mctp_demux',
      'PrivateABI' => 1,
      'Size' => '312',
      'Source' => 'mctp-demux.c',
      'Type' => 'Struct'
    },
    '519452' => {
      'BaseType' => '6373',
      'Name' => 'pldm_tid_t[256]',
      'Size' => '256',
      'Type' => 'Array'
    },
    '519989' => {
      'BaseType' => '519384',
      'Name' => 'struct pldm_transport_mctp_demux*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '520495' => {
      'BaseType' => '519989',
      'Name' => 'struct pldm_transport_mctp_demux**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '543275' => {
      'Header' => 'file_io.h',
      'Line' => '32',
      'Memb' => {
        '0' => {
          'name' => 'handle',
          'offset' => '0',
          'type' => '145'
        },
        '1' => {
          'name' => 'length',
          'offset' => '4',
          'type' => '169'
        },
        '2' => {
          'name' => 'data',
          'offset' => '8',
          'type' => '283972'
        }
      },
      'Name' => 'struct pldm_oem_meta_file_io_write_req',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '543342' => {
      'Header' => 'file_io.h',
      'Line' => '45',
      'Memb' => {
        '0' => {
          'name' => 'transferFlag',
          'offset' => '0',
          'type' => '145'
        },
        '1' => {
          'name' => 'offset',
          'offset' => '2',
          'type' => '157'
        }
      },
      'Name' => 'struct pldm_oem_meta_file_io_read_data_info',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '543381' => {
      'Header' => 'file_io.h',
      'Line' => '55',
      'Memb' => {
        '0' => {
          'name' => 'size',
          'offset' => '0',
          'type' => '157'
        },
        '1' => {
          'name' => 'crc32',
          'offset' => '4',
          'type' => '169'
        }
      },
      'Name' => 'struct pldm_oem_meta_file_io_read_attr_info',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '543420' => {
      'Header' => 'file_io.h',
      'Line' => '70',
      'Memb' => {
        '0' => {
          'name' => 'data',
          'offset' => '0',
          'type' => '543342'
        }
      },
      'Name' => 'anon-union-file_io.h-70',
      'Size' => '4',
      'Type' => 'Union'
    },
    '543438' => {
      'Header' => 'file_io.h',
      'Line' => '65',
      'Memb' => {
        '0' => {
          'name' => 'version',
          'offset' => '0',
          'type' => '900'
        },
        '1' => {
          'name' => 'handle',
          'offset' => '8',
          'type' => '145'
        },
        '2' => {
          'name' => 'option',
          'offset' => '9',
          'type' => '145'
        },
        '3' => {
          'name' => 'length',
          'offset' => '16',
          'type' => '145'
        },
        '4' => {
          'name' => 'info',
          'offset' => '18',
          'type' => '543420'
        }
      },
      'Name' => 'struct pldm_oem_meta_file_io_read_req',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '543516' => {
      'Header' => 'file_io.h',
      'Line' => '86',
      'Memb' => {
        '0' => {
          'name' => 'attr',
          'offset' => '0',
          'type' => '543381'
        },
        '1' => {
          'name' => 'data',
          'offset' => '0',
          'type' => '543342'
        }
      },
      'Name' => 'anon-union-file_io.h-86',
      'Size' => '8',
      'Type' => 'Union'
    },
    '543544' => {
      'Header' => 'file_io.h',
      'Line' => '80',
      'Memb' => {
        '0' => {
          'name' => 'version',
          'offset' => '0',
          'type' => '900'
        },
        '1' => {
          'name' => 'completion_code',
          'offset' => '8',
          'type' => '145'
        },
        '2' => {
          'name' => 'handle',
          'offset' => '9',
          'type' => '145'
        },
        '3' => {
          'name' => 'option',
          'offset' => '16',
          'type' => '145'
        },
        '4' => {
          'name' => 'length',
          'offset' => '17',
          'type' => '145'
        },
        '5' => {
          'name' => 'info',
          'offset' => '18',
          'type' => '543516'
        },
        '6' => {
          'name' => 'data',
          'offset' => '32',
          'type' => '283972'
        }
      },
      'Name' => 'struct pldm_oem_meta_file_io_read_resp',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '548529' => {
      'BaseType' => '543544',
      'Name' => 'struct pldm_oem_meta_file_io_read_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '551497' => {
      'BaseType' => '543438',
      'Name' => 'struct pldm_oem_meta_file_io_read_req*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '551938' => {
      'BaseType' => '543275',
      'Name' => 'struct pldm_oem_meta_file_io_write_req*',
      'Size' => '8',
      'Type' => 'Pointer'
    }
  },
  'UndefinedSymbols' => {
    'libpldm.so.0.15.0' => {
      '_ITM_deregisterTMCloneTable' => 0,
      '_ITM_registerTMCloneTable' => 0,
      '__assert_fail@GLIBC_2.2.5' => 0,
      '__cxa_finalize@GLIBC_2.2.5' => 0,
      '__errno_location@GLIBC_2.2.5' => 0,
      '__gmon_start__' => 0,
      '__isoc23_strtol@GLIBC_2.38' => 0,
      '__memcpy_chk@GLIBC_2.3.4' => 0,
      '__recv_chk@GLIBC_2.4' => 0,
      '__recvfrom_chk@GLIBC_2.4' => 0,
      '__stack_chk_fail@GLIBC_2.4' => 0,
      'bind@GLIBC_2.2.5' => 0,
      'calloc@GLIBC_2.2.5' => 0,
      'clock_gettime@GLIBC_2.17' => 0,
      'close@GLIBC_2.2.5' => 0,
      'connect@GLIBC_2.2.5' => 0,
      'dup@GLIBC_2.2.5' => 0,
      'fclose@GLIBC_2.2.5' => 0,
      'fcntl64@GLIBC_2.28' => 0,
      'fgets@GLIBC_2.2.5' => 0,
      'fopen64@GLIBC_2.2.5' => 0,
      'free@GLIBC_2.2.5' => 0,
      'getsockopt@GLIBC_2.2.5' => 0,
      'malloc@GLIBC_2.2.5' => 0,
      'memcmp@GLIBC_2.2.5' => 0,
      'memcpy@GLIBC_2.14' => 0,
      'memmem@GLIBC_2.2.5' => 0,
      'open64@GLIBC_2.2.5' => 0,
      'poll@GLIBC_2.2.5' => 0,
      'ppoll@GLIBC_2.4' => 0,
      'recv@GLIBC_2.2.5' => 0,
      'recvmsg@GLIBC_2.2.5' => 0,
      'sendmsg@GLIBC_2.2.5' => 0,
      'sendto@GLIBC_2.2.5' => 0,
      'setsockopt@GLIBC_2.2.5' => 0,
      'socket@GLIBC_2.2.5' => 0,
      'stat64@GLIBC_2.33' => 0,
      'strlen@GLIBC_2.2.5' => 0,
      'strnlen@GLIBC_2.2.5' => 0,
      'timerfd_create@GLIBC_2.8' => 0,
      'timerfd_settime@GLIBC_2.8' => 0,
      'write@GLIBC_2.2.5' => 0
    }
  },
  'WordSize' => '8'
};
