$VAR1 = {
  'ABI_DUMPER_VERSION' => '1.4',
  'ABI_DUMP_VERSION' => '3.5',
  'Arch' => 'x86_64',
  'GccVersion' => '15.2.0',
  'Headers' => {
    'af-mctp.h' => 1,
    'base.h' => 1,
    'bios.h' => 1,
    'bios_table.h' => 1,
    'edac.h' => 1,
    'file.h' => 1,
    'file_io.h' => 1,
    'firmware_update.h' => 1,
    'fru.h' => 1,
    'host.h' => 1,
    'instance-id.h' => 1,
    'mctp-demux.h' => 1,
    'pdr.h' => 1,
    'platform.h' => 1,
    'pldm.h' => 1,
    'pldm_types.h' => 1,
    'transport.h' => 1,
    'utils.h' => 1
  },
  'Language' => 'C',
  'LibraryName' => 'libpldm.so.0.14.0',
  'LibraryVersion' => '0.14.0',
  'NameSpaces' => {},
  'Needed' => {
    'libc.so.6' => 1
  },
  'PublicABI' => '1',
  'Sources' => {
    'af-mctp.c' => 1,
    'bios_table.c' => 1,
    'instance-id.c' => 1,
    'mctp-demux.c' => 1,
    'pdr.c' => 1
  },
  'SymbolInfo' => {
    '1469' => {
      'Header' => 'base.h',
      'Line' => '784',
      'Param' => {
        '0' => {
          'name' => 'instance_id',
          'type' => '140'
        },
        '1' => {
          'name' => 'type',
          'type' => '140'
        },
        '2' => {
          'name' => 'command',
          'type' => '140'
        },
        '3' => {
          'name' => 'cc',
          'type' => '140'
        },
        '4' => {
          'name' => 'msg',
          'type' => '1511'
        }
      },
      'Return' => '58',
      'ShortName' => 'encode_cc_only_resp'
    },
    '1516' => {

      'pldm_entity_association_tree_copy_root' => 1,
      'pldm_entity_association_tree_delete_node' => 1,
      'pldm_entity_association_tree_destroy' => 1,
      'pldm_entity_association_tree_destroy_root' => 1,
      'pldm_entity_association_tree_find' => 1,
      'pldm_entity_association_tree_find_with_locality' => 1,
      'pldm_entity_association_tree_init' => 1,
      'pldm_entity_association_tree_visit' => 1,
      'pldm_entity_extract' => 1,
      'pldm_entity_get_num_children' => 1,
      'pldm_entity_get_parent' => 1,
      'pldm_entity_is_exist_parent' => 1,
      'pldm_entity_is_node_parent' => 1,
      'pldm_entity_node_get_remote_container_id' => 1,
      'pldm_find_entity_ref_in_tree' => 1,
      'pldm_instance_db_destroy' => 1,
      'pldm_instance_db_init' => 1,
      'pldm_instance_db_init_default' => 1,
      'pldm_instance_id_alloc' => 1,
      'pldm_instance_id_free' => 1,
      'pldm_is_current_parent_child' => 1,
      'pldm_is_empty_entity_assoc_tree' => 1,
      'pldm_msg_hdr_correlate_response' => 1,
      'pldm_oem_meta_file_io_read_resp_data' => 1,
      'pldm_oem_meta_file_io_write_req_data' => 1,
      'pldm_package_component_image_information_iter_init' => 1,
      'pldm_package_downstream_device_id_record_iter_init' => 1,
      'pldm_package_firmware_device_id_record_iter_init' => 1,
      'pldm_pdr_add' => 1,
      'pldm_pdr_add_fru_record_set' => 1,
      'pldm_pdr_delete_by_effecter_id' => 1,
      'pldm_pdr_delete_by_record_handle' => 1,
      'pldm_pdr_delete_by_sensor_id' => 1,
      'pldm_pdr_destroy' => 1,
      'pldm_pdr_find_last_in_range' => 1,
      'pldm_pdr_find_record' => 1,
      'pldm_pdr_find_record_by_type' => 1,
      'pldm_pdr_fru_record_set_find_by_rsi' => 1,
      'pldm_pdr_get_next_record' => 1,
      'pldm_pdr_get_record_count' => 1,
      'pldm_pdr_get_record_handle' => 1,
      'pldm_pdr_get_repo_size' => 1,
      'pldm_pdr_init' => 1,
      'pldm_pdr_record_is_remote' => 1,
      'pldm_pdr_remove_fru_record_set_by_rsi' => 1,
      'pldm_pdr_remove_pdrs_by_terminus_handle' => 1,
      'pldm_pdr_remove_remote_pdrs' => 1,
      'pldm_pdr_update_TL_pdr' => 1,
      'pldm_platform_cper_event_event_data' => 1,
      'pldm_transport_af_mctp_bind' => 1,
      'pldm_transport_af_mctp_core' => 1,
      'pldm_transport_af_mctp_destroy' => 1,
      'pldm_transport_af_mctp_init' => 1,
      'pldm_transport_af_mctp_init_pollfd' => 1,
      'pldm_transport_af_mctp_map_tid' => 1,
      'pldm_transport_af_mctp_unmap_tid' => 1,
      'pldm_transport_mctp_demux_core' => 1,
      'pldm_transport_mctp_demux_destroy' => 1,
      'pldm_transport_mctp_demux_init' => 1,
      'pldm_transport_mctp_demux_init_pollfd' => 1,
      'pldm_transport_mctp_demux_map_tid' => 1,
      'pldm_transport_mctp_demux_unmap_tid' => 1,
      'pldm_transport_poll' => 1,
      'pldm_transport_recv_msg' => 1,
      'pldm_transport_send_msg' => 1,
      'pldm_transport_send_recv_msg' => 1,
      'unpack_pldm_header' => 1,
      'ver2str' => 1
    }
  },
  'Target' => 'unix',
  'TypeInfo' => {
    '1' => {
      'Name' => 'void',
      'Type' => 'Intrinsic'
    },
    '51' => {
      'Name' => 'char',
      'Size' => '1',
      'Type' => 'Intrinsic'
    },
    '58' => {
      'Name' => 'int',
      'Size' => '4',
      'Type' => 'Intrinsic'
    },
    '65' => {
      'Name' => 'unsigned char',
      'Size' => '1',
      'Type' => 'Intrinsic'
    },
    '72' => {
      'Name' => 'unsigned short',
      'Size' => '2',
      'Type' => 'Intrinsic'
    },
    '79' => {
      'Name' => 'unsigned int',
      'Size' => '4',
      'Type' => 'Intrinsic'
    },
    '86' => {
      'Name' => 'unsigned long',
      'Size' => '8',
      'Type' => 'Intrinsic'
    },
    '93' => {
      'Name' => 'signed char',
      'Size' => '1',
      'Type' => 'Intrinsic'
    },
    '100' => {
      'BaseType' => '65',
      'Header' => 'types.h',
      'Line' => '38',
      'Name' => '__uint8_t',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '112' => {
      'Name' => 'short',
      'Size' => '2',
      'Type' => 'Intrinsic'
    },
    '119' => {
      'BaseType' => '79',
      'Header' => 'types.h',
      'Line' => '42',
      'Name' => '__uint32_t',
      'PrivateABI' => 1,
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '131' => {
      'Name' => 'long',
      'Size' => '8',
      'Type' => 'Intrinsic'
    },
    '138' => {
      'BaseType' => '1',
      'Name' => 'void*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '140' => {
      'BaseType' => '100',
      'Header' => 'stdint-uintn.h',
      'Line' => '24',
      'Name' => 'uint8_t',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '152' => {
      'BaseType' => '119',
      'Header' => 'stdint-uintn.h',
      'Line' => '26',
      'Name' => 'uint32_t',
      'PrivateABI' => 1,
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '164' => {
      'BaseType' => '152',
      'Name' => 'uint32_t const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '169' => {
      'BaseType' => '86',
      'Header' => 'stddef.h',
      'Line' => '229',
      'Name' => 'size_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '195' => {
      'Header' => 'pldm_types.h',
      'Line' => '13',
      'Name' => 'struct bits8',
      'Size' => '1',
      'Type' => 'Struct'
    },
    '353' => {
      'Header' => 'pldm_types.h',
      'Line' => '23',
      'Memb' => {
        '0' => {
          'name' => 'byte',
          'offset' => '0',
          'type' => '140'
        },
        '1' => {
          'name' => 'bits',
          'offset' => '0',
          'type' => '195'
        }
      },
      'Name' => 'union bitfield8_t',
      'Size' => '1',
      'Type' => 'Union'
    },
    '365' => {
      'BaseType' => '353',
      'Name' => 'bitfield8_t const',
      'Size' => '1',
      'Type' => 'Const'
    },
    '370' => {
      'Header' => 'pldm_types.h',
      'Line' => '29',
      'Memb' => {
        '0' => {
          'name' => 'alpha',
          'offset' => '0',
          'type' => '140'
        },
        '1' => {
          'name' => 'update',
          'offset' => '1',
          'type' => '140'
        },
        '2' => {
          'name' => 'minor',
          'offset' => '2',
          'type' => '140'
        },
        '3' => {
          'name' => 'major',
          'offset' => '3',
          'type' => '140'
        }
      },
      'Name' => 'struct pldm_version',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '436' => {
      'BaseType' => '370',
      'Header' => 'pldm_types.h',
      'Line' => '34',
      'Name' => 'ver32_t',
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '448' => {
      'BaseType' => '436',
      'Name' => 'ver32_t const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '453' => {
      'Name' => 'float',
      'Size' => '4',
      'Type' => 'Intrinsic'
    },
    '894' => {
      'Header' => 'base.h',
      'Line' => '130',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_RESPONSE',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_REQUEST',
          'value' => '1'
        },
        '2' => {
          'name' => 'PLDM_RESERVED',
          'value' => '2'
        },
        '3' => {
          'name' => 'PLDM_ASYNC_REQUEST_NOTIFY',
          'value' => '3'
        }
      },
      'Name' => 'enum MessageType',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '906' => {
      'Header' => 'base.h',
      'Line' => '183',
      'Memb' => {
        '0' => {
          'name' => 'command',
          'offset' => '2',
          'type' => '140'
        }
      },
      'Name' => 'struct pldm_msg_hdr',
      'Size' => '3',
      'Type' => 'Struct'
    },
    '1017' => {
      'BaseType' => '906',
      'Name' => 'struct pldm_msg_hdr const',
      'Size' => '3',
      'Type' => 'Const'
    },
    '1022' => {
      'Header' => 'base.h',
      'Line' => '216',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '906'
        },
        '1' => {
          'name' => 'payload',
          'offset' => '3',
          'type' => '1067'
        }
      },
      'Name' => 'struct pldm_msg',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '1062' => {
      'BaseType' => '1022',
      'Name' => 'struct pldm_msg const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '1067' => {
      'BaseType' => '140',
      'Name' => 'uint8_t[1]',
      'Size' => '1',
      'Type' => 'Array'
    },
    '1083' => {
      'Header' => 'base.h',
      'Line' => '283',
      'Memb' => {
        '0' => {
          'name' => 'msg_type',
          'offset' => '0',
          'type' => '894'
        },
        '1' => {
          'name' => 'instance',
          'offset' => '4',
          'type' => '140'
        },
        '2' => {
          'name' => 'pldm_type',
          'offset' => '5',
          'type' => '140'
        },
        '3' => {
          'name' => 'command',
          'offset' => '6',
          'type' => '140'
        },
        '4' => {
          'name' => 'completion_code',
          'offset' => '7',
          'type' => '140'
        }
      },
      'Name' => 'struct pldm_header_info',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '1163' => {
      'BaseType' => '1083',
      'Name' => 'struct pldm_header_info const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '1168' => {
      'BaseType' => '353',
      'Name' => 'bitfield8_t[8]',
      'Size' => '8',
      'Type' => 'Array'
    },
    '1330' => {
      'BaseType' => '1335',
      'Name' => 'void const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '1335' => {
      'BaseType' => '1',
      'Name' => 'void const',
      'Type' => 'Const'
    },
    '1336' => {
      'BaseType' => '365',
      'Name' => 'bitfield8_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '1511' => {
      'BaseType' => '1022',
      'Name' => 'struct pldm_msg*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '1590' => {
      'BaseType' => '1062',
      'Name' => 'struct pldm_msg const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '1595' => {
      'BaseType' => '140',
      'Name' => 'uint8_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '1600' => {
      'BaseType' => '436',
      'Name' => 'ver32_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '1694' => {
      'BaseType' => '448',
      'Name' => 'ver32_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '1741' => {
      'BaseType' => '152',
      'Name' => 'uint32_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '1810' => {
      'BaseType' => '1017',
      'Name' => 'struct pldm_msg_hdr const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '1815' => {
      'BaseType' => '1083',
      'Name' => 'struct pldm_header_info*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2770' => {
      'BaseType' => '169',
      'Name' => 'size_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '3230' => {
      'BaseType' => '1163',
      'Name' => 'struct pldm_header_info const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '4903' => {
      'BaseType' => '140',
      'Name' => 'uint8_t const',
      'Size' => '1',
      'Type' => 'Const'
    },
    '5114' => {
      'BaseType' => '4903',
      'Name' => 'uint8_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '5652' => {
      'BaseType' => '140',
      'Header' => 'base.h',
      'Line' => '19',
      'Name' => 'pldm_tid_t',
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '5664' => {
      'BaseType' => '140',
      'Header' => 'instance-id.h',
      'Line' => '13',
      'Name' => 'pldm_instance_id_t',
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '5676' => {
      'Header' => 'responder.h',
      'Line' => '10',
      'Memb' => {
        '0' => {
          'name' => 'tid',
          'offset' => '0',
          'type' => '5652'
        },
        '1' => {
          'name' => 'instance_id',
          'offset' => '1',
          'type' => '5664'
        },
        '2' => {
          'name' => 'type',
          'offset' => '2',
          'type' => '140'
        },
        '3' => {
          'name' => 'command',
          'offset' => '3',
          'type' => '140'
        },
        '4' => {
          'name' => 'next',
          'offset' => '8',
          'type' => '5756'
        }
      },
      'Name' => 'struct pldm_responder_cookie',
      'PrivateABI' => 1,
      'Size' => '16',
      'Type' => 'Struct'
    },
    '5756' => {
      'BaseType' => '5676',
      'Name' => 'struct pldm_responder_cookie*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '5761' => {
      'Header' => 'pldm.h',
      'Line' => '15',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_REQUESTER_SUCCESS',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_REQUESTER_OPEN_FAIL',
          'value' => '18446744073709551615 (-1)'
        },
        '2' => {
          'name' => 'PLDM_REQUESTER_NOT_PLDM_MSG',
          'value' => '18446744073709551614 (-2)'
        },
        '3' => {
          'name' => 'PLDM_REQUESTER_NOT_RESP_MSG',
          'value' => '18446744073709551613 (-3)'
        },
        '4' => {
          'name' => 'PLDM_REQUESTER_NOT_REQ_MSG',
          'value' => '18446744073709551612 (-4)'
        },
        '5' => {
          'name' => 'PLDM_REQUESTER_RESP_MSG_TOO_SMALL',
          'value' => '18446744073709551611 (-5)'
        },
        '6' => {
          'name' => 'PLDM_REQUESTER_INSTANCE_ID_MISMATCH',
          'value' => '18446744073709551610 (-6)'
        },
        '7' => {
          'name' => 'PLDM_REQUESTER_SEND_FAIL',
          'value' => '18446744073709551609 (-7)'
        },
        '8' => {
          'name' => 'PLDM_REQUESTER_RECV_FAIL',
          'value' => '18446744073709551608 (-8)'
        },
        '9' => {
          'name' => 'PLDM_REQUESTER_INVALID_RECV_LEN',
          'value' => '18446744073709551607 (-9)'
        },
        '10' => {
          'name' => 'PLDM_REQUESTER_SETUP_FAIL',
          'value' => '18446744073709551606 (-10)'
        },
        '11' => {
          'name' => 'PLDM_REQUESTER_INVALID_SETUP',
          'value' => '18446744073709551605 (-11)'
        },
        '12' => {
          'name' => 'PLDM_REQUESTER_POLL_FAIL',
          'value' => '18446744073709551604 (-12)'
        },
        '13' => {
          'name' => 'PLDM_REQUESTER_TRANSPORT_BUSY',
          'value' => '18446744073709551603 (-13)'
        }
      },
      'Name' => 'enum pldm_requester_error_codes',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '6282' => {
      'Name' => '_Bool',
      'Size' => '1',
      'Type' => 'Intrinsic'
    },
    '6409' => {
      'BaseType' => '72',
      'Header' => 'types.h',
      'Line' => '40',
      'Name' => '__uint16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '6447' => {
      'BaseType' => '131',
      'Header' => 'types.h',
      'Line' => '194',
      'Name' => '__ssize_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '6459' => {
      'BaseType' => '51',
      'Name' => 'char*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '6483' => {
      'BaseType' => '6409',
      'Header' => 'stdint-uintn.h',
      'Line' => '25',
      'Name' => 'uint16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '6615' => {
      'BaseType' => '6447',
      'Header' => 'types.h',
      'Line' => '108',
      'Name' => 'ssize_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '7823' => {
      'BaseType' => '51',
      'Name' => 'char const',
      'Size' => '1',
      'Type' => 'Const'
    },
    '7857' => {
      'BaseType' => '6483',
      'Name' => 'uint16_t const',
      'Size' => '2',
      'Type' => 'Const'
    },
    '8201' => {
      'Header' => 'utils.h',
      'Line' => '21',
      'Memb' => {
        '0' => {
          'name' => 'ptr',
          'offset' => '0',
          'type' => '5114'
        },
        '1' => {
          'name' => 'length',
          'offset' => '8',
          'type' => '169'
        }
      },
      'Name' => 'struct variable_field',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '9279' => {
      'Header' => 'base.h',
      'Line' => '367',
      'Memb' => {
        '0' => {
          'name' => 'pldm_type',
          'offset' => '0',
          'type' => '140'
        },
        '1' => {
          'name' => 'transfer_opflag',
          'offset' => '1',
          'type' => '140'
        },
        '2' => {
          'name' => 'transfer_ctx',
          'offset' => '4',
          'type' => '152'
        },
        '3' => {
          'name' => 'transfer_handle',
          'offset' => '8',
          'type' => '152'
        },
        '4' => {
          'name' => 'section_offset',
          'offset' => '18',
          'type' => '152'
        },
        '5' => {
          'name' => 'section_length',
          'offset' => '22',
          'type' => '152'
        }
      },
      'Name' => 'struct pldm_base_multipart_receive_req',
      'Size' => '20',
      'Type' => 'Struct'
    },
    '9370' => {
      'BaseType' => '9279',
      'Name' => 'struct pldm_base_multipart_receive_req const',
      'Size' => '20',
      'Type' => 'Const'
    },
    '9375' => {
      'Header' => 'base.h',
      'Line' => '385',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '140'
        },
        '1' => {
          'name' => 'transfer_flag',
          'offset' => '1',
          'type' => '140'
        },
        '2' => {
          'name' => 'next_transfer_handle',
          'offset' => '4',
          'type' => '152'
        },
        '3' => {
          'name' => 'data',
          'offset' => '8',
          'type' => '8201'
        }
      },
      'Name' => 'struct pldm_base_multipart_receive_resp',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '9445' => {
      'Header' => 'base.h',
      'Line' => '397',
      'Memb' => {
        '0' => {
          'name' => 'requester_part_size',
          'offset' => '0',
          'type' => '6483'
        },
        '1' => {
          'name' => 'requester_protocol_support',
          'offset' => '2',
          'type' => '1168'
        }
      },
      'Name' => 'struct pldm_base_negotiate_transfer_params_req',
      'Size' => '10',
      'Type' => 'Struct'
    },
    '9484' => {
      'BaseType' => '9445',
      'Name' => 'struct pldm_base_negotiate_transfer_params_req const',
      'Size' => '10',
      'Type' => 'Const'
    },
    '9489' => {
      'Header' => 'base.h',
      'Line' => '406',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '140'
        },
        '1' => {
          'name' => 'responder_part_size',
          'offset' => '2',
          'type' => '6483'
        },
        '2' => {
          'name' => 'responder_protocol_support',
          'offset' => '4',
          'type' => '1168'
        }
      },
      'Name' => 'struct pldm_base_negotiate_transfer_params_resp',
      'Size' => '12',
      'Type' => 'Struct'
    },
    '9578' => {
      'BaseType' => '7823',
      'Name' => 'char const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '11732' => {
      'BaseType' => '9489',
      'Name' => 'struct pldm_base_negotiate_transfer_params_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '17243' => {
      'BaseType' => '9484',
      'Name' => 'struct pldm_base_negotiate_transfer_params_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '24800' => {
      'BaseType' => '9375',
      'Name' => 'struct pldm_base_multipart_receive_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '27554' => {
      'BaseType' => '9370',
      'Name' => 'struct pldm_base_multipart_receive_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '33405' => {
      'BaseType' => '353',
      'Name' => 'bitfield8_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '35173' => {
      'BaseType' => '906',
      'Name' => 'struct pldm_msg_hdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '39420' => {
      'BaseType' => '8201',
      'Name' => 'struct variable_field*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '41502' => {
      'BaseType' => '6483',
      'Name' => 'uint16_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '44752' => {
      'BaseType' => '86',
      'Header' => 'types.h',
      'Line' => '45',
      'Name' => '__uint64_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '44846' => {
      'BaseType' => '44752',
      'Header' => 'stdint-uintn.h',
      'Line' => '27',
      'Name' => 'uint64_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '45144' => {
      'Header' => 'bios.h',
      'Line' => '39',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_BIOS_STRING_TABLE',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_BIOS_ATTR_TABLE',
          'value' => '1'
        },
        '2' => {
          'name' => 'PLDM_BIOS_ATTR_VAL_TABLE',
          'value' => '2'
        }
      },
      'Name' => 'enum pldm_bios_table_types',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '45178' => {
      'Header' => 'bios.h',
      'Line' => '48',
      'Memb' => {
        '0' => {
          'name' => 'string_handle',
          'offset' => '0',
          'type' => '6483'
        },
        '1' => {
          'name' => 'string_length',
          'offset' => '2',
          'type' => '6483'
        },
        '2' => {
          'name' => 'name',
          'offset' => '4',
          'type' => '45235'
        }
      },
      'Name' => 'struct pldm_bios_string_table_entry',
      'Size' => '5',
      'Type' => 'Struct'
    },
    '45230' => {
      'BaseType' => '45178',
      'Name' => 'struct pldm_bios_string_table_entry const',
      'Size' => '5',
      'Type' => 'Const'
    },
    '45235' => {
      'BaseType' => '51',
      'Name' => 'char[1]',
      'Size' => '1',
      'Type' => 'Array'
    },
    '45251' => {
      'Header' => 'bios.h',
      'Line' => '54',
      'Memb' => {
        '0' => {
          'name' => 'attr_handle',
          'offset' => '0',
          'type' => '6483'
        },
        '1' => {
          'name' => 'attr_type',
          'offset' => '2',
          'type' => '140'
        },
        '2' => {
          'name' => 'string_handle',
          'offset' => '3',
          'type' => '6483'
        },
        '3' => {
          'name' => 'metadata',
          'offset' => '5',
          'type' => '1067'
        }
      },
      'Name' => 'struct pldm_bios_attr_table_entry',
      'Size' => '6',
      'Type' => 'Struct'
    },
    '45316' => {
      'BaseType' => '45251',
      'Name' => 'struct pldm_bios_attr_table_entry const',
      'Size' => '6',
      'Type' => 'Const'
    },
    '45321' => {
      'Header' => 'bios.h',
      'Line' => '66',
      'Memb' => {
        '0' => {
          'name' => 'attr_handle',
          'offset' => '0',
          'type' => '6483'
        },
        '1' => {
          'name' => 'attr_type',
          'offset' => '2',
          'type' => '140'
        },
        '2' => {
          'name' => 'value',
          'offset' => '3',
          'type' => '1067'
        }
      },
      'Name' => 'struct pldm_bios_attr_val_table_entry',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '45373' => {
      'BaseType' => '45321',
      'Name' => 'struct pldm_bios_attr_val_table_entry const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '45442' => {
      'Header' => 'bios_table.h',
      'Line' => '206',
      'Memb' => {
        '0' => {
          'name' => 'name_handle',
          'offset' => '0',
          'type' => '6483'
        },
        '1' => {
          'name' => 'read_only',
          'offset' => '2',
          'type' => '6282'
        },
        '2' => {
          'name' => 'pv_num',
          'offset' => '3',
          'type' => '140'
        },
        '3' => {
          'name' => 'pv_handle',
          'offset' => '8',
          'type' => '45545'
        },
        '4' => {
          'name' => 'def_num',
          'offset' => '22',
          'type' => '140'
        },
        '5' => {
          'name' => 'def_index',
          'offset' => '36',
          'type' => '5114'
        }
      },
      'Name' => 'struct pldm_bios_table_attr_entry_enum_info',
      'Size' => '32',
      'Type' => 'Struct'
    },
    '45533' => {
      'BaseType' => '45442',
      'Name' => 'struct pldm_bios_table_attr_entry_enum_info const',
      'Size' => '32',
      'Type' => 'Const'
    },
    '45545' => {
      'BaseType' => '7857',
      'Name' => 'uint16_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '45550' => {
      'Header' => 'bios_table.h',
      'Line' => '294',
      'Memb' => {
        '0' => {
          'name' => 'name_handle',
          'offset' => '0',
          'type' => '6483'
        },
        '1' => {
          'name' => 'read_only',
          'offset' => '2',
          'type' => '6282'
        },
        '2' => {
          'name' => 'string_type',
          'offset' => '3',
          'type' => '140'
        },
        '3' => {
          'name' => 'min_length',
          'offset' => '4',
          'type' => '6483'
        },
        '4' => {
          'name' => 'max_length',
          'offset' => '6',
          'type' => '6483'
        },
        '5' => {
          'name' => 'def_length',
          'offset' => '8',
          'type' => '6483'
        },
        '6' => {
          'name' => 'def_string',
          'offset' => '22',
          'type' => '9578'
        }
      },
      'Name' => 'struct pldm_bios_table_attr_entry_string_info',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '45662' => {
      'BaseType' => '45550',
      'Name' => 'struct pldm_bios_table_attr_entry_string_info const',
      'Size' => '24',
      'Type' => 'Const'
    },
    '45672' => {
      'Header' => 'bios_table.h',
      'Line' => '384',
      'Memb' => {
        '0' => {
          'name' => 'name_handle',
          'offset' => '0',
          'type' => '6483'
        },
        '1' => {
          'name' => 'read_only',
          'offset' => '2',
          'type' => '6282'
        },
        '2' => {
          'name' => 'lower_bound',
          'offset' => '8',
          'type' => '44846'
        },
        '3' => {
          'name' => 'upper_bound',
          'offset' => '22',
          'type' => '44846'
        },
        '4' => {
          'name' => 'scalar_increment',
          'offset' => '36',
          'type' => '152'
        },
        '5' => {
          'name' => 'default_value',
          'offset' => '50',
          'type' => '44846'
        }
      },
      'Name' => 'struct pldm_bios_table_attr_entry_integer_info',
      'Size' => '40',
      'Type' => 'Struct'
    },
    '45770' => {
      'BaseType' => '45672',
      'Name' => 'struct pldm_bios_table_attr_entry_integer_info const',
      'Size' => '40',
      'Type' => 'Const'
    },
    '46002' => {
      'Name' => 'ssize_t(*)(void const*)',
      'Param' => {
        '0' => {
          'type' => '1330'
        }
      },
      'Return' => '6615',
      'Size' => '8',
      'Type' => 'FuncPtr'
    },
    '46072' => {
      'Line' => '957',
      'Memb' => {
        '0' => {
          'name' => 'table_data',
          'offset' => '0',
          'type' => '5114'
        },
        '1' => {
          'name' => 'table_len',
          'offset' => '8',
          'type' => '169'
        },
        '2' => {
          'name' => 'current_pos',
          'offset' => '22',
          'type' => '169'
        },
        '3' => {
          'name' => 'entry_length_handler',
          'offset' => '36',
          'type' => '46002'
        }
      },
      'Name' => 'struct pldm_bios_table_iter',
      'PrivateABI' => 1,
      'Size' => '32',
      'Source' => 'bios_table.c',
      'Type' => 'Struct'
    },
    '46142' => {
      'BaseType' => '46072',
      'Name' => 'struct pldm_bios_table_iter const',
      'Size' => '32',
      'Type' => 'Const'
    },
    '47212' => {
      'BaseType' => '46072',
      'Name' => 'struct pldm_bios_table_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '47217' => {
      'BaseType' => '45373',
      'Name' => 'struct pldm_bios_attr_val_table_entry const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '47631' => {
      'BaseType' => '45316',
      'Name' => 'struct pldm_bios_attr_table_entry const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '48234' => {
      'BaseType' => '45230',
      'Name' => 'struct pldm_bios_string_table_entry const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '49397' => {
      'BaseType' => '46142',
      'Name' => 'struct pldm_bios_table_iter const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '53580' => {
      'BaseType' => '44846',
      'Name' => 'uint64_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '53857' => {
      'BaseType' => '45770',
      'Name' => 'struct pldm_bios_table_attr_entry_integer_info const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '54124' => {
      'BaseType' => '9578',
      'Name' => 'char const**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '55253' => {
      'BaseType' => '45662',
      'Name' => 'struct pldm_bios_table_attr_entry_string_info const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '56707' => {
      'BaseType' => '45533',
      'Name' => 'struct pldm_bios_table_attr_entry_enum_info const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '58928' => {
      'Header' => 'pldm_types.h',
      'Line' => '40',
      'Name' => 'struct bits16',
      'Size' => '2',
      'Type' => 'Struct'
    },
    '59198' => {
      'Header' => 'pldm_types.h',
      'Line' => '58',
      'Memb' => {
        '0' => {
          'name' => 'value',
          'offset' => '0',
          'type' => '6483'
        },
        '1' => {
          'name' => 'bits',
          'offset' => '0',
          'type' => '58928'
        }
      },
      'Name' => 'union bitfield16_t',
      'Size' => '2',
      'Type' => 'Union'
    },
    '59982' => {
      'Header' => 'file.h',
      'Line' => '53',
      'Memb' => {
        '0' => {
          'name' => 'file_identifier',
          'offset' => '0',
          'type' => '6483'
        },
        '1' => {
          'name' => 'file_attribute',
          'offset' => '2',
          'type' => '59198'
        }
      },
      'Name' => 'struct pldm_file_df_open_req',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '60022' => {
      'BaseType' => '59982',
      'Name' => 'struct pldm_file_df_open_req const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '60027' => {
      'Header' => 'file.h',
      'Line' => '62',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '140'
        },
        '1' => {
          'name' => 'file_descriptor',
          'offset' => '2',
          'type' => '6483'
        }
      },
      'Name' => 'struct pldm_file_df_open_resp',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '60072' => {
      'Header' => 'file.h',
      'Line' => '71',
      'Memb' => {
        '0' => {
          'name' => 'file_descriptor',
          'offset' => '0',
          'type' => '6483'
        },
        '1' => {
          'name' => 'df_close_options',
          'offset' => '2',
          'type' => '59198'
        }
      },
      'Name' => 'struct pldm_file_df_close_req',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '60112' => {
      'BaseType' => '60072',
      'Name' => 'struct pldm_file_df_close_req const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '60117' => {
      'Header' => 'file.h',
      'Line' => '80',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '140'
        }
      },
      'Name' => 'struct pldm_file_df_close_resp',
      'Size' => '1',
      'Type' => 'Struct'
    },
    '60149' => {
      'Header' => 'file.h',
      'Line' => '88',
      'Memb' => {
        '0' => {
          'name' => 'file_descriptor',
          'offset' => '0',
          'type' => '6483'
        },
        '1' => {
          'name' => 'requester_max_interval',
          'offset' => '4',
          'type' => '152'
        }
      },
      'Name' => 'struct pldm_file_df_heartbeat_req',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '60189' => {
      'BaseType' => '60149',
      'Name' => 'struct pldm_file_df_heartbeat_req const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '60194' => {
      'Header' => 'file.h',
      'Line' => '97',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '140'
        },
        '1' => {
          'name' => 'responder_max_interval',
          'offset' => '4',
          'type' => '152'
        }
      },
      'Name' => 'struct pldm_file_df_heartbeat_resp',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '61803' => {
      'BaseType' => '60194',
      'Name' => 'struct pldm_file_df_heartbeat_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '63382' => {
      'BaseType' => '60189',
      'Name' => 'struct pldm_file_df_heartbeat_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '63523' => {
      'BaseType' => '60117',
      'Name' => 'struct pldm_file_df_close_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '67814' => {
      'BaseType' => '60112',
      'Name' => 'struct pldm_file_df_close_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '69564' => {
      'BaseType' => '60027',
      'Name' => 'struct pldm_file_df_open_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '74150' => {
      'BaseType' => '60022',
      'Name' => 'struct pldm_file_df_open_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '75881' => {
      'BaseType' => '140',
      'Header' => 'pldm_types.h',
      'Line' => '36',
      'Name' => 'bool8_t',
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '76173' => {
      'Header' => 'pldm_types.h',
      'Line' => '62',
      'Name' => 'struct bits32',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '76665' => {
      'Header' => 'pldm_types.h',
      'Line' => '96',
      'Memb' => {
        '0' => {
          'name' => 'value',
          'offset' => '0',
          'type' => '152'
        },
        '1' => {
          'name' => 'bits',
          'offset' => '0',
          'type' => '76173'
        }
      },
      'Name' => 'union bitfield32_t',
      'Size' => '4',
      'Type' => 'Union'
    },
    '76677' => {
      'Header' => 'pldm_types.h',
      'Line' => '100',
      'Name' => 'struct bits64',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '77617' => {
      'Header' => 'pldm_types.h',
      'Line' => '166',
      'Memb' => {
        '0' => {
          'name' => 'value',
          'offset' => '0',
          'type' => '44846'
        },
        '1' => {
          'name' => 'bits',
          'offset' => '0',
          'type' => '76677'
        }
      },
      'Name' => 'union bitfield64_t',
      'Size' => '8',
      'Type' => 'Union'
    },
    '77636' => {
      'BaseType' => '77648',
      'Header' => 'pldm_types.h',
      'Line' => '170',
      'Name' => 'pldm_uuid',
      'Size' => '16',
      'Type' => 'Typedef'
    },
    '77648' => {
      'BaseType' => '140',
      'Name' => 'uint8_t[16]',
      'Size' => '16',
      'Type' => 'Array'
    },
    '77664' => {
      'BaseType' => '77648',
      'Name' => 'uint8_t[16] const',
      'Size' => '16',
      'Type' => 'Const'
    },
    '77693' => {
      'BaseType' => '169',
      'Name' => 'size_t const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '77758' => {
      'BaseType' => '8201',
      'Name' => 'struct variable_field const',
      'Size' => '16',
      'Type' => 'Const'
    },
    '79898' => {
      'BaseType' => '140',
      'Name' => 'uint8_t[8]',
      'Size' => '8',
      'Type' => 'Array'
    },
    '79914' => {
      'Header' => 'firmware_update.h',
      'Line' => '466',
      'Memb' => {
        '0' => {
          'name' => 'uuid',
          'offset' => '0',
          'type' => '77648'
        },
        '1' => {
          'name' => 'package_header_format_version',
          'offset' => '22',
          'type' => '140'
        },
        '2' => {
          'name' => 'package_header_size',
          'offset' => '23',
          'type' => '6483'
        },
        '3' => {
          'name' => 'package_release_date_time',
          'offset' => '25',
          'type' => '80027'
        },
        '4' => {
          'name' => 'component_bitmap_bit_length',
          'offset' => '50',
          'type' => '6483'
        },
        '5' => {
          'name' => 'package_version_string_type',
          'offset' => '52',
          'type' => '140'
        },
        '6' => {
          'name' => 'package_version_string_length',
          'offset' => '53',
          'type' => '140'
        }
      },
      'Name' => 'struct pldm_package_header_information',
      'Size' => '36',
      'Type' => 'Struct'
    },
    '80027' => {
      'BaseType' => '140',
      'Name' => 'uint8_t[13]',
      'Size' => '13',
      'Type' => 'Array'
    },
    '80043' => {
      'Header' => 'firmware_update.h',
      'Line' => '480',
      'Memb' => {
        '0' => {
          'name' => 'record_length',
          'offset' => '0',
          'type' => '6483'
        },
        '1' => {
          'name' => 'descriptor_count',
          'offset' => '2',
          'type' => '140'
        },
        '2' => {
          'name' => 'device_update_option_flags',
          'offset' => '3',
          'type' => '76665'
        },
        '3' => {
          'name' => 'comp_image_set_version_string_type',
          'offset' => '7',
          'type' => '140'
        },
        '4' => {
          'name' => 'comp_image_set_version_string_length',
          'offset' => '8',
          'type' => '140'
        },
        '5' => {
          'name' => 'fw_device_pkg_data_length',
          'offset' => '9',
          'type' => '6483'
        }
      },
      'Name' => 'struct pldm_firmware_device_id_record',
      'Size' => '11',
      'Type' => 'Struct'
    },
    '80256' => {
      'Header' => 'firmware_update.h',
      'Line' => '514',
      'Memb' => {
        '0' => {
          'name' => 'comp_classification',
          'offset' => '0',
          'type' => '6483'
        },
        '1' => {
          'name' => 'comp_identifier',
          'offset' => '2',
          'type' => '6483'
        },
        '2' => {
          'name' => 'comp_comparison_stamp',
          'offset' => '4',
          'type' => '152'
        },
        '3' => {
          'name' => 'comp_options',
          'offset' => '8',
          'type' => '59198'
        },
        '4' => {
          'name' => 'requested_comp_activation_method',
          'offset' => '16',
          'type' => '59198'
        },
        '5' => {
          'name' => 'comp_location_offset',
          'offset' => '18',
          'type' => '152'
        },
        '6' => {
          'name' => 'comp_size',
          'offset' => '22',
          'type' => '152'
        },
        '7' => {
          'name' => 'comp_version_string_type',
          'offset' => '32',
          'type' => '140'
        },
        '8' => {
          'name' => 'comp_version_string_length',
          'offset' => '33',
          'type' => '140'
        }
      },
      'Name' => 'struct pldm_component_image_information',
      'Size' => '22',
      'Type' => 'Struct'
    },
    '80454' => {
      'Header' => 'firmware_update.h',
      'Line' => '540',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '140'
        },
        '1' => {
          'name' => 'capabilities_during_update',
          'offset' => '1',
          'type' => '76665'
        },
        '2' => {
          'name' => 'comp_count',
          'offset' => '5',
          'type' => '6483'
        },
        '3' => {
          'name' => 'active_comp_image_set_ver_str_type',
          'offset' => '7',
          'type' => '140'
        },
        '4' => {
          'name' => 'active_comp_image_set_ver_str_len',
          'offset' => '8',
          'type' => '140'
        },
        '5' => {
          'name' => 'pending_comp_image_set_ver_str_type',
          'offset' => '9',
          'type' => '140'
        },
        '6' => {
          'name' => 'pending_comp_image_set_ver_str_len',
          'offset' => '16',
          'type' => '140'
        }
      },
      'Name' => 'struct pldm_get_firmware_parameters_resp',
      'Size' => '11',
      'Type' => 'Struct'
    },
    '80657' => {
      'Header' => 'firmware_update.h',
      'Line' => '568',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '140'
        },
        '1' => {
          'name' => 'downstream_device_update_supported',
          'offset' => '1',
          'type' => '140'
        },
        '2' => {
          'name' => 'number_of_downstream_devices',
          'offset' => '2',
          'type' => '6483'
        },
        '3' => {
          'name' => 'max_number_of_downstream_devices',
          'offset' => '4',
          'type' => '6483'
        },
        '4' => {
          'name' => 'capabilities',
          'offset' => '8',
          'type' => '76665'
        }
      },
      'Name' => 'struct pldm_query_downstream_devices_resp',
      'Size' => '12',
      'Type' => 'Struct'
    },
    '80742' => {
      'Header' => 'firmware_update.h',
      'Line' => '580',
      'Memb' => {
        '0' => {
          'name' => 'comp_classification',
          'offset' => '0',
          'type' => '6483'
        },
        '1' => {
          'name' => 'comp_identifier',
          'offset' => '2',
          'type' => '6483'
        },
        '2' => {
          'name' => 'comp_classification_index',
          'offset' => '4',
          'type' => '140'
        },
        '3' => {
          'name' => 'active_comp_comparison_stamp',
          'offset' => '5',
          'type' => '152'
        },
        '4' => {
          'name' => 'active_comp_ver_str_type',
          'offset' => '9',
          'type' => '140'
        },
        '5' => {
          'name' => 'active_comp_ver_str_len',
          'offset' => '16',
          'type' => '140'
        },
        '6' => {
          'name' => 'active_comp_release_date',
          'offset' => '17',
          'type' => '79898'
        },
        '7' => {
          'name' => 'pending_comp_comparison_stamp',
          'offset' => '25',
          'type' => '152'
        },
        '8' => {
          'name' => 'pending_comp_ver_str_type',
          'offset' => '35',
          'type' => '140'
        },
        '9' => {
          'name' => 'pending_comp_ver_str_len',
          'offset' => '36',
          'type' => '140'
        },
        '10' => {
          'name' => 'pending_comp_release_date',
          'offset' => '37',
          'type' => '79898'
        },
        '11' => {
          'name' => 'comp_activation_methods',
          'offset' => '51',
          'type' => '59198'
        },
        '12' => {
          'name' => 'capabilities_during_update',
          'offset' => '53',
          'type' => '76665'
        }
      },
      'Name' => 'struct pldm_component_parameter_entry',
      'Size' => '39',
      'Type' => 'Struct'
    },
    '81057' => {
      'Header' => 'firmware_update.h',
      'Line' => '619',
      'Memb' => {
        '0' => {
          'name' => 'data_transfer_handle',
          'offset' => '0',
          'type' => '152'
        },
        '1' => {
          'name' => 'transfer_operation_flag',
          'offset' => '4',
          'type' => '140'
        }
      },
      'Name' => 'struct pldm_query_downstream_identifiers_req',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '81100' => {
      'BaseType' => '81057',
      'Name' => 'struct pldm_query_downstream_identifiers_req const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '81105' => {
      'Header' => 'firmware_update.h',
      'Line' => '633',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '140'
        },
        '1' => {
          'name' => 'next_data_transfer_handle',
          'offset' => '4',
          'type' => '152'
        },
        '2' => {
          'name' => 'transfer_flag',
          'offset' => '8',
          'type' => '140'
        },
        '3' => {
          'name' => 'downstream_devices_length',
          'offset' => '18',
          'type' => '152'
        },
        '4' => {
          'name' => 'number_of_downstream_devices',
          'offset' => '22',
          'type' => '6483'
        }
      },
      'Name' => 'struct pldm_query_downstream_identifiers_resp',
      'Size' => '20',
      'Type' => 'Struct'
    },
    '81190' => {
      'Header' => 'firmware_update.h',
      'Line' => '646',
      'Memb' => {
        '0' => {
          'name' => 'downstream_device_index',
          'offset' => '0',
          'type' => '6483'
        },
        '1' => {
          'name' => 'downstream_descriptor_count',
          'offset' => '2',
          'type' => '140'
        }
      },
      'Name' => 'struct pldm_downstream_device',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '81233' => {
      'Header' => 'firmware_update.h',
      'Line' => '652',
      'Memb' => {
        '0' => {
          'name' => 'field',
          'offset' => '0',
          'type' => '8201'
        },
        '1' => {
          'name' => 'devs',
          'offset' => '22',
          'type' => '169'
        }
      },
      'Name' => 'struct pldm_downstream_device_iter',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '81276' => {
      'Header' => 'firmware_update.h',
      'Line' => '726',
      'Memb' => {
        '0' => {
          'name' => 'descriptor_type',
          'offset' => '0',
          'type' => '6483'
        },
        '1' => {
          'name' => 'descriptor_length',
          'offset' => '2',
          'type' => '6483'
        },
        '2' => {
          'name' => 'descriptor_data',
          'offset' => '8',
          'type' => '1330'
        }
      },
      'Name' => 'struct pldm_descriptor',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '81349' => {
      'Header' => 'firmware_update.h',
      'Line' => '732',
      'Memb' => {
        '0' => {
          'name' => 'field',
          'offset' => '0',
          'type' => '39420'
        },
        '1' => {
          'name' => 'count',
          'offset' => '8',
          'type' => '169'
        }
      },
      'Name' => 'struct pldm_descriptor_iter',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '81397' => {
      'Header' => 'firmware_update.h',
      'Line' => '825',
      'Memb' => {
        '0' => {
          'name' => 'data_transfer_handle',
          'offset' => '0',
          'type' => '152'
        },
        '1' => {
          'name' => 'transfer_operation_flag',
          'offset' => '4',
          'type' => '140'
        }
      },
      'Name' => 'struct pldm_get_downstream_firmware_parameters_req',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '81440' => {
      'BaseType' => '81397',
      'Name' => 'struct pldm_get_downstream_firmware_parameters_req const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '81445' => {
      'Header' => 'firmware_update.h',
      'Line' => '840',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '140'
        },
        '1' => {
          'name' => 'next_data_transfer_handle',
          'offset' => '4',
          'type' => '152'
        },
        '2' => {
          'name' => 'transfer_flag',
          'offset' => '8',
          'type' => '140'
        },
        '3' => {
          'name' => 'fdp_capabilities_during_update',
          'offset' => '18',
          'type' => '76665'
        },
        '4' => {
          'name' => 'downstream_device_count',
          'offset' => '22',
          'type' => '6483'
        }
      },
      'Name' => 'struct pldm_get_downstream_firmware_parameters_resp',
      'Size' => '20',
      'Type' => 'Struct'
    },
    '81530' => {
      'Header' => 'firmware_update.h',
      'Line' => '858',
      'Memb' => {
        '0' => {
          'name' => 'downstream_device_index',
          'offset' => '0',
          'type' => '6483'
        },
        '1' => {
          'name' => 'active_comp_comparison_stamp',
          'offset' => '4',
          'type' => '152'
        },
        '2' => {
          'name' => 'active_comp_ver_str_type',
          'offset' => '8',
          'type' => '140'
        },
        '3' => {
          'name' => 'active_comp_ver_str_len',
          'offset' => '9',
          'type' => '140'
        },
        '4' => {
          'name' => 'active_comp_release_date',
          'offset' => '16',
          'type' => '81727'
        },
        '5' => {
          'name' => 'pending_comp_comparison_stamp',
          'offset' => '32',
          'type' => '152'
        },
        '6' => {
          'name' => 'pending_comp_ver_str_type',
          'offset' => '36',
          'type' => '140'
        },
        '7' => {
          'name' => 'pending_comp_ver_str_len',
          'offset' => '37',
          'type' => '140'
        },
        '8' => {
          'name' => 'pending_comp_release_date',
          'offset' => '38',
          'type' => '81727'
        },
        '9' => {
          'name' => 'comp_activation_methods',
          'offset' => '54',
          'type' => '59198'
        },
        '10' => {
          'name' => 'capabilities_during_update',
          'offset' => '64',
          'type' => '76665'
        },
        '11' => {
          'name' => 'active_comp_ver_str',
          'offset' => '72',
          'type' => '1330'
        },
        '12' => {
          'name' => 'pending_comp_ver_str',
          'offset' => '86',
          'type' => '1330'
        }
      },
      'Name' => 'struct pldm_downstream_device_parameters_entry',
      'Size' => '64',
      'Type' => 'Struct'
    },
    '81727' => {
      'BaseType' => '51',
      'Name' => 'char[9]',
      'Size' => '9',
      'Type' => 'Array'
    },
    '83098' => {
      'Header' => 'firmware_update.h',
      'Line' => '1395',
      'Memb' => {
        '0' => {
          'name' => 'field',
          'offset' => '0',
          'type' => '8201'
        },
        '1' => {
          'name' => 'entries',
          'offset' => '22',
          'type' => '169'
        }
      },
      'Name' => 'struct pldm_downstream_device_parameters_iter',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '83141' => {
      'Header' => 'firmware_update.h',
      'Line' => '2249',
      'Memb' => {
        '0' => {
          'name' => 'magic',
          'offset' => '0',
          'type' => '164'
        },
        '1' => {
          'name' => 'version',
          'offset' => '4',
          'type' => '4903'
        }
      },
      'Name' => 'anon-struct-firmware_update.h-2249',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '83178' => {
      'Header' => 'firmware_update.h',
      'Line' => '2268',
      'Memb' => {
        '0' => {
          'name' => 'identifier',
          'offset' => '0',
          'type' => '77664'
        },
        '1' => {
          'name' => 'revision',
          'offset' => '22',
          'type' => '4903'
        }
      },
      'Name' => 'anon-struct-firmware_update.h-2268',
      'Size' => '17',
      'Type' => 'Struct'
    },
    '83215' => {
      'Header' => 'firmware_update.h',
      'Line' => '2248',
      'Memb' => {
        '0' => {
          'name' => 'meta',
          'offset' => '0',
          'type' => '83141'
        },
        '1' => {
          'name' => 'format',
          'offset' => '8',
          'type' => '83178'
        }
      },
      'Name' => 'struct pldm_package_format_pin',
      'Size' => '28',
      'Type' => 'Struct'
    },
    '83258' => {
      'BaseType' => '83215',
      'Name' => 'struct pldm_package_format_pin const',
      'Size' => '28',
      'Type' => 'Const'
    },
    '83263' => {
      'Header' => 'firmware_update.h',
      'Line' => '2277',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_PACKAGE_PARSE_INIT',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_PACKAGE_PARSE_COMPLETE',
          'value' => '1'
        },
        '2' => {
          'name' => 'PLDM_PACKAGE_PARSE_HEADER',
          'value' => '2'
        },
        '3' => {
          'name' => 'PLDM_PACKAGE_PARSE_FIRMWARE_DEVICES',
          'value' => '3'
        },
        '4' => {
          'name' => 'PLDM_PACKAGE_PARSE_DOWNSTREAM_DEVICES',
          'value' => '4'
        },
        '5' => {
          'name' => 'PLDM_PACKAGE_PARSE_COMPONENT_IMAGE_INFORMATION',
          'value' => '5'
        }
      },
      'Name' => 'enum pldm_package_parse',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '83315' => {
      'Header' => 'firmware_update.h',
      'Line' => '2286',
      'Memb' => {
        '0' => {
          'name' => 'field',
          'offset' => '0',
          'type' => '8201'
        },
        '1' => {
          'name' => 'entries',
          'offset' => '22',
          'type' => '169'
        }
      },
      'Name' => 'struct pldm_package_iter',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '83358' => {
      'Header' => 'firmware_update.h',
      'Line' => '2299',
      'Memb' => {
        '0' => {
          'name' => 'package_header_identifier',
          'offset' => '0',
          'type' => '77636'
        },
        '1' => {
          'name' => 'package_header_format_revision',
          'offset' => '22',
          'type' => '140'
        },
        '2' => {
          'name' => 'package_release_date_time',
          'offset' => '23',
          'type' => '80027'
        },
        '3' => {
          'name' => 'component_bitmap_bit_length',
          'offset' => '48',
          'type' => '6483'
        },
        '4' => {
          'name' => 'package_version_string_type',
          'offset' => '50',
          'type' => '140'
        },
        '5' => {
          'name' => 'package_version_string',
          'offset' => '64',
          'type' => '8201'
        }
      },
      'Name' => 'struct pldm__package_header_information',
      'Size' => '56',
      'Type' => 'Struct'
    },
    '83457' => {
      'BaseType' => '83358',
      'Header' => 'firmware_update.h',
      'Line' => '2312',
      'Name' => 'pldm_package_header_information_pad',
      'Size' => '56',
      'Type' => 'Typedef'
    },
    '83470' => {
      'BaseType' => '83457',
      'Name' => 'pldm_package_header_information_pad const',
      'Size' => '56',
      'Type' => 'Const'
    },
    '83475' => {
      'Header' => 'firmware_update.h',
      'Line' => '2315',
      'Memb' => {
        '0' => {
          'name' => 'bitmap',
          'offset' => '0',
          'type' => '8201'
        }
      },
      'Name' => 'struct pldm_package_component_bitmap',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '83504' => {
      'Header' => 'firmware_update.h',
      'Line' => '2327',
      'Memb' => {
        '0' => {
          'name' => 'descriptor_count',
          'offset' => '0',
          'type' => '140'
        },
        '1' => {
          'name' => 'device_update_option_flags',
          'offset' => '4',
          'type' => '76665'
        },
        '2' => {
          'name' => 'component_image_set_version_string_type',
          'offset' => '8',
          'type' => '140'
        },
        '3' => {
          'name' => 'component_image_set_version_string',
          'offset' => '22',
          'type' => '8201'
        },
        '4' => {
          'name' => 'applicable_components',
          'offset' => '50',
          'type' => '83475'
        },
        '5' => {
          'name' => 'record_descriptors',
          'offset' => '72',
          'type' => '8201'
        },
        '6' => {
          'name' => 'firmware_device_package_data',
          'offset' => '100',
          'type' => '8201'
        },
        '7' => {
          'name' => 'reference_manifest_data',
          'offset' => '128',
          'type' => '8201'
        }
      },
      'Name' => 'struct pldm_package_firmware_device_id_record',
      'Size' => '96',
      'Type' => 'Struct'
    },
    '83631' => {
      'Header' => 'firmware_update.h',
      'Line' => '2378',
      'Memb' => {
        '0' => {
          'name' => 'descriptor_count',
          'offset' => '0',
          'type' => '140'
        },
        '1' => {
          'name' => 'update_option_flags',
          'offset' => '4',
          'type' => '76665'
        },
        '2' => {
          'name' => 'self_contained_activation_min_version_string_type',
          'offset' => '8',
          'type' => '140'
        },
        '3' => {
          'name' => 'self_contained_activation_min_version_string',
          'offset' => '22',
          'type' => '8201'
        },
        '4' => {
          'name' => 'self_contained_activation_min_version_comparison_stamp',
          'offset' => '50',
          'type' => '152'
        },
        '5' => {
          'name' => 'applicable_components',
          'offset' => '64',
          'type' => '83475'
        },
        '6' => {
          'name' => 'record_descriptors',
          'offset' => '86',
          'type' => '8201'
        },
        '7' => {
          'name' => 'package_data',
          'offset' => '114',
          'type' => '8201'
        },
        '8' => {
          'name' => 'reference_manifest_data',
          'offset' => '136',
          'type' => '8201'
        }
      },
      'Name' => 'struct pldm_package_downstream_device_id_record',
      'Size' => '104',
      'Type' => 'Struct'
    },
    '83772' => {
      'Header' => 'firmware_update.h',
      'Line' => '2428',
      'Memb' => {
        '0' => {
          'name' => 'component_classification',
          'offset' => '0',
          'type' => '6483'
        },
        '1' => {
          'name' => 'component_identifier',
          'offset' => '2',
          'type' => '6483'
        },
        '2' => {
          'name' => 'component_comparison_stamp',
          'offset' => '4',
          'type' => '152'
        },
        '3' => {
          'name' => 'component_options',
          'offset' => '8',
          'type' => '59198'
        },
        '4' => {
          'name' => 'requested_component_activation_method',
          'offset' => '16',
          'type' => '59198'
        },
        '5' => {
          'name' => 'component_image',
          'offset' => '22',
          'type' => '8201'
        },
        '6' => {
          'name' => 'component_version_string_type',
          'offset' => '50',
          'type' => '140'
        },
        '7' => {
          'name' => 'component_version_string',
          'offset' => '64',
          'type' => '8201'
        },
        '8' => {
          'name' => 'component_opaque_data',
          'offset' => '86',
          'type' => '8201'
        }
      },
      'Name' => 'struct pldm_package_component_image_information',
      'Size' => '72',
      'Type' => 'Struct'
    },
    '83913' => {
      'Header' => 'firmware_update.h',
      'Line' => '2469',
      'Memb' => {
        '0' => {
          'name' => 'pin',
          'offset' => '0',
          'type' => '84024'
        },
        '1' => {
          'name' => 'hdr',
          'offset' => '8',
          'type' => '84029'
        },
        '2' => {
          'name' => 'state',
          'offset' => '22',
          'type' => '83263'
        },
        '3' => {
          'name' => 'flags',
          'offset' => '32',
          'type' => '152'
        },
        '4' => {
          'name' => 'package',
          'offset' => '36',
          'type' => '8201'
        },
        '5' => {
          'name' => 'areas',
          'offset' => '64',
          'type' => '8201'
        },
        '6' => {
          'name' => 'iter',
          'offset' => '86',
          'type' => '83315'
        }
      },
      'Name' => 'struct pldm_package',
      'Size' => '80',
      'Type' => 'Struct'
    },
    '84024' => {
      'BaseType' => '83258',
      'Name' => 'struct pldm_package_format_pin const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '84029' => {
      'BaseType' => '83470',
      'Name' => 'pldm_package_header_information_pad const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '90909' => {
      'BaseType' => '83913',
      'Name' => 'struct pldm_package*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '90914' => {
      'BaseType' => '83772',
      'Name' => 'struct pldm_package_component_image_information*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '99003' => {
      'BaseType' => '83631',
      'Name' => 'struct pldm_package_downstream_device_id_record*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '100656' => {
      'BaseType' => '83504',
      'Name' => 'struct pldm_package_firmware_device_id_record*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '102408' => {
      'BaseType' => '83457',
      'Name' => 'pldm_package_header_information_pad*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '104484' => {
      'BaseType' => '75881',
      'Name' => 'bool8_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '104489' => {
      'BaseType' => '77617',
      'Name' => 'bitfield64_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '108550' => {
      'BaseType' => '76665',
      'Name' => 'bitfield32_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '113662' => {
      'BaseType' => '59198',
      'Name' => 'bitfield16_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '126371' => {
      'BaseType' => '77758',
      'Name' => 'struct variable_field const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '153244' => {
      'BaseType' => '83098',
      'Name' => 'struct pldm_downstream_device_parameters_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '153249' => {
      'BaseType' => '81530',
      'Name' => 'struct pldm_downstream_device_parameters_entry*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '156713' => {
      'BaseType' => '81445',
      'Name' => 'struct pldm_get_downstream_firmware_parameters_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '158162' => {
      'BaseType' => '81440',
      'Name' => 'struct pldm_get_downstream_firmware_parameters_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '159728' => {
      'BaseType' => '81233',
      'Name' => 'struct pldm_downstream_device_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '159733' => {
      'BaseType' => '81190',
      'Name' => 'struct pldm_downstream_device*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '163194' => {
      'BaseType' => '81105',
      'Name' => 'struct pldm_query_downstream_identifiers_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '164643' => {
      'BaseType' => '81100',
      'Name' => 'struct pldm_query_downstream_identifiers_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '168016' => {
      'BaseType' => '80657',
      'Name' => 'struct pldm_query_downstream_devices_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '168463' => {
      'BaseType' => '80742',
      'Name' => 'struct pldm_component_parameter_entry*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '178807' => {
      'BaseType' => '80454',
      'Name' => 'struct pldm_get_firmware_parameters_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '182433' => {
      'BaseType' => '1595',
      'Name' => 'uint8_t**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '182775' => {
      'BaseType' => '80256',
      'Name' => 'struct pldm_component_image_information*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '185753' => {
      'BaseType' => '81349',
      'Name' => 'struct pldm_descriptor_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '185758' => {
      'BaseType' => '81276',
      'Name' => 'struct pldm_descriptor*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '186142' => {
      'BaseType' => '80043',
      'Name' => 'struct pldm_firmware_device_id_record*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '194905' => {
      'BaseType' => '138',
      'Name' => 'void**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '195406' => {
      'BaseType' => '79914',
      'Name' => 'struct pldm_package_header_information*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '212720' => {
      'BaseType' => '212737',
      'Header' => 'pdr.h',
      'Line' => '16',
      'Name' => 'pldm_pdr',
      'PrivateABI' => 1,
      'Size' => '24',
      'Type' => 'Typedef'
    },
    '212732' => {
      'BaseType' => '212720',
      'Name' => 'pldm_pdr const',
      'Size' => '24',
      'Type' => 'Const'
    },
    '212737' => {
      'Line' => '31',
      'Memb' => {
        '0' => {
          'name' => 'record_count',
          'offset' => '0',
          'type' => '152'
        },
        '1' => {
          'name' => 'size',
          'offset' => '4',
          'type' => '152'
        },
        '2' => {
          'name' => 'first',
          'offset' => '8',
          'type' => '214201'
        },
        '3' => {
          'name' => 'last',
          'offset' => '22',
          'type' => '214201'
        }
      },
      'Name' => 'struct pldm_pdr',
      'PrivateABI' => 1,
      'Size' => '24',
      'Source' => 'pdr.c',
      'Type' => 'Struct'
    },
    '212803' => {
      'BaseType' => '212820',
      'Header' => 'pdr.h',
      'Line' => '21',
      'Name' => 'pldm_pdr_record',
      'PrivateABI' => 1,
      'Size' => '32',
      'Type' => 'Typedef'
    },
    '212815' => {
      'BaseType' => '212803',
      'Name' => 'pldm_pdr_record const',
      'Size' => '32',
      'Type' => 'Const'
    },
    '212820' => {
      'Line' => '22',
      'Memb' => {
        '0' => {
          'name' => 'record_handle',
          'offset' => '0',
          'type' => '152'
        },
        '1' => {
          'name' => 'size',
          'offset' => '4',
          'type' => '152'
        },
        '2' => {
          'name' => 'data',
          'offset' => '8',
          'type' => '1595'
        },
        '3' => {
          'name' => 'next',
          'offset' => '22',
          'type' => '214189'
        },
        '4' => {
          'name' => 'is_remote',
          'offset' => '36',
          'type' => '6282'
        },
        '5' => {
          'name' => 'terminus_handle',
          'offset' => '38',
          'type' => '6483'
        }
      },
      'Name' => 'struct pldm_pdr_record',
      'PrivateABI' => 1,
      'Size' => '32',
      'Source' => 'pdr.c',
      'Type' => 'Struct'
    },
    '212912' => {
      'Header' => 'pdr.h',
      'Line' => '327',
      'Memb' => {
        '0' => {
          'name' => 'entity_type',
          'offset' => '0',
          'type' => '6483'
        },
        '1' => {
          'name' => 'entity_instance_num',
          'offset' => '2',
          'type' => '6483'
        },
        '2' => {
          'name' => 'entity_container_id',
          'offset' => '4',
          'type' => '6483'
        }
      },
      'Name' => 'struct pldm_entity',
      'Size' => '6',
      'Type' => 'Struct'
    },
    '212974' => {
      'BaseType' => '212912',
      'Header' => 'pdr.h',
      'Line' => '331',
      'Name' => 'pldm_entity',
      'Size' => '6',
      'Type' => 'Typedef'
    },
    '212986' => {
      'BaseType' => '212974',
      'Name' => 'pldm_entity const',
      'Size' => '6',
      'Type' => 'Const'
    },
    '213020' => {
      'BaseType' => '213032',
      'Header' => 'pdr.h',
      'Line' => '341',
      'Name' => 'pldm_entity_association_tree',
      'PrivateABI' => 1,
      'Size' => '16',
      'Type' => 'Typedef'
    },
    '213032' => {
      'Line' => '648',
      'Memb' => {
        '0' => {
          'name' => 'root',
          'offset' => '0',
          'type' => '214206'
        },
        '1' => {
          'name' => 'last_used_container_id',
          'offset' => '8',
          'type' => '6483'
        }
      },
      'Name' => 'struct pldm_entity_association_tree',
      'PrivateABI' => 1,
      'Size' => '16',
      'Source' => 'pdr.c',
      'Type' => 'Struct'
    },
    '213075' => {
      'BaseType' => '213092',
      'Header' => 'pdr.h',
      'Line' => '346',
      'Name' => 'pldm_entity_node',
      'PrivateABI' => 1,
      'Size' => '40',
      'Type' => 'Typedef'
    },
    '213087' => {
      'BaseType' => '213075',
      'Name' => 'pldm_entity_node const',
      'Size' => '40',
      'Type' => 'Const'
    },
    '213092' => {
      'Line' => '653',
      'Memb' => {
        '0' => {
          'name' => 'entity',
          'offset' => '0',
          'type' => '212974'
        },
        '1' => {
          'name' => 'parent',
          'offset' => '6',
          'type' => '212974'
        },
        '2' => {
          'name' => 'remote_container_id',
          'offset' => '18',
          'type' => '6483'
        },
        '3' => {
          'name' => 'first_child',
          'offset' => '22',
          'type' => '214206'
        },
        '4' => {
          'name' => 'next_sibling',
          'offset' => '36',
          'type' => '214206'
        },
        '5' => {
          'name' => 'association_type',
          'offset' => '50',
          'type' => '140'
        }
      },
      'Name' => 'struct pldm_entity_node',
      'PrivateABI' => 1,
      'Size' => '40',
      'Source' => 'pdr.c',
      'Type' => 'Struct'
    },
    '213407' => {
      'Header' => 'platform.h',
      'Line' => '576',
      'Memb' => {
        '0' => {
          'name' => 'record_handle',
          'offset' => '0',
          'type' => '152'
        },
        '1' => {
          'name' => 'version',
          'offset' => '4',
          'type' => '140'
        },
        '2' => {
          'name' => 'type',
          'offset' => '5',
          'type' => '140'
        },
        '3' => {
          'name' => 'record_change_num',
          'offset' => '6',
          'type' => '6483'
        },
        '4' => {
          'name' => 'length',
          'offset' => '8',
          'type' => '6483'
        }
      },
      'Name' => 'struct pldm_pdr_hdr',
      'Size' => '10',
      'Type' => 'Struct'
    },
    '213856' => {
      'Header' => 'platform.h',
      'Line' => '651',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '213407'
        },
        '1' => {
          'name' => 'terminus_handle',
          'offset' => '16',
          'type' => '6483'
        },
        '2' => {
          'name' => 'sensor_id',
          'offset' => '18',
          'type' => '6483'
        },
        '3' => {
          'name' => 'entity_type',
          'offset' => '20',
          'type' => '6483'
        },
        '4' => {
          'name' => 'entity_instance',
          'offset' => '22',
          'type' => '6483'
        },
        '5' => {
          'name' => 'container_id',
          'offset' => '24',
          'type' => '6483'
        },
        '6' => {
          'name' => 'sensor_init',
          'offset' => '32',
          'type' => '140'
        },
        '7' => {
          'name' => 'sensor_auxiliary_names_pdr',
          'offset' => '33',
          'type' => '75881'
        },
        '8' => {
          'name' => 'composite_sensor_count',
          'offset' => '34',
          'type' => '140'
        },
        '9' => {
          'name' => 'possible_states',
          'offset' => '35',
          'type' => '1067'
        }
      },
      'Name' => 'struct pldm_state_sensor_pdr',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '214010' => {
      'Header' => 'platform.h',
      'Line' => '678',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '213407'
        },
        '1' => {
          'name' => 'terminus_handle',
          'offset' => '16',
          'type' => '6483'
        },
        '2' => {
          'name' => 'effecter_id',
          'offset' => '18',
          'type' => '6483'
        },
        '3' => {
          'name' => 'entity_type',
          'offset' => '20',
          'type' => '6483'
        },
        '4' => {
          'name' => 'entity_instance',
          'offset' => '22',
          'type' => '6483'
        },
        '5' => {
          'name' => 'container_id',
          'offset' => '24',
          'type' => '6483'
        },
        '6' => {
          'name' => 'effecter_semantic_id',
          'offset' => '32',
          'type' => '6483'
        },
        '7' => {
          'name' => 'effecter_init',
          'offset' => '34',
          'type' => '140'
        },
        '8' => {
          'name' => 'has_description_pdr',
          'offset' => '35',
          'type' => '75881'
        },
        '9' => {
          'name' => 'composite_effecter_count',
          'offset' => '36',
          'type' => '140'
        },
        '10' => {
          'name' => 'possible_states',
          'offset' => '37',
          'type' => '1067'
        }
      },
      'Name' => 'struct pldm_state_effecter_pdr',
      'Size' => '26',
      'Type' => 'Struct'
    },
    '214189' => {
      'BaseType' => '212820',
      'Name' => 'struct pldm_pdr_record*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '214201' => {
      'BaseType' => '212803',
      'Name' => 'pldm_pdr_record*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '214206' => {
      'BaseType' => '213075',
      'Name' => 'pldm_entity_node*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '214573' => {
      'BaseType' => '213020',
      'Name' => 'pldm_entity_association_tree*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '214578' => {
      'BaseType' => '212986',
      'Name' => 'pldm_entity const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '216062' => {
      'BaseType' => '212720',
      'Name' => 'pldm_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '217717' => {
      'BaseType' => '212815',
      'Name' => 'pldm_pdr_record const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '226436' => {
      'BaseType' => '212974',
      'Name' => 'pldm_entity*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '246313' => {
      'BaseType' => '226436',
      'Name' => 'pldm_entity**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '246960' => {
      'BaseType' => '214206',
      'Name' => 'pldm_entity_node**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '247749' => {
      'BaseType' => '212732',
      'Name' => 'pldm_pdr const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '253222' => {
      'BaseType' => '213087',
      'Name' => 'pldm_entity_node const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '260067' => {
      'BaseType' => '214010',
      'Name' => 'struct pldm_state_effecter_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '265758' => {
      'BaseType' => '213856',
      'Name' => 'struct pldm_state_sensor_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '270978' => {
      'BaseType' => '93',
      'Header' => 'types.h',
      'Line' => '37',
      'Name' => '__int8_t',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '271009' => {
      'BaseType' => '112',
      'Header' => 'types.h',
      'Line' => '39',
      'Name' => '__int16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '271040' => {
      'BaseType' => '58',
      'Header' => 'types.h',
      'Line' => '41',
      'Name' => '__int32_t',
      'PrivateABI' => 1,
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '271078' => {
      'BaseType' => '6409',
      'Header' => 'types.h',
      'Line' => '55',
      'Name' => '__uint_least16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '271131' => {
      'BaseType' => '270978',
      'Header' => 'stdint-intn.h',
      'Line' => '24',
      'Name' => 'int8_t',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '271143' => {
      'BaseType' => '271009',
      'Header' => 'stdint-intn.h',
      'Line' => '25',
      'Name' => 'int16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '271155' => {
      'BaseType' => '271040',
      'Header' => 'stdint-intn.h',
      'Line' => '26',
      'Name' => 'int32_t',
      'PrivateABI' => 1,
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '271780' => {
      'BaseType' => '453',
      'Header' => 'pldm_types.h',
      'Line' => '168',
      'Name' => 'real32_t',
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '272583' => {
      'BaseType' => '271078',
      'Header' => 'uchar.h',
      'Line' => '51',
      'Name' => 'char16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '273500' => {
      'Header' => 'platform.h',
      'Line' => '345',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_SENSOR_OP_STATE',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_STATE_SENSOR_STATE',
          'value' => '1'
        },
        '2' => {
          'name' => 'PLDM_NUMERIC_SENSOR_STATE',
          'value' => '2'
        }
      },
      'Name' => 'enum sensor_event_class_states',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '273534' => {
      'BaseType' => '273500',
      'Name' => 'enum sensor_event_class_states const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '274030' => {
      'Header' => 'platform.h',
      'Line' => '668',
      'Memb' => {
        '0' => {
          'name' => 'state_set_id',
          'offset' => '0',
          'type' => '6483'
        },
        '1' => {
          'name' => 'possible_states_size',
          'offset' => '2',
          'type' => '140'
        },
        '2' => {
          'name' => 'states',
          'offset' => '3',
          'type' => '274092'
        }
      },
      'Name' => 'struct state_sensor_possible_states',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '274087' => {
      'BaseType' => '274030',
      'Name' => 'struct state_sensor_possible_states const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '274092' => {
      'BaseType' => '353',
      'Name' => 'bitfield8_t[1]',
      'Size' => '1',
      'Type' => 'Array'
    },
    '274465' => {
      'Header' => 'platform.h',
      'Line' => '769',
      'Memb' => {
        '0' => {
          'name' => 'value_u8',
          'offset' => '0',
          'type' => '140'
        },
        '1' => {
          'name' => 'value_s8',
          'offset' => '0',
          'type' => '271131'
        },
        '2' => {
          'name' => 'value_u16',
          'offset' => '0',
          'type' => '6483'
        },
        '3' => {
          'name' => 'value_s16',
          'offset' => '0',
          'type' => '271143'
        },
        '4' => {
          'name' => 'value_u32',
          'offset' => '0',
          'type' => '152'
        },
        '5' => {
          'name' => 'value_s32',
          'offset' => '0',
          'type' => '271155'
        },
        '6' => {
          'name' => 'value_f32',
          'offset' => '0',
          'type' => '271780'
        }
      },
      'Name' => 'union union_range_field_format',
      'Size' => '4',
      'Type' => 'Union'
    },
    '275064' => {
      'Header' => 'platform.h',
      'Line' => '826',
      'Memb' => {
        '0' => {
          'name' => 'value_u8',
          'offset' => '0',
          'type' => '140'
        },
        '1' => {
          'name' => 'value_s8',
          'offset' => '0',
          'type' => '271131'
        },
        '2' => {
          'name' => 'value_u16',
          'offset' => '0',
          'type' => '6483'
        },
        '3' => {
          'name' => 'value_s16',
          'offset' => '0',
          'type' => '271143'
        },
        '4' => {
          'name' => 'value_u32',
          'offset' => '0',
          'type' => '152'
        },
        '5' => {
          'name' => 'value_s32',
          'offset' => '0',
          'type' => '271155'
        }
      },
      'Name' => 'union union_sensor_data_size',
      'Size' => '4',
      'Type' => 'Union'
    },
    '275077' => {
      'Header' => 'platform.h',
      'Line' => '833',
      'Memb' => {
        '0' => {
          'name' => 'record_handle',
          'offset' => '0',
          'type' => '152'
        },
        '1' => {
          'name' => 'version',
          'offset' => '4',
          'type' => '140'
        },
        '2' => {
          'name' => 'type',
          'offset' => '5',
          'type' => '140'
        },
        '3' => {
          'name' => 'record_change_num',
          'offset' => '6',
          'type' => '6483'
        },
        '4' => {
          'name' => 'length',
          'offset' => '8',
          'type' => '6483'
        }
      },
      'Name' => 'struct pldm_value_pdr_hdr',
      'Size' => '12',
      'Type' => 'Struct'
    },
    '275162' => {
      'Header' => 'platform.h',
      'Line' => '851',
      'Memb' => {
        '0' => {
          'name' => 'entity_instance_num',
          'offset' => '0',
          'type' => '6483'
        },
        '1' => {
          'name' => 'entity_instance',
          'offset' => '0',
          'type' => '6483'
        }
      },
      'Name' => 'anon-union-platform.h-851',
      'Size' => '2',
      'Type' => 'Union'
    },
    '275197' => {
      'Header' => 'platform.h',
      'Line' => '846',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '275077'
        },
        '1' => {
          'name' => 'terminus_handle',
          'offset' => '18',
          'type' => '6483'
        },
        '2' => {
          'name' => 'sensor_id',
          'offset' => '20',
          'type' => '6483'
        },
        '3' => {
          'name' => 'entity_type',
          'offset' => '22',
          'type' => '6483'
        },
        '4' => {
          'name' => 'unnamed0',
          'offset' => '24',
          'type' => '275162'
        },
        '5' => {
          'name' => 'container_id',
          'offset' => '32',
          'type' => '6483'
        },
        '6' => {
          'name' => 'sensor_init',
          'offset' => '34',
          'type' => '140'
        },
        '7' => {
          'name' => 'sensor_auxiliary_names_pdr',
          'offset' => '35',
          'type' => '75881'
        },
        '8' => {
          'name' => 'base_unit',
          'offset' => '36',
          'type' => '140'
        },
        '9' => {
          'name' => 'unit_modifier',
          'offset' => '37',
          'type' => '271131'
        },
        '10' => {
          'name' => 'rate_unit',
          'offset' => '38',
          'type' => '140'
        },
        '11' => {
          'name' => 'base_oem_unit_handle',
          'offset' => '39',
          'type' => '140'
        },
        '12' => {
          'name' => 'aux_unit',
          'offset' => '40',
          'type' => '140'
        },
        '13' => {
          'name' => 'aux_unit_modifier',
          'offset' => '41',
          'type' => '271131'
        },
        '14' => {
          'name' => 'aux_rate_unit',
          'offset' => '48',
          'type' => '140'
        },
        '15' => {
          'name' => 'rel',
          'offset' => '49',
          'type' => '140'
        },
        '16' => {
          'name' => 'aux_oem_unit_handle',
          'offset' => '50',
          'type' => '140'
        },
        '17' => {
          'name' => 'is_linear',
          'offset' => '51',
          'type' => '75881'
        },
        '18' => {
          'name' => 'sensor_data_size',
          'offset' => '52',
          'type' => '140'
        },
        '19' => {
          'name' => 'resolution',
          'offset' => '54',
          'type' => '271780'
        },
        '20' => {
          'name' => 'offset',
          'offset' => '64',
          'type' => '271780'
        },
        '21' => {
          'name' => 'accuracy',
          'offset' => '68',
          'type' => '6483'
        },
        '22' => {
          'name' => 'plus_tolerance',
          'offset' => '70',
          'type' => '140'
        },
        '23' => {
          'name' => 'minus_tolerance',
          'offset' => '71',
          'type' => '140'
        },
        '24' => {
          'name' => 'hysteresis',
          'offset' => '72',
          'type' => '275064'
        },
        '25' => {
          'name' => 'supported_thresholds',
          'offset' => '82',
          'type' => '353'
        },
        '26' => {
          'name' => 'threshold_and_hysteresis_volatility',
          'offset' => '83',
          'type' => '353'
        },
        '27' => {
          'name' => 'state_transition_interval',
          'offset' => '86',
          'type' => '271780'
        },
        '28' => {
          'name' => 'update_interval',
          'offset' => '96',
          'type' => '271780'
        },
        '29' => {
          'name' => 'max_readable',
          'offset' => '100',
          'type' => '275064'
        },
        '30' => {
          'name' => 'min_readable',
          'offset' => '104',
          'type' => '275064'
        },
        '31' => {
          'name' => 'range_field_format',
          'offset' => '114',
          'type' => '140'
        },
        '32' => {
          'name' => 'range_field_support',
          'offset' => '115',
          'type' => '353'
        },
        '33' => {
          'name' => 'nominal_value',
          'offset' => '118',
          'type' => '274465'
        },
        '34' => {
          'name' => 'normal_max',
          'offset' => '128',
          'type' => '274465'
        },
        '35' => {
          'name' => 'normal_min',
          'offset' => '132',
          'type' => '274465'
        },
        '36' => {
          'name' => 'warning_high',
          'offset' => '136',
          'type' => '274465'
        },
        '37' => {
          'name' => 'warning_low',
          'offset' => '146',
          'type' => '274465'
        },
        '38' => {
          'name' => 'critical_high',
          'offset' => '150',
          'type' => '274465'
        },
        '39' => {
          'name' => 'critical_low',
          'offset' => '256',
          'type' => '274465'
        },
        '40' => {
          'name' => 'fatal_high',
          'offset' => '260',
          'type' => '274465'
        },
        '41' => {
          'name' => 'fatal_low',
          'offset' => '264',
          'type' => '274465'
        }
      },
      'Name' => 'struct pldm_numeric_sensor_value_pdr',
      'Size' => '112',
      'Type' => 'Struct'
    },
    '275790' => {
      'BaseType' => '272583',
      'Header' => 'platform.h',
      'Line' => '894',
      'Name' => 'pldm_utf16be',
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '275803' => {
      'Header' => 'platform.h',
      'Line' => '896',
      'Memb' => {
        '0' => {
          'name' => 'tag',
          'offset' => '0',
          'type' => '6459'
        },
        '1' => {
          'name' => 'name',
          'offset' => '8',
          'type' => '275845'
        }
      },
      'Name' => 'struct pldm_entity_auxiliary_name',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '275845' => {
      'BaseType' => '275790',
      'Name' => 'pldm_utf16be*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '275850' => {
      'Header' => 'platform.h',
      'Line' => '906',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '275077'
        },
        '1' => {
          'name' => 'container',
          'offset' => '18',
          'type' => '212974'
        },
        '2' => {
          'name' => 'shared_name_count',
          'offset' => '24',
          'type' => '140'
        },
        '3' => {
          'name' => 'name_string_count',
          'offset' => '25',
          'type' => '140'
        },
        '4' => {
          'name' => 'names',
          'offset' => '36',
          'type' => '275964'
        },
        '5' => {
          'name' => 'auxiliary_name_data_size',
          'offset' => '50',
          'type' => '169'
        },
        '6' => {
          'name' => 'auxiliary_name_data',
          'offset' => '64',
          'type' => '275969'
        }
      },
      'Name' => 'struct pldm_entity_auxiliary_names_pdr',
      'Size' => '40',
      'Type' => 'Struct'
    },
    '275964' => {
      'BaseType' => '275803',
      'Name' => 'struct pldm_entity_auxiliary_name*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '275969' => {
      'BaseType' => '51',
      'Name' => 'char[]',
      'Size' => '8',
      'Type' => 'Array'
    },
    '275984' => {
      'Header' => 'platform.h',
      'Line' => '936',
      'Memb' => {
        '0' => {
          'name' => 'state_set_id',
          'offset' => '0',
          'type' => '6483'
        },
        '1' => {
          'name' => 'possible_states_size',
          'offset' => '2',
          'type' => '140'
        },
        '2' => {
          'name' => 'states',
          'offset' => '3',
          'type' => '274092'
        }
      },
      'Name' => 'struct state_effecter_possible_states',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '276041' => {
      'BaseType' => '275984',
      'Name' => 'struct state_effecter_possible_states const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '276046' => {
      'Header' => 'platform.h',
      'Line' => '960',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '275077'
        },
        '1' => {
          'name' => 'terminus_handle',
          'offset' => '18',
          'type' => '6483'
        },
        '2' => {
          'name' => 'file_identifier',
          'offset' => '20',
          'type' => '6483'
        },
        '3' => {
          'name' => 'container',
          'offset' => '22',
          'type' => '212974'
        },
        '4' => {
          'name' => 'superior_directory_file_identifier',
          'offset' => '34',
          'type' => '6483'
        },
        '5' => {
          'name' => 'file_classification',
          'offset' => '36',
          'type' => '140'
        },
        '6' => {
          'name' => 'oem_file_classification',
          'offset' => '37',
          'type' => '140'
        },
        '7' => {
          'name' => 'file_capabilities',
          'offset' => '38',
          'type' => '59198'
        },
        '8' => {
          'name' => 'file_version',
          'offset' => '40',
          'type' => '436'
        },
        '9' => {
          'name' => 'file_maximum_size',
          'offset' => '50',
          'type' => '152'
        },
        '10' => {
          'name' => 'file_maximum_file_descriptor_count',
          'offset' => '54',
          'type' => '140'
        },
        '11' => {
          'name' => 'file_name',
          'offset' => '64',
          'type' => '8201'
        },
        '12' => {
          'name' => 'oem_file_classification_name',
          'offset' => '86',
          'type' => '8201'
        }
      },
      'Name' => 'struct pldm_platform_file_descriptor_pdr',
      'Size' => '72',
      'Type' => 'Struct'
    },
    '276247' => {
      'Header' => 'platform.h',
      'Line' => '1006',
      'Memb' => {
        '0' => {
          'name' => 'set_request',
          'offset' => '0',
          'type' => '140'
        },
        '1' => {
          'name' => 'effecter_state',
          'offset' => '1',
          'type' => '140'
        }
      },
      'Name' => 'struct state_field_for_state_effecter_set',
      'Size' => '2',
      'Type' => 'Struct'
    },
    '276290' => {
      'BaseType' => '276247',
      'Header' => 'platform.h',
      'Line' => '1009',
      'Name' => 'set_effecter_state_field',
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '276303' => {
      'Header' => 'platform.h',
      'Line' => '1015',
      'Memb' => {
        '0' => {
          'name' => 'sensor_op_state',
          'offset' => '0',
          'type' => '140'
        },
        '1' => {
          'name' => 'present_state',
          'offset' => '1',
          'type' => '140'
        },
        '2' => {
          'name' => 'previous_state',
          'offset' => '2',
          'type' => '140'
        },
        '3' => {
          'name' => 'event_state',
          'offset' => '3',
          'type' => '140'
        }
      },
      'Name' => 'struct state_field_for_get_state_sensor_readings',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '276374' => {
      'BaseType' => '276303',
      'Header' => 'platform.h',
      'Line' => '1023',
      'Name' => 'get_sensor_state_field',
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '276387' => {
      'Header' => 'platform.h',
      'Line' => '1029',
      'Memb' => {
        '0' => {
          'name' => 'effecter_op_state',
          'offset' => '0',
          'type' => '140'
        },
        '1' => {
          'name' => 'pending_state',
          'offset' => '1',
          'type' => '140'
        },
        '2' => {
          'name' => 'present_state',
          'offset' => '2',
          'type' => '140'
        }
      },
      'Name' => 'struct state_field_for_get_state_effecter_states',
      'Size' => '3',
      'Type' => 'Struct'
    },
    '276444' => {
      'BaseType' => '276387',
      'Header' => 'platform.h',
      'Line' => '1033',
      'Name' => 'get_effecter_state_field',
      'Size' => '3',
      'Type' => 'Typedef'
    },
    '276928' => {
      'Header' => 'platform.h',
      'Line' => '1106',
      'Memb' => {
        '0' => {
          'name' => 'mctp_eid',
          'offset' => '0',
          'type' => '140'
        },
        '1' => {
          'name' => 'vendor_specific',
          'offset' => '0',
          'type' => '8201'
        }
      },
      'Name' => 'anon-union-platform.h-1106',
      'Size' => '16',
      'Type' => 'Union'
    },
    '276962' => {
      'Header' => 'platform.h',
      'Line' => '1103',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '140'
        },
        '1' => {
          'name' => 'transport_protocol_type',
          'offset' => '1',
          'type' => '140'
        },
        '2' => {
          'name' => 'event_receiver_address',
          'offset' => '8',
          'type' => '276928'
        }
      },
      'Name' => 'struct pldm_get_event_receiver_resp',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '277264' => {
      'Header' => 'platform.h',
      'Line' => '1191',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '140'
        },
        '1' => {
          'name' => 'comp_effecter_count',
          'offset' => '1',
          'type' => '140'
        },
        '2' => {
          'name' => 'field',
          'offset' => '2',
          'type' => '277321'
        }
      },
      'Name' => 'struct pldm_get_state_effecter_states_resp',
      'Size' => '26',
      'Type' => 'Struct'
    },
    '277321' => {
      'BaseType' => '276444',
      'Name' => 'get_effecter_state_field[8]',
      'Size' => '24',
      'Type' => 'Array'
    },
    '277337' => {
      'Header' => 'platform.h',
      'Line' => '1201',
      'Memb' => {
        '0' => {
          'name' => 'sensor_id',
          'offset' => '0',
          'type' => '6483'
        },
        '1' => {
          'name' => 'sensor_event_class_type',
          'offset' => '2',
          'type' => '140'
        },
        '2' => {
          'name' => 'event_class',
          'offset' => '3',
          'type' => '1067'
        }
      },
      'Name' => 'struct pldm_sensor_event_data',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '277451' => {
      'Header' => 'platform.h',
      'Line' => '1241',
      'Memb' => {
        '0' => {
          'name' => 'format_version',
          'offset' => '0',
          'type' => '140'
        },
        '1' => {
          'name' => 'event_id',
          'offset' => '2',
          'type' => '6483'
        },
        '2' => {
          'name' => 'data_transfer_handle',
          'offset' => '4',
          'type' => '152'
        }
      },
      'Name' => 'struct pldm_message_poll_event',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '277513' => {
      'Header' => 'platform.h',
      'Line' => '1251',
      'Memb' => {
        '0' => {
          'name' => 'format_version',
          'offset' => '0',
          'type' => '140'
        },
        '1' => {
          'name' => 'format_type',
          'offset' => '1',
          'type' => '140'
        },
        '2' => {
          'name' => 'event_data_length',
          'offset' => '2',
          'type' => '6483'
        },
        '3' => {
          'name' => 'event_data',
          'offset' => '4',
          'type' => '277584'
        }
      },
      'Name' => 'struct pldm_platform_cper_event',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '277584' => {
      'BaseType' => '140',
      'Name' => 'uint8_t[]',
      'Size' => '8',
      'Type' => 'Array'
    },
    '277740' => {
      'Header' => 'platform.h',
      'Line' => '1311',
      'Memb' => {
        '0' => {
          'name' => 'event_data_format',
          'offset' => '0',
          'type' => '140'
        },
        '1' => {
          'name' => 'number_of_change_records',
          'offset' => '1',
          'type' => '140'
        },
        '2' => {
          'name' => 'change_records',
          'offset' => '2',
          'type' => '1067'
        }
      },
      'Name' => 'struct pldm_pdr_repository_chg_event_data',
      'Size' => '3',
      'Type' => 'Struct'
    },
    '286138' => {
      'BaseType' => '2770',
      'Name' => 'size_t*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '295142' => {
      'BaseType' => '276046',
      'Name' => 'struct pldm_platform_file_descriptor_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '295201' => {
      'BaseType' => '277513',
      'Name' => 'struct pldm_platform_cper_event*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '299621' => {
      'BaseType' => '275850',
      'Name' => 'struct pldm_entity_auxiliary_names_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '311527' => {
      'BaseType' => '277264',
      'Name' => 'struct pldm_get_state_effecter_states_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '358239' => {
      'BaseType' => '276962',
      'Name' => 'struct pldm_get_event_receiver_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '377600' => {
      'BaseType' => '277451',
      'Name' => 'struct pldm_message_poll_event*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '379285' => {
      'BaseType' => '379295',
      'Name' => 'uint32_t const*const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '379290' => {
      'BaseType' => '164',
      'Name' => 'uint32_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '379295' => {
      'BaseType' => '379290',
      'Name' => 'uint32_t const*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '379300' => {
      'BaseType' => '277740',
      'Name' => 'struct pldm_pdr_repository_chg_event_data*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '429716' => {
      'BaseType' => '275197',
      'Name' => 'struct pldm_numeric_sensor_value_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '457455' => {
      'BaseType' => '277337',
      'Name' => 'struct pldm_sensor_event_data*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '457460' => {
      'BaseType' => '457455',
      'Name' => 'struct pldm_sensor_event_data*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '462488' => {
      'BaseType' => '276374',
      'Name' => 'get_sensor_state_field*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '490472' => {
      'BaseType' => '276290',
      'Name' => 'set_effecter_state_field*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '491453' => {
      'BaseType' => '265758',
      'Name' => 'struct pldm_state_sensor_pdr*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '491458' => {
      'BaseType' => '274087',
      'Name' => 'struct state_sensor_possible_states const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '491463' => {
      'BaseType' => '491458',
      'Name' => 'struct state_sensor_possible_states const*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '491863' => {
      'BaseType' => '260067',
      'Name' => 'struct pldm_state_effecter_pdr*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '491868' => {
      'BaseType' => '276041',
      'Name' => 'struct state_effecter_possible_states const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '491873' => {
      'BaseType' => '491868',
      'Name' => 'struct state_effecter_possible_states const*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '496262' => {
      'Line' => '19',
      'Memb' => {
        '0' => {
          'name' => 'prev',
          'offset' => '0',
          'type' => '5664'
        },
        '1' => {
          'name' => 'allocations',
          'offset' => '4',
          'type' => '152'
        }
      },
      'Name' => 'struct pldm_tid_state',
      'PrivateABI' => 1,
      'Size' => '8',
      'Source' => 'instance-id.c',
      'Type' => 'Struct'
    },
    '496301' => {
      'Line' => '24',
      'Memb' => {
        '0' => {
          'name' => 'state',
          'offset' => '0',
          'type' => '496343'
        },
        '1' => {
          'name' => 'lock_db_fd',
          'offset' => '8264',
          'type' => '58'
        }
      },
      'Name' => 'struct pldm_instance_db',
      'PrivateABI' => 1,
      'Size' => '2052',
      'Source' => 'instance-id.c',
      'Type' => 'Struct'
    },
    '496343' => {
      'BaseType' => '496262',
      'Name' => 'struct pldm_tid_state[256]',
      'Size' => '2048',
      'Type' => 'Array'
    },
    '496899' => {
      'BaseType' => '496301',
      'Name' => 'struct pldm_instance_db*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '497286' => {
      'BaseType' => '5664',
      'Name' => 'pldm_instance_id_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '497462' => {
      'BaseType' => '496899',
      'Name' => 'struct pldm_instance_db**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '498175' => {
      'BaseType' => '65',
      'Header' => 'int-ll64.h',
      'Line' => '21',
      'Name' => '__u8',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '498187' => {
      'BaseType' => '72',
      'Header' => 'int-ll64.h',
      'Line' => '24',
      'Name' => '__u16',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '498424' => {
      'Header' => 'socket.h',
      'Line' => '5',
      'Memb' => {
        '0' => {
          'name' => 'size',
          'offset' => '0',
          'type' => '58'
        },
        '1' => {
          'name' => 'socket',
          'offset' => '4',
          'type' => '58'
        },
        '2' => {
          'name' => 'max_size',
          'offset' => '8',
          'type' => '58'
        }
      },
      'Name' => 'struct pldm_socket_sndbuf',
      'PrivateABI' => 1,
      'Size' => '12',
      'Type' => 'Struct'
    },
    '498477' => {
      'BaseType' => '140',
      'Header' => 'pldm.h',
      'Line' => '13',
      'Name' => 'mctp_eid_t',
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '498591' => {
      'BaseType' => '5761',
      'Header' => 'pldm.h',
      'Line' => '30',
      'Name' => 'pldm_requester_rc_t',
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '498603' => {
      'Header' => 'transport.h',
      'Line' => '18',
      'Memb' => {
        '0' => {
          'name' => 'name',
          'offset' => '0',
          'type' => '9578'
        },
        '1' => {
          'name' => 'version',
          'offset' => '8',
          'type' => '140'
        },
        '2' => {
          'name' => 'recv',
          'offset' => '22',
          'type' => '498737'
        },
        '3' => {
          'name' => 'send',
          'offset' => '36',
          'type' => '498778'
        },
        '4' => {
          'name' => 'init_pollfd',
          'offset' => '50',
          'type' => '498859'
        }
      },
      'Name' => 'struct pldm_transport',
      'PrivateABI' => 1,
      'Size' => '40',
      'Type' => 'Struct'
    },
    '498717' => {
      'BaseType' => '498603',
      'Name' => 'struct pldm_transport*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '498722' => {
      'BaseType' => '5652',
      'Name' => 'pldm_tid_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '498737' => {
      'Name' => 'pldm_requester_rc_t(*)(struct pldm_transport*, pldm_tid_t*, void**, size_t*)',
      'Param' => {
        '0' => {
          'type' => '498717'
        },
        '1' => {
          'type' => '498722'
        },
        '2' => {
          'type' => '194905'
        },
        '3' => {
          'type' => '2770'
        }
      },
      'Return' => '498591',
      'Size' => '8',
      'Type' => 'FuncPtr'
    },
    '498778' => {
      'Name' => 'pldm_requester_rc_t(*)(struct pldm_transport*, pldm_tid_t, void const*, size_t)',
      'Param' => {
        '0' => {
          'type' => '498717'
        },
        '1' => {
          'type' => '5652'
        },
        '2' => {
          'type' => '1330'
        },
        '3' => {
          'type' => '169'
        }
      },
      'Return' => '498591',
      'Size' => '8',
      'Type' => 'FuncPtr'
    },
    '498803' => {
      'BaseType' => '498808',
      'Name' => 'struct pollfd*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '498808' => {
      'Header' => 'poll.h',
      'Line' => '36',
      'Memb' => {
        '0' => {
          'name' => 'fd',
          'offset' => '0',
          'type' => '58'
        },
        '1' => {
          'name' => 'events',
          'offset' => '4',
          'type' => '112'
        },
        '2' => {
          'name' => 'revents',
          'offset' => '6',
          'type' => '112'
        }
      },
      'Name' => 'struct pollfd',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Struct'
    },
    '498859' => {
      'Name' => 'int(*)(struct pldm_transport*, struct pollfd*)',
      'Param' => {
        '0' => {
          'type' => '498717'
        },
        '1' => {
          'type' => '498803'
        }
      },
      'Return' => '58',
      'Size' => '8',
      'Type' => 'FuncPtr'
    },
    '498864' => {
      'BaseType' => '72',
      'Header' => 'socket.h',
      'Line' => '10',
      'Name' => '__kernel_sa_family_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '499239' => {
      'Header' => 'mctp.h',
      'Line' => '18',
      'Memb' => {
        '0' => {
          'name' => 's_addr',
          'offset' => '0',
          'type' => '498477'
        }
      },
      'Name' => 'struct mctp_addr',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Struct'
    },
    '499266' => {
      'Header' => 'mctp.h',
      'Line' => '22',
      'Memb' => {
        '0' => {
          'name' => 'smctp_family',
          'offset' => '0',
          'type' => '498864'
        },
        '1' => {
          'name' => '__smctp_pad0',
          'offset' => '2',
          'type' => '498187'
        },
        '2' => {
          'name' => 'smctp_network',
          'offset' => '4',
          'type' => '79'
        },
        '3' => {
          'name' => 'smctp_addr',
          'offset' => '8',
          'type' => '499239'
        },
        '4' => {
          'name' => 'smctp_type',
          'offset' => '9',
          'type' => '498175'
        },
        '5' => {
          'name' => 'smctp_tag',
          'offset' => '16',
          'type' => '498175'
        },
        '6' => {
          'name' => '__smctp_pad1',
          'offset' => '17',
          'type' => '498175'
        }
      },
      'Name' => 'struct sockaddr_mctp',
      'PrivateABI' => 1,
      'Size' => '12',
      'Type' => 'Struct'
    },
    '499371' => {
      'BaseType' => '499266',
      'Name' => 'struct sockaddr_mctp const',
      'Size' => '12',
      'Type' => 'Const'
    },
    '499415' => {
      'Line' => '35',
      'Memb' => {
        '0' => {
          'name' => 'transport',
          'offset' => '0',
          'type' => '498603'
        },
        '1' => {
          'name' => 'socket',
          'offset' => '64',
          'type' => '58'
        },
        '2' => {
          'name' => 'tid_eid_map',
          'offset' => '68',
          'type' => '499508'
        },
        '3' => {
          'name' => 'socket_send_buf',
          'offset' => '768',
          'type' => '498424'
        },
        '4' => {
          'name' => 'bound',
          'offset' => '786',
          'type' => '6282'
        },
        '5' => {
          'name' => 'cookie_jar',
          'offset' => '800',
          'type' => '5676'
        }
      },
      'Name' => 'struct pldm_transport_af_mctp',
      'PrivateABI' => 1,
      'Size' => '336',
      'Source' => 'af-mctp.c',
      'Type' => 'Struct'
    },
    '499508' => {
      'BaseType' => '5652',
      'Name' => 'pldm_tid_t[256]',
      'Size' => '256',
      'Type' => 'Array'
    },
    '500309' => {
      'BaseType' => '499415',
      'Name' => 'struct pldm_transport_af_mctp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '500314' => {
      'BaseType' => '499371',
      'Name' => 'struct sockaddr_mctp const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '500627' => {
      'BaseType' => '500309',
      'Name' => 'struct pldm_transport_af_mctp**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '503751' => {
      'Line' => '26',
      'Memb' => {
        '0' => {
          'name' => 'transport',
          'offset' => '0',
          'type' => '498603'
        },
        '1' => {
          'name' => 'socket',
          'offset' => '64',
          'type' => '58'
        },
        '2' => {
          'name' => 'tid_eid_map',
          'offset' => '68',
          'type' => '499508'
        },
        '3' => {
          'name' => 'socket_send_buf',
          'offset' => '768',
          'type' => '498424'
        }
      },
      'Name' => 'struct pldm_transport_mctp_demux',
      'PrivateABI' => 1,
      'Size' => '312',
      'Source' => 'mctp-demux.c',
      'Type' => 'Struct'
    },
    '504356' => {
      'BaseType' => '503751',
      'Name' => 'struct pldm_transport_mctp_demux*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '504862' => {
      'BaseType' => '504356',
      'Name' => 'struct pldm_transport_mctp_demux**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '527703' => {
      'Header' => 'file_io.h',
      'Line' => '32',
      'Memb' => {
        '0' => {
          'name' => 'handle',
          'offset' => '0',
          'type' => '140'
        },
        '1' => {
          'name' => 'length',
          'offset' => '4',
          'type' => '152'
        },
        '2' => {
          'name' => 'data',
          'offset' => '8',
          'type' => '277584'
        }
      },
      'Name' => 'struct pldm_oem_meta_file_io_write_req',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '527770' => {
      'Header' => 'file_io.h',
      'Line' => '45',
      'Memb' => {
        '0' => {
          'name' => 'transferFlag',
          'offset' => '0',
          'type' => '140'
        },
        '1' => {
          'name' => 'offset',
          'offset' => '2',
          'type' => '6483'
        }
      },
      'Name' => 'struct pldm_oem_meta_file_io_read_data_info',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '527809' => {
      'Header' => 'file_io.h',
      'Line' => '55',
      'Memb' => {
        '0' => {
          'name' => 'size',
          'offset' => '0',
          'type' => '6483'
        },
        '1' => {
          'name' => 'crc32',
          'offset' => '4',
          'type' => '152'
        }
      },
      'Name' => 'struct pldm_oem_meta_file_io_read_attr_info',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '527848' => {
      'Header' => 'file_io.h',
      'Line' => '70',
      'Memb' => {
        '0' => {
          'name' => 'data',
          'offset' => '0',
          'type' => '527770'
        }
      },
      'Name' => 'anon-union-file_io.h-70',
      'Size' => '4',
      'Type' => 'Union'
    },
    '527866' => {
      'Header' => 'file_io.h',
      'Line' => '65',
      'Memb' => {
        '0' => {
          'name' => 'version',
          'offset' => '0',
          'type' => '169'
        },
        '1' => {
          'name' => 'handle',
          'offset' => '8',
          'type' => '140'
        },
        '2' => {
          'name' => 'option',
          'offset' => '9',
          'type' => '140'
        },
        '3' => {
          'name' => 'length',
          'offset' => '16',
          'type' => '140'
        },
        '4' => {
          'name' => 'info',
          'offset' => '18',
          'type' => '527848'
        }
      },
      'Name' => 'struct pldm_oem_meta_file_io_read_req',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '527944' => {
      'Header' => 'file_io.h',
      'Line' => '86',
      'Memb' => {
        '0' => {
          'name' => 'attr',
          'offset' => '0',
          'type' => '527809'
        },
        '1' => {
          'name' => 'data',
          'offset' => '0',
          'type' => '527770'
        }
      },
      'Name' => 'anon-union-file_io.h-86',
      'Size' => '8',
      'Type' => 'Union'
    },
    '527972' => {
      'Header' => 'file_io.h',
      'Line' => '80',
      'Memb' => {
        '0' => {
          'name' => 'version',
          'offset' => '0',
          'type' => '169'
        },
        '1' => {
          'name' => 'completion_code',
          'offset' => '8',
          'type' => '140'
        },
        '2' => {
          'name' => 'handle',
          'offset' => '9',
          'type' => '140'
        },
        '3' => {
          'name' => 'option',
          'offset' => '16',
          'type' => '140'
        },
        '4' => {
          'name' => 'length',
          'offset' => '17',
          'type' => '140'
        },
        '5' => {
          'name' => 'info',
          'offset' => '18',
          'type' => '527944'
        },
        '6' => {
          'name' => 'data',
          'offset' => '32',
          'type' => '277584'
        }
      },
      'Name' => 'struct pldm_oem_meta_file_io_read_resp',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '532804' => {
      'BaseType' => '527972',
      'Name' => 'struct pldm_oem_meta_file_io_read_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '535689' => {
      'BaseType' => '527866',
      'Name' => 'struct pldm_oem_meta_file_io_read_req*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '536128' => {
      'BaseType' => '527703',
      'Name' => 'struct pldm_oem_meta_file_io_write_req*',
      'Size' => '8',
      'Type' => 'Pointer'
    }
  },
  'UndefinedSymbols' => {
    'libpldm.so.0.14.0' => {
      '_ITM_deregisterTMCloneTable' => 0,
      '_ITM_registerTMCloneTable' => 0,
      '__assert_fail@GLIBC_2.2.5' => 0,
      '__cxa_finalize@GLIBC_2.2.5' => 0,
      '__errno_location@GLIBC_2.2.5' => 0,
      '__gmon_start__' => 0,
      '__isoc23_strtol@GLIBC_2.38' => 0,
      '__memcpy_chk@GLIBC_2.3.4' => 0,
      '__recv_chk@GLIBC_2.4' => 0,
      '__recvfrom_chk@GLIBC_2.4' => 0,
      '__stack_chk_fail@GLIBC_2.4' => 0,
      'bind@GLIBC_2.2.5' => 0,
      'calloc@GLIBC_2.2.5' => 0,
      'clock_gettime@GLIBC_2.17' => 0,
      'close@GLIBC_2.2.5' => 0,
      'connect@GLIBC_2.2.5' => 0,
      'dup@GLIBC_2.2.5' => 0,
      'fclose@GLIBC_2.2.5' => 0,
      'fcntl64@GLIBC_2.28' => 0,
      'fgets@GLIBC_2.2.5' => 0,
      'fopen64@GLIBC_2.2.5' => 0,
      'free@GLIBC_2.2.5' => 0,
      'getsockopt@GLIBC_2.2.5' => 0,
      'malloc@GLIBC_2.2.5' => 0,
      'memcmp@GLIBC_2.2.5' => 0,
      'memcpy@GLIBC_2.14' => 0,
      'memmem@GLIBC_2.2.5' => 0,
      'open64@GLIBC_2.2.5' => 0,
      'poll@GLIBC_2.2.5' => 0,
      'ppoll@GLIBC_2.4' => 0,
      'recv@GLIBC_2.2.5' => 0,
      'recvmsg@GLIBC_2.2.5' => 0,
      'sendmsg@GLIBC_2.2.5' => 0,
      'sendto@GLIBC_2.2.5' => 0,
      'setsockopt@GLIBC_2.2.5' => 0,
      'socket@GLIBC_2.2.5' => 0,
      'stat64@GLIBC_2.33' => 0,
      'strlen@GLIBC_2.2.5' => 0,
      'strnlen@GLIBC_2.2.5' => 0,
      'timerfd_create@GLIBC_2.8' => 0,
      'timerfd_settime@GLIBC_2.8' => 0,
      'write@GLIBC_2.2.5' => 0
    }
  },
  'WordSize' => '8'
};
