$VAR1 = {
  'ABI_DUMPER_VERSION' => '1.2',
  'ABI_DUMP_VERSION' => '3.5',
  'Arch' => 'x86_64',
  'GccVersion' => '14.2.0',
  'Headers' => {
    'af-mctp.h' => 1,
    'base.h' => 1,
    'bios.h' => 1,
    'bios_table.h' => 1,
    'file_io.h' => 1,
    'firmware_update.h' => 1,
    'fru.h' => 1,
    'host.h' => 1,
    'instance-id.h' => 1,
    'mctp-demux.h' => 1,
    'pdr.h' => 1,
    'platform.h' => 1,
    'pldm.h' => 1,
    'pldm_types.h' => 1,
    'transport.h' => 1,
    'utils.h' => 1
  },
  'Language' => 'C',
  'LibraryName' => 'libpldm.so.0.12.0',
  'LibraryVersion' => '0.12.0',
  'NameSpaces' => {},
  'Needed' => {
    'libc.so.6' => 1
  },
  'PublicABI' => '1',
  'Sources' => {
    'af-mctp.c' => 1,
    'bios_table.c' => 1,
    'instance-id.c' => 1,
    'mctp-demux.c' => 1,
    'pdr.c' => 1
  },
  'SymbolInfo' => {
    '1370' => {
      'Header' => 'base.h',
      'Line' => '730',
      'Param' => {
        '0' => {
          'name' => 'instance_id',
          'type' => '135'
        },
        '1' => {
          'name' => 'type',
          'type' => '135'
        },
        '2' => {
          'name' => 'command',
          'type' => '135'
        },
        '3' => {
          'name' => 'cc',
          'type' => '135'
        },
        '4' => {
          'name' => 'msg',
          'type' => '1412'
        }
      },
      'Return' => '53',
      'ShortName' => 'encode_cc_only_resp'
    },
    '1417' => {
      'Header' => 'base.h',
      'Line' => '584',

      'pldm_entity_association_pdr_add' => 1,
      'pldm_entity_association_pdr_add_from_node' => 1,
      'pldm_entity_association_pdr_add_from_node_with_record_handle' => 1,
      'pldm_entity_association_pdr_extract' => 1,
      'pldm_entity_association_tree_add' => 1,
      'pldm_entity_association_tree_add_entity' => 1,
      'pldm_entity_association_tree_copy_root' => 1,
      'pldm_entity_association_tree_destroy' => 1,
      'pldm_entity_association_tree_destroy_root' => 1,
      'pldm_entity_association_tree_find' => 1,
      'pldm_entity_association_tree_find_with_locality' => 1,
      'pldm_entity_association_tree_init' => 1,
      'pldm_entity_association_tree_visit' => 1,
      'pldm_entity_extract' => 1,
      'pldm_entity_get_num_children' => 1,
      'pldm_entity_get_parent' => 1,
      'pldm_entity_is_exist_parent' => 1,
      'pldm_entity_is_node_parent' => 1,
      'pldm_entity_node_get_remote_container_id' => 1,
      'pldm_find_entity_ref_in_tree' => 1,
      'pldm_firmware_device_id_record_iter_init' => 1,
      'pldm_instance_db_destroy' => 1,
      'pldm_instance_db_init' => 1,
      'pldm_instance_db_init_default' => 1,
      'pldm_instance_id_alloc' => 1,
      'pldm_instance_id_free' => 1,
      'pldm_is_current_parent_child' => 1,
      'pldm_is_empty_entity_assoc_tree' => 1,
      'pldm_msg_hdr_correlate_response' => 1,
      'pldm_oem_meta_file_io_read_resp_data' => 1,
      'pldm_oem_meta_file_io_write_req_data' => 1,
      'pldm_pdr_add' => 1,
      'pldm_pdr_add_fru_record_set' => 1,
      'pldm_pdr_delete_by_record_handle' => 1,
      'pldm_pdr_destroy' => 1,
      'pldm_pdr_find_last_in_range' => 1,
      'pldm_pdr_find_record' => 1,
      'pldm_pdr_find_record_by_type' => 1,
      'pldm_pdr_fru_record_set_find_by_rsi' => 1,
      'pldm_pdr_get_next_record' => 1,
      'pldm_pdr_get_record_count' => 1,
      'pldm_pdr_get_record_handle' => 1,
      'pldm_pdr_get_repo_size' => 1,
      'pldm_pdr_init' => 1,
      'pldm_pdr_record_is_remote' => 1,
      'pldm_pdr_remove_pdrs_by_terminus_handle' => 1,
      'pldm_pdr_remove_remote_pdrs' => 1,
      'pldm_pdr_update_TL_pdr' => 1,
      'pldm_platform_cper_event_event_data' => 1,
      'pldm_transport_af_mctp_bind' => 1,
      'pldm_transport_af_mctp_core' => 1,
      'pldm_transport_af_mctp_destroy' => 1,
      'pldm_transport_af_mctp_init' => 1,
      'pldm_transport_af_mctp_init_pollfd' => 1,
      'pldm_transport_af_mctp_map_tid' => 1,
      'pldm_transport_af_mctp_unmap_tid' => 1,
      'pldm_transport_mctp_demux_core' => 1,
      'pldm_transport_mctp_demux_destroy' => 1,
      'pldm_transport_mctp_demux_init' => 1,
      'pldm_transport_mctp_demux_init_pollfd' => 1,
      'pldm_transport_mctp_demux_map_tid' => 1,
      'pldm_transport_mctp_demux_unmap_tid' => 1,
      'pldm_transport_poll' => 1,
      'pldm_transport_recv_msg' => 1,
      'pldm_transport_send_msg' => 1,
      'pldm_transport_send_recv_msg' => 1,
      'unpack_pldm_header' => 1,
      'ver2str' => 1
    }
  },
  'Target' => 'unix',
  'TypeInfo' => {
    '1' => {
      'Name' => 'void',
      'Type' => 'Intrinsic'
    },
    '46' => {
      'Name' => 'char',
      'Size' => '1',
      'Type' => 'Intrinsic'
    },
    '53' => {
      'Name' => 'int',
      'Size' => '4',
      'Type' => 'Intrinsic'
    },
    '60' => {
      'Name' => 'unsigned char',
      'Size' => '1',
      'Type' => 'Intrinsic'
    },
    '67' => {
      'Name' => 'unsigned short',
      'Size' => '2',
      'Type' => 'Intrinsic'
    },
    '74' => {
      'Name' => 'unsigned int',
      'Size' => '4',
      'Type' => 'Intrinsic'
    },
    '81' => {
      'Name' => 'unsigned long',
      'Size' => '8',
      'Type' => 'Intrinsic'
    },
    '88' => {
      'Name' => 'signed char',
      'Size' => '1',
      'Type' => 'Intrinsic'
    },
    '95' => {
      'BaseType' => '60',
      'Header' => 'types.h',
      'Line' => '38',
      'Name' => '__uint8_t',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '107' => {
      'Name' => 'short',
      'Size' => '2',
      'Type' => 'Intrinsic'
    },
    '114' => {
      'BaseType' => '74',
      'Header' => 'types.h',
      'Line' => '42',
      'Name' => '__uint32_t',
      'PrivateABI' => 1,
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '126' => {
      'Name' => 'long',
      'Size' => '8',
      'Type' => 'Intrinsic'
    },
    '133' => {
      'BaseType' => '1',
      'Name' => 'void*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '135' => {
      'BaseType' => '95',
      'Header' => 'stdint-uintn.h',
      'Line' => '24',
      'Name' => 'uint8_t',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '147' => {
      'BaseType' => '114',
      'Header' => 'stdint-uintn.h',
      'Line' => '26',
      'Name' => 'uint32_t',
      'PrivateABI' => 1,
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '159' => {
      'BaseType' => '147',
      'Name' => 'uint32_t const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '164' => {
      'BaseType' => '81',
      'Header' => 'stddef.h',
      'Line' => '214',
      'Name' => 'size_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '190' => {
      'Header' => 'pldm_types.h',
      'Line' => '9',
      'Name' => 'anon-struct-pldm_types.h-9',
      'Size' => '1',
      'Type' => 'Struct'
    },
    '344' => {
      'Header' => 'pldm_types.h',
      'Line' => '19',
      'Memb' => {
        '0' => {
          'name' => 'byte',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'bits',
          'offset' => '0',
          'type' => '190'
        }
      },
      'Name' => 'union bitfield8_t',
      'Size' => '1',
      'Type' => 'Union'
    },
    '356' => {
      'BaseType' => '344',
      'Name' => 'bitfield8_t const',
      'Size' => '1',
      'Type' => 'Const'
    },
    '361' => {
      'Header' => 'pldm_types.h',
      'Line' => '25',
      'Memb' => {
        '0' => {
          'name' => 'alpha',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'update',
          'offset' => '1',
          'type' => '135'
        },
        '2' => {
          'name' => 'minor',
          'offset' => '2',
          'type' => '135'
        },
        '3' => {
          'name' => 'major',
          'offset' => '3',
          'type' => '135'
        }
      },
      'Name' => 'struct pldm_version',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '427' => {
      'BaseType' => '361',
      'Header' => 'pldm_types.h',
      'Line' => '30',
      'Name' => 'ver32_t',
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '439' => {
      'BaseType' => '427',
      'Name' => 'ver32_t const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '444' => {
      'Name' => 'float',
      'Size' => '4',
      'Type' => 'Intrinsic'
    },
    '795' => {
      'Header' => 'base.h',
      'Line' => '108',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_RESPONSE',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_REQUEST',
          'value' => '1'
        },
        '2' => {
          'name' => 'PLDM_RESERVED',
          'value' => '2'
        },
        '3' => {
          'name' => 'PLDM_ASYNC_REQUEST_NOTIFY',
          'value' => '3'
        }
      },
      'Name' => 'enum MessageType',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '807' => {
      'Header' => 'base.h',
      'Line' => '161',
      'Memb' => {
        '0' => {
          'name' => 'command',
          'offset' => '2',
          'type' => '135'
        }
      },
      'Name' => 'struct pldm_msg_hdr',
      'Size' => '3',
      'Type' => 'Struct'
    },
    '918' => {
      'BaseType' => '807',
      'Name' => 'struct pldm_msg_hdr const',
      'Size' => '3',
      'Type' => 'Const'
    },
    '923' => {
      'Header' => 'base.h',
      'Line' => '194',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '807'
        },
        '1' => {
          'name' => 'payload',
          'offset' => '3',
          'type' => '968'
        }
      },
      'Name' => 'struct pldm_msg',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '963' => {
      'BaseType' => '923',
      'Name' => 'struct pldm_msg const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '968' => {
      'BaseType' => '135',
      'Name' => 'uint8_t[1]',
      'Size' => '1',
      'Type' => 'Array'
    },
    '984' => {
      'Header' => 'base.h',
      'Line' => '261',
      'Memb' => {
        '0' => {
          'name' => 'msg_type',
          'offset' => '0',
          'type' => '795'
        },
        '1' => {
          'name' => 'instance',
          'offset' => '4',
          'type' => '135'
        },
        '2' => {
          'name' => 'pldm_type',
          'offset' => '5',
          'type' => '135'
        },
        '3' => {
          'name' => 'command',
          'offset' => '6',
          'type' => '135'
        },
        '4' => {
          'name' => 'completion_code',
          'offset' => '7',
          'type' => '135'
        }
      },
      'Name' => 'struct pldm_header_info',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '1064' => {
      'BaseType' => '984',
      'Name' => 'struct pldm_header_info const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '1231' => {
      'BaseType' => '1236',
      'Name' => 'void const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '1236' => {
      'BaseType' => '1',
      'Name' => 'void const',
      'Type' => 'Const'
    },
    '1237' => {
      'BaseType' => '356',
      'Name' => 'bitfield8_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '1412' => {
      'BaseType' => '923',
      'Name' => 'struct pldm_msg*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '1491' => {
      'BaseType' => '963',
      'Name' => 'struct pldm_msg const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '1496' => {
      'BaseType' => '135',
      'Name' => 'uint8_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '1501' => {
      'BaseType' => '427',
      'Name' => 'ver32_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '1595' => {
      'BaseType' => '439',
      'Name' => 'ver32_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '1642' => {
      'BaseType' => '147',
      'Name' => 'uint32_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '1711' => {
      'BaseType' => '918',
      'Name' => 'struct pldm_msg_hdr const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '1716' => {
      'BaseType' => '984',
      'Name' => 'struct pldm_header_info*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2671' => {
      'BaseType' => '164',
      'Name' => 'size_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '3131' => {
      'BaseType' => '1064',
      'Name' => 'struct pldm_header_info const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '4803' => {
      'BaseType' => '135',
      'Header' => 'base.h',
      'Line' => '19',
      'Name' => 'pldm_tid_t',
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '4815' => {
      'BaseType' => '135',
      'Header' => 'instance-id.h',
      'Line' => '13',
      'Name' => 'pldm_instance_id_t',
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '4827' => {
      'Header' => 'responder.h',
      'Line' => '10',
      'Memb' => {
        '0' => {
          'name' => 'tid',
          'offset' => '0',
          'type' => '4803'
        },
        '1' => {
          'name' => 'instance_id',
          'offset' => '1',
          'type' => '4815'
        },
        '2' => {
          'name' => 'type',
          'offset' => '2',
          'type' => '135'
        },
        '3' => {
          'name' => 'command',
          'offset' => '3',
          'type' => '135'
        },
        '4' => {
          'name' => 'next',
          'offset' => '8',
          'type' => '4907'
        }
      },
      'Name' => 'struct pldm_responder_cookie',
      'PrivateABI' => 1,
      'Size' => '16',
      'Type' => 'Struct'
    },
    '4907' => {
      'BaseType' => '4827',
      'Name' => 'struct pldm_responder_cookie*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '4912' => {
      'Header' => 'pldm.h',
      'Line' => '15',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_REQUESTER_SUCCESS',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_REQUESTER_OPEN_FAIL',
          'value' => '18446744073709551615 (-1)'
        },
        '2' => {
          'name' => 'PLDM_REQUESTER_NOT_PLDM_MSG',
          'value' => '18446744073709551614 (-2)'
        },
        '3' => {
          'name' => 'PLDM_REQUESTER_NOT_RESP_MSG',
          'value' => '18446744073709551613 (-3)'
        },
        '4' => {
          'name' => 'PLDM_REQUESTER_NOT_REQ_MSG',
          'value' => '18446744073709551612 (-4)'
        },
        '5' => {
          'name' => 'PLDM_REQUESTER_RESP_MSG_TOO_SMALL',
          'value' => '18446744073709551611 (-5)'
        },
        '6' => {
          'name' => 'PLDM_REQUESTER_INSTANCE_ID_MISMATCH',
          'value' => '18446744073709551610 (-6)'
        },
        '7' => {
          'name' => 'PLDM_REQUESTER_SEND_FAIL',
          'value' => '18446744073709551609 (-7)'
        },
        '8' => {
          'name' => 'PLDM_REQUESTER_RECV_FAIL',
          'value' => '18446744073709551608 (-8)'
        },
        '9' => {
          'name' => 'PLDM_REQUESTER_INVALID_RECV_LEN',
          'value' => '18446744073709551607 (-9)'
        },
        '10' => {
          'name' => 'PLDM_REQUESTER_SETUP_FAIL',
          'value' => '18446744073709551606 (-10)'
        },
        '11' => {
          'name' => 'PLDM_REQUESTER_INVALID_SETUP',
          'value' => '18446744073709551605 (-11)'
        },
        '12' => {
          'name' => 'PLDM_REQUESTER_POLL_FAIL',
          'value' => '18446744073709551604 (-12)'
        },
        '13' => {
          'name' => 'PLDM_REQUESTER_TRANSPORT_BUSY',
          'value' => '18446744073709551603 (-13)'
        }
      },
      'Name' => 'enum pldm_requester_error_codes',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '5433' => {
      'Name' => '_Bool',
      'Size' => '1',
      'Type' => 'Intrinsic'
    },
    '5555' => {
      'BaseType' => '67',
      'Header' => 'types.h',
      'Line' => '40',
      'Name' => '__uint16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '5593' => {
      'BaseType' => '126',
      'Header' => 'types.h',
      'Line' => '194',
      'Name' => '__ssize_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '5605' => {
      'BaseType' => '46',
      'Name' => 'char*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '5629' => {
      'BaseType' => '135',
      'Name' => 'uint8_t const',
      'Size' => '1',
      'Type' => 'Const'
    },
    '5634' => {
      'BaseType' => '5555',
      'Header' => 'stdint-uintn.h',
      'Line' => '25',
      'Name' => 'uint16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '5766' => {
      'BaseType' => '5593',
      'Header' => 'types.h',
      'Line' => '108',
      'Name' => 'ssize_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '5785' => {
      'BaseType' => '5629',
      'Name' => 'uint8_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '7300' => {
      'BaseType' => '46',
      'Name' => 'char const',
      'Size' => '1',
      'Type' => 'Const'
    },
    '7334' => {
      'BaseType' => '5634',
      'Name' => 'uint16_t const',
      'Size' => '2',
      'Type' => 'Const'
    },
    '7674' => {
      'Header' => 'utils.h',
      'Line' => '20',
      'Memb' => {
        '0' => {
          'name' => 'ptr',
          'offset' => '0',
          'type' => '5785'
        },
        '1' => {
          'name' => 'length',
          'offset' => '8',
          'type' => '164'
        }
      },
      'Name' => 'struct variable_field',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '8959' => {
      'BaseType' => '7300',
      'Name' => 'char const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '19243' => {
      'BaseType' => '344',
      'Name' => 'bitfield8_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '21012' => {
      'BaseType' => '807',
      'Name' => 'struct pldm_msg_hdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '21335' => {
      'BaseType' => '133',
      'Name' => 'void**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '24662' => {
      'BaseType' => '7674',
      'Name' => 'struct variable_field*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '26744' => {
      'BaseType' => '5634',
      'Name' => 'uint16_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '29983' => {
      'BaseType' => '81',
      'Header' => 'types.h',
      'Line' => '45',
      'Name' => '__uint64_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '30077' => {
      'BaseType' => '29983',
      'Header' => 'stdint-uintn.h',
      'Line' => '27',
      'Name' => 'uint64_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '30291' => {
      'Header' => 'bios.h',
      'Line' => '39',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_BIOS_STRING_TABLE',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_BIOS_ATTR_TABLE',
          'value' => '1'
        },
        '2' => {
          'name' => 'PLDM_BIOS_ATTR_VAL_TABLE',
          'value' => '2'
        }
      },
      'Name' => 'enum pldm_bios_table_types',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '30325' => {
      'Header' => 'bios.h',
      'Line' => '48',
      'Memb' => {
        '0' => {
          'name' => 'string_handle',
          'offset' => '0',
          'type' => '5634'
        },
        '1' => {
          'name' => 'string_length',
          'offset' => '2',
          'type' => '5634'
        },
        '2' => {
          'name' => 'name',
          'offset' => '4',
          'type' => '30382'
        }
      },
      'Name' => 'struct pldm_bios_string_table_entry',
      'Size' => '5',
      'Type' => 'Struct'
    },
    '30377' => {
      'BaseType' => '30325',
      'Name' => 'struct pldm_bios_string_table_entry const',
      'Size' => '5',
      'Type' => 'Const'
    },
    '30382' => {
      'BaseType' => '46',
      'Name' => 'char[1]',
      'Size' => '1',
      'Type' => 'Array'
    },
    '30398' => {
      'Header' => 'bios.h',
      'Line' => '54',
      'Memb' => {
        '0' => {
          'name' => 'attr_handle',
          'offset' => '0',
          'type' => '5634'
        },
        '1' => {
          'name' => 'attr_type',
          'offset' => '2',
          'type' => '135'
        },
        '2' => {
          'name' => 'string_handle',
          'offset' => '3',
          'type' => '5634'
        },
        '3' => {
          'name' => 'metadata',
          'offset' => '5',
          'type' => '968'
        }
      },
      'Name' => 'struct pldm_bios_attr_table_entry',
      'Size' => '6',
      'Type' => 'Struct'
    },
    '30463' => {
      'BaseType' => '30398',
      'Name' => 'struct pldm_bios_attr_table_entry const',
      'Size' => '6',
      'Type' => 'Const'
    },
    '30468' => {
      'Header' => 'bios.h',
      'Line' => '66',
      'Memb' => {
        '0' => {
          'name' => 'attr_handle',
          'offset' => '0',
          'type' => '5634'
        },
        '1' => {
          'name' => 'attr_type',
          'offset' => '2',
          'type' => '135'
        },
        '2' => {
          'name' => 'value',
          'offset' => '3',
          'type' => '968'
        }
      },
      'Name' => 'struct pldm_bios_attr_val_table_entry',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '30520' => {
      'BaseType' => '30468',
      'Name' => 'struct pldm_bios_attr_val_table_entry const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '30589' => {
      'Header' => 'bios_table.h',
      'Line' => '206',
      'Memb' => {
        '0' => {
          'name' => 'name_handle',
          'offset' => '0',
          'type' => '5634'
        },
        '1' => {
          'name' => 'read_only',
          'offset' => '2',
          'type' => '5433'
        },
        '2' => {
          'name' => 'pv_num',
          'offset' => '3',
          'type' => '135'
        },
        '3' => {
          'name' => 'pv_handle',
          'offset' => '8',
          'type' => '30692'
        },
        '4' => {
          'name' => 'def_num',
          'offset' => '22',
          'type' => '135'
        },
        '5' => {
          'name' => 'def_index',
          'offset' => '36',
          'type' => '5785'
        }
      },
      'Name' => 'struct pldm_bios_table_attr_entry_enum_info',
      'Size' => '32',
      'Type' => 'Struct'
    },
    '30680' => {
      'BaseType' => '30589',
      'Name' => 'struct pldm_bios_table_attr_entry_enum_info const',
      'Size' => '32',
      'Type' => 'Const'
    },
    '30692' => {
      'BaseType' => '7334',
      'Name' => 'uint16_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '30697' => {
      'Header' => 'bios_table.h',
      'Line' => '294',
      'Memb' => {
        '0' => {
          'name' => 'name_handle',
          'offset' => '0',
          'type' => '5634'
        },
        '1' => {
          'name' => 'read_only',
          'offset' => '2',
          'type' => '5433'
        },
        '2' => {
          'name' => 'string_type',
          'offset' => '3',
          'type' => '135'
        },
        '3' => {
          'name' => 'min_length',
          'offset' => '4',
          'type' => '5634'
        },
        '4' => {
          'name' => 'max_length',
          'offset' => '6',
          'type' => '5634'
        },
        '5' => {
          'name' => 'def_length',
          'offset' => '8',
          'type' => '5634'
        },
        '6' => {
          'name' => 'def_string',
          'offset' => '22',
          'type' => '8959'
        }
      },
      'Name' => 'struct pldm_bios_table_attr_entry_string_info',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '30809' => {
      'BaseType' => '30697',
      'Name' => 'struct pldm_bios_table_attr_entry_string_info const',
      'Size' => '24',
      'Type' => 'Const'
    },
    '30819' => {
      'Header' => 'bios_table.h',
      'Line' => '384',
      'Memb' => {
        '0' => {
          'name' => 'name_handle',
          'offset' => '0',
          'type' => '5634'
        },
        '1' => {
          'name' => 'read_only',
          'offset' => '2',
          'type' => '5433'
        },
        '2' => {
          'name' => 'lower_bound',
          'offset' => '8',
          'type' => '30077'
        },
        '3' => {
          'name' => 'upper_bound',
          'offset' => '22',
          'type' => '30077'
        },
        '4' => {
          'name' => 'scalar_increment',
          'offset' => '36',
          'type' => '147'
        },
        '5' => {
          'name' => 'default_value',
          'offset' => '50',
          'type' => '30077'
        }
      },
      'Name' => 'struct pldm_bios_table_attr_entry_integer_info',
      'Size' => '40',
      'Type' => 'Struct'
    },
    '30917' => {
      'BaseType' => '30819',
      'Name' => 'struct pldm_bios_table_attr_entry_integer_info const',
      'Size' => '40',
      'Type' => 'Const'
    },
    '31149' => {
      'Name' => 'ssize_t(*)(void const*)',
      'Param' => {
        '0' => {
          'type' => '1231'
        }
      },
      'Return' => '5766',
      'Size' => '8',
      'Type' => 'FuncPtr'
    },
    '31219' => {
      'Line' => '957',
      'Memb' => {
        '0' => {
          'name' => 'table_data',
          'offset' => '0',
          'type' => '5785'
        },
        '1' => {
          'name' => 'table_len',
          'offset' => '8',
          'type' => '164'
        },
        '2' => {
          'name' => 'current_pos',
          'offset' => '22',
          'type' => '164'
        },
        '3' => {
          'name' => 'entry_length_handler',
          'offset' => '36',
          'type' => '31149'
        }
      },
      'Name' => 'struct pldm_bios_table_iter',
      'PrivateABI' => 1,
      'Size' => '32',
      'Source' => 'bios_table.c',
      'Type' => 'Struct'
    },
    '31289' => {
      'BaseType' => '31219',
      'Name' => 'struct pldm_bios_table_iter const',
      'Size' => '32',
      'Type' => 'Const'
    },
    '32359' => {
      'BaseType' => '31219',
      'Name' => 'struct pldm_bios_table_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '32364' => {
      'BaseType' => '30520',
      'Name' => 'struct pldm_bios_attr_val_table_entry const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '32778' => {
      'BaseType' => '30463',
      'Name' => 'struct pldm_bios_attr_table_entry const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '33381' => {
      'BaseType' => '30377',
      'Name' => 'struct pldm_bios_string_table_entry const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '34544' => {
      'BaseType' => '31289',
      'Name' => 'struct pldm_bios_table_iter const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '38727' => {
      'BaseType' => '30077',
      'Name' => 'uint64_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '39004' => {
      'BaseType' => '30917',
      'Name' => 'struct pldm_bios_table_attr_entry_integer_info const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '39313' => {
      'BaseType' => '8959',
      'Name' => 'char const**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '40442' => {
      'BaseType' => '30809',
      'Name' => 'struct pldm_bios_table_attr_entry_string_info const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '41896' => {
      'BaseType' => '30680',
      'Name' => 'struct pldm_bios_table_attr_entry_enum_info const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '44109' => {
      'Header' => 'pldm_types.h',
      'Line' => '36',
      'Name' => 'anon-struct-pldm_types.h-36',
      'Size' => '2',
      'Type' => 'Struct'
    },
    '44375' => {
      'Header' => 'pldm_types.h',
      'Line' => '54',
      'Memb' => {
        '0' => {
          'name' => 'value',
          'offset' => '0',
          'type' => '5634'
        },
        '1' => {
          'name' => 'bits',
          'offset' => '0',
          'type' => '44109'
        }
      },
      'Name' => 'union bitfield16_t',
      'Size' => '2',
      'Type' => 'Union'
    },
    '52326' => {
      'BaseType' => '135',
      'Header' => 'pldm_types.h',
      'Line' => '32',
      'Name' => 'bool8_t',
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '52614' => {
      'Header' => 'pldm_types.h',
      'Line' => '58',
      'Name' => 'anon-struct-pldm_types.h-58',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '53102' => {
      'Header' => 'pldm_types.h',
      'Line' => '92',
      'Memb' => {
        '0' => {
          'name' => 'value',
          'offset' => '0',
          'type' => '147'
        },
        '1' => {
          'name' => 'bits',
          'offset' => '0',
          'type' => '52614'
        }
      },
      'Name' => 'union bitfield32_t',
      'Size' => '4',
      'Type' => 'Union'
    },
    '53114' => {
      'Header' => 'pldm_types.h',
      'Line' => '96',
      'Name' => 'anon-struct-pldm_types.h-96',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '54050' => {
      'Header' => 'pldm_types.h',
      'Line' => '162',
      'Memb' => {
        '0' => {
          'name' => 'value',
          'offset' => '0',
          'type' => '30077'
        },
        '1' => {
          'name' => 'bits',
          'offset' => '0',
          'type' => '53114'
        }
      },
      'Name' => 'union bitfield64_t',
      'Size' => '8',
      'Type' => 'Union'
    },
    '54093' => {
      'BaseType' => '164',
      'Name' => 'size_t const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '54208' => {
      'BaseType' => '7674',
      'Name' => 'struct variable_field const',
      'Size' => '16',
      'Type' => 'Const'
    },
    '55079' => {
      'Header' => 'firmware_update.h',
      'Line' => '157',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_STR_TYPE_UNKNOWN',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_STR_TYPE_ASCII',
          'value' => '1'
        },
        '2' => {
          'name' => 'PLDM_STR_TYPE_UTF_8',
          'value' => '2'
        },
        '3' => {
          'name' => 'PLDM_STR_TYPE_UTF_16',
          'value' => '3'
        },
        '4' => {
          'name' => 'PLDM_STR_TYPE_UTF_16LE',
          'value' => '4'
        },
        '5' => {
          'name' => 'PLDM_STR_TYPE_UTF_16BE',
          'value' => '5'
        }
      },
      'Name' => 'enum pldm_firmware_update_string_type',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '55990' => {
      'Header' => 'firmware_update.h',
      'Line' => '421',
      'Memb' => {
        '0' => {
          'name' => 'str_type',
          'offset' => '0',
          'type' => '55079'
        },
        '1' => {
          'name' => 'str_len',
          'offset' => '4',
          'type' => '135'
        },
        '2' => {
          'name' => 'str_data',
          'offset' => '5',
          'type' => '56046'
        }
      },
      'Name' => 'struct pldm_firmware_string',
      'Size' => '72',
      'Type' => 'Struct'
    },
    '56046' => {
      'BaseType' => '135',
      'Name' => 'uint8_t[64]',
      'Size' => '64',
      'Type' => 'Array'
    },
    '56062' => {
      'Header' => 'firmware_update.h',
      'Line' => '431',
      'Memb' => {
        '0' => {
          'name' => 'comparison_stamp',
          'offset' => '0',
          'type' => '147'
        },
        '1' => {
          'name' => 'str',
          'offset' => '4',
          'type' => '55990'
        },
        '2' => {
          'name' => 'date',
          'offset' => '118',
          'type' => '56117'
        }
      },
      'Name' => 'struct pldm_firmware_version',
      'Size' => '84',
      'Type' => 'Struct'
    },
    '56117' => {
      'BaseType' => '135',
      'Name' => 'uint8_t[8]',
      'Size' => '8',
      'Type' => 'Array'
    },
    '56133' => {
      'Header' => 'firmware_update.h',
      'Line' => '443',
      'Memb' => {
        '0' => {
          'name' => 'uuid',
          'offset' => '0',
          'type' => '56245'
        },
        '1' => {
          'name' => 'package_header_format_version',
          'offset' => '22',
          'type' => '135'
        },
        '2' => {
          'name' => 'package_header_size',
          'offset' => '23',
          'type' => '5634'
        },
        '3' => {
          'name' => 'package_release_date_time',
          'offset' => '25',
          'type' => '56261'
        },
        '4' => {
          'name' => 'component_bitmap_bit_length',
          'offset' => '50',
          'type' => '5634'
        },
        '5' => {
          'name' => 'package_version_string_type',
          'offset' => '52',
          'type' => '135'
        },
        '6' => {
          'name' => 'package_version_string_length',
          'offset' => '53',
          'type' => '135'
        }
      },
      'Name' => 'struct pldm_package_header_information',
      'Size' => '36',
      'Type' => 'Struct'
    },
    '56245' => {
      'BaseType' => '135',
      'Name' => 'uint8_t[16]',
      'Size' => '16',
      'Type' => 'Array'
    },
    '56261' => {
      'BaseType' => '135',
      'Name' => 'uint8_t[13]',
      'Size' => '13',
      'Type' => 'Array'
    },
    '56277' => {
      'Header' => 'firmware_update.h',
      'Line' => '459',
      'Memb' => {
        '0' => {
          'name' => 'record_length',
          'offset' => '0',
          'type' => '5634'
        },
        '1' => {
          'name' => 'descriptor_count',
          'offset' => '2',
          'type' => '135'
        },
        '2' => {
          'name' => 'device_update_option_flags',
          'offset' => '3',
          'type' => '53102'
        },
        '3' => {
          'name' => 'comp_image_set_version_string_type',
          'offset' => '7',
          'type' => '135'
        },
        '4' => {
          'name' => 'comp_image_set_version_string_length',
          'offset' => '8',
          'type' => '135'
        },
        '5' => {
          'name' => 'fw_device_pkg_data_length',
          'offset' => '9',
          'type' => '5634'
        }
      },
      'Name' => 'struct pldm_firmware_device_id_record',
      'Size' => '11',
      'Type' => 'Struct'
    },
    '56487' => {
      'Header' => 'firmware_update.h',
      'Line' => '495',
      'Memb' => {
        '0' => {
          'name' => 'comp_classification',
          'offset' => '0',
          'type' => '5634'
        },
        '1' => {
          'name' => 'comp_identifier',
          'offset' => '2',
          'type' => '5634'
        },
        '2' => {
          'name' => 'comp_comparison_stamp',
          'offset' => '4',
          'type' => '147'
        },
        '3' => {
          'name' => 'comp_options',
          'offset' => '8',
          'type' => '44375'
        },
        '4' => {
          'name' => 'requested_comp_activation_method',
          'offset' => '16',
          'type' => '44375'
        },
        '5' => {
          'name' => 'comp_location_offset',
          'offset' => '18',
          'type' => '147'
        },
        '6' => {
          'name' => 'comp_size',
          'offset' => '22',
          'type' => '147'
        },
        '7' => {
          'name' => 'comp_version_string_type',
          'offset' => '32',
          'type' => '135'
        },
        '8' => {
          'name' => 'comp_version_string_length',
          'offset' => '33',
          'type' => '135'
        }
      },
      'Name' => 'struct pldm_component_image_information',
      'Size' => '22',
      'Type' => 'Struct'
    },
    '56683' => {
      'Header' => 'firmware_update.h',
      'Line' => '521',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'capabilities_during_update',
          'offset' => '1',
          'type' => '53102'
        },
        '2' => {
          'name' => 'comp_count',
          'offset' => '5',
          'type' => '5634'
        },
        '3' => {
          'name' => 'active_comp_image_set_ver_str_type',
          'offset' => '7',
          'type' => '135'
        },
        '4' => {
          'name' => 'active_comp_image_set_ver_str_len',
          'offset' => '8',
          'type' => '135'
        },
        '5' => {
          'name' => 'pending_comp_image_set_ver_str_type',
          'offset' => '9',
          'type' => '135'
        },
        '6' => {
          'name' => 'pending_comp_image_set_ver_str_len',
          'offset' => '16',
          'type' => '135'
        }
      },
      'Name' => 'struct pldm_get_firmware_parameters_resp',
      'Size' => '11',
      'Type' => 'Struct'
    },
    '56795' => {
      'Header' => 'firmware_update.h',
      'Line' => '535',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'capabilities_during_update',
          'offset' => '4',
          'type' => '53102'
        },
        '2' => {
          'name' => 'comp_count',
          'offset' => '8',
          'type' => '5634'
        },
        '3' => {
          'name' => 'active_comp_image_set_ver_str',
          'offset' => '18',
          'type' => '55990'
        },
        '4' => {
          'name' => 'pending_comp_image_set_ver_str',
          'offset' => '132',
          'type' => '55990'
        }
      },
      'Name' => 'struct pldm_get_firmware_parameters_resp_full',
      'Size' => '156',
      'Type' => 'Struct'
    },
    '56879' => {
      'BaseType' => '56795',
      'Name' => 'struct pldm_get_firmware_parameters_resp_full const',
      'Size' => '156',
      'Type' => 'Const'
    },
    '56884' => {
      'Header' => 'firmware_update.h',
      'Line' => '549',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'downstream_device_update_supported',
          'offset' => '1',
          'type' => '135'
        },
        '2' => {
          'name' => 'number_of_downstream_devices',
          'offset' => '2',
          'type' => '5634'
        },
        '3' => {
          'name' => 'max_number_of_downstream_devices',
          'offset' => '4',
          'type' => '5634'
        },
        '4' => {
          'name' => 'capabilities',
          'offset' => '8',
          'type' => '53102'
        }
      },
      'Name' => 'struct pldm_query_downstream_devices_resp',
      'Size' => '12',
      'Type' => 'Struct'
    },
    '56968' => {
      'Header' => 'firmware_update.h',
      'Line' => '561',
      'Memb' => {
        '0' => {
          'name' => 'comp_classification',
          'offset' => '0',
          'type' => '5634'
        },
        '1' => {
          'name' => 'comp_identifier',
          'offset' => '2',
          'type' => '5634'
        },
        '2' => {
          'name' => 'comp_classification_index',
          'offset' => '4',
          'type' => '135'
        },
        '3' => {
          'name' => 'active_comp_comparison_stamp',
          'offset' => '5',
          'type' => '147'
        },
        '4' => {
          'name' => 'active_comp_ver_str_type',
          'offset' => '9',
          'type' => '135'
        },
        '5' => {
          'name' => 'active_comp_ver_str_len',
          'offset' => '16',
          'type' => '135'
        },
        '6' => {
          'name' => 'active_comp_release_date',
          'offset' => '17',
          'type' => '56117'
        },
        '7' => {
          'name' => 'pending_comp_comparison_stamp',
          'offset' => '25',
          'type' => '147'
        },
        '8' => {
          'name' => 'pending_comp_ver_str_type',
          'offset' => '35',
          'type' => '135'
        },
        '9' => {
          'name' => 'pending_comp_ver_str_len',
          'offset' => '36',
          'type' => '135'
        },
        '10' => {
          'name' => 'pending_comp_release_date',
          'offset' => '37',
          'type' => '56117'
        },
        '11' => {
          'name' => 'comp_activation_methods',
          'offset' => '51',
          'type' => '44375'
        },
        '12' => {
          'name' => 'capabilities_during_update',
          'offset' => '53',
          'type' => '53102'
        }
      },
      'Name' => 'struct pldm_component_parameter_entry',
      'Size' => '39',
      'Type' => 'Struct'
    },
    '57164' => {
      'Header' => 'firmware_update.h',
      'Line' => '583',
      'Memb' => {
        '0' => {
          'name' => 'comp_classification',
          'offset' => '0',
          'type' => '5634'
        },
        '1' => {
          'name' => 'comp_identifier',
          'offset' => '2',
          'type' => '5634'
        },
        '2' => {
          'name' => 'comp_classification_index',
          'offset' => '4',
          'type' => '135'
        },
        '3' => {
          'name' => 'active_ver',
          'offset' => '8',
          'type' => '56062'
        },
        '4' => {
          'name' => 'pending_ver',
          'offset' => '146',
          'type' => '56062'
        },
        '5' => {
          'name' => 'comp_activation_methods',
          'offset' => '374',
          'type' => '44375'
        },
        '6' => {
          'name' => 'capabilities_during_update',
          'offset' => '384',
          'type' => '53102'
        }
      },
      'Name' => 'struct pldm_component_parameter_entry_full',
      'Size' => '184',
      'Type' => 'Struct'
    },
    '57276' => {
      'BaseType' => '57164',
      'Name' => 'struct pldm_component_parameter_entry_full const',
      'Size' => '184',
      'Type' => 'Const'
    },
    '57281' => {
      'Header' => 'firmware_update.h',
      'Line' => '600',
      'Memb' => {
        '0' => {
          'name' => 'data_transfer_handle',
          'offset' => '0',
          'type' => '147'
        },
        '1' => {
          'name' => 'transfer_operation_flag',
          'offset' => '4',
          'type' => '135'
        }
      },
      'Name' => 'struct pldm_query_downstream_identifiers_req',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '57323' => {
      'BaseType' => '57281',
      'Name' => 'struct pldm_query_downstream_identifiers_req const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '57328' => {
      'Header' => 'firmware_update.h',
      'Line' => '614',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'next_data_transfer_handle',
          'offset' => '4',
          'type' => '147'
        },
        '2' => {
          'name' => 'transfer_flag',
          'offset' => '8',
          'type' => '135'
        },
        '3' => {
          'name' => 'downstream_devices_length',
          'offset' => '18',
          'type' => '147'
        },
        '4' => {
          'name' => 'number_of_downstream_devices',
          'offset' => '22',
          'type' => '5634'
        }
      },
      'Name' => 'struct pldm_query_downstream_identifiers_resp',
      'Size' => '20',
      'Type' => 'Struct'
    },
    '57412' => {
      'Header' => 'firmware_update.h',
      'Line' => '627',
      'Memb' => {
        '0' => {
          'name' => 'downstream_device_index',
          'offset' => '0',
          'type' => '5634'
        },
        '1' => {
          'name' => 'downstream_descriptor_count',
          'offset' => '2',
          'type' => '135'
        }
      },
      'Name' => 'struct pldm_downstream_device',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '57454' => {
      'Header' => 'firmware_update.h',
      'Line' => '633',
      'Memb' => {
        '0' => {
          'name' => 'field',
          'offset' => '0',
          'type' => '7674'
        },
        '1' => {
          'name' => 'devs',
          'offset' => '22',
          'type' => '164'
        }
      },
      'Name' => 'struct pldm_downstream_device_iter',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '57496' => {
      'Header' => 'firmware_update.h',
      'Line' => '707',
      'Memb' => {
        '0' => {
          'name' => 'descriptor_type',
          'offset' => '0',
          'type' => '5634'
        },
        '1' => {
          'name' => 'descriptor_length',
          'offset' => '2',
          'type' => '5634'
        },
        '2' => {
          'name' => 'descriptor_data',
          'offset' => '8',
          'type' => '1231'
        }
      },
      'Name' => 'struct pldm_descriptor',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '57552' => {
      'BaseType' => '57496',
      'Name' => 'struct pldm_descriptor const',
      'Size' => '16',
      'Type' => 'Const'
    },
    '57568' => {
      'Header' => 'firmware_update.h',
      'Line' => '713',
      'Memb' => {
        '0' => {
          'name' => 'field',
          'offset' => '0',
          'type' => '24662'
        },
        '1' => {
          'name' => 'count',
          'offset' => '8',
          'type' => '164'
        }
      },
      'Name' => 'struct pldm_descriptor_iter',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '57615' => {
      'Header' => 'firmware_update.h',
      'Line' => '806',
      'Memb' => {
        '0' => {
          'name' => 'data_transfer_handle',
          'offset' => '0',
          'type' => '147'
        },
        '1' => {
          'name' => 'transfer_operation_flag',
          'offset' => '4',
          'type' => '135'
        }
      },
      'Name' => 'struct pldm_get_downstream_firmware_parameters_req',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '57657' => {
      'BaseType' => '57615',
      'Name' => 'struct pldm_get_downstream_firmware_parameters_req const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '57662' => {
      'Header' => 'firmware_update.h',
      'Line' => '821',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'next_data_transfer_handle',
          'offset' => '4',
          'type' => '147'
        },
        '2' => {
          'name' => 'transfer_flag',
          'offset' => '8',
          'type' => '135'
        },
        '3' => {
          'name' => 'fdp_capabilities_during_update',
          'offset' => '18',
          'type' => '53102'
        },
        '4' => {
          'name' => 'downstream_device_count',
          'offset' => '22',
          'type' => '5634'
        }
      },
      'Name' => 'struct pldm_get_downstream_firmware_parameters_resp',
      'Size' => '20',
      'Type' => 'Struct'
    },
    '57746' => {
      'Header' => 'firmware_update.h',
      'Line' => '839',
      'Memb' => {
        '0' => {
          'name' => 'downstream_device_index',
          'offset' => '0',
          'type' => '5634'
        },
        '1' => {
          'name' => 'active_comp_comparison_stamp',
          'offset' => '4',
          'type' => '147'
        },
        '2' => {
          'name' => 'active_comp_ver_str_type',
          'offset' => '8',
          'type' => '135'
        },
        '3' => {
          'name' => 'active_comp_ver_str_len',
          'offset' => '9',
          'type' => '135'
        },
        '4' => {
          'name' => 'active_comp_release_date',
          'offset' => '16',
          'type' => '57942'
        },
        '5' => {
          'name' => 'pending_comp_comparison_stamp',
          'offset' => '32',
          'type' => '147'
        },
        '6' => {
          'name' => 'pending_comp_ver_str_type',
          'offset' => '36',
          'type' => '135'
        },
        '7' => {
          'name' => 'pending_comp_ver_str_len',
          'offset' => '37',
          'type' => '135'
        },
        '8' => {
          'name' => 'pending_comp_release_date',
          'offset' => '38',
          'type' => '57942'
        },
        '9' => {
          'name' => 'comp_activation_methods',
          'offset' => '54',
          'type' => '44375'
        },
        '10' => {
          'name' => 'capabilities_during_update',
          'offset' => '64',
          'type' => '53102'
        },
        '11' => {
          'name' => 'active_comp_ver_str',
          'offset' => '72',
          'type' => '1231'
        },
        '12' => {
          'name' => 'pending_comp_ver_str',
          'offset' => '86',
          'type' => '1231'
        }
      },
      'Name' => 'struct pldm_downstream_device_parameters_entry',
      'Size' => '64',
      'Type' => 'Struct'
    },
    '57942' => {
      'BaseType' => '46',
      'Name' => 'char[9]',
      'Size' => '9',
      'Type' => 'Array'
    },
    '58056' => {
      'Header' => 'firmware_update.h',
      'Line' => '879',
      'Memb' => {
        '0' => {
          'name' => 'max_transfer_size',
          'offset' => '0',
          'type' => '147'
        },
        '1' => {
          'name' => 'num_of_comp',
          'offset' => '4',
          'type' => '5634'
        },
        '2' => {
          'name' => 'max_outstanding_transfer_req',
          'offset' => '6',
          'type' => '135'
        },
        '3' => {
          'name' => 'pkg_data_len',
          'offset' => '8',
          'type' => '5634'
        },
        '4' => {
          'name' => 'image_set_ver',
          'offset' => '18',
          'type' => '55990'
        }
      },
      'Name' => 'struct pldm_request_update_req_full',
      'Size' => '84',
      'Type' => 'Struct'
    },
    '58140' => {
      'Header' => 'firmware_update.h',
      'Line' => '892',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'fd_meta_data_len',
          'offset' => '1',
          'type' => '5634'
        },
        '2' => {
          'name' => 'fd_will_send_pkg_data',
          'offset' => '3',
          'type' => '135'
        }
      },
      'Name' => 'struct pldm_request_update_resp',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '58196' => {
      'BaseType' => '58140',
      'Name' => 'struct pldm_request_update_resp const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '58313' => {
      'Header' => 'firmware_update.h',
      'Line' => '919',
      'Memb' => {
        '0' => {
          'name' => 'transfer_flag',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'comp_classification',
          'offset' => '2',
          'type' => '5634'
        },
        '2' => {
          'name' => 'comp_identifier',
          'offset' => '4',
          'type' => '5634'
        },
        '3' => {
          'name' => 'comp_classification_index',
          'offset' => '6',
          'type' => '135'
        },
        '4' => {
          'name' => 'comp_comparison_stamp',
          'offset' => '8',
          'type' => '147'
        },
        '5' => {
          'name' => 'version',
          'offset' => '18',
          'type' => '55990'
        }
      },
      'Name' => 'struct pldm_pass_component_table_req_full',
      'Size' => '84',
      'Type' => 'Struct'
    },
    '58411' => {
      'Header' => 'firmware_update.h',
      'Line' => '932',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'comp_resp',
          'offset' => '1',
          'type' => '135'
        },
        '2' => {
          'name' => 'comp_resp_code',
          'offset' => '2',
          'type' => '135'
        }
      },
      'Name' => 'struct pldm_pass_component_table_resp',
      'Size' => '3',
      'Type' => 'Struct'
    },
    '58467' => {
      'BaseType' => '58411',
      'Name' => 'struct pldm_pass_component_table_resp const',
      'Size' => '3',
      'Type' => 'Const'
    },
    '58598' => {
      'Header' => 'firmware_update.h',
      'Line' => '960',
      'Memb' => {
        '0' => {
          'name' => 'comp_classification',
          'offset' => '0',
          'type' => '5634'
        },
        '1' => {
          'name' => 'comp_identifier',
          'offset' => '2',
          'type' => '5634'
        },
        '2' => {
          'name' => 'comp_classification_index',
          'offset' => '4',
          'type' => '135'
        },
        '3' => {
          'name' => 'comp_comparison_stamp',
          'offset' => '8',
          'type' => '147'
        },
        '4' => {
          'name' => 'version',
          'offset' => '18',
          'type' => '55990'
        },
        '5' => {
          'name' => 'comp_image_size',
          'offset' => '132',
          'type' => '147'
        },
        '6' => {
          'name' => 'update_option_flags',
          'offset' => '136',
          'type' => '53102'
        }
      },
      'Name' => 'struct pldm_update_component_req_full',
      'Size' => '92',
      'Type' => 'Struct'
    },
    '58710' => {
      'Header' => 'firmware_update.h',
      'Line' => '976',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'comp_compatibility_resp',
          'offset' => '1',
          'type' => '135'
        },
        '2' => {
          'name' => 'comp_compatibility_resp_code',
          'offset' => '2',
          'type' => '135'
        },
        '3' => {
          'name' => 'update_option_flags_enabled',
          'offset' => '3',
          'type' => '53102'
        },
        '4' => {
          'name' => 'time_before_req_fw_data',
          'offset' => '7',
          'type' => '5634'
        }
      },
      'Name' => 'struct pldm_update_component_resp',
      'Size' => '9',
      'Type' => 'Struct'
    },
    '58794' => {
      'BaseType' => '58710',
      'Name' => 'struct pldm_update_component_resp const',
      'Size' => '9',
      'Type' => 'Const'
    },
    '58799' => {
      'Header' => 'firmware_update.h',
      'Line' => '988',
      'Memb' => {
        '0' => {
          'name' => 'offset',
          'offset' => '0',
          'type' => '147'
        },
        '1' => {
          'name' => 'length',
          'offset' => '4',
          'type' => '147'
        }
      },
      'Name' => 'struct pldm_request_firmware_data_req',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '58841' => {
      'BaseType' => '58799',
      'Name' => 'struct pldm_request_firmware_data_req const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '58846' => {
      'Header' => 'firmware_update.h',
      'Line' => '997',
      'Memb' => {
        '0' => {
          'name' => 'apply_result',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'comp_activation_methods_modification',
          'offset' => '1',
          'type' => '44375'
        }
      },
      'Name' => 'struct pldm_apply_complete_req',
      'Size' => '3',
      'Type' => 'Struct'
    },
    '58888' => {
      'BaseType' => '58846',
      'Name' => 'struct pldm_apply_complete_req const',
      'Size' => '3',
      'Type' => 'Const'
    },
    '58921' => {
      'Header' => 'firmware_update.h',
      'Line' => '1014',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'estimated_time_activation',
          'offset' => '1',
          'type' => '5634'
        }
      },
      'Name' => 'struct pldm_activate_firmware_resp',
      'Size' => '3',
      'Type' => 'Struct'
    },
    '58963' => {
      'BaseType' => '58921',
      'Name' => 'struct pldm_activate_firmware_resp const',
      'Size' => '3',
      'Type' => 'Const'
    },
    '58968' => {
      'Header' => 'firmware_update.h',
      'Line' => '1023',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'current_state',
          'offset' => '1',
          'type' => '135'
        },
        '2' => {
          'name' => 'previous_state',
          'offset' => '2',
          'type' => '135'
        },
        '3' => {
          'name' => 'aux_state',
          'offset' => '3',
          'type' => '135'
        },
        '4' => {
          'name' => 'aux_state_status',
          'offset' => '4',
          'type' => '135'
        },
        '5' => {
          'name' => 'progress_percent',
          'offset' => '5',
          'type' => '135'
        },
        '6' => {
          'name' => 'reason_code',
          'offset' => '6',
          'type' => '135'
        },
        '7' => {
          'name' => 'update_option_flags_enabled',
          'offset' => '7',
          'type' => '53102'
        }
      },
      'Name' => 'struct pldm_get_status_resp',
      'Size' => '11',
      'Type' => 'Struct'
    },
    '59094' => {
      'BaseType' => '58968',
      'Name' => 'struct pldm_get_status_resp const',
      'Size' => '11',
      'Type' => 'Const'
    },
    '59099' => {
      'Header' => 'firmware_update.h',
      'Line' => '1038',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'non_functioning_component_indication',
          'offset' => '1',
          'type' => '52326'
        },
        '2' => {
          'name' => 'non_functioning_component_bitmap',
          'offset' => '2',
          'type' => '30077'
        }
      },
      'Name' => 'struct pldm_cancel_update_resp',
      'Size' => '10',
      'Type' => 'Struct'
    },
    '59155' => {
      'BaseType' => '59099',
      'Name' => 'struct pldm_cancel_update_resp const',
      'Size' => '10',
      'Type' => 'Const'
    },
    '59160' => {
      'Header' => 'firmware_update.h',
      'Line' => '1353',
      'Memb' => {
        '0' => {
          'name' => 'field',
          'offset' => '0',
          'type' => '7674'
        },
        '1' => {
          'name' => 'entries',
          'offset' => '22',
          'type' => '164'
        }
      },
      'Name' => 'struct pldm_downstream_device_parameters_iter',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '59202' => {
      'Header' => 'firmware_update.h',
      'Line' => '2066',
      'Memb' => {
        '0' => {
          'name' => 'package_header_identifier',
          'offset' => '0',
          'type' => '56245'
        },
        '1' => {
          'name' => 'package_header_format_revision',
          'offset' => '22',
          'type' => '135'
        },
        '2' => {
          'name' => 'package_release_date_time',
          'offset' => '23',
          'type' => '56261'
        },
        '3' => {
          'name' => 'component_bitmap_bit_length',
          'offset' => '48',
          'type' => '5634'
        },
        '4' => {
          'name' => 'package_version_string_type',
          'offset' => '50',
          'type' => '135'
        },
        '5' => {
          'name' => 'package_version_string',
          'offset' => '64',
          'type' => '7674'
        },
        '6' => {
          'name' => 'areas',
          'offset' => '86',
          'type' => '7674'
        },
        '7' => {
          'name' => 'package',
          'offset' => '114',
          'type' => '7674'
        },
        '8' => {
          'name' => 'package_payload_checksum',
          'offset' => '136',
          'type' => '147'
        }
      },
      'Name' => 'struct pldm__package_header_information',
      'Size' => '96',
      'Type' => 'Struct'
    },
    '59342' => {
      'BaseType' => '59202',
      'Header' => 'firmware_update.h',
      'Line' => '2078',
      'Name' => 'pldm_package_header_information_pad',
      'Size' => '96',
      'Type' => 'Typedef'
    },
    '59353' => {
      'Header' => 'firmware_update.h',
      'Line' => '2080',
      'Memb' => {
        '0' => {
          'name' => 'bitmap',
          'offset' => '0',
          'type' => '7674'
        }
      },
      'Name' => 'struct pldm_component_bitmap',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '59381' => {
      'Header' => 'firmware_update.h',
      'Line' => '2085',
      'Memb' => {
        '0' => {
          'name' => 'descriptor_count',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'device_update_option_flags',
          'offset' => '4',
          'type' => '53102'
        },
        '2' => {
          'name' => 'component_image_set_version_string_type',
          'offset' => '8',
          'type' => '135'
        },
        '3' => {
          'name' => 'component_image_set_version_string',
          'offset' => '22',
          'type' => '7674'
        },
        '4' => {
          'name' => 'applicable_components',
          'offset' => '50',
          'type' => '59353'
        },
        '5' => {
          'name' => 'record_descriptors',
          'offset' => '72',
          'type' => '7674'
        },
        '6' => {
          'name' => 'firmware_device_package_data',
          'offset' => '100',
          'type' => '7674'
        },
        '7' => {
          'name' => 'reference_manifest_data',
          'offset' => '128',
          'type' => '7674'
        }
      },
      'Name' => 'struct pldm__firmware_device_id_record',
      'Size' => '96',
      'Type' => 'Struct'
    },
    '59507' => {
      'BaseType' => '59381',
      'Header' => 'firmware_update.h',
      'Line' => '2098',
      'Name' => 'pldm_firmware_device_id_record_pad',
      'Size' => '96',
      'Type' => 'Typedef'
    },
    '59518' => {
      'Header' => 'firmware_update.h',
      'Line' => '2100',
      'Memb' => {
        '0' => {
          'name' => 'descriptor_count',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'update_option_flags',
          'offset' => '4',
          'type' => '53102'
        },
        '2' => {
          'name' => 'self_contained_activation_min_version_string_type',
          'offset' => '8',
          'type' => '135'
        },
        '3' => {
          'name' => 'self_contained_activation_min_version_string',
          'offset' => '22',
          'type' => '7674'
        },
        '4' => {
          'name' => 'self_contained_activation_min_version_comparison_stamp',
          'offset' => '50',
          'type' => '147'
        },
        '5' => {
          'name' => 'applicable_components',
          'offset' => '64',
          'type' => '59353'
        },
        '6' => {
          'name' => 'record_descriptors',
          'offset' => '86',
          'type' => '7674'
        },
        '7' => {
          'name' => 'package_data',
          'offset' => '114',
          'type' => '7674'
        },
        '8' => {
          'name' => 'reference_manifest_data',
          'offset' => '136',
          'type' => '7674'
        }
      },
      'Name' => 'struct pldm_downstream_device_id_record',
      'Size' => '104',
      'Type' => 'Struct'
    },
    '59658' => {
      'Header' => 'firmware_update.h',
      'Line' => '2113',
      'Memb' => {
        '0' => {
          'name' => 'component_classification',
          'offset' => '0',
          'type' => '5634'
        },
        '1' => {
          'name' => 'component_identifier',
          'offset' => '2',
          'type' => '5634'
        },
        '2' => {
          'name' => 'component_comparison_stamp',
          'offset' => '4',
          'type' => '147'
        },
        '3' => {
          'name' => 'component_options',
          'offset' => '8',
          'type' => '44375'
        },
        '4' => {
          'name' => 'requested_component_activation_method',
          'offset' => '16',
          'type' => '44375'
        },
        '5' => {
          'name' => 'component_image',
          'offset' => '22',
          'type' => '7674'
        },
        '6' => {
          'name' => 'component_version_string_type',
          'offset' => '50',
          'type' => '135'
        },
        '7' => {
          'name' => 'component_version_string',
          'offset' => '64',
          'type' => '7674'
        },
        '8' => {
          'name' => 'component_opaque_data',
          'offset' => '86',
          'type' => '7674'
        }
      },
      'Name' => 'struct pldm__component_image_information',
      'Size' => '72',
      'Type' => 'Struct'
    },
    '59798' => {
      'BaseType' => '59658',
      'Header' => 'firmware_update.h',
      'Line' => '2129',
      'Name' => 'pldm_component_image_information_pad',
      'Size' => '72',
      'Type' => 'Typedef'
    },
    '59809' => {
      'Header' => 'firmware_update.h',
      'Line' => '2131',
      'Memb' => {
        '0' => {
          'name' => 'field',
          'offset' => '0',
          'type' => '7674'
        },
        '1' => {
          'name' => 'entries',
          'offset' => '22',
          'type' => '164'
        }
      },
      'Name' => 'struct pldm_firmware_device_id_record_iter',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '59851' => {
      'Header' => 'firmware_update.h',
      'Line' => '2136',
      'Memb' => {
        '0' => {
          'name' => 'field',
          'offset' => '0',
          'type' => '7674'
        },
        '1' => {
          'name' => 'entries',
          'offset' => '22',
          'type' => '164'
        }
      },
      'Name' => 'struct pldm_downstream_device_id_record_iter',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '59893' => {
      'Header' => 'firmware_update.h',
      'Line' => '2141',
      'Memb' => {
        '0' => {
          'name' => 'field',
          'offset' => '0',
          'type' => '7674'
        },
        '1' => {
          'name' => 'entries',
          'offset' => '22',
          'type' => '164'
        }
      },
      'Name' => 'struct pldm_component_image_information_iter',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '59935' => {
      'Header' => 'firmware_update.h',
      'Line' => '2146',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '59342'
        },
        '1' => {
          'name' => 'package',
          'offset' => '150',
          'type' => '7674'
        },
        '2' => {
          'name' => 'fds',
          'offset' => '274',
          'type' => '59809'
        },
        '3' => {
          'name' => 'dds',
          'offset' => '310',
          'type' => '59851'
        },
        '4' => {
          'name' => 'infos',
          'offset' => '352',
          'type' => '59893'
        }
      },
      'Name' => 'struct pldm_firmware_update_package_iter',
      'Size' => '184',
      'Type' => 'Struct'
    },
    '68550' => {
      'BaseType' => '59342',
      'Name' => 'pldm_package_header_information_pad*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '68555' => {
      'BaseType' => '59893',
      'Name' => 'struct pldm_component_image_information_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '68560' => {
      'BaseType' => '59798',
      'Name' => 'pldm_component_image_information_pad*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '69555' => {
      'BaseType' => '59851',
      'Name' => 'struct pldm_downstream_device_id_record_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '74253' => {
      'BaseType' => '59518',
      'Name' => 'struct pldm_downstream_device_id_record*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '75250' => {
      'BaseType' => '59809',
      'Name' => 'struct pldm_firmware_device_id_record_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '75385' => {
      'BaseType' => '59507',
      'Name' => 'pldm_firmware_device_id_record_pad*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '76428' => {
      'BaseType' => '59935',
      'Name' => 'struct pldm_firmware_update_package_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '77890' => {
      'BaseType' => '59155',
      'Name' => 'struct pldm_cancel_update_resp const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '78083' => {
      'BaseType' => '52326',
      'Name' => 'bool8_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '78088' => {
      'BaseType' => '54050',
      'Name' => 'bitfield64_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '81198' => {
      'BaseType' => '59094',
      'Name' => 'struct pldm_get_status_resp const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '81531' => {
      'BaseType' => '53102',
      'Name' => 'bitfield32_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '82927' => {
      'BaseType' => '58963',
      'Name' => 'struct pldm_activate_firmware_resp const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '84094' => {
      'BaseType' => '5433',
      'Name' => '_Bool*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '85504' => {
      'BaseType' => '58888',
      'Name' => 'struct pldm_apply_complete_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '85620' => {
      'BaseType' => '44375',
      'Name' => 'bitfield16_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '89487' => {
      'BaseType' => '58841',
      'Name' => 'struct pldm_request_firmware_data_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '91566' => {
      'BaseType' => '58794',
      'Name' => 'struct pldm_update_component_resp const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '95505' => {
      'BaseType' => '58598',
      'Name' => 'struct pldm_update_component_req_full*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '95980' => {
      'BaseType' => '54208',
      'Name' => 'struct variable_field const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '97439' => {
      'BaseType' => '58467',
      'Name' => 'struct pldm_pass_component_table_resp const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '100926' => {
      'BaseType' => '58313',
      'Name' => 'struct pldm_pass_component_table_req_full*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '102872' => {
      'BaseType' => '58196',
      'Name' => 'struct pldm_request_update_resp const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '105989' => {
      'BaseType' => '58056',
      'Name' => 'struct pldm_request_update_req_full*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '111274' => {
      'BaseType' => '59160',
      'Name' => 'struct pldm_downstream_device_parameters_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '111279' => {
      'BaseType' => '57746',
      'Name' => 'struct pldm_downstream_device_parameters_entry*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '113964' => {
      'BaseType' => '57662',
      'Name' => 'struct pldm_get_downstream_firmware_parameters_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '115098' => {
      'BaseType' => '57657',
      'Name' => 'struct pldm_get_downstream_firmware_parameters_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '116279' => {
      'BaseType' => '57454',
      'Name' => 'struct pldm_downstream_device_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '116284' => {
      'BaseType' => '57412',
      'Name' => 'struct pldm_downstream_device*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '118983' => {
      'BaseType' => '57328',
      'Name' => 'struct pldm_query_downstream_identifiers_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '120117' => {
      'BaseType' => '57323',
      'Name' => 'struct pldm_query_downstream_identifiers_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '122719' => {
      'BaseType' => '56884',
      'Name' => 'struct pldm_query_downstream_devices_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '123168' => {
      'BaseType' => '56968',
      'Name' => 'struct pldm_component_parameter_entry*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '128258' => {
      'BaseType' => '57276',
      'Name' => 'struct pldm_component_parameter_entry_full const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '131603' => {
      'BaseType' => '56879',
      'Name' => 'struct pldm_get_firmware_parameters_resp_full const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '131829' => {
      'BaseType' => '56683',
      'Name' => 'struct pldm_get_firmware_parameters_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '134642' => {
      'BaseType' => '57552',
      'Name' => 'struct pldm_descriptor const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '134804' => {
      'BaseType' => '1496',
      'Name' => 'uint8_t**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '135148' => {
      'BaseType' => '56487',
      'Name' => 'struct pldm_component_image_information*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '137643' => {
      'BaseType' => '57568',
      'Name' => 'struct pldm_descriptor_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '137648' => {
      'BaseType' => '57496',
      'Name' => 'struct pldm_descriptor*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '138112' => {
      'BaseType' => '56277',
      'Name' => 'struct pldm_firmware_device_id_record*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '144950' => {
      'BaseType' => '56133',
      'Name' => 'struct pldm_package_header_information*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '159587' => {
      'BaseType' => '159604',
      'Header' => 'pdr.h',
      'Line' => '16',
      'Name' => 'pldm_pdr',
      'PrivateABI' => 1,
      'Size' => '24',
      'Type' => 'Typedef'
    },
    '159599' => {
      'BaseType' => '159587',
      'Name' => 'pldm_pdr const',
      'Size' => '24',
      'Type' => 'Const'
    },
    '159604' => {
      'Line' => '30',
      'Memb' => {
        '0' => {
          'name' => 'record_count',
          'offset' => '0',
          'type' => '147'
        },
        '1' => {
          'name' => 'size',
          'offset' => '4',
          'type' => '147'
        },
        '2' => {
          'name' => 'first',
          'offset' => '8',
          'type' => '161026'
        },
        '3' => {
          'name' => 'last',
          'offset' => '22',
          'type' => '161026'
        }
      },
      'Name' => 'struct pldm_pdr',
      'PrivateABI' => 1,
      'Size' => '24',
      'Source' => 'pdr.c',
      'Type' => 'Struct'
    },
    '159670' => {
      'BaseType' => '159687',
      'Header' => 'pdr.h',
      'Line' => '21',
      'Name' => 'pldm_pdr_record',
      'PrivateABI' => 1,
      'Size' => '32',
      'Type' => 'Typedef'
    },
    '159682' => {
      'BaseType' => '159670',
      'Name' => 'pldm_pdr_record const',
      'Size' => '32',
      'Type' => 'Const'
    },
    '159687' => {
      'Line' => '21',
      'Memb' => {
        '0' => {
          'name' => 'record_handle',
          'offset' => '0',
          'type' => '147'
        },
        '1' => {
          'name' => 'size',
          'offset' => '4',
          'type' => '147'
        },
        '2' => {
          'name' => 'data',
          'offset' => '8',
          'type' => '1496'
        },
        '3' => {
          'name' => 'next',
          'offset' => '22',
          'type' => '161014'
        },
        '4' => {
          'name' => 'is_remote',
          'offset' => '36',
          'type' => '5433'
        },
        '5' => {
          'name' => 'terminus_handle',
          'offset' => '38',
          'type' => '5634'
        }
      },
      'Name' => 'struct pldm_pdr_record',
      'PrivateABI' => 1,
      'Size' => '32',
      'Source' => 'pdr.c',
      'Type' => 'Struct'
    },
    '159779' => {
      'Header' => 'pdr.h',
      'Line' => '327',
      'Memb' => {
        '0' => {
          'name' => 'entity_type',
          'offset' => '0',
          'type' => '5634'
        },
        '1' => {
          'name' => 'entity_instance_num',
          'offset' => '2',
          'type' => '5634'
        },
        '2' => {
          'name' => 'entity_container_id',
          'offset' => '4',
          'type' => '5634'
        }
      },
      'Name' => 'struct pldm_entity',
      'Size' => '6',
      'Type' => 'Struct'
    },
    '159841' => {
      'BaseType' => '159779',
      'Header' => 'pdr.h',
      'Line' => '331',
      'Name' => 'pldm_entity',
      'Size' => '6',
      'Type' => 'Typedef'
    },
    '159882' => {
      'BaseType' => '159894',
      'Header' => 'pdr.h',
      'Line' => '341',
      'Name' => 'pldm_entity_association_tree',
      'PrivateABI' => 1,
      'Size' => '16',
      'Type' => 'Typedef'
    },
    '159894' => {
      'Line' => '647',
      'Memb' => {
        '0' => {
          'name' => 'root',
          'offset' => '0',
          'type' => '161031'
        },
        '1' => {
          'name' => 'last_used_container_id',
          'offset' => '8',
          'type' => '5634'
        }
      },
      'Name' => 'struct pldm_entity_association_tree',
      'PrivateABI' => 1,
      'Size' => '16',
      'Source' => 'pdr.c',
      'Type' => 'Struct'
    },
    '159937' => {
      'BaseType' => '159954',
      'Header' => 'pdr.h',
      'Line' => '346',
      'Name' => 'pldm_entity_node',
      'PrivateABI' => 1,
      'Size' => '40',
      'Type' => 'Typedef'
    },
    '159949' => {
      'BaseType' => '159937',
      'Name' => 'pldm_entity_node const',
      'Size' => '40',
      'Type' => 'Const'
    },
    '159954' => {
      'Line' => '652',
      'Memb' => {
        '0' => {
          'name' => 'entity',
          'offset' => '0',
          'type' => '159841'
        },
        '1' => {
          'name' => 'parent',
          'offset' => '6',
          'type' => '159841'
        },
        '2' => {
          'name' => 'remote_container_id',
          'offset' => '18',
          'type' => '5634'
        },
        '3' => {
          'name' => 'first_child',
          'offset' => '22',
          'type' => '161031'
        },
        '4' => {
          'name' => 'next_sibling',
          'offset' => '36',
          'type' => '161031'
        },
        '5' => {
          'name' => 'association_type',
          'offset' => '50',
          'type' => '135'
        }
      },
      'Name' => 'struct pldm_entity_node',
      'PrivateABI' => 1,
      'Size' => '40',
      'Source' => 'pdr.c',
      'Type' => 'Struct'
    },
    '160232' => {
      'Header' => 'platform.h',
      'Line' => '561',
      'Memb' => {
        '0' => {
          'name' => 'record_handle',
          'offset' => '0',
          'type' => '147'
        },
        '1' => {
          'name' => 'version',
          'offset' => '4',
          'type' => '135'
        },
        '2' => {
          'name' => 'type',
          'offset' => '5',
          'type' => '135'
        },
        '3' => {
          'name' => 'record_change_num',
          'offset' => '6',
          'type' => '5634'
        },
        '4' => {
          'name' => 'length',
          'offset' => '8',
          'type' => '5634'
        }
      },
      'Name' => 'struct pldm_pdr_hdr',
      'Size' => '10',
      'Type' => 'Struct'
    },
    '160681' => {
      'Header' => 'platform.h',
      'Line' => '636',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '160232'
        },
        '1' => {
          'name' => 'terminus_handle',
          'offset' => '16',
          'type' => '5634'
        },
        '2' => {
          'name' => 'sensor_id',
          'offset' => '18',
          'type' => '5634'
        },
        '3' => {
          'name' => 'entity_type',
          'offset' => '20',
          'type' => '5634'
        },
        '4' => {
          'name' => 'entity_instance',
          'offset' => '22',
          'type' => '5634'
        },
        '5' => {
          'name' => 'container_id',
          'offset' => '24',
          'type' => '5634'
        },
        '6' => {
          'name' => 'sensor_init',
          'offset' => '32',
          'type' => '135'
        },
        '7' => {
          'name' => 'sensor_auxiliary_names_pdr',
          'offset' => '33',
          'type' => '52326'
        },
        '8' => {
          'name' => 'composite_sensor_count',
          'offset' => '34',
          'type' => '135'
        },
        '9' => {
          'name' => 'possible_states',
          'offset' => '35',
          'type' => '968'
        }
      },
      'Name' => 'struct pldm_state_sensor_pdr',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '160835' => {
      'Header' => 'platform.h',
      'Line' => '663',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '160232'
        },
        '1' => {
          'name' => 'terminus_handle',
          'offset' => '16',
          'type' => '5634'
        },
        '2' => {
          'name' => 'effecter_id',
          'offset' => '18',
          'type' => '5634'
        },
        '3' => {
          'name' => 'entity_type',
          'offset' => '20',
          'type' => '5634'
        },
        '4' => {
          'name' => 'entity_instance',
          'offset' => '22',
          'type' => '5634'
        },
        '5' => {
          'name' => 'container_id',
          'offset' => '24',
          'type' => '5634'
        },
        '6' => {
          'name' => 'effecter_semantic_id',
          'offset' => '32',
          'type' => '5634'
        },
        '7' => {
          'name' => 'effecter_init',
          'offset' => '34',
          'type' => '135'
        },
        '8' => {
          'name' => 'has_description_pdr',
          'offset' => '35',
          'type' => '52326'
        },
        '9' => {
          'name' => 'composite_effecter_count',
          'offset' => '36',
          'type' => '135'
        },
        '10' => {
          'name' => 'possible_states',
          'offset' => '37',
          'type' => '968'
        }
      },
      'Name' => 'struct pldm_state_effecter_pdr',
      'Size' => '26',
      'Type' => 'Struct'
    },
    '161014' => {
      'BaseType' => '159687',
      'Name' => 'struct pldm_pdr_record*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '161026' => {
      'BaseType' => '159670',
      'Name' => 'pldm_pdr_record*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '161031' => {
      'BaseType' => '159937',
      'Name' => 'pldm_entity_node*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '162270' => {
      'BaseType' => '159587',
      'Name' => 'pldm_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '163581' => {
      'BaseType' => '159682',
      'Name' => 'pldm_pdr_record const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '170815' => {
      'BaseType' => '159841',
      'Name' => 'pldm_entity*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '186937' => {
      'BaseType' => '170815',
      'Name' => 'pldm_entity**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '187001' => {
      'BaseType' => '159882',
      'Name' => 'pldm_entity_association_tree*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '187589' => {
      'BaseType' => '161031',
      'Name' => 'pldm_entity_node**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '188378' => {
      'BaseType' => '159599',
      'Name' => 'pldm_pdr const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '193855' => {
      'BaseType' => '159949',
      'Name' => 'pldm_entity_node const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '199718' => {
      'BaseType' => '160835',
      'Name' => 'struct pldm_state_effecter_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '204675' => {
      'BaseType' => '160681',
      'Name' => 'struct pldm_state_sensor_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '209323' => {
      'BaseType' => '88',
      'Header' => 'types.h',
      'Line' => '37',
      'Name' => '__int8_t',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '209354' => {
      'BaseType' => '107',
      'Header' => 'types.h',
      'Line' => '39',
      'Name' => '__int16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '209385' => {
      'BaseType' => '53',
      'Header' => 'types.h',
      'Line' => '41',
      'Name' => '__int32_t',
      'PrivateABI' => 1,
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '209423' => {
      'BaseType' => '5555',
      'Header' => 'types.h',
      'Line' => '55',
      'Name' => '__uint_least16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '209476' => {
      'BaseType' => '209323',
      'Header' => 'stdint-intn.h',
      'Line' => '24',
      'Name' => 'int8_t',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '209488' => {
      'BaseType' => '209354',
      'Header' => 'stdint-intn.h',
      'Line' => '25',
      'Name' => 'int16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '209500' => {
      'BaseType' => '209385',
      'Header' => 'stdint-intn.h',
      'Line' => '26',
      'Name' => 'int32_t',
      'PrivateABI' => 1,
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '210117' => {
      'BaseType' => '444',
      'Header' => 'pldm_types.h',
      'Line' => '164',
      'Name' => 'real32_t',
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '210832' => {
      'BaseType' => '209423',
      'Header' => 'uchar.h',
      'Line' => '51',
      'Name' => 'char16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '211665' => {
      'Header' => 'platform.h',
      'Line' => '339',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_SENSOR_OP_STATE',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_STATE_SENSOR_STATE',
          'value' => '1'
        },
        '2' => {
          'name' => 'PLDM_NUMERIC_SENSOR_STATE',
          'value' => '2'
        }
      },
      'Name' => 'enum sensor_event_class_states',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '211699' => {
      'BaseType' => '211665',
      'Name' => 'enum sensor_event_class_states const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '212161' => {
      'Header' => 'platform.h',
      'Line' => '653',
      'Memb' => {
        '0' => {
          'name' => 'state_set_id',
          'offset' => '0',
          'type' => '5634'
        },
        '1' => {
          'name' => 'possible_states_size',
          'offset' => '2',
          'type' => '135'
        },
        '2' => {
          'name' => 'states',
          'offset' => '3',
          'type' => '212223'
        }
      },
      'Name' => 'struct state_sensor_possible_states',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '212218' => {
      'BaseType' => '212161',
      'Name' => 'struct state_sensor_possible_states const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '212223' => {
      'BaseType' => '344',
      'Name' => 'bitfield8_t[1]',
      'Size' => '1',
      'Type' => 'Array'
    },
    '212592' => {
      'Header' => 'platform.h',
      'Line' => '754',
      'Memb' => {
        '0' => {
          'name' => 'value_u8',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'value_s8',
          'offset' => '0',
          'type' => '209476'
        },
        '2' => {
          'name' => 'value_u16',
          'offset' => '0',
          'type' => '5634'
        },
        '3' => {
          'name' => 'value_s16',
          'offset' => '0',
          'type' => '209488'
        },
        '4' => {
          'name' => 'value_u32',
          'offset' => '0',
          'type' => '147'
        },
        '5' => {
          'name' => 'value_s32',
          'offset' => '0',
          'type' => '209500'
        },
        '6' => {
          'name' => 'value_f32',
          'offset' => '0',
          'type' => '210117'
        }
      },
      'Name' => 'union union_range_field_format',
      'Size' => '4',
      'Type' => 'Union'
    },
    '213189' => {
      'Header' => 'platform.h',
      'Line' => '811',
      'Memb' => {
        '0' => {
          'name' => 'value_u8',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'value_s8',
          'offset' => '0',
          'type' => '209476'
        },
        '2' => {
          'name' => 'value_u16',
          'offset' => '0',
          'type' => '5634'
        },
        '3' => {
          'name' => 'value_s16',
          'offset' => '0',
          'type' => '209488'
        },
        '4' => {
          'name' => 'value_u32',
          'offset' => '0',
          'type' => '147'
        },
        '5' => {
          'name' => 'value_s32',
          'offset' => '0',
          'type' => '209500'
        }
      },
      'Name' => 'union union_sensor_data_size',
      'Size' => '4',
      'Type' => 'Union'
    },
    '213202' => {
      'Header' => 'platform.h',
      'Line' => '818',
      'Memb' => {
        '0' => {
          'name' => 'record_handle',
          'offset' => '0',
          'type' => '147'
        },
        '1' => {
          'name' => 'version',
          'offset' => '4',
          'type' => '135'
        },
        '2' => {
          'name' => 'type',
          'offset' => '5',
          'type' => '135'
        },
        '3' => {
          'name' => 'record_change_num',
          'offset' => '6',
          'type' => '5634'
        },
        '4' => {
          'name' => 'length',
          'offset' => '8',
          'type' => '5634'
        }
      },
      'Name' => 'struct pldm_value_pdr_hdr',
      'Size' => '12',
      'Type' => 'Struct'
    },
    '213287' => {
      'Header' => 'platform.h',
      'Line' => '836',
      'Memb' => {
        '0' => {
          'name' => 'entity_instance_num',
          'offset' => '0',
          'type' => '5634'
        },
        '1' => {
          'name' => 'entity_instance',
          'offset' => '0',
          'type' => '5634'
        }
      },
      'Name' => 'anon-union-platform.h-836',
      'Size' => '2',
      'Type' => 'Union'
    },
    '213322' => {
      'Header' => 'platform.h',
      'Line' => '831',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '213202'
        },
        '1' => {
          'name' => 'terminus_handle',
          'offset' => '18',
          'type' => '5634'
        },
        '2' => {
          'name' => 'sensor_id',
          'offset' => '20',
          'type' => '5634'
        },
        '3' => {
          'name' => 'entity_type',
          'offset' => '22',
          'type' => '5634'
        },
        '4' => {
          'name' => 'unnamed0',
          'offset' => '24',
          'type' => '213287'
        },
        '5' => {
          'name' => 'container_id',
          'offset' => '32',
          'type' => '5634'
        },
        '6' => {
          'name' => 'sensor_init',
          'offset' => '34',
          'type' => '135'
        },
        '7' => {
          'name' => 'sensor_auxiliary_names_pdr',
          'offset' => '35',
          'type' => '52326'
        },
        '8' => {
          'name' => 'base_unit',
          'offset' => '36',
          'type' => '135'
        },
        '9' => {
          'name' => 'unit_modifier',
          'offset' => '37',
          'type' => '209476'
        },
        '10' => {
          'name' => 'rate_unit',
          'offset' => '38',
          'type' => '135'
        },
        '11' => {
          'name' => 'base_oem_unit_handle',
          'offset' => '39',
          'type' => '135'
        },
        '12' => {
          'name' => 'aux_unit',
          'offset' => '40',
          'type' => '135'
        },
        '13' => {
          'name' => 'aux_unit_modifier',
          'offset' => '41',
          'type' => '209476'
        },
        '14' => {
          'name' => 'aux_rate_unit',
          'offset' => '48',
          'type' => '135'
        },
        '15' => {
          'name' => 'rel',
          'offset' => '49',
          'type' => '135'
        },
        '16' => {
          'name' => 'aux_oem_unit_handle',
          'offset' => '50',
          'type' => '135'
        },
        '17' => {
          'name' => 'is_linear',
          'offset' => '51',
          'type' => '52326'
        },
        '18' => {
          'name' => 'sensor_data_size',
          'offset' => '52',
          'type' => '135'
        },
        '19' => {
          'name' => 'resolution',
          'offset' => '54',
          'type' => '210117'
        },
        '20' => {
          'name' => 'offset',
          'offset' => '64',
          'type' => '210117'
        },
        '21' => {
          'name' => 'accuracy',
          'offset' => '68',
          'type' => '5634'
        },
        '22' => {
          'name' => 'plus_tolerance',
          'offset' => '70',
          'type' => '135'
        },
        '23' => {
          'name' => 'minus_tolerance',
          'offset' => '71',
          'type' => '135'
        },
        '24' => {
          'name' => 'hysteresis',
          'offset' => '72',
          'type' => '213189'
        },
        '25' => {
          'name' => 'supported_thresholds',
          'offset' => '82',
          'type' => '344'
        },
        '26' => {
          'name' => 'threshold_and_hysteresis_volatility',
          'offset' => '83',
          'type' => '344'
        },
        '27' => {
          'name' => 'state_transition_interval',
          'offset' => '86',
          'type' => '210117'
        },
        '28' => {
          'name' => 'update_interval',
          'offset' => '96',
          'type' => '210117'
        },
        '29' => {
          'name' => 'max_readable',
          'offset' => '100',
          'type' => '213189'
        },
        '30' => {
          'name' => 'min_readable',
          'offset' => '104',
          'type' => '213189'
        },
        '31' => {
          'name' => 'range_field_format',
          'offset' => '114',
          'type' => '135'
        },
        '32' => {
          'name' => 'range_field_support',
          'offset' => '115',
          'type' => '344'
        },
        '33' => {
          'name' => 'nominal_value',
          'offset' => '118',
          'type' => '212592'
        },
        '34' => {
          'name' => 'normal_max',
          'offset' => '128',
          'type' => '212592'
        },
        '35' => {
          'name' => 'normal_min',
          'offset' => '132',
          'type' => '212592'
        },
        '36' => {
          'name' => 'warning_high',
          'offset' => '136',
          'type' => '212592'
        },
        '37' => {
          'name' => 'warning_low',
          'offset' => '146',
          'type' => '212592'
        },
        '38' => {
          'name' => 'critical_high',
          'offset' => '150',
          'type' => '212592'
        },
        '39' => {
          'name' => 'critical_low',
          'offset' => '256',
          'type' => '212592'
        },
        '40' => {
          'name' => 'fatal_high',
          'offset' => '260',
          'type' => '212592'
        },
        '41' => {
          'name' => 'fatal_low',
          'offset' => '264',
          'type' => '212592'
        }
      },
      'Name' => 'struct pldm_numeric_sensor_value_pdr',
      'Size' => '112',
      'Type' => 'Struct'
    },
    '213915' => {
      'BaseType' => '210832',
      'Header' => 'platform.h',
      'Line' => '879',
      'Name' => 'pldm_utf16be',
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '213928' => {
      'Header' => 'platform.h',
      'Line' => '881',
      'Memb' => {
        '0' => {
          'name' => 'tag',
          'offset' => '0',
          'type' => '5605'
        },
        '1' => {
          'name' => 'name',
          'offset' => '8',
          'type' => '213970'
        }
      },
      'Name' => 'struct pldm_entity_auxiliary_name',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '213970' => {
      'BaseType' => '213915',
      'Name' => 'pldm_utf16be*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '213975' => {
      'Header' => 'platform.h',
      'Line' => '891',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '213202'
        },
        '1' => {
          'name' => 'container',
          'offset' => '18',
          'type' => '159841'
        },
        '2' => {
          'name' => 'shared_name_count',
          'offset' => '24',
          'type' => '135'
        },
        '3' => {
          'name' => 'name_string_count',
          'offset' => '25',
          'type' => '135'
        },
        '4' => {
          'name' => 'names',
          'offset' => '36',
          'type' => '214089'
        },
        '5' => {
          'name' => 'auxiliary_name_data_size',
          'offset' => '50',
          'type' => '164'
        },
        '6' => {
          'name' => 'auxiliary_name_data',
          'offset' => '64',
          'type' => '214094'
        }
      },
      'Name' => 'struct pldm_entity_auxiliary_names_pdr',
      'Size' => '40',
      'Type' => 'Struct'
    },
    '214089' => {
      'BaseType' => '213928',
      'Name' => 'struct pldm_entity_auxiliary_name*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '214094' => {
      'BaseType' => '46',
      'Name' => 'char[]',
      'Size' => '8',
      'Type' => 'Array'
    },
    '214109' => {
      'Header' => 'platform.h',
      'Line' => '921',
      'Memb' => {
        '0' => {
          'name' => 'state_set_id',
          'offset' => '0',
          'type' => '5634'
        },
        '1' => {
          'name' => 'possible_states_size',
          'offset' => '2',
          'type' => '135'
        },
        '2' => {
          'name' => 'states',
          'offset' => '3',
          'type' => '212223'
        }
      },
      'Name' => 'struct state_effecter_possible_states',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '214166' => {
      'BaseType' => '214109',
      'Name' => 'struct state_effecter_possible_states const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '214367' => {
      'Header' => 'platform.h',
      'Line' => '991',
      'Memb' => {
        '0' => {
          'name' => 'set_request',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'effecter_state',
          'offset' => '1',
          'type' => '135'
        }
      },
      'Name' => 'struct state_field_for_state_effecter_set',
      'Size' => '2',
      'Type' => 'Struct'
    },
    '214410' => {
      'BaseType' => '214367',
      'Header' => 'platform.h',
      'Line' => '994',
      'Name' => 'set_effecter_state_field',
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '214423' => {
      'Header' => 'platform.h',
      'Line' => '1000',
      'Memb' => {
        '0' => {
          'name' => 'sensor_op_state',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'present_state',
          'offset' => '1',
          'type' => '135'
        },
        '2' => {
          'name' => 'previous_state',
          'offset' => '2',
          'type' => '135'
        },
        '3' => {
          'name' => 'event_state',
          'offset' => '3',
          'type' => '135'
        }
      },
      'Name' => 'struct state_field_for_get_state_sensor_readings',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '214494' => {
      'BaseType' => '214423',
      'Header' => 'platform.h',
      'Line' => '1008',
      'Name' => 'get_sensor_state_field',
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '214507' => {
      'Header' => 'platform.h',
      'Line' => '1014',
      'Memb' => {
        '0' => {
          'name' => 'effecter_op_state',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'pending_state',
          'offset' => '1',
          'type' => '135'
        },
        '2' => {
          'name' => 'present_state',
          'offset' => '2',
          'type' => '135'
        }
      },
      'Name' => 'struct state_field_for_get_state_effecter_states',
      'Size' => '3',
      'Type' => 'Struct'
    },
    '214564' => {
      'BaseType' => '214507',
      'Header' => 'platform.h',
      'Line' => '1018',
      'Name' => 'get_effecter_state_field',
      'Size' => '3',
      'Type' => 'Typedef'
    },
    '215293' => {
      'Header' => 'platform.h',
      'Line' => '1163',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'comp_effecter_count',
          'offset' => '1',
          'type' => '135'
        },
        '2' => {
          'name' => 'field',
          'offset' => '2',
          'type' => '215350'
        }
      },
      'Name' => 'struct pldm_get_state_effecter_states_resp',
      'Size' => '26',
      'Type' => 'Struct'
    },
    '215350' => {
      'BaseType' => '214564',
      'Name' => 'get_effecter_state_field[8]',
      'Size' => '24',
      'Type' => 'Array'
    },
    '215366' => {
      'Header' => 'platform.h',
      'Line' => '1173',
      'Memb' => {
        '0' => {
          'name' => 'sensor_id',
          'offset' => '0',
          'type' => '5634'
        },
        '1' => {
          'name' => 'sensor_event_class_type',
          'offset' => '2',
          'type' => '135'
        },
        '2' => {
          'name' => 'event_class',
          'offset' => '3',
          'type' => '968'
        }
      },
      'Name' => 'struct pldm_sensor_event_data',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '215480' => {
      'Header' => 'platform.h',
      'Line' => '1213',
      'Memb' => {
        '0' => {
          'name' => 'format_version',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'event_id',
          'offset' => '2',
          'type' => '5634'
        },
        '2' => {
          'name' => 'data_transfer_handle',
          'offset' => '4',
          'type' => '147'
        }
      },
      'Name' => 'struct pldm_message_poll_event',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '215542' => {
      'Header' => 'platform.h',
      'Line' => '1223',
      'Memb' => {
        '0' => {
          'name' => 'format_version',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'format_type',
          'offset' => '1',
          'type' => '135'
        },
        '2' => {
          'name' => 'event_data_length',
          'offset' => '2',
          'type' => '5634'
        },
        '3' => {
          'name' => 'event_data',
          'offset' => '4',
          'type' => '215613'
        }
      },
      'Name' => 'struct pldm_platform_cper_event',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '215613' => {
      'BaseType' => '135',
      'Name' => 'uint8_t[]',
      'Size' => '8',
      'Type' => 'Array'
    },
    '215769' => {
      'Header' => 'platform.h',
      'Line' => '1283',
      'Memb' => {
        '0' => {
          'name' => 'event_data_format',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'number_of_change_records',
          'offset' => '1',
          'type' => '135'
        },
        '2' => {
          'name' => 'change_records',
          'offset' => '2',
          'type' => '968'
        }
      },
      'Name' => 'struct pldm_pdr_repository_chg_event_data',
      'Size' => '3',
      'Type' => 'Struct'
    },
    '224100' => {
      'BaseType' => '215542',
      'Name' => 'struct pldm_platform_cper_event*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '227565' => {
      'BaseType' => '213975',
      'Name' => 'struct pldm_entity_auxiliary_names_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '237085' => {
      'BaseType' => '215293',
      'Name' => 'struct pldm_get_state_effecter_states_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '283232' => {
      'BaseType' => '2671',
      'Name' => 'size_t*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '286191' => {
      'BaseType' => '215480',
      'Name' => 'struct pldm_message_poll_event*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '287623' => {
      'BaseType' => '287633',
      'Name' => 'uint32_t const*const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '287628' => {
      'BaseType' => '159',
      'Name' => 'uint32_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '287633' => {
      'BaseType' => '287628',
      'Name' => 'uint32_t const*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '287638' => {
      'BaseType' => '215769',
      'Name' => 'struct pldm_pdr_repository_chg_event_data*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '331339' => {
      'BaseType' => '213322',
      'Name' => 'struct pldm_numeric_sensor_value_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '353457' => {
      'BaseType' => '215366',
      'Name' => 'struct pldm_sensor_event_data*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '353462' => {
      'BaseType' => '353457',
      'Name' => 'struct pldm_sensor_event_data*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '357437' => {
      'BaseType' => '214494',
      'Name' => 'get_sensor_state_field*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '380892' => {
      'BaseType' => '214410',
      'Name' => 'set_effecter_state_field*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '381873' => {
      'BaseType' => '204675',
      'Name' => 'struct pldm_state_sensor_pdr*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '381878' => {
      'BaseType' => '212218',
      'Name' => 'struct state_sensor_possible_states const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '381883' => {
      'BaseType' => '381878',
      'Name' => 'struct state_sensor_possible_states const*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '382283' => {
      'BaseType' => '199718',
      'Name' => 'struct pldm_state_effecter_pdr*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '382288' => {
      'BaseType' => '214166',
      'Name' => 'struct state_effecter_possible_states const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '382293' => {
      'BaseType' => '382288',
      'Name' => 'struct state_effecter_possible_states const*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '385777' => {
      'Line' => '19',
      'Memb' => {
        '0' => {
          'name' => 'prev',
          'offset' => '0',
          'type' => '4815'
        },
        '1' => {
          'name' => 'allocations',
          'offset' => '4',
          'type' => '147'
        }
      },
      'Name' => 'struct pldm_tid_state',
      'PrivateABI' => 1,
      'Size' => '8',
      'Source' => 'instance-id.c',
      'Type' => 'Struct'
    },
    '385816' => {
      'Line' => '24',
      'Memb' => {
        '0' => {
          'name' => 'state',
          'offset' => '0',
          'type' => '385858'
        },
        '1' => {
          'name' => 'lock_db_fd',
          'offset' => '8264',
          'type' => '53'
        }
      },
      'Name' => 'struct pldm_instance_db',
      'PrivateABI' => 1,
      'Size' => '2052',
      'Source' => 'instance-id.c',
      'Type' => 'Struct'
    },
    '385858' => {
      'BaseType' => '385777',
      'Name' => 'struct pldm_tid_state[256]',
      'Size' => '2048',
      'Type' => 'Array'
    },
    '386414' => {
      'BaseType' => '385816',
      'Name' => 'struct pldm_instance_db*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '386801' => {
      'BaseType' => '4815',
      'Name' => 'pldm_instance_id_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '386977' => {
      'BaseType' => '386414',
      'Name' => 'struct pldm_instance_db**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '387685' => {
      'BaseType' => '60',
      'Header' => 'int-ll64.h',
      'Line' => '21',
      'Name' => '__u8',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '387697' => {
      'BaseType' => '67',
      'Header' => 'int-ll64.h',
      'Line' => '24',
      'Name' => '__u16',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '387934' => {
      'Header' => 'socket.h',
      'Line' => '5',
      'Memb' => {
        '0' => {
          'name' => 'size',
          'offset' => '0',
          'type' => '53'
        },
        '1' => {
          'name' => 'socket',
          'offset' => '4',
          'type' => '53'
        },
        '2' => {
          'name' => 'max_size',
          'offset' => '8',
          'type' => '53'
        }
      },
      'Name' => 'struct pldm_socket_sndbuf',
      'PrivateABI' => 1,
      'Size' => '12',
      'Type' => 'Struct'
    },
    '387987' => {
      'BaseType' => '135',
      'Header' => 'pldm.h',
      'Line' => '13',
      'Name' => 'mctp_eid_t',
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '388101' => {
      'BaseType' => '4912',
      'Header' => 'pldm.h',
      'Line' => '30',
      'Name' => 'pldm_requester_rc_t',
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '388113' => {
      'Header' => 'transport.h',
      'Line' => '18',
      'Memb' => {
        '0' => {
          'name' => 'name',
          'offset' => '0',
          'type' => '8959'
        },
        '1' => {
          'name' => 'version',
          'offset' => '8',
          'type' => '135'
        },
        '2' => {
          'name' => 'recv',
          'offset' => '22',
          'type' => '388247'
        },
        '3' => {
          'name' => 'send',
          'offset' => '36',
          'type' => '388288'
        },
        '4' => {
          'name' => 'init_pollfd',
          'offset' => '50',
          'type' => '388369'
        }
      },
      'Name' => 'struct pldm_transport',
      'PrivateABI' => 1,
      'Size' => '40',
      'Type' => 'Struct'
    },
    '388227' => {
      'BaseType' => '388113',
      'Name' => 'struct pldm_transport*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '388232' => {
      'BaseType' => '4803',
      'Name' => 'pldm_tid_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '388247' => {
      'Name' => 'pldm_requester_rc_t(*)(struct pldm_transport*, pldm_tid_t*, void**, size_t*)',
      'Param' => {
        '0' => {
          'type' => '388227'
        },
        '1' => {
          'type' => '388232'
        },
        '2' => {
          'type' => '21335'
        },
        '3' => {
          'type' => '2671'
        }
      },
      'Return' => '388101',
      'Size' => '8',
      'Type' => 'FuncPtr'
    },
    '388288' => {
      'Name' => 'pldm_requester_rc_t(*)(struct pldm_transport*, pldm_tid_t, void const*, size_t)',
      'Param' => {
        '0' => {
          'type' => '388227'
        },
        '1' => {
          'type' => '4803'
        },
        '2' => {
          'type' => '1231'
        },
        '3' => {
          'type' => '164'
        }
      },
      'Return' => '388101',
      'Size' => '8',
      'Type' => 'FuncPtr'
    },
    '388313' => {
      'BaseType' => '388318',
      'Name' => 'struct pollfd*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '388318' => {
      'Header' => 'poll.h',
      'Line' => '36',
      'Memb' => {
        '0' => {
          'name' => 'fd',
          'offset' => '0',
          'type' => '53'
        },
        '1' => {
          'name' => 'events',
          'offset' => '4',
          'type' => '107'
        },
        '2' => {
          'name' => 'revents',
          'offset' => '6',
          'type' => '107'
        }
      },
      'Name' => 'struct pollfd',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Struct'
    },
    '388369' => {
      'Name' => 'int(*)(struct pldm_transport*, struct pollfd*)',
      'Param' => {
        '0' => {
          'type' => '388227'
        },
        '1' => {
          'type' => '388313'
        }
      },
      'Return' => '53',
      'Size' => '8',
      'Type' => 'FuncPtr'
    },
    '388374' => {
      'BaseType' => '67',
      'Header' => 'socket.h',
      'Line' => '10',
      'Name' => '__kernel_sa_family_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '388740' => {
      'Header' => 'mctp.h',
      'Line' => '18',
      'Memb' => {
        '0' => {
          'name' => 's_addr',
          'offset' => '0',
          'type' => '387987'
        }
      },
      'Name' => 'struct mctp_addr',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Struct'
    },
    '388767' => {
      'Header' => 'mctp.h',
      'Line' => '22',
      'Memb' => {
        '0' => {
          'name' => 'smctp_family',
          'offset' => '0',
          'type' => '388374'
        },
        '1' => {
          'name' => '__smctp_pad0',
          'offset' => '2',
          'type' => '387697'
        },
        '2' => {
          'name' => 'smctp_network',
          'offset' => '4',
          'type' => '74'
        },
        '3' => {
          'name' => 'smctp_addr',
          'offset' => '8',
          'type' => '388740'
        },
        '4' => {
          'name' => 'smctp_type',
          'offset' => '9',
          'type' => '387685'
        },
        '5' => {
          'name' => 'smctp_tag',
          'offset' => '16',
          'type' => '387685'
        },
        '6' => {
          'name' => '__smctp_pad1',
          'offset' => '17',
          'type' => '387685'
        }
      },
      'Name' => 'struct sockaddr_mctp',
      'PrivateABI' => 1,
      'Size' => '12',
      'Type' => 'Struct'
    },
    '388872' => {
      'BaseType' => '388767',
      'Name' => 'struct sockaddr_mctp const',
      'Size' => '12',
      'Type' => 'Const'
    },
    '388916' => {
      'Line' => '35',
      'Memb' => {
        '0' => {
          'name' => 'transport',
          'offset' => '0',
          'type' => '388113'
        },
        '1' => {
          'name' => 'socket',
          'offset' => '64',
          'type' => '53'
        },
        '2' => {
          'name' => 'tid_eid_map',
          'offset' => '68',
          'type' => '389009'
        },
        '3' => {
          'name' => 'socket_send_buf',
          'offset' => '768',
          'type' => '387934'
        },
        '4' => {
          'name' => 'bound',
          'offset' => '786',
          'type' => '5433'
        },
        '5' => {
          'name' => 'cookie_jar',
          'offset' => '800',
          'type' => '4827'
        }
      },
      'Name' => 'struct pldm_transport_af_mctp',
      'PrivateABI' => 1,
      'Size' => '336',
      'Source' => 'af-mctp.c',
      'Type' => 'Struct'
    },
    '389009' => {
      'BaseType' => '4803',
      'Name' => 'pldm_tid_t[256]',
      'Size' => '256',
      'Type' => 'Array'
    },
    '389810' => {
      'BaseType' => '388916',
      'Name' => 'struct pldm_transport_af_mctp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '389815' => {
      'BaseType' => '388872',
      'Name' => 'struct sockaddr_mctp const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '390128' => {
      'BaseType' => '389810',
      'Name' => 'struct pldm_transport_af_mctp**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '393238' => {
      'Line' => '26',
      'Memb' => {
        '0' => {
          'name' => 'transport',
          'offset' => '0',
          'type' => '388113'
        },
        '1' => {
          'name' => 'socket',
          'offset' => '64',
          'type' => '53'
        },
        '2' => {
          'name' => 'tid_eid_map',
          'offset' => '68',
          'type' => '389009'
        },
        '3' => {
          'name' => 'socket_send_buf',
          'offset' => '768',
          'type' => '387934'
        }
      },
      'Name' => 'struct pldm_transport_mctp_demux',
      'PrivateABI' => 1,
      'Size' => '312',
      'Source' => 'mctp-demux.c',
      'Type' => 'Struct'
    },
    '393843' => {
      'BaseType' => '393238',
      'Name' => 'struct pldm_transport_mctp_demux*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '394349' => {
      'BaseType' => '393843',
      'Name' => 'struct pldm_transport_mctp_demux**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '416883' => {
      'Header' => 'file_io.h',
      'Line' => '32',
      'Memb' => {
        '0' => {
          'name' => 'handle',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'length',
          'offset' => '4',
          'type' => '147'
        },
        '2' => {
          'name' => 'data',
          'offset' => '8',
          'type' => '215613'
        }
      },
      'Name' => 'struct pldm_oem_meta_file_io_write_req',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '416950' => {
      'Header' => 'file_io.h',
      'Line' => '45',
      'Memb' => {
        '0' => {
          'name' => 'transferFlag',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'offset',
          'offset' => '2',
          'type' => '5634'
        }
      },
      'Name' => 'struct pldm_oem_meta_file_io_read_data_info',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '416989' => {
      'Header' => 'file_io.h',
      'Line' => '55',
      'Memb' => {
        '0' => {
          'name' => 'size',
          'offset' => '0',
          'type' => '5634'
        },
        '1' => {
          'name' => 'crc32',
          'offset' => '4',
          'type' => '147'
        }
      },
      'Name' => 'struct pldm_oem_meta_file_io_read_attr_info',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '417028' => {
      'Header' => 'file_io.h',
      'Line' => '70',
      'Memb' => {
        '0' => {
          'name' => 'data',
          'offset' => '0',
          'type' => '416950'
        }
      },
      'Name' => 'anon-union-file_io.h-70',
      'Size' => '4',
      'Type' => 'Union'
    },
    '417046' => {
      'Header' => 'file_io.h',
      'Line' => '65',
      'Memb' => {
        '0' => {
          'name' => 'version',
          'offset' => '0',
          'type' => '164'
        },
        '1' => {
          'name' => 'handle',
          'offset' => '8',
          'type' => '135'
        },
        '2' => {
          'name' => 'option',
          'offset' => '9',
          'type' => '135'
        },
        '3' => {
          'name' => 'length',
          'offset' => '16',
          'type' => '135'
        },
        '4' => {
          'name' => 'info',
          'offset' => '18',
          'type' => '417028'
        }
      },
      'Name' => 'struct pldm_oem_meta_file_io_read_req',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '417124' => {
      'Header' => 'file_io.h',
      'Line' => '86',
      'Memb' => {
        '0' => {
          'name' => 'attr',
          'offset' => '0',
          'type' => '416989'
        },
        '1' => {
          'name' => 'data',
          'offset' => '0',
          'type' => '416950'
        }
      },
      'Name' => 'anon-union-file_io.h-86',
      'Size' => '8',
      'Type' => 'Union'
    },
    '417152' => {
      'Header' => 'file_io.h',
      'Line' => '80',
      'Memb' => {
        '0' => {
          'name' => 'version',
          'offset' => '0',
          'type' => '164'
        },
        '1' => {
          'name' => 'completion_code',
          'offset' => '8',
          'type' => '135'
        },
        '2' => {
          'name' => 'handle',
          'offset' => '9',
          'type' => '135'
        },
        '3' => {
          'name' => 'option',
          'offset' => '16',
          'type' => '135'
        },
        '4' => {
          'name' => 'length',
          'offset' => '17',
          'type' => '135'
        },
        '5' => {
          'name' => 'info',
          'offset' => '18',
          'type' => '417124'
        },
        '6' => {
          'name' => 'data',
          'offset' => '32',
          'type' => '215613'
        }
      },
      'Name' => 'struct pldm_oem_meta_file_io_read_resp',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '421136' => {
      'BaseType' => '417152',
      'Name' => 'struct pldm_oem_meta_file_io_read_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '423394' => {
      'BaseType' => '417046',
      'Name' => 'struct pldm_oem_meta_file_io_read_req*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '423830' => {
      'BaseType' => '416883',
      'Name' => 'struct pldm_oem_meta_file_io_write_req*',
      'Size' => '8',
      'Type' => 'Pointer'
    }
  },
  'UndefinedSymbols' => {
    'libpldm.so.0.12.0' => {
      '_ITM_deregisterTMCloneTable' => 0,
      '_ITM_registerTMCloneTable' => 0,
      '__assert_fail@GLIBC_2.2.5' => 0,
      '__cxa_finalize@GLIBC_2.2.5' => 0,
      '__errno_location@GLIBC_2.2.5' => 0,
      '__fprintf_chk@GLIBC_2.3.4' => 0,
      '__gmon_start__' => 0,
      '__isoc23_strtol@GLIBC_2.38' => 0,
      '__memcpy_chk@GLIBC_2.3.4' => 0,
      '__printf_chk@GLIBC_2.3.4' => 0,
      '__recv_chk@GLIBC_2.4' => 0,
      '__recvfrom_chk@GLIBC_2.4' => 0,
      '__stack_chk_fail@GLIBC_2.4' => 0,
      'bind@GLIBC_2.2.5' => 0,
      'calloc@GLIBC_2.2.5' => 0,
      'clock_gettime@GLIBC_2.17' => 0,
      'close@GLIBC_2.2.5' => 0,
      'connect@GLIBC_2.2.5' => 0,
      'dup@GLIBC_2.2.5' => 0,
      'fclose@GLIBC_2.2.5' => 0,
      'fcntl64@GLIBC_2.28' => 0,
      'fgets@GLIBC_2.2.5' => 0,
      'fopen64@GLIBC_2.2.5' => 0,
      'free@GLIBC_2.2.5' => 0,
      'getsockopt@GLIBC_2.2.5' => 0,
      'malloc@GLIBC_2.2.5' => 0,
      'memcmp@GLIBC_2.2.5' => 0,
      'memcpy@GLIBC_2.14' => 0,
      'memmem@GLIBC_2.2.5' => 0,
      'open64@GLIBC_2.2.5' => 0,
      'poll@GLIBC_2.2.5' => 0,
      'ppoll@GLIBC_2.4' => 0,
      'recv@GLIBC_2.2.5' => 0,
      'recvmsg@GLIBC_2.2.5' => 0,
      'sendmsg@GLIBC_2.2.5' => 0,
      'sendto@GLIBC_2.2.5' => 0,
      'setsockopt@GLIBC_2.2.5' => 0,
      'socket@GLIBC_2.2.5' => 0,
      'stat64@GLIBC_2.33' => 0,
      'stderr@GLIBC_2.2.5' => 0,
      'strlen@GLIBC_2.2.5' => 0,
      'strnlen@GLIBC_2.2.5' => 0,
      'timerfd_create@GLIBC_2.8' => 0,
      'timerfd_settime@GLIBC_2.8' => 0,
      'write@GLIBC_2.2.5' => 0
    }
  },
  'WordSize' => '8'
};
