$VAR1 = {
  'ABI_DUMPER_VERSION' => '1.2',
  'ABI_DUMP_VERSION' => '3.5',
  'Arch' => 'x86_64',
  'GccVersion' => '14.2.0',
  'Headers' => {
    'af-mctp.h' => 1,
    'base.h' => 1,
    'bios.h' => 1,
    'bios_table.h' => 1,
    'file_io.h' => 1,
    'firmware_update.h' => 1,
    'fru.h' => 1,
    'host.h' => 1,
    'instance-id.h' => 1,
    'mctp-demux.h' => 1,
    'pdr.h' => 1,
    'platform.h' => 1,
    'pldm.h' => 1,
    'pldm_types.h' => 1,
    'transport.h' => 1,
    'utils.h' => 1
  },
  'Language' => 'C',
  'LibraryName' => 'libpldm.so.0.11.0',
  'LibraryVersion' => '0.11.0',
  'NameSpaces' => {},
  'Needed' => {
    'libc.so.6' => 1
  },
  'PublicABI' => '1',
  'Sources' => {
    'af-mctp.c' => 1,
    'bios_table.c' => 1,
    'instance-id.c' => 1,
    'mctp-demux.c' => 1,
    'pdr.c' => 1
  },
  'SymbolInfo' => {
    '1401' => {
      'Header' => 'base.h',
      'Line' => '644',
      'Param' => {
        '0' => {
          'name' => 'instance_id',
          'type' => '135'
        },
        '1' => {
          'name' => 'type',
          'type' => '135'
        },
        '2' => {
          'name' => 'command',
          'type' => '135'
        },
        '3' => {
          'name' => 'cc',
          'type' => '135'
        },
        '4' => {
          'name' => 'msg',
          'type' => '1443'
        }
      },
      'Return' => '100',
      'ShortName' => 'encode_cc_only_resp'
    },
    '1448' => {
      'Header' => 'base.h',
      'Line' => '536',

      'pldm_entity_association_pdr_add_from_node' => 1,
      'pldm_entity_association_pdr_add_from_node_with_record_handle' => 1,
      'pldm_entity_association_pdr_extract' => 1,
      'pldm_entity_association_tree_add' => 1,
      'pldm_entity_association_tree_add_entity' => 1,
      'pldm_entity_association_tree_copy_root' => 1,
      'pldm_entity_association_tree_destroy' => 1,
      'pldm_entity_association_tree_destroy_root' => 1,
      'pldm_entity_association_tree_find' => 1,
      'pldm_entity_association_tree_find_with_locality' => 1,
      'pldm_entity_association_tree_init' => 1,
      'pldm_entity_association_tree_visit' => 1,
      'pldm_entity_extract' => 1,
      'pldm_entity_get_num_children' => 1,
      'pldm_entity_get_parent' => 1,
      'pldm_entity_is_exist_parent' => 1,
      'pldm_entity_is_node_parent' => 1,
      'pldm_entity_node_get_remote_container_id' => 1,
      'pldm_find_entity_ref_in_tree' => 1,
      'pldm_instance_db_destroy' => 1,
      'pldm_instance_db_init' => 1,
      'pldm_instance_db_init_default' => 1,
      'pldm_instance_id_alloc' => 1,
      'pldm_instance_id_free' => 1,
      'pldm_is_current_parent_child' => 1,
      'pldm_is_empty_entity_assoc_tree' => 1,
      'pldm_msg_hdr_correlate_response' => 1,
      'pldm_oem_meta_file_io_read_resp_data' => 1,
      'pldm_oem_meta_file_io_write_req_data' => 1,
      'pldm_open' => 1,
      'pldm_pdr_add' => 1,
      'pldm_pdr_add_fru_record_set' => 1,
      'pldm_pdr_destroy' => 1,
      'pldm_pdr_find_last_in_range' => 1,
      'pldm_pdr_find_record' => 1,
      'pldm_pdr_find_record_by_type' => 1,
      'pldm_pdr_fru_record_set_find_by_rsi' => 1,
      'pldm_pdr_get_next_record' => 1,
      'pldm_pdr_get_record_count' => 1,
      'pldm_pdr_get_record_handle' => 1,
      'pldm_pdr_get_repo_size' => 1,
      'pldm_pdr_init' => 1,
      'pldm_pdr_record_is_remote' => 1,
      'pldm_pdr_remove_pdrs_by_terminus_handle' => 1,
      'pldm_pdr_remove_remote_pdrs' => 1,
      'pldm_pdr_update_TL_pdr' => 1,
      'pldm_platform_cper_event_event_data' => 1,
      'pldm_recv' => 1,
      'pldm_recv_any' => 1,
      'pldm_send' => 1,
      'pldm_send_recv' => 1,
      'pldm_transport_af_mctp_bind' => 1,
      'pldm_transport_af_mctp_core' => 1,
      'pldm_transport_af_mctp_destroy' => 1,
      'pldm_transport_af_mctp_init' => 1,
      'pldm_transport_af_mctp_init_pollfd' => 1,
      'pldm_transport_af_mctp_map_tid' => 1,
      'pldm_transport_af_mctp_unmap_tid' => 1,
      'pldm_transport_mctp_demux_core' => 1,
      'pldm_transport_mctp_demux_destroy' => 1,
      'pldm_transport_mctp_demux_init' => 1,
      'pldm_transport_mctp_demux_init_pollfd' => 1,
      'pldm_transport_mctp_demux_map_tid' => 1,
      'pldm_transport_mctp_demux_unmap_tid' => 1,
      'pldm_transport_poll' => 1,
      'pldm_transport_recv_msg' => 1,
      'pldm_transport_send_msg' => 1,
      'pldm_transport_send_recv_msg' => 1,
      'unpack_pldm_header' => 1,
      'ver2str' => 1
    }
  },
  'Target' => 'unix',
  'TypeInfo' => {
    '1' => {
      'Name' => 'void',
      'Type' => 'Intrinsic'
    },
    '46' => {
      'Name' => 'unsigned char',
      'Size' => '1',
      'Type' => 'Intrinsic'
    },
    '53' => {
      'Name' => 'unsigned short',
      'Size' => '2',
      'Type' => 'Intrinsic'
    },
    '60' => {
      'Name' => 'unsigned int',
      'Size' => '4',
      'Type' => 'Intrinsic'
    },
    '67' => {
      'Name' => 'unsigned long',
      'Size' => '8',
      'Type' => 'Intrinsic'
    },
    '74' => {
      'Name' => 'signed char',
      'Size' => '1',
      'Type' => 'Intrinsic'
    },
    '81' => {
      'BaseType' => '46',
      'Header' => 'types.h',
      'Line' => '38',
      'Name' => '__uint8_t',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '93' => {
      'Name' => 'short',
      'Size' => '2',
      'Type' => 'Intrinsic'
    },
    '100' => {
      'Name' => 'int',
      'Size' => '4',
      'Type' => 'Intrinsic'
    },
    '107' => {
      'BaseType' => '60',
      'Header' => 'types.h',
      'Line' => '42',
      'Name' => '__uint32_t',
      'PrivateABI' => 1,
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '119' => {
      'Name' => 'long',
      'Size' => '8',
      'Type' => 'Intrinsic'
    },
    '126' => {
      'BaseType' => '1',
      'Name' => 'void*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '128' => {
      'Name' => 'char',
      'Size' => '1',
      'Type' => 'Intrinsic'
    },
    '135' => {
      'BaseType' => '81',
      'Header' => 'stdint-uintn.h',
      'Line' => '24',
      'Name' => 'uint8_t',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '147' => {
      'BaseType' => '107',
      'Header' => 'stdint-uintn.h',
      'Line' => '26',
      'Name' => 'uint32_t',
      'PrivateABI' => 1,
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '159' => {
      'BaseType' => '147',
      'Name' => 'uint32_t const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '164' => {
      'BaseType' => '67',
      'Header' => 'stddef.h',
      'Line' => '214',
      'Name' => 'size_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '190' => {
      'Header' => 'pldm_types.h',
      'Line' => '9',
      'Name' => 'anon-struct-pldm_types.h-9',
      'Size' => '1',
      'Type' => 'Struct'
    },
    '344' => {
      'Header' => 'pldm_types.h',
      'Line' => '19',
      'Memb' => {
        '0' => {
          'name' => 'byte',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'bits',
          'offset' => '0',
          'type' => '190'
        }
      },
      'Name' => 'union bitfield8_t',
      'Size' => '1',
      'Type' => 'Union'
    },
    '356' => {
      'BaseType' => '344',
      'Name' => 'bitfield8_t const',
      'Size' => '1',
      'Type' => 'Const'
    },
    '361' => {
      'Header' => 'pldm_types.h',
      'Line' => '25',
      'Memb' => {
        '0' => {
          'name' => 'alpha',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'update',
          'offset' => '1',
          'type' => '135'
        },
        '2' => {
          'name' => 'minor',
          'offset' => '2',
          'type' => '135'
        },
        '3' => {
          'name' => 'major',
          'offset' => '3',
          'type' => '135'
        }
      },
      'Name' => 'struct pldm_version',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '427' => {
      'BaseType' => '361',
      'Header' => 'pldm_types.h',
      'Line' => '30',
      'Name' => 'ver32_t',
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '439' => {
      'BaseType' => '427',
      'Name' => 'ver32_t const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '444' => {
      'Name' => 'float',
      'Size' => '4',
      'Type' => 'Intrinsic'
    },
    '789' => {
      'Header' => 'base.h',
      'Line' => '97',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_RESPONSE',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_REQUEST',
          'value' => '1'
        },
        '2' => {
          'name' => 'PLDM_RESERVED',
          'value' => '2'
        },
        '3' => {
          'name' => 'PLDM_ASYNC_REQUEST_NOTIFY',
          'value' => '3'
        }
      },
      'Name' => 'enum MessageType',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '801' => {
      'Header' => 'base.h',
      'Line' => '145',
      'Memb' => {
        '0' => {
          'name' => 'command',
          'offset' => '2',
          'type' => '135'
        }
      },
      'Name' => 'struct pldm_msg_hdr',
      'Size' => '3',
      'Type' => 'Struct'
    },
    '912' => {
      'BaseType' => '801',
      'Name' => 'struct pldm_msg_hdr const',
      'Size' => '3',
      'Type' => 'Const'
    },
    '917' => {
      'Header' => 'base.h',
      'Line' => '178',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '801'
        },
        '1' => {
          'name' => 'payload',
          'offset' => '3',
          'type' => '962'
        }
      },
      'Name' => 'struct pldm_msg',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '957' => {
      'BaseType' => '917',
      'Name' => 'struct pldm_msg const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '962' => {
      'BaseType' => '135',
      'Name' => 'uint8_t[1]',
      'Size' => '1',
      'Type' => 'Array'
    },
    '978' => {
      'Header' => 'base.h',
      'Line' => '245',
      'Memb' => {
        '0' => {
          'name' => 'msg_type',
          'offset' => '0',
          'type' => '789'
        },
        '1' => {
          'name' => 'instance',
          'offset' => '4',
          'type' => '135'
        },
        '2' => {
          'name' => 'pldm_type',
          'offset' => '5',
          'type' => '135'
        },
        '3' => {
          'name' => 'command',
          'offset' => '6',
          'type' => '135'
        },
        '4' => {
          'name' => 'completion_code',
          'offset' => '7',
          'type' => '135'
        }
      },
      'Name' => 'struct pldm_header_info',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '1057' => {
      'BaseType' => '978',
      'Name' => 'struct pldm_header_info const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '1186' => {
      'BaseType' => '135',
      'Name' => 'uint8_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '1262' => {
      'BaseType' => '1267',
      'Name' => 'void const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '1267' => {
      'BaseType' => '1',
      'Name' => 'void const',
      'Type' => 'Const'
    },
    '1268' => {
      'BaseType' => '356',
      'Name' => 'bitfield8_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '1443' => {
      'BaseType' => '917',
      'Name' => 'struct pldm_msg*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '1522' => {
      'BaseType' => '957',
      'Name' => 'struct pldm_msg const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '1527' => {
      'BaseType' => '427',
      'Name' => 'ver32_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '1621' => {
      'BaseType' => '439',
      'Name' => 'ver32_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '1668' => {
      'BaseType' => '147',
      'Name' => 'uint32_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '1737' => {
      'BaseType' => '912',
      'Name' => 'struct pldm_msg_hdr const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '1742' => {
      'BaseType' => '978',
      'Name' => 'struct pldm_header_info*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2697' => {
      'BaseType' => '164',
      'Name' => 'size_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '3157' => {
      'BaseType' => '1057',
      'Name' => 'struct pldm_header_info const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '4829' => {
      'BaseType' => '135',
      'Header' => 'base.h',
      'Line' => '17',
      'Name' => 'pldm_tid_t',
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '4841' => {
      'BaseType' => '135',
      'Header' => 'instance-id.h',
      'Line' => '13',
      'Name' => 'pldm_instance_id_t',
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '4853' => {
      'Header' => 'responder.h',
      'Line' => '10',
      'Memb' => {
        '0' => {
          'name' => 'tid',
          'offset' => '0',
          'type' => '4829'
        },
        '1' => {
          'name' => 'instance_id',
          'offset' => '1',
          'type' => '4841'
        },
        '2' => {
          'name' => 'type',
          'offset' => '2',
          'type' => '135'
        },
        '3' => {
          'name' => 'command',
          'offset' => '3',
          'type' => '135'
        },
        '4' => {
          'name' => 'next',
          'offset' => '8',
          'type' => '4933'
        }
      },
      'Name' => 'struct pldm_responder_cookie',
      'PrivateABI' => 1,
      'Size' => '16',
      'Type' => 'Struct'
    },
    '4933' => {
      'BaseType' => '4853',
      'Name' => 'struct pldm_responder_cookie*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '4938' => {
      'Header' => 'pldm.h',
      'Line' => '15',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_REQUESTER_SUCCESS',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_REQUESTER_OPEN_FAIL',
          'value' => '18446744073709551615 (-1)'
        },
        '2' => {
          'name' => 'PLDM_REQUESTER_NOT_PLDM_MSG',
          'value' => '18446744073709551614 (-2)'
        },
        '3' => {
          'name' => 'PLDM_REQUESTER_NOT_RESP_MSG',
          'value' => '18446744073709551613 (-3)'
        },
        '4' => {
          'name' => 'PLDM_REQUESTER_NOT_REQ_MSG',
          'value' => '18446744073709551612 (-4)'
        },
        '5' => {
          'name' => 'PLDM_REQUESTER_RESP_MSG_TOO_SMALL',
          'value' => '18446744073709551611 (-5)'
        },
        '6' => {
          'name' => 'PLDM_REQUESTER_INSTANCE_ID_MISMATCH',
          'value' => '18446744073709551610 (-6)'
        },
        '7' => {
          'name' => 'PLDM_REQUESTER_SEND_FAIL',
          'value' => '18446744073709551609 (-7)'
        },
        '8' => {
          'name' => 'PLDM_REQUESTER_RECV_FAIL',
          'value' => '18446744073709551608 (-8)'
        },
        '9' => {
          'name' => 'PLDM_REQUESTER_INVALID_RECV_LEN',
          'value' => '18446744073709551607 (-9)'
        },
        '10' => {
          'name' => 'PLDM_REQUESTER_SETUP_FAIL',
          'value' => '18446744073709551606 (-10)'
        },
        '11' => {
          'name' => 'PLDM_REQUESTER_INVALID_SETUP',
          'value' => '18446744073709551605 (-11)'
        },
        '12' => {
          'name' => 'PLDM_REQUESTER_POLL_FAIL',
          'value' => '18446744073709551604 (-12)'
        },
        '13' => {
          'name' => 'PLDM_REQUESTER_TRANSPORT_BUSY',
          'value' => '18446744073709551603 (-13)'
        }
      },
      'Name' => 'enum pldm_requester_error_codes',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '5459' => {
      'Name' => '_Bool',
      'Size' => '1',
      'Type' => 'Intrinsic'
    },
    '5581' => {
      'BaseType' => '53',
      'Header' => 'types.h',
      'Line' => '40',
      'Name' => '__uint16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '5619' => {
      'BaseType' => '119',
      'Header' => 'types.h',
      'Line' => '194',
      'Name' => '__ssize_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '5631' => {
      'BaseType' => '128',
      'Name' => 'char*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '5655' => {
      'BaseType' => '135',
      'Name' => 'uint8_t const',
      'Size' => '1',
      'Type' => 'Const'
    },
    '5660' => {
      'BaseType' => '5581',
      'Header' => 'stdint-uintn.h',
      'Line' => '25',
      'Name' => 'uint16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '5856' => {
      'BaseType' => '5619',
      'Header' => 'types.h',
      'Line' => '108',
      'Name' => 'ssize_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '5868' => {
      'BaseType' => '5655',
      'Name' => 'uint8_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '7302' => {
      'BaseType' => '128',
      'Name' => 'char const',
      'Size' => '1',
      'Type' => 'Const'
    },
    '8652' => {
      'BaseType' => '7302',
      'Name' => 'char const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '11406' => {
      'BaseType' => '344',
      'Name' => 'bitfield8_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '13168' => {
      'BaseType' => '801',
      'Name' => 'struct pldm_msg_hdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '15038' => {
      'Header' => 'utils.h',
      'Line' => '20',
      'Memb' => {
        '0' => {
          'name' => 'ptr',
          'offset' => '0',
          'type' => '5868'
        },
        '1' => {
          'name' => 'length',
          'offset' => '8',
          'type' => '164'
        }
      },
      'Name' => 'struct variable_field',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '15434' => {
      'BaseType' => '15038',
      'Name' => 'struct variable_field*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '17516' => {
      'BaseType' => '5660',
      'Name' => 'uint16_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '20755' => {
      'BaseType' => '67',
      'Header' => 'types.h',
      'Line' => '45',
      'Name' => '__uint64_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '20832' => {
      'BaseType' => '5660',
      'Name' => 'uint16_t const',
      'Size' => '2',
      'Type' => 'Const'
    },
    '20849' => {
      'BaseType' => '20755',
      'Header' => 'stdint-uintn.h',
      'Line' => '27',
      'Name' => 'uint64_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '21007' => {
      'Header' => 'bios.h',
      'Line' => '39',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_BIOS_STRING_TABLE',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_BIOS_ATTR_TABLE',
          'value' => '1'
        },
        '2' => {
          'name' => 'PLDM_BIOS_ATTR_VAL_TABLE',
          'value' => '2'
        }
      },
      'Name' => 'enum pldm_bios_table_types',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '21041' => {
      'Header' => 'bios.h',
      'Line' => '48',
      'Memb' => {
        '0' => {
          'name' => 'string_handle',
          'offset' => '0',
          'type' => '5660'
        },
        '1' => {
          'name' => 'string_length',
          'offset' => '2',
          'type' => '5660'
        },
        '2' => {
          'name' => 'name',
          'offset' => '4',
          'type' => '21098'
        }
      },
      'Name' => 'struct pldm_bios_string_table_entry',
      'Size' => '5',
      'Type' => 'Struct'
    },
    '21093' => {
      'BaseType' => '21041',
      'Name' => 'struct pldm_bios_string_table_entry const',
      'Size' => '5',
      'Type' => 'Const'
    },
    '21098' => {
      'BaseType' => '128',
      'Name' => 'char[1]',
      'Size' => '1',
      'Type' => 'Array'
    },
    '21114' => {
      'Header' => 'bios.h',
      'Line' => '54',
      'Memb' => {
        '0' => {
          'name' => 'attr_handle',
          'offset' => '0',
          'type' => '5660'
        },
        '1' => {
          'name' => 'attr_type',
          'offset' => '2',
          'type' => '135'
        },
        '2' => {
          'name' => 'string_handle',
          'offset' => '3',
          'type' => '5660'
        },
        '3' => {
          'name' => 'metadata',
          'offset' => '5',
          'type' => '962'
        }
      },
      'Name' => 'struct pldm_bios_attr_table_entry',
      'Size' => '6',
      'Type' => 'Struct'
    },
    '21179' => {
      'BaseType' => '21114',
      'Name' => 'struct pldm_bios_attr_table_entry const',
      'Size' => '6',
      'Type' => 'Const'
    },
    '21184' => {
      'Header' => 'bios.h',
      'Line' => '66',
      'Memb' => {
        '0' => {
          'name' => 'attr_handle',
          'offset' => '0',
          'type' => '5660'
        },
        '1' => {
          'name' => 'attr_type',
          'offset' => '2',
          'type' => '135'
        },
        '2' => {
          'name' => 'value',
          'offset' => '3',
          'type' => '962'
        }
      },
      'Name' => 'struct pldm_bios_attr_val_table_entry',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '21236' => {
      'BaseType' => '21184',
      'Name' => 'struct pldm_bios_attr_val_table_entry const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '21305' => {
      'Header' => 'bios_table.h',
      'Line' => '206',
      'Memb' => {
        '0' => {
          'name' => 'name_handle',
          'offset' => '0',
          'type' => '5660'
        },
        '1' => {
          'name' => 'read_only',
          'offset' => '2',
          'type' => '5459'
        },
        '2' => {
          'name' => 'pv_num',
          'offset' => '3',
          'type' => '135'
        },
        '3' => {
          'name' => 'pv_handle',
          'offset' => '8',
          'type' => '21408'
        },
        '4' => {
          'name' => 'def_num',
          'offset' => '22',
          'type' => '135'
        },
        '5' => {
          'name' => 'def_index',
          'offset' => '36',
          'type' => '5868'
        }
      },
      'Name' => 'struct pldm_bios_table_attr_entry_enum_info',
      'Size' => '32',
      'Type' => 'Struct'
    },
    '21396' => {
      'BaseType' => '21305',
      'Name' => 'struct pldm_bios_table_attr_entry_enum_info const',
      'Size' => '32',
      'Type' => 'Const'
    },
    '21408' => {
      'BaseType' => '20832',
      'Name' => 'uint16_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '21418' => {
      'Header' => 'bios_table.h',
      'Line' => '294',
      'Memb' => {
        '0' => {
          'name' => 'name_handle',
          'offset' => '0',
          'type' => '5660'
        },
        '1' => {
          'name' => 'read_only',
          'offset' => '2',
          'type' => '5459'
        },
        '2' => {
          'name' => 'string_type',
          'offset' => '3',
          'type' => '135'
        },
        '3' => {
          'name' => 'min_length',
          'offset' => '4',
          'type' => '5660'
        },
        '4' => {
          'name' => 'max_length',
          'offset' => '6',
          'type' => '5660'
        },
        '5' => {
          'name' => 'def_length',
          'offset' => '8',
          'type' => '5660'
        },
        '6' => {
          'name' => 'def_string',
          'offset' => '22',
          'type' => '8652'
        }
      },
      'Name' => 'struct pldm_bios_table_attr_entry_string_info',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '21530' => {
      'BaseType' => '21418',
      'Name' => 'struct pldm_bios_table_attr_entry_string_info const',
      'Size' => '24',
      'Type' => 'Const'
    },
    '21540' => {
      'Header' => 'bios_table.h',
      'Line' => '384',
      'Memb' => {
        '0' => {
          'name' => 'name_handle',
          'offset' => '0',
          'type' => '5660'
        },
        '1' => {
          'name' => 'read_only',
          'offset' => '2',
          'type' => '5459'
        },
        '2' => {
          'name' => 'lower_bound',
          'offset' => '8',
          'type' => '20849'
        },
        '3' => {
          'name' => 'upper_bound',
          'offset' => '22',
          'type' => '20849'
        },
        '4' => {
          'name' => 'scalar_increment',
          'offset' => '36',
          'type' => '147'
        },
        '5' => {
          'name' => 'default_value',
          'offset' => '50',
          'type' => '20849'
        }
      },
      'Name' => 'struct pldm_bios_table_attr_entry_integer_info',
      'Size' => '40',
      'Type' => 'Struct'
    },
    '21638' => {
      'BaseType' => '21540',
      'Name' => 'struct pldm_bios_table_attr_entry_integer_info const',
      'Size' => '40',
      'Type' => 'Const'
    },
    '21921' => {
      'Name' => 'ssize_t(*)(void const*)',
      'Param' => {
        '0' => {
          'type' => '1262'
        }
      },
      'Return' => '5856',
      'Size' => '8',
      'Type' => 'FuncPtr'
    },
    '21991' => {
      'Line' => '957',
      'Memb' => {
        '0' => {
          'name' => 'table_data',
          'offset' => '0',
          'type' => '5868'
        },
        '1' => {
          'name' => 'table_len',
          'offset' => '8',
          'type' => '164'
        },
        '2' => {
          'name' => 'current_pos',
          'offset' => '22',
          'type' => '164'
        },
        '3' => {
          'name' => 'entry_length_handler',
          'offset' => '36',
          'type' => '21921'
        }
      },
      'Name' => 'struct pldm_bios_table_iter',
      'PrivateABI' => 1,
      'Size' => '32',
      'Source' => 'bios_table.c',
      'Type' => 'Struct'
    },
    '22061' => {
      'BaseType' => '21991',
      'Name' => 'struct pldm_bios_table_iter const',
      'Size' => '32',
      'Type' => 'Const'
    },
    '23131' => {
      'BaseType' => '21991',
      'Name' => 'struct pldm_bios_table_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '23136' => {
      'BaseType' => '21236',
      'Name' => 'struct pldm_bios_attr_val_table_entry const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '23550' => {
      'BaseType' => '21179',
      'Name' => 'struct pldm_bios_attr_table_entry const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '24153' => {
      'BaseType' => '21093',
      'Name' => 'struct pldm_bios_string_table_entry const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '25316' => {
      'BaseType' => '22061',
      'Name' => 'struct pldm_bios_table_iter const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '29499' => {
      'BaseType' => '20849',
      'Name' => 'uint64_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '29776' => {
      'BaseType' => '21638',
      'Name' => 'struct pldm_bios_table_attr_entry_integer_info const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '30085' => {
      'BaseType' => '8652',
      'Name' => 'char const**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '31214' => {
      'BaseType' => '21530',
      'Name' => 'struct pldm_bios_table_attr_entry_string_info const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '32668' => {
      'BaseType' => '21396',
      'Name' => 'struct pldm_bios_table_attr_entry_enum_info const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '34885' => {
      'BaseType' => '135',
      'Header' => 'pldm_types.h',
      'Line' => '32',
      'Name' => 'bool8_t',
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '34897' => {
      'Header' => 'pldm_types.h',
      'Line' => '36',
      'Name' => 'anon-struct-pldm_types.h-36',
      'Size' => '2',
      'Type' => 'Struct'
    },
    '35161' => {
      'Header' => 'pldm_types.h',
      'Line' => '54',
      'Memb' => {
        '0' => {
          'name' => 'value',
          'offset' => '0',
          'type' => '5660'
        },
        '1' => {
          'name' => 'bits',
          'offset' => '0',
          'type' => '34897'
        }
      },
      'Name' => 'union bitfield16_t',
      'Size' => '2',
      'Type' => 'Union'
    },
    '35173' => {
      'Header' => 'pldm_types.h',
      'Line' => '58',
      'Name' => 'anon-struct-pldm_types.h-58',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '35661' => {
      'Header' => 'pldm_types.h',
      'Line' => '92',
      'Memb' => {
        '0' => {
          'name' => 'value',
          'offset' => '0',
          'type' => '147'
        },
        '1' => {
          'name' => 'bits',
          'offset' => '0',
          'type' => '35173'
        }
      },
      'Name' => 'union bitfield32_t',
      'Size' => '4',
      'Type' => 'Union'
    },
    '35673' => {
      'Header' => 'pldm_types.h',
      'Line' => '96',
      'Name' => 'anon-struct-pldm_types.h-96',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '36609' => {
      'Header' => 'pldm_types.h',
      'Line' => '162',
      'Memb' => {
        '0' => {
          'name' => 'value',
          'offset' => '0',
          'type' => '20849'
        },
        '1' => {
          'name' => 'bits',
          'offset' => '0',
          'type' => '35673'
        }
      },
      'Name' => 'union bitfield64_t',
      'Size' => '8',
      'Type' => 'Union'
    },
    '36668' => {
      'BaseType' => '164',
      'Name' => 'size_t const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '37300' => {
      'BaseType' => '15038',
      'Name' => 'struct variable_field const',
      'Size' => '16',
      'Type' => 'Const'
    },
    '38590' => {
      'BaseType' => '135',
      'Name' => 'uint8_t[8]',
      'Size' => '8',
      'Type' => 'Array'
    },
    '38606' => {
      'Header' => 'firmware_update.h',
      'Line' => '441',
      'Memb' => {
        '0' => {
          'name' => 'uuid',
          'offset' => '0',
          'type' => '38710'
        },
        '1' => {
          'name' => 'package_header_format_version',
          'offset' => '22',
          'type' => '135'
        },
        '2' => {
          'name' => 'package_header_size',
          'offset' => '23',
          'type' => '5660'
        },
        '3' => {
          'name' => 'package_release_date_time',
          'offset' => '25',
          'type' => '38726'
        },
        '4' => {
          'name' => 'component_bitmap_bit_length',
          'offset' => '50',
          'type' => '5660'
        },
        '5' => {
          'name' => 'package_version_string_type',
          'offset' => '52',
          'type' => '135'
        },
        '6' => {
          'name' => 'package_version_string_length',
          'offset' => '53',
          'type' => '135'
        }
      },
      'Name' => 'struct pldm_package_header_information',
      'Size' => '36',
      'Type' => 'Struct'
    },
    '38710' => {
      'BaseType' => '135',
      'Name' => 'uint8_t[16]',
      'Size' => '16',
      'Type' => 'Array'
    },
    '38726' => {
      'BaseType' => '135',
      'Name' => 'uint8_t[13]',
      'Size' => '13',
      'Type' => 'Array'
    },
    '38742' => {
      'Header' => 'firmware_update.h',
      'Line' => '455',
      'Memb' => {
        '0' => {
          'name' => 'record_length',
          'offset' => '0',
          'type' => '5660'
        },
        '1' => {
          'name' => 'descriptor_count',
          'offset' => '2',
          'type' => '135'
        },
        '2' => {
          'name' => 'device_update_option_flags',
          'offset' => '3',
          'type' => '35661'
        },
        '3' => {
          'name' => 'comp_image_set_version_string_type',
          'offset' => '7',
          'type' => '135'
        },
        '4' => {
          'name' => 'comp_image_set_version_string_length',
          'offset' => '8',
          'type' => '135'
        },
        '5' => {
          'name' => 'fw_device_pkg_data_length',
          'offset' => '9',
          'type' => '5660'
        }
      },
      'Name' => 'struct pldm_firmware_device_id_record',
      'Size' => '11',
      'Type' => 'Struct'
    },
    '38937' => {
      'Header' => 'firmware_update.h',
      'Line' => '489',
      'Memb' => {
        '0' => {
          'name' => 'comp_classification',
          'offset' => '0',
          'type' => '5660'
        },
        '1' => {
          'name' => 'comp_identifier',
          'offset' => '2',
          'type' => '5660'
        },
        '2' => {
          'name' => 'comp_comparison_stamp',
          'offset' => '4',
          'type' => '147'
        },
        '3' => {
          'name' => 'comp_options',
          'offset' => '8',
          'type' => '35161'
        },
        '4' => {
          'name' => 'requested_comp_activation_method',
          'offset' => '16',
          'type' => '35161'
        },
        '5' => {
          'name' => 'comp_location_offset',
          'offset' => '18',
          'type' => '147'
        },
        '6' => {
          'name' => 'comp_size',
          'offset' => '22',
          'type' => '147'
        },
        '7' => {
          'name' => 'comp_version_string_type',
          'offset' => '32',
          'type' => '135'
        },
        '8' => {
          'name' => 'comp_version_string_length',
          'offset' => '33',
          'type' => '135'
        }
      },
      'Name' => 'struct pldm_component_image_information',
      'Size' => '22',
      'Type' => 'Struct'
    },
    '39119' => {
      'Header' => 'firmware_update.h',
      'Line' => '515',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'capabilities_during_update',
          'offset' => '1',
          'type' => '35661'
        },
        '2' => {
          'name' => 'comp_count',
          'offset' => '5',
          'type' => '5660'
        },
        '3' => {
          'name' => 'active_comp_image_set_ver_str_type',
          'offset' => '7',
          'type' => '135'
        },
        '4' => {
          'name' => 'active_comp_image_set_ver_str_len',
          'offset' => '8',
          'type' => '135'
        },
        '5' => {
          'name' => 'pending_comp_image_set_ver_str_type',
          'offset' => '9',
          'type' => '135'
        },
        '6' => {
          'name' => 'pending_comp_image_set_ver_str_len',
          'offset' => '16',
          'type' => '135'
        }
      },
      'Name' => 'struct pldm_get_firmware_parameters_resp',
      'Size' => '11',
      'Type' => 'Struct'
    },
    '39306' => {
      'Header' => 'firmware_update.h',
      'Line' => '543',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'downstream_device_update_supported',
          'offset' => '1',
          'type' => '135'
        },
        '2' => {
          'name' => 'number_of_downstream_devices',
          'offset' => '2',
          'type' => '5660'
        },
        '3' => {
          'name' => 'max_number_of_downstream_devices',
          'offset' => '4',
          'type' => '5660'
        },
        '4' => {
          'name' => 'capabilities',
          'offset' => '8',
          'type' => '35661'
        }
      },
      'Name' => 'struct pldm_query_downstream_devices_resp',
      'Size' => '12',
      'Type' => 'Struct'
    },
    '39384' => {
      'Header' => 'firmware_update.h',
      'Line' => '555',
      'Memb' => {
        '0' => {
          'name' => 'comp_classification',
          'offset' => '0',
          'type' => '5660'
        },
        '1' => {
          'name' => 'comp_identifier',
          'offset' => '2',
          'type' => '5660'
        },
        '2' => {
          'name' => 'comp_classification_index',
          'offset' => '4',
          'type' => '135'
        },
        '3' => {
          'name' => 'active_comp_comparison_stamp',
          'offset' => '5',
          'type' => '147'
        },
        '4' => {
          'name' => 'active_comp_ver_str_type',
          'offset' => '9',
          'type' => '135'
        },
        '5' => {
          'name' => 'active_comp_ver_str_len',
          'offset' => '16',
          'type' => '135'
        },
        '6' => {
          'name' => 'active_comp_release_date',
          'offset' => '17',
          'type' => '38590'
        },
        '7' => {
          'name' => 'pending_comp_comparison_stamp',
          'offset' => '25',
          'type' => '147'
        },
        '8' => {
          'name' => 'pending_comp_ver_str_type',
          'offset' => '35',
          'type' => '135'
        },
        '9' => {
          'name' => 'pending_comp_ver_str_len',
          'offset' => '36',
          'type' => '135'
        },
        '10' => {
          'name' => 'pending_comp_release_date',
          'offset' => '37',
          'type' => '38590'
        },
        '11' => {
          'name' => 'comp_activation_methods',
          'offset' => '51',
          'type' => '35161'
        },
        '12' => {
          'name' => 'capabilities_during_update',
          'offset' => '53',
          'type' => '35661'
        }
      },
      'Name' => 'struct pldm_component_parameter_entry',
      'Size' => '39',
      'Type' => 'Struct'
    },
    '39675' => {
      'Header' => 'firmware_update.h',
      'Line' => '594',
      'Memb' => {
        '0' => {
          'name' => 'data_transfer_handle',
          'offset' => '0',
          'type' => '147'
        },
        '1' => {
          'name' => 'transfer_operation_flag',
          'offset' => '4',
          'type' => '135'
        }
      },
      'Name' => 'struct pldm_query_downstream_identifiers_req',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '39714' => {
      'BaseType' => '39675',
      'Name' => 'struct pldm_query_downstream_identifiers_req const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '39719' => {
      'Header' => 'firmware_update.h',
      'Line' => '608',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'next_data_transfer_handle',
          'offset' => '4',
          'type' => '147'
        },
        '2' => {
          'name' => 'transfer_flag',
          'offset' => '8',
          'type' => '135'
        },
        '3' => {
          'name' => 'downstream_devices_length',
          'offset' => '18',
          'type' => '147'
        },
        '4' => {
          'name' => 'number_of_downstream_devices',
          'offset' => '22',
          'type' => '5660'
        }
      },
      'Name' => 'struct pldm_query_downstream_identifiers_resp',
      'Size' => '20',
      'Type' => 'Struct'
    },
    '39797' => {
      'Header' => 'firmware_update.h',
      'Line' => '621',
      'Memb' => {
        '0' => {
          'name' => 'downstream_device_index',
          'offset' => '0',
          'type' => '5660'
        },
        '1' => {
          'name' => 'downstream_descriptor_count',
          'offset' => '2',
          'type' => '135'
        }
      },
      'Name' => 'struct pldm_downstream_device',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '39836' => {
      'Header' => 'firmware_update.h',
      'Line' => '627',
      'Memb' => {
        '0' => {
          'name' => 'field',
          'offset' => '0',
          'type' => '15038'
        },
        '1' => {
          'name' => 'devs',
          'offset' => '22',
          'type' => '164'
        }
      },
      'Name' => 'struct pldm_downstream_device_iter',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '39875' => {
      'Header' => 'firmware_update.h',
      'Line' => '701',
      'Memb' => {
        '0' => {
          'name' => 'descriptor_type',
          'offset' => '0',
          'type' => '5660'
        },
        '1' => {
          'name' => 'descriptor_length',
          'offset' => '2',
          'type' => '5660'
        },
        '2' => {
          'name' => 'descriptor_data',
          'offset' => '8',
          'type' => '1262'
        }
      },
      'Name' => 'struct pldm_descriptor',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '39943' => {
      'Header' => 'firmware_update.h',
      'Line' => '707',
      'Memb' => {
        '0' => {
          'name' => 'field',
          'offset' => '0',
          'type' => '15434'
        },
        '1' => {
          'name' => 'count',
          'offset' => '8',
          'type' => '164'
        }
      },
      'Name' => 'struct pldm_descriptor_iter',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '39987' => {
      'Header' => 'firmware_update.h',
      'Line' => '800',
      'Memb' => {
        '0' => {
          'name' => 'data_transfer_handle',
          'offset' => '0',
          'type' => '147'
        },
        '1' => {
          'name' => 'transfer_operation_flag',
          'offset' => '4',
          'type' => '135'
        }
      },
      'Name' => 'struct pldm_get_downstream_firmware_parameters_req',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '40026' => {
      'BaseType' => '39987',
      'Name' => 'struct pldm_get_downstream_firmware_parameters_req const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '40031' => {
      'Header' => 'firmware_update.h',
      'Line' => '815',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'next_data_transfer_handle',
          'offset' => '4',
          'type' => '147'
        },
        '2' => {
          'name' => 'transfer_flag',
          'offset' => '8',
          'type' => '135'
        },
        '3' => {
          'name' => 'fdp_capabilities_during_update',
          'offset' => '18',
          'type' => '35661'
        },
        '4' => {
          'name' => 'downstream_device_count',
          'offset' => '22',
          'type' => '5660'
        }
      },
      'Name' => 'struct pldm_get_downstream_firmware_parameters_resp',
      'Size' => '20',
      'Type' => 'Struct'
    },
    '40109' => {
      'Header' => 'firmware_update.h',
      'Line' => '833',
      'Memb' => {
        '0' => {
          'name' => 'downstream_device_index',
          'offset' => '0',
          'type' => '5660'
        },
        '1' => {
          'name' => 'active_comp_comparison_stamp',
          'offset' => '4',
          'type' => '147'
        },
        '2' => {
          'name' => 'active_comp_ver_str_type',
          'offset' => '8',
          'type' => '135'
        },
        '3' => {
          'name' => 'active_comp_ver_str_len',
          'offset' => '9',
          'type' => '135'
        },
        '4' => {
          'name' => 'active_comp_release_date',
          'offset' => '16',
          'type' => '40291'
        },
        '5' => {
          'name' => 'pending_comp_comparison_stamp',
          'offset' => '32',
          'type' => '147'
        },
        '6' => {
          'name' => 'pending_comp_ver_str_type',
          'offset' => '36',
          'type' => '135'
        },
        '7' => {
          'name' => 'pending_comp_ver_str_len',
          'offset' => '37',
          'type' => '135'
        },
        '8' => {
          'name' => 'pending_comp_release_date',
          'offset' => '38',
          'type' => '40291'
        },
        '9' => {
          'name' => 'comp_activation_methods',
          'offset' => '54',
          'type' => '35161'
        },
        '10' => {
          'name' => 'capabilities_during_update',
          'offset' => '64',
          'type' => '35661'
        },
        '11' => {
          'name' => 'active_comp_ver_str',
          'offset' => '72',
          'type' => '1262'
        },
        '12' => {
          'name' => 'pending_comp_ver_str',
          'offset' => '86',
          'type' => '1262'
        }
      },
      'Name' => 'struct pldm_downstream_device_parameters_entry',
      'Size' => '64',
      'Type' => 'Struct'
    },
    '40291' => {
      'BaseType' => '128',
      'Name' => 'char[9]',
      'Size' => '9',
      'Type' => 'Array'
    },
    '41426' => {
      'Header' => 'firmware_update.h',
      'Line' => '1347',
      'Memb' => {
        '0' => {
          'name' => 'field',
          'offset' => '0',
          'type' => '15038'
        },
        '1' => {
          'name' => 'entries',
          'offset' => '22',
          'type' => '164'
        }
      },
      'Name' => 'struct pldm_downstream_device_parameters_iter',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '43333' => {
      'BaseType' => '34885',
      'Name' => 'bool8_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '43338' => {
      'BaseType' => '36609',
      'Name' => 'bitfield64_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '46774' => {
      'BaseType' => '35661',
      'Name' => 'bitfield32_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '50852' => {
      'BaseType' => '35161',
      'Name' => 'bitfield16_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '61195' => {
      'BaseType' => '37300',
      'Name' => 'struct variable_field const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '76477' => {
      'BaseType' => '41426',
      'Name' => 'struct pldm_downstream_device_parameters_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '76482' => {
      'BaseType' => '40109',
      'Name' => 'struct pldm_downstream_device_parameters_entry*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '79166' => {
      'BaseType' => '40031',
      'Name' => 'struct pldm_get_downstream_firmware_parameters_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '80298' => {
      'BaseType' => '40026',
      'Name' => 'struct pldm_get_downstream_firmware_parameters_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '81478' => {
      'BaseType' => '39836',
      'Name' => 'struct pldm_downstream_device_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '81483' => {
      'BaseType' => '39797',
      'Name' => 'struct pldm_downstream_device*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '84181' => {
      'BaseType' => '39719',
      'Name' => 'struct pldm_query_downstream_identifiers_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '85313' => {
      'BaseType' => '39714',
      'Name' => 'struct pldm_query_downstream_identifiers_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '87914' => {
      'BaseType' => '39306',
      'Name' => 'struct pldm_query_downstream_devices_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '88361' => {
      'BaseType' => '39384',
      'Name' => 'struct pldm_component_parameter_entry*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '97019' => {
      'BaseType' => '39119',
      'Name' => 'struct pldm_get_firmware_parameters_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '99991' => {
      'BaseType' => '1186',
      'Name' => 'uint8_t**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '100333' => {
      'BaseType' => '38937',
      'Name' => 'struct pldm_component_image_information*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '102825' => {
      'BaseType' => '39943',
      'Name' => 'struct pldm_descriptor_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '102830' => {
      'BaseType' => '39875',
      'Name' => 'struct pldm_descriptor*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '103115' => {
      'BaseType' => '38742',
      'Name' => 'struct pldm_firmware_device_id_record*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '103570' => {
      'BaseType' => '38606',
      'Name' => 'struct pldm_package_header_information*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '104722' => {
      'BaseType' => '126',
      'Name' => 'void**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '112649' => {
      'BaseType' => '112666',
      'Header' => 'pdr.h',
      'Line' => '16',
      'Name' => 'pldm_pdr',
      'PrivateABI' => 1,
      'Size' => '24',
      'Type' => 'Typedef'
    },
    '112661' => {
      'BaseType' => '112649',
      'Name' => 'pldm_pdr const',
      'Size' => '24',
      'Type' => 'Const'
    },
    '112666' => {
      'Line' => '30',
      'Memb' => {
        '0' => {
          'name' => 'record_count',
          'offset' => '0',
          'type' => '147'
        },
        '1' => {
          'name' => 'size',
          'offset' => '4',
          'type' => '147'
        },
        '2' => {
          'name' => 'first',
          'offset' => '8',
          'type' => '113765'
        },
        '3' => {
          'name' => 'last',
          'offset' => '22',
          'type' => '113765'
        }
      },
      'Name' => 'struct pldm_pdr',
      'PrivateABI' => 1,
      'Size' => '24',
      'Source' => 'pdr.c',
      'Type' => 'Struct'
    },
    '112732' => {
      'BaseType' => '112749',
      'Header' => 'pdr.h',
      'Line' => '21',
      'Name' => 'pldm_pdr_record',
      'PrivateABI' => 1,
      'Size' => '32',
      'Type' => 'Typedef'
    },
    '112744' => {
      'BaseType' => '112732',
      'Name' => 'pldm_pdr_record const',
      'Size' => '32',
      'Type' => 'Const'
    },
    '112749' => {
      'Line' => '21',
      'Memb' => {
        '0' => {
          'name' => 'record_handle',
          'offset' => '0',
          'type' => '147'
        },
        '1' => {
          'name' => 'size',
          'offset' => '4',
          'type' => '147'
        },
        '2' => {
          'name' => 'data',
          'offset' => '8',
          'type' => '1186'
        },
        '3' => {
          'name' => 'next',
          'offset' => '22',
          'type' => '113753'
        },
        '4' => {
          'name' => 'is_remote',
          'offset' => '36',
          'type' => '5459'
        },
        '5' => {
          'name' => 'terminus_handle',
          'offset' => '38',
          'type' => '5660'
        }
      },
      'Name' => 'struct pldm_pdr_record',
      'PrivateABI' => 1,
      'Size' => '32',
      'Source' => 'pdr.c',
      'Type' => 'Struct'
    },
    '112841' => {
      'Header' => 'pdr.h',
      'Line' => '288',
      'Memb' => {
        '0' => {
          'name' => 'entity_type',
          'offset' => '0',
          'type' => '5660'
        },
        '1' => {
          'name' => 'entity_instance_num',
          'offset' => '2',
          'type' => '5660'
        },
        '2' => {
          'name' => 'entity_container_id',
          'offset' => '4',
          'type' => '5660'
        }
      },
      'Name' => 'struct pldm_entity',
      'Size' => '6',
      'Type' => 'Struct'
    },
    '112903' => {
      'BaseType' => '112841',
      'Header' => 'pdr.h',
      'Line' => '292',
      'Name' => 'pldm_entity',
      'Size' => '6',
      'Type' => 'Typedef'
    },
    '112947' => {
      'BaseType' => '112959',
      'Header' => 'pdr.h',
      'Line' => '302',
      'Name' => 'pldm_entity_association_tree',
      'PrivateABI' => 1,
      'Size' => '16',
      'Type' => 'Typedef'
    },
    '112959' => {
      'Line' => '459',
      'Memb' => {
        '0' => {
          'name' => 'root',
          'offset' => '0',
          'type' => '113770'
        },
        '1' => {
          'name' => 'last_used_container_id',
          'offset' => '8',
          'type' => '5660'
        }
      },
      'Name' => 'struct pldm_entity_association_tree',
      'PrivateABI' => 1,
      'Size' => '16',
      'Source' => 'pdr.c',
      'Type' => 'Struct'
    },
    '113002' => {
      'BaseType' => '113019',
      'Header' => 'pdr.h',
      'Line' => '307',
      'Name' => 'pldm_entity_node',
      'PrivateABI' => 1,
      'Size' => '40',
      'Type' => 'Typedef'
    },
    '113014' => {
      'BaseType' => '113002',
      'Name' => 'pldm_entity_node const',
      'Size' => '40',
      'Type' => 'Const'
    },
    '113019' => {
      'Line' => '464',
      'Memb' => {
        '0' => {
          'name' => 'entity',
          'offset' => '0',
          'type' => '112903'
        },
        '1' => {
          'name' => 'parent',
          'offset' => '6',
          'type' => '112903'
        },
        '2' => {
          'name' => 'remote_container_id',
          'offset' => '18',
          'type' => '5660'
        },
        '3' => {
          'name' => 'first_child',
          'offset' => '22',
          'type' => '113770'
        },
        '4' => {
          'name' => 'next_sibling',
          'offset' => '36',
          'type' => '113770'
        },
        '5' => {
          'name' => 'association_type',
          'offset' => '50',
          'type' => '135'
        }
      },
      'Name' => 'struct pldm_entity_node',
      'PrivateABI' => 1,
      'Size' => '40',
      'Source' => 'pdr.c',
      'Type' => 'Struct'
    },
    '113293' => {
      'Header' => 'platform.h',
      'Line' => '551',
      'Memb' => {
        '0' => {
          'name' => 'record_handle',
          'offset' => '0',
          'type' => '147'
        },
        '1' => {
          'name' => 'version',
          'offset' => '4',
          'type' => '135'
        },
        '2' => {
          'name' => 'type',
          'offset' => '5',
          'type' => '135'
        },
        '3' => {
          'name' => 'record_change_num',
          'offset' => '6',
          'type' => '5660'
        },
        '4' => {
          'name' => 'length',
          'offset' => '8',
          'type' => '5660'
        }
      },
      'Name' => 'struct pldm_pdr_hdr',
      'Size' => '10',
      'Type' => 'Struct'
    },
    '113753' => {
      'BaseType' => '112749',
      'Name' => 'struct pldm_pdr_record*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '113765' => {
      'BaseType' => '112732',
      'Name' => 'pldm_pdr_record*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '113770' => {
      'BaseType' => '113002',
      'Name' => 'pldm_entity_node*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '115009' => {
      'BaseType' => '112649',
      'Name' => 'pldm_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '116320' => {
      'BaseType' => '112744',
      'Name' => 'pldm_pdr_record const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '123554' => {
      'BaseType' => '112903',
      'Name' => 'pldm_entity*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '139681' => {
      'BaseType' => '123554',
      'Name' => 'pldm_entity**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '139745' => {
      'BaseType' => '112947',
      'Name' => 'pldm_entity_association_tree*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '140333' => {
      'BaseType' => '113770',
      'Name' => 'pldm_entity_node**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '141122' => {
      'BaseType' => '112661',
      'Name' => 'pldm_pdr const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '146360' => {
      'BaseType' => '113014',
      'Name' => 'pldm_entity_node const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '151475' => {
      'BaseType' => '74',
      'Header' => 'types.h',
      'Line' => '37',
      'Name' => '__int8_t',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '151506' => {
      'BaseType' => '93',
      'Header' => 'types.h',
      'Line' => '39',
      'Name' => '__int16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '151537' => {
      'BaseType' => '100',
      'Header' => 'types.h',
      'Line' => '41',
      'Name' => '__int32_t',
      'PrivateABI' => 1,
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '151575' => {
      'BaseType' => '5581',
      'Header' => 'types.h',
      'Line' => '55',
      'Name' => '__uint_least16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '151628' => {
      'BaseType' => '151475',
      'Header' => 'stdint-intn.h',
      'Line' => '24',
      'Name' => 'int8_t',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '151640' => {
      'BaseType' => '151506',
      'Header' => 'stdint-intn.h',
      'Line' => '25',
      'Name' => 'int16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '151652' => {
      'BaseType' => '151537',
      'Header' => 'stdint-intn.h',
      'Line' => '26',
      'Name' => 'int32_t',
      'PrivateABI' => 1,
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '151917' => {
      'BaseType' => '444',
      'Header' => 'pldm_types.h',
      'Line' => '164',
      'Name' => 'real32_t',
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '152574' => {
      'BaseType' => '151575',
      'Header' => 'uchar.h',
      'Line' => '51',
      'Name' => 'char16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '153400' => {
      'Header' => 'platform.h',
      'Line' => '329',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_SENSOR_OP_STATE',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_STATE_SENSOR_STATE',
          'value' => '1'
        },
        '2' => {
          'name' => 'PLDM_NUMERIC_SENSOR_STATE',
          'value' => '2'
        }
      },
      'Name' => 'enum sensor_event_class_states',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '153434' => {
      'BaseType' => '153400',
      'Name' => 'enum sensor_event_class_states const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '153742' => {
      'Header' => 'platform.h',
      'Line' => '626',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '113293'
        },
        '1' => {
          'name' => 'terminus_handle',
          'offset' => '16',
          'type' => '5660'
        },
        '2' => {
          'name' => 'sensor_id',
          'offset' => '18',
          'type' => '5660'
        },
        '3' => {
          'name' => 'entity_type',
          'offset' => '20',
          'type' => '5660'
        },
        '4' => {
          'name' => 'entity_instance',
          'offset' => '22',
          'type' => '5660'
        },
        '5' => {
          'name' => 'container_id',
          'offset' => '24',
          'type' => '5660'
        },
        '6' => {
          'name' => 'sensor_init',
          'offset' => '32',
          'type' => '135'
        },
        '7' => {
          'name' => 'sensor_auxiliary_names_pdr',
          'offset' => '33',
          'type' => '34885'
        },
        '8' => {
          'name' => 'composite_sensor_count',
          'offset' => '34',
          'type' => '135'
        },
        '9' => {
          'name' => 'possible_states',
          'offset' => '35',
          'type' => '962'
        }
      },
      'Name' => 'struct pldm_state_sensor_pdr',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '153896' => {
      'Header' => 'platform.h',
      'Line' => '643',
      'Memb' => {
        '0' => {
          'name' => 'state_set_id',
          'offset' => '0',
          'type' => '5660'
        },
        '1' => {
          'name' => 'possible_states_size',
          'offset' => '2',
          'type' => '135'
        },
        '2' => {
          'name' => 'states',
          'offset' => '3',
          'type' => '153958'
        }
      },
      'Name' => 'struct state_sensor_possible_states',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '153953' => {
      'BaseType' => '153896',
      'Name' => 'struct state_sensor_possible_states const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '153958' => {
      'BaseType' => '344',
      'Name' => 'bitfield8_t[1]',
      'Size' => '1',
      'Type' => 'Array'
    },
    '153974' => {
      'Header' => 'platform.h',
      'Line' => '653',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '113293'
        },
        '1' => {
          'name' => 'terminus_handle',
          'offset' => '16',
          'type' => '5660'
        },
        '2' => {
          'name' => 'effecter_id',
          'offset' => '18',
          'type' => '5660'
        },
        '3' => {
          'name' => 'entity_type',
          'offset' => '20',
          'type' => '5660'
        },
        '4' => {
          'name' => 'entity_instance',
          'offset' => '22',
          'type' => '5660'
        },
        '5' => {
          'name' => 'container_id',
          'offset' => '24',
          'type' => '5660'
        },
        '6' => {
          'name' => 'effecter_semantic_id',
          'offset' => '32',
          'type' => '5660'
        },
        '7' => {
          'name' => 'effecter_init',
          'offset' => '34',
          'type' => '135'
        },
        '8' => {
          'name' => 'has_description_pdr',
          'offset' => '35',
          'type' => '34885'
        },
        '9' => {
          'name' => 'composite_effecter_count',
          'offset' => '36',
          'type' => '135'
        },
        '10' => {
          'name' => 'possible_states',
          'offset' => '37',
          'type' => '962'
        }
      },
      'Name' => 'struct pldm_state_effecter_pdr',
      'Size' => '26',
      'Type' => 'Struct'
    },
    '154327' => {
      'Header' => 'platform.h',
      'Line' => '744',
      'Memb' => {
        '0' => {
          'name' => 'value_u8',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'value_s8',
          'offset' => '0',
          'type' => '151628'
        },
        '2' => {
          'name' => 'value_u16',
          'offset' => '0',
          'type' => '5660'
        },
        '3' => {
          'name' => 'value_s16',
          'offset' => '0',
          'type' => '151640'
        },
        '4' => {
          'name' => 'value_u32',
          'offset' => '0',
          'type' => '147'
        },
        '5' => {
          'name' => 'value_s32',
          'offset' => '0',
          'type' => '151652'
        },
        '6' => {
          'name' => 'value_f32',
          'offset' => '0',
          'type' => '151917'
        }
      },
      'Name' => 'union union_range_field_format',
      'Size' => '4',
      'Type' => 'Union'
    },
    '154924' => {
      'Header' => 'platform.h',
      'Line' => '801',
      'Memb' => {
        '0' => {
          'name' => 'value_u8',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'value_s8',
          'offset' => '0',
          'type' => '151628'
        },
        '2' => {
          'name' => 'value_u16',
          'offset' => '0',
          'type' => '5660'
        },
        '3' => {
          'name' => 'value_s16',
          'offset' => '0',
          'type' => '151640'
        },
        '4' => {
          'name' => 'value_u32',
          'offset' => '0',
          'type' => '147'
        },
        '5' => {
          'name' => 'value_s32',
          'offset' => '0',
          'type' => '151652'
        }
      },
      'Name' => 'union union_sensor_data_size',
      'Size' => '4',
      'Type' => 'Union'
    },
    '154937' => {
      'Header' => 'platform.h',
      'Line' => '808',
      'Memb' => {
        '0' => {
          'name' => 'record_handle',
          'offset' => '0',
          'type' => '147'
        },
        '1' => {
          'name' => 'version',
          'offset' => '4',
          'type' => '135'
        },
        '2' => {
          'name' => 'type',
          'offset' => '5',
          'type' => '135'
        },
        '3' => {
          'name' => 'record_change_num',
          'offset' => '6',
          'type' => '5660'
        },
        '4' => {
          'name' => 'length',
          'offset' => '8',
          'type' => '5660'
        }
      },
      'Name' => 'struct pldm_value_pdr_hdr',
      'Size' => '12',
      'Type' => 'Struct'
    },
    '155022' => {
      'Header' => 'platform.h',
      'Line' => '826',
      'Memb' => {
        '0' => {
          'name' => 'entity_instance_num',
          'offset' => '0',
          'type' => '5660'
        },
        '1' => {
          'name' => 'entity_instance',
          'offset' => '0',
          'type' => '5660'
        }
      },
      'Name' => 'anon-union-platform.h-826',
      'Size' => '2',
      'Type' => 'Union'
    },
    '155057' => {
      'Header' => 'platform.h',
      'Line' => '821',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '154937'
        },
        '1' => {
          'name' => 'terminus_handle',
          'offset' => '18',
          'type' => '5660'
        },
        '2' => {
          'name' => 'sensor_id',
          'offset' => '20',
          'type' => '5660'
        },
        '3' => {
          'name' => 'entity_type',
          'offset' => '22',
          'type' => '5660'
        },
        '4' => {
          'name' => 'unnamed0',
          'offset' => '24',
          'type' => '155022'
        },
        '5' => {
          'name' => 'container_id',
          'offset' => '32',
          'type' => '5660'
        },
        '6' => {
          'name' => 'sensor_init',
          'offset' => '34',
          'type' => '135'
        },
        '7' => {
          'name' => 'sensor_auxiliary_names_pdr',
          'offset' => '35',
          'type' => '34885'
        },
        '8' => {
          'name' => 'base_unit',
          'offset' => '36',
          'type' => '135'
        },
        '9' => {
          'name' => 'unit_modifier',
          'offset' => '37',
          'type' => '151628'
        },
        '10' => {
          'name' => 'rate_unit',
          'offset' => '38',
          'type' => '135'
        },
        '11' => {
          'name' => 'base_oem_unit_handle',
          'offset' => '39',
          'type' => '135'
        },
        '12' => {
          'name' => 'aux_unit',
          'offset' => '40',
          'type' => '135'
        },
        '13' => {
          'name' => 'aux_unit_modifier',
          'offset' => '41',
          'type' => '151628'
        },
        '14' => {
          'name' => 'aux_rate_unit',
          'offset' => '48',
          'type' => '135'
        },
        '15' => {
          'name' => 'rel',
          'offset' => '49',
          'type' => '135'
        },
        '16' => {
          'name' => 'aux_oem_unit_handle',
          'offset' => '50',
          'type' => '135'
        },
        '17' => {
          'name' => 'is_linear',
          'offset' => '51',
          'type' => '34885'
        },
        '18' => {
          'name' => 'sensor_data_size',
          'offset' => '52',
          'type' => '135'
        },
        '19' => {
          'name' => 'resolution',
          'offset' => '54',
          'type' => '151917'
        },
        '20' => {
          'name' => 'offset',
          'offset' => '64',
          'type' => '151917'
        },
        '21' => {
          'name' => 'accuracy',
          'offset' => '68',
          'type' => '5660'
        },
        '22' => {
          'name' => 'plus_tolerance',
          'offset' => '70',
          'type' => '135'
        },
        '23' => {
          'name' => 'minus_tolerance',
          'offset' => '71',
          'type' => '135'
        },
        '24' => {
          'name' => 'hysteresis',
          'offset' => '72',
          'type' => '154924'
        },
        '25' => {
          'name' => 'supported_thresholds',
          'offset' => '82',
          'type' => '344'
        },
        '26' => {
          'name' => 'threshold_and_hysteresis_volatility',
          'offset' => '83',
          'type' => '344'
        },
        '27' => {
          'name' => 'state_transition_interval',
          'offset' => '86',
          'type' => '151917'
        },
        '28' => {
          'name' => 'update_interval',
          'offset' => '96',
          'type' => '151917'
        },
        '29' => {
          'name' => 'max_readable',
          'offset' => '100',
          'type' => '154924'
        },
        '30' => {
          'name' => 'min_readable',
          'offset' => '104',
          'type' => '154924'
        },
        '31' => {
          'name' => 'range_field_format',
          'offset' => '114',
          'type' => '135'
        },
        '32' => {
          'name' => 'range_field_support',
          'offset' => '115',
          'type' => '344'
        },
        '33' => {
          'name' => 'nominal_value',
          'offset' => '118',
          'type' => '154327'
        },
        '34' => {
          'name' => 'normal_max',
          'offset' => '128',
          'type' => '154327'
        },
        '35' => {
          'name' => 'normal_min',
          'offset' => '132',
          'type' => '154327'
        },
        '36' => {
          'name' => 'warning_high',
          'offset' => '136',
          'type' => '154327'
        },
        '37' => {
          'name' => 'warning_low',
          'offset' => '146',
          'type' => '154327'
        },
        '38' => {
          'name' => 'critical_high',
          'offset' => '150',
          'type' => '154327'
        },
        '39' => {
          'name' => 'critical_low',
          'offset' => '256',
          'type' => '154327'
        },
        '40' => {
          'name' => 'fatal_high',
          'offset' => '260',
          'type' => '154327'
        },
        '41' => {
          'name' => 'fatal_low',
          'offset' => '264',
          'type' => '154327'
        }
      },
      'Name' => 'struct pldm_numeric_sensor_value_pdr',
      'Size' => '112',
      'Type' => 'Struct'
    },
    '155650' => {
      'BaseType' => '152574',
      'Header' => 'platform.h',
      'Line' => '869',
      'Name' => 'pldm_utf16be',
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '155663' => {
      'Header' => 'platform.h',
      'Line' => '871',
      'Memb' => {
        '0' => {
          'name' => 'tag',
          'offset' => '0',
          'type' => '5631'
        },
        '1' => {
          'name' => 'name',
          'offset' => '8',
          'type' => '155705'
        }
      },
      'Name' => 'struct pldm_entity_auxiliary_name',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '155705' => {
      'BaseType' => '155650',
      'Name' => 'pldm_utf16be*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '155710' => {
      'Header' => 'platform.h',
      'Line' => '881',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '154937'
        },
        '1' => {
          'name' => 'container',
          'offset' => '18',
          'type' => '112903'
        },
        '2' => {
          'name' => 'shared_name_count',
          'offset' => '24',
          'type' => '135'
        },
        '3' => {
          'name' => 'name_string_count',
          'offset' => '25',
          'type' => '135'
        },
        '4' => {
          'name' => 'names',
          'offset' => '36',
          'type' => '155824'
        },
        '5' => {
          'name' => 'auxiliary_name_data_size',
          'offset' => '50',
          'type' => '164'
        },
        '6' => {
          'name' => 'auxiliary_name_data',
          'offset' => '64',
          'type' => '155829'
        }
      },
      'Name' => 'struct pldm_entity_auxiliary_names_pdr',
      'Size' => '40',
      'Type' => 'Struct'
    },
    '155824' => {
      'BaseType' => '155663',
      'Name' => 'struct pldm_entity_auxiliary_name*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '155829' => {
      'BaseType' => '128',
      'Name' => 'char[]',
      'Size' => '8',
      'Type' => 'Array'
    },
    '155844' => {
      'Header' => 'platform.h',
      'Line' => '911',
      'Memb' => {
        '0' => {
          'name' => 'state_set_id',
          'offset' => '0',
          'type' => '5660'
        },
        '1' => {
          'name' => 'possible_states_size',
          'offset' => '2',
          'type' => '135'
        },
        '2' => {
          'name' => 'states',
          'offset' => '3',
          'type' => '153958'
        }
      },
      'Name' => 'struct state_effecter_possible_states',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '155901' => {
      'BaseType' => '155844',
      'Name' => 'struct state_effecter_possible_states const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '155906' => {
      'Header' => 'platform.h',
      'Line' => '959',
      'Memb' => {
        '0' => {
          'name' => 'set_request',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'effecter_state',
          'offset' => '1',
          'type' => '135'
        }
      },
      'Name' => 'struct state_field_for_state_effecter_set',
      'Size' => '2',
      'Type' => 'Struct'
    },
    '155949' => {
      'BaseType' => '155906',
      'Header' => 'platform.h',
      'Line' => '962',
      'Name' => 'set_effecter_state_field',
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '155962' => {
      'Header' => 'platform.h',
      'Line' => '968',
      'Memb' => {
        '0' => {
          'name' => 'sensor_op_state',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'present_state',
          'offset' => '1',
          'type' => '135'
        },
        '2' => {
          'name' => 'previous_state',
          'offset' => '2',
          'type' => '135'
        },
        '3' => {
          'name' => 'event_state',
          'offset' => '3',
          'type' => '135'
        }
      },
      'Name' => 'struct state_field_for_get_state_sensor_readings',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '156033' => {
      'BaseType' => '155962',
      'Header' => 'platform.h',
      'Line' => '976',
      'Name' => 'get_sensor_state_field',
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '156046' => {
      'Header' => 'platform.h',
      'Line' => '982',
      'Memb' => {
        '0' => {
          'name' => 'effecter_op_state',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'pending_state',
          'offset' => '1',
          'type' => '135'
        },
        '2' => {
          'name' => 'present_state',
          'offset' => '2',
          'type' => '135'
        }
      },
      'Name' => 'struct state_field_for_get_state_effecter_states',
      'Size' => '3',
      'Type' => 'Struct'
    },
    '156103' => {
      'BaseType' => '156046',
      'Header' => 'platform.h',
      'Line' => '986',
      'Name' => 'get_effecter_state_field',
      'Size' => '3',
      'Type' => 'Typedef'
    },
    '156832' => {
      'Header' => 'platform.h',
      'Line' => '1131',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'comp_effecter_count',
          'offset' => '1',
          'type' => '135'
        },
        '2' => {
          'name' => 'field',
          'offset' => '2',
          'type' => '156889'
        }
      },
      'Name' => 'struct pldm_get_state_effecter_states_resp',
      'Size' => '26',
      'Type' => 'Struct'
    },
    '156889' => {
      'BaseType' => '156103',
      'Name' => 'get_effecter_state_field[8]',
      'Size' => '24',
      'Type' => 'Array'
    },
    '156905' => {
      'Header' => 'platform.h',
      'Line' => '1141',
      'Memb' => {
        '0' => {
          'name' => 'sensor_id',
          'offset' => '0',
          'type' => '5660'
        },
        '1' => {
          'name' => 'sensor_event_class_type',
          'offset' => '2',
          'type' => '135'
        },
        '2' => {
          'name' => 'event_class',
          'offset' => '3',
          'type' => '962'
        }
      },
      'Name' => 'struct pldm_sensor_event_data',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '157019' => {
      'Header' => 'platform.h',
      'Line' => '1181',
      'Memb' => {
        '0' => {
          'name' => 'format_version',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'event_id',
          'offset' => '2',
          'type' => '5660'
        },
        '2' => {
          'name' => 'data_transfer_handle',
          'offset' => '4',
          'type' => '147'
        }
      },
      'Name' => 'struct pldm_message_poll_event',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '157081' => {
      'Header' => 'platform.h',
      'Line' => '1191',
      'Memb' => {
        '0' => {
          'name' => 'format_version',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'format_type',
          'offset' => '1',
          'type' => '135'
        },
        '2' => {
          'name' => 'event_data_length',
          'offset' => '2',
          'type' => '5660'
        },
        '3' => {
          'name' => 'event_data',
          'offset' => '4',
          'type' => '157152'
        }
      },
      'Name' => 'struct pldm_platform_cper_event',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '157152' => {
      'BaseType' => '135',
      'Name' => 'uint8_t[]',
      'Size' => '8',
      'Type' => 'Array'
    },
    '157308' => {
      'Header' => 'platform.h',
      'Line' => '1251',
      'Memb' => {
        '0' => {
          'name' => 'event_data_format',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'number_of_change_records',
          'offset' => '1',
          'type' => '135'
        },
        '2' => {
          'name' => 'change_records',
          'offset' => '2',
          'type' => '962'
        }
      },
      'Name' => 'struct pldm_pdr_repository_chg_event_data',
      'Size' => '3',
      'Type' => 'Struct'
    },
    '157932' => {
      'BaseType' => '157081',
      'Name' => 'struct pldm_platform_cper_event*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '161402' => {
      'BaseType' => '155710',
      'Name' => 'struct pldm_entity_auxiliary_names_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '170922' => {
      'BaseType' => '156832',
      'Name' => 'struct pldm_get_state_effecter_states_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '217074' => {
      'BaseType' => '2697',
      'Name' => 'size_t*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '220033' => {
      'BaseType' => '157019',
      'Name' => 'struct pldm_message_poll_event*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '221465' => {
      'BaseType' => '221475',
      'Name' => 'uint32_t const*const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '221470' => {
      'BaseType' => '159',
      'Name' => 'uint32_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '221475' => {
      'BaseType' => '221470',
      'Name' => 'uint32_t const*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '221480' => {
      'BaseType' => '157308',
      'Name' => 'struct pldm_pdr_repository_chg_event_data*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '265181' => {
      'BaseType' => '155057',
      'Name' => 'struct pldm_numeric_sensor_value_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '287299' => {
      'BaseType' => '156905',
      'Name' => 'struct pldm_sensor_event_data*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '287304' => {
      'BaseType' => '287299',
      'Name' => 'struct pldm_sensor_event_data*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '291279' => {
      'BaseType' => '156033',
      'Name' => 'get_sensor_state_field*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '314579' => {
      'BaseType' => '155949',
      'Name' => 'set_effecter_state_field*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '315555' => {
      'BaseType' => '153742',
      'Name' => 'struct pldm_state_sensor_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '315560' => {
      'BaseType' => '315555',
      'Name' => 'struct pldm_state_sensor_pdr*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '315565' => {
      'BaseType' => '153953',
      'Name' => 'struct state_sensor_possible_states const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '315570' => {
      'BaseType' => '315565',
      'Name' => 'struct state_sensor_possible_states const*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '315965' => {
      'BaseType' => '153974',
      'Name' => 'struct pldm_state_effecter_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '315970' => {
      'BaseType' => '315965',
      'Name' => 'struct pldm_state_effecter_pdr*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '315975' => {
      'BaseType' => '155901',
      'Name' => 'struct state_effecter_possible_states const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '315980' => {
      'BaseType' => '315975',
      'Name' => 'struct state_effecter_possible_states const*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '319399' => {
      'Line' => '19',
      'Memb' => {
        '0' => {
          'name' => 'prev',
          'offset' => '0',
          'type' => '4841'
        },
        '1' => {
          'name' => 'allocations',
          'offset' => '4',
          'type' => '147'
        }
      },
      'Name' => 'struct pldm_tid_state',
      'PrivateABI' => 1,
      'Size' => '8',
      'Source' => 'instance-id.c',
      'Type' => 'Struct'
    },
    '319438' => {
      'Line' => '24',
      'Memb' => {
        '0' => {
          'name' => 'state',
          'offset' => '0',
          'type' => '319480'
        },
        '1' => {
          'name' => 'lock_db_fd',
          'offset' => '8264',
          'type' => '100'
        }
      },
      'Name' => 'struct pldm_instance_db',
      'PrivateABI' => 1,
      'Size' => '2052',
      'Source' => 'instance-id.c',
      'Type' => 'Struct'
    },
    '319480' => {
      'BaseType' => '319399',
      'Name' => 'struct pldm_tid_state[256]',
      'Size' => '2048',
      'Type' => 'Array'
    },
    '320036' => {
      'BaseType' => '319438',
      'Name' => 'struct pldm_instance_db*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '320423' => {
      'BaseType' => '4841',
      'Name' => 'pldm_instance_id_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '320599' => {
      'BaseType' => '320036',
      'Name' => 'struct pldm_instance_db**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '321391' => {
      'BaseType' => '135',
      'Header' => 'pldm.h',
      'Line' => '13',
      'Name' => 'mctp_eid_t',
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '321506' => {
      'BaseType' => '4938',
      'Header' => 'pldm.h',
      'Line' => '30',
      'Name' => 'pldm_requester_rc_t',
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '321524' => {
      'Line' => '26',
      'Memb' => {
        '0' => {
          'name' => 'transport',
          'offset' => '0',
          'type' => '321597'
        },
        '1' => {
          'name' => 'socket',
          'offset' => '64',
          'type' => '100'
        },
        '2' => {
          'name' => 'tid_eid_map',
          'offset' => '68',
          'type' => '325302'
        },
        '3' => {
          'name' => 'socket_send_buf',
          'offset' => '768',
          'type' => '324215'
        }
      },
      'Name' => 'struct pldm_transport_mctp_demux',
      'PrivateABI' => 1,
      'Size' => '312',
      'Source' => 'mctp-demux.c',
      'Type' => 'Struct'
    },
    '321550' => {
      'BaseType' => '321524',
      'Name' => 'struct pldm_transport_mctp_demux*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '321592' => {
      'BaseType' => '321597',
      'Name' => 'struct pldm_transport*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '321597' => {
      'Header' => 'transport.h',
      'Line' => '18',
      'Memb' => {
        '0' => {
          'name' => 'name',
          'offset' => '0',
          'type' => '8652'
        },
        '1' => {
          'name' => 'version',
          'offset' => '8',
          'type' => '135'
        },
        '2' => {
          'name' => 'recv',
          'offset' => '22',
          'type' => '324528'
        },
        '3' => {
          'name' => 'send',
          'offset' => '36',
          'type' => '324569'
        },
        '4' => {
          'name' => 'init_pollfd',
          'offset' => '50',
          'type' => '324650'
        }
      },
      'Name' => 'struct pldm_transport',
      'PrivateABI' => 1,
      'Size' => '40',
      'Type' => 'Struct'
    },
    '321733' => {
      'BaseType' => '4829',
      'Name' => 'pldm_tid_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '321836' => {
      'BaseType' => '321550',
      'Name' => 'struct pldm_transport_mctp_demux**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '323933' => {
      'BaseType' => '46',
      'Header' => 'int-ll64.h',
      'Line' => '21',
      'Name' => '__u8',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '323945' => {
      'BaseType' => '53',
      'Header' => 'int-ll64.h',
      'Line' => '24',
      'Name' => '__u16',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '324215' => {
      'Header' => 'socket.h',
      'Line' => '5',
      'Memb' => {
        '0' => {
          'name' => 'size',
          'offset' => '0',
          'type' => '100'
        },
        '1' => {
          'name' => 'socket',
          'offset' => '4',
          'type' => '100'
        },
        '2' => {
          'name' => 'max_size',
          'offset' => '8',
          'type' => '100'
        }
      },
      'Name' => 'struct pldm_socket_sndbuf',
      'PrivateABI' => 1,
      'Size' => '12',
      'Type' => 'Struct'
    },
    '324528' => {
      'Name' => 'pldm_requester_rc_t(*)(struct pldm_transport*, pldm_tid_t*, void**, size_t*)',
      'Param' => {
        '0' => {
          'type' => '321592'
        },
        '1' => {
          'type' => '321733'
        },
        '2' => {
          'type' => '104722'
        },
        '3' => {
          'type' => '2697'
        }
      },
      'Return' => '321506',
      'Size' => '8',
      'Type' => 'FuncPtr'
    },
    '324569' => {
      'Name' => 'pldm_requester_rc_t(*)(struct pldm_transport*, pldm_tid_t, void const*, size_t)',
      'Param' => {
        '0' => {
          'type' => '321592'
        },
        '1' => {
          'type' => '4829'
        },
        '2' => {
          'type' => '1262'
        },
        '3' => {
          'type' => '164'
        }
      },
      'Return' => '321506',
      'Size' => '8',
      'Type' => 'FuncPtr'
    },
    '324594' => {
      'BaseType' => '324599',
      'Name' => 'struct pollfd*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '324599' => {
      'Header' => 'poll.h',
      'Line' => '36',
      'Memb' => {
        '0' => {
          'name' => 'fd',
          'offset' => '0',
          'type' => '100'
        },
        '1' => {
          'name' => 'events',
          'offset' => '4',
          'type' => '93'
        },
        '2' => {
          'name' => 'revents',
          'offset' => '6',
          'type' => '93'
        }
      },
      'Name' => 'struct pollfd',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Struct'
    },
    '324650' => {
      'Name' => 'int(*)(struct pldm_transport*, struct pollfd*)',
      'Param' => {
        '0' => {
          'type' => '321592'
        },
        '1' => {
          'type' => '324594'
        }
      },
      'Return' => '100',
      'Size' => '8',
      'Type' => 'FuncPtr'
    },
    '324655' => {
      'BaseType' => '53',
      'Header' => 'socket.h',
      'Line' => '10',
      'Name' => '__kernel_sa_family_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '325033' => {
      'Header' => 'mctp.h',
      'Line' => '18',
      'Memb' => {
        '0' => {
          'name' => 's_addr',
          'offset' => '0',
          'type' => '321391'
        }
      },
      'Name' => 'struct mctp_addr',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Struct'
    },
    '325060' => {
      'Header' => 'mctp.h',
      'Line' => '22',
      'Memb' => {
        '0' => {
          'name' => 'smctp_family',
          'offset' => '0',
          'type' => '324655'
        },
        '1' => {
          'name' => '__smctp_pad0',
          'offset' => '2',
          'type' => '323945'
        },
        '2' => {
          'name' => 'smctp_network',
          'offset' => '4',
          'type' => '60'
        },
        '3' => {
          'name' => 'smctp_addr',
          'offset' => '8',
          'type' => '325033'
        },
        '4' => {
          'name' => 'smctp_type',
          'offset' => '9',
          'type' => '323933'
        },
        '5' => {
          'name' => 'smctp_tag',
          'offset' => '16',
          'type' => '323933'
        },
        '6' => {
          'name' => '__smctp_pad1',
          'offset' => '17',
          'type' => '323933'
        }
      },
      'Name' => 'struct sockaddr_mctp',
      'PrivateABI' => 1,
      'Size' => '12',
      'Type' => 'Struct'
    },
    '325165' => {
      'BaseType' => '325060',
      'Name' => 'struct sockaddr_mctp const',
      'Size' => '12',
      'Type' => 'Const'
    },
    '325209' => {
      'Line' => '35',
      'Memb' => {
        '0' => {
          'name' => 'transport',
          'offset' => '0',
          'type' => '321597'
        },
        '1' => {
          'name' => 'socket',
          'offset' => '64',
          'type' => '100'
        },
        '2' => {
          'name' => 'tid_eid_map',
          'offset' => '68',
          'type' => '325302'
        },
        '3' => {
          'name' => 'socket_send_buf',
          'offset' => '768',
          'type' => '324215'
        },
        '4' => {
          'name' => 'bound',
          'offset' => '786',
          'type' => '5459'
        },
        '5' => {
          'name' => 'cookie_jar',
          'offset' => '800',
          'type' => '4853'
        }
      },
      'Name' => 'struct pldm_transport_af_mctp',
      'PrivateABI' => 1,
      'Size' => '336',
      'Source' => 'af-mctp.c',
      'Type' => 'Struct'
    },
    '325302' => {
      'BaseType' => '4829',
      'Name' => 'pldm_tid_t[256]',
      'Size' => '256',
      'Type' => 'Array'
    },
    '326103' => {
      'BaseType' => '325209',
      'Name' => 'struct pldm_transport_af_mctp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '326108' => {
      'BaseType' => '325165',
      'Name' => 'struct sockaddr_mctp const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '326421' => {
      'BaseType' => '326103',
      'Name' => 'struct pldm_transport_af_mctp**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '353089' => {
      'Header' => 'file_io.h',
      'Line' => '32',
      'Memb' => {
        '0' => {
          'name' => 'handle',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'length',
          'offset' => '4',
          'type' => '147'
        },
        '2' => {
          'name' => 'data',
          'offset' => '8',
          'type' => '157152'
        }
      },
      'Name' => 'struct pldm_oem_meta_file_io_write_req',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '353156' => {
      'Header' => 'file_io.h',
      'Line' => '45',
      'Memb' => {
        '0' => {
          'name' => 'transferFlag',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'offset',
          'offset' => '2',
          'type' => '5660'
        }
      },
      'Name' => 'struct pldm_oem_meta_file_io_read_data_info',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '353195' => {
      'Header' => 'file_io.h',
      'Line' => '55',
      'Memb' => {
        '0' => {
          'name' => 'size',
          'offset' => '0',
          'type' => '5660'
        },
        '1' => {
          'name' => 'crc32',
          'offset' => '4',
          'type' => '147'
        }
      },
      'Name' => 'struct pldm_oem_meta_file_io_read_attr_info',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '353234' => {
      'Header' => 'file_io.h',
      'Line' => '70',
      'Memb' => {
        '0' => {
          'name' => 'data',
          'offset' => '0',
          'type' => '353156'
        }
      },
      'Name' => 'anon-union-file_io.h-70',
      'Size' => '4',
      'Type' => 'Union'
    },
    '353252' => {
      'Header' => 'file_io.h',
      'Line' => '65',
      'Memb' => {
        '0' => {
          'name' => 'version',
          'offset' => '0',
          'type' => '164'
        },
        '1' => {
          'name' => 'handle',
          'offset' => '8',
          'type' => '135'
        },
        '2' => {
          'name' => 'option',
          'offset' => '9',
          'type' => '135'
        },
        '3' => {
          'name' => 'length',
          'offset' => '16',
          'type' => '135'
        },
        '4' => {
          'name' => 'info',
          'offset' => '18',
          'type' => '353234'
        }
      },
      'Name' => 'struct pldm_oem_meta_file_io_read_req',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '353330' => {
      'Header' => 'file_io.h',
      'Line' => '86',
      'Memb' => {
        '0' => {
          'name' => 'attr',
          'offset' => '0',
          'type' => '353195'
        },
        '1' => {
          'name' => 'data',
          'offset' => '0',
          'type' => '353156'
        }
      },
      'Name' => 'anon-union-file_io.h-86',
      'Size' => '8',
      'Type' => 'Union'
    },
    '353358' => {
      'Header' => 'file_io.h',
      'Line' => '80',
      'Memb' => {
        '0' => {
          'name' => 'version',
          'offset' => '0',
          'type' => '164'
        },
        '1' => {
          'name' => 'completion_code',
          'offset' => '8',
          'type' => '135'
        },
        '2' => {
          'name' => 'handle',
          'offset' => '9',
          'type' => '135'
        },
        '3' => {
          'name' => 'option',
          'offset' => '16',
          'type' => '135'
        },
        '4' => {
          'name' => 'length',
          'offset' => '17',
          'type' => '135'
        },
        '5' => {
          'name' => 'info',
          'offset' => '18',
          'type' => '353330'
        },
        '6' => {
          'name' => 'data',
          'offset' => '32',
          'type' => '157152'
        }
      },
      'Name' => 'struct pldm_oem_meta_file_io_read_resp',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '357329' => {
      'BaseType' => '353358',
      'Name' => 'struct pldm_oem_meta_file_io_read_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '359587' => {
      'BaseType' => '353252',
      'Name' => 'struct pldm_oem_meta_file_io_read_req*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '360023' => {
      'BaseType' => '353089',
      'Name' => 'struct pldm_oem_meta_file_io_write_req*',
      'Size' => '8',
      'Type' => 'Pointer'
    }
  },
  'UndefinedSymbols' => {
    'libpldm.so.0.11.0' => {
      '_ITM_deregisterTMCloneTable' => 0,
      '_ITM_registerTMCloneTable' => 0,
      '__assert_fail@GLIBC_2.2.5' => 0,
      '__cxa_finalize@GLIBC_2.2.5' => 0,
      '__errno_location@GLIBC_2.2.5' => 0,
      '__gmon_start__' => 0,
      '__isoc23_strtol@GLIBC_2.38' => 0,
      '__memcpy_chk@GLIBC_2.3.4' => 0,
      '__recv_chk@GLIBC_2.4' => 0,
      '__recvfrom_chk@GLIBC_2.4' => 0,
      '__stack_chk_fail@GLIBC_2.4' => 0,
      'bind@GLIBC_2.2.5' => 0,
      'calloc@GLIBC_2.2.5' => 0,
      'clock_gettime@GLIBC_2.17' => 0,
      'close@GLIBC_2.2.5' => 0,
      'connect@GLIBC_2.2.5' => 0,
      'dup@GLIBC_2.2.5' => 0,
      'fclose@GLIBC_2.2.5' => 0,
      'fcntl64@GLIBC_2.28' => 0,
      'fgets@GLIBC_2.2.5' => 0,
      'fopen64@GLIBC_2.2.5' => 0,
      'free@GLIBC_2.2.5' => 0,
      'getsockopt@GLIBC_2.2.5' => 0,
      'malloc@GLIBC_2.2.5' => 0,
      'memcmp@GLIBC_2.2.5' => 0,
      'memcpy@GLIBC_2.14' => 0,
      'memmem@GLIBC_2.2.5' => 0,
      'open64@GLIBC_2.2.5' => 0,
      'poll@GLIBC_2.2.5' => 0,
      'ppoll@GLIBC_2.4' => 0,
      'recv@GLIBC_2.2.5' => 0,
      'recvmsg@GLIBC_2.2.5' => 0,
      'sendmsg@GLIBC_2.2.5' => 0,
      'sendto@GLIBC_2.2.5' => 0,
      'setsockopt@GLIBC_2.2.5' => 0,
      'socket@GLIBC_2.2.5' => 0,
      'stat64@GLIBC_2.33' => 0,
      'strlen@GLIBC_2.2.5' => 0,
      'strnlen@GLIBC_2.2.5' => 0,
      'timerfd_create@GLIBC_2.8' => 0,
      'timerfd_settime@GLIBC_2.8' => 0,
      'write@GLIBC_2.2.5' => 0
    }
  },
  'WordSize' => '8'
};
