$VAR1 = {
  'ABI_DUMPER_VERSION' => '1.2',
  'ABI_DUMP_VERSION' => '3.5',
  'Arch' => 'x86_64',
  'GccVersion' => '14.2.0',
  'Headers' => {
    'af-mctp.h' => 1,
    'base.h' => 1,
    'bios.h' => 1,
    'bios_table.h' => 1,
    'file_io.h' => 1,
    'firmware_update.h' => 1,
    'fru.h' => 1,
    'host.h' => 1,
    'instance-id.h' => 1,
    'mctp-demux.h' => 1,
    'pdr.h' => 1,
    'platform.h' => 1,
    'pldm.h' => 1,
    'pldm_types.h' => 1,
    'transport.h' => 1,
    'utils.h' => 1
  },
  'Language' => 'C',
  'LibraryName' => 'libpldm.so.0.12.0',
  'LibraryVersion' => '0.12.0',
  'NameSpaces' => {},
  'Needed' => {
    'libc.so.6' => 1
  },
  'PublicABI' => '1',
  'Sources' => {
    'af-mctp.c' => 1,
    'bios_table.c' => 1,
    'instance-id.c' => 1,
    'mctp-demux.c' => 1,
    'pdr.c' => 1
  },
  'SymbolInfo' => {
    '1370' => {
      'Header' => 'base.h',
      'Line' => '730',
      'Param' => {
        '0' => {
          'name' => 'instance_id',
          'type' => '135'
        },
        '1' => {
          'name' => 'type',
          'type' => '135'
        },
        '2' => {
          'name' => 'command',
          'type' => '135'
        },
        '3' => {
          'name' => 'cc',
          'type' => '135'
        },
        '4' => {
          'name' => 'msg',
          'type' => '1412'
        }
      },
      'Return' => '53',
      'ShortName' => 'encode_cc_only_resp'
    },
    '1417' => {
      'Header' => 'base.h',
      'Line' => '584',

      'pldm_edac_crc8' => 1,
      'pldm_entity_association_pdr_add' => 1,
      'pldm_entity_association_pdr_add_from_node' => 1,
      'pldm_entity_association_pdr_add_from_node_with_record_handle' => 1,
      'pldm_entity_association_pdr_extract' => 1,
      'pldm_entity_association_tree_add' => 1,
      'pldm_entity_association_tree_add_entity' => 1,
      'pldm_entity_association_tree_copy_root' => 1,
      'pldm_entity_association_tree_destroy' => 1,
      'pldm_entity_association_tree_destroy_root' => 1,
      'pldm_entity_association_tree_find' => 1,
      'pldm_entity_association_tree_find_with_locality' => 1,
      'pldm_entity_association_tree_init' => 1,
      'pldm_entity_association_tree_visit' => 1,
      'pldm_entity_extract' => 1,
      'pldm_entity_get_num_children' => 1,
      'pldm_entity_get_parent' => 1,
      'pldm_entity_is_exist_parent' => 1,
      'pldm_entity_is_node_parent' => 1,
      'pldm_entity_node_get_remote_container_id' => 1,
      'pldm_find_entity_ref_in_tree' => 1,
      'pldm_instance_db_destroy' => 1,
      'pldm_instance_db_init' => 1,
      'pldm_instance_db_init_default' => 1,
      'pldm_instance_id_alloc' => 1,
      'pldm_instance_id_free' => 1,
      'pldm_is_current_parent_child' => 1,
      'pldm_is_empty_entity_assoc_tree' => 1,
      'pldm_msg_hdr_correlate_response' => 1,
      'pldm_oem_meta_file_io_read_resp_data' => 1,
      'pldm_oem_meta_file_io_write_req_data' => 1,
      'pldm_pdr_add' => 1,
      'pldm_pdr_add_fru_record_set' => 1,
      'pldm_pdr_delete_by_record_handle' => 1,
      'pldm_pdr_destroy' => 1,
      'pldm_pdr_find_last_in_range' => 1,
      'pldm_pdr_find_record' => 1,
      'pldm_pdr_find_record_by_type' => 1,
      'pldm_pdr_fru_record_set_find_by_rsi' => 1,
      'pldm_pdr_get_next_record' => 1,
      'pldm_pdr_get_record_count' => 1,
      'pldm_pdr_get_record_handle' => 1,
      'pldm_pdr_get_repo_size' => 1,
      'pldm_pdr_init' => 1,
      'pldm_pdr_record_is_remote' => 1,
      'pldm_pdr_remove_pdrs_by_terminus_handle' => 1,
      'pldm_pdr_remove_remote_pdrs' => 1,
      'pldm_pdr_update_TL_pdr' => 1,
      'pldm_platform_cper_event_event_data' => 1,
      'pldm_transport_af_mctp_bind' => 1,
      'pldm_transport_af_mctp_core' => 1,
      'pldm_transport_af_mctp_destroy' => 1,
      'pldm_transport_af_mctp_init' => 1,
      'pldm_transport_af_mctp_init_pollfd' => 1,
      'pldm_transport_af_mctp_map_tid' => 1,
      'pldm_transport_af_mctp_unmap_tid' => 1,
      'pldm_transport_mctp_demux_core' => 1,
      'pldm_transport_mctp_demux_destroy' => 1,
      'pldm_transport_mctp_demux_init' => 1,
      'pldm_transport_mctp_demux_init_pollfd' => 1,
      'pldm_transport_mctp_demux_map_tid' => 1,
      'pldm_transport_mctp_demux_unmap_tid' => 1,
      'pldm_transport_poll' => 1,
      'pldm_transport_recv_msg' => 1,
      'pldm_transport_send_msg' => 1,
      'pldm_transport_send_recv_msg' => 1,
      'unpack_pldm_header' => 1,
      'ver2str' => 1
    }
  },
  'Target' => 'unix',
  'TypeInfo' => {
    '1' => {
      'Name' => 'void',
      'Type' => 'Intrinsic'
    },
    '46' => {
      'Name' => 'char',
      'Size' => '1',
      'Type' => 'Intrinsic'
    },
    '53' => {
      'Name' => 'int',
      'Size' => '4',
      'Type' => 'Intrinsic'
    },
    '60' => {
      'Name' => 'unsigned char',
      'Size' => '1',
      'Type' => 'Intrinsic'
    },
    '67' => {
      'Name' => 'unsigned short',
      'Size' => '2',
      'Type' => 'Intrinsic'
    },
    '74' => {
      'Name' => 'unsigned int',
      'Size' => '4',
      'Type' => 'Intrinsic'
    },
    '81' => {
      'Name' => 'unsigned long',
      'Size' => '8',
      'Type' => 'Intrinsic'
    },
    '88' => {
      'Name' => 'signed char',
      'Size' => '1',
      'Type' => 'Intrinsic'
    },
    '95' => {
      'BaseType' => '60',
      'Header' => 'types.h',
      'Line' => '38',
      'Name' => '__uint8_t',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '107' => {
      'Name' => 'short',
      'Size' => '2',
      'Type' => 'Intrinsic'
    },
    '114' => {
      'BaseType' => '74',
      'Header' => 'types.h',
      'Line' => '42',
      'Name' => '__uint32_t',
      'PrivateABI' => 1,
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '126' => {
      'Name' => 'long',
      'Size' => '8',
      'Type' => 'Intrinsic'
    },
    '133' => {
      'BaseType' => '1',
      'Name' => 'void*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '135' => {
      'BaseType' => '95',
      'Header' => 'stdint-uintn.h',
      'Line' => '24',
      'Name' => 'uint8_t',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '147' => {
      'BaseType' => '114',
      'Header' => 'stdint-uintn.h',
      'Line' => '26',
      'Name' => 'uint32_t',
      'PrivateABI' => 1,
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '159' => {
      'BaseType' => '147',
      'Name' => 'uint32_t const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '164' => {
      'BaseType' => '81',
      'Header' => 'stddef.h',
      'Line' => '214',
      'Name' => 'size_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '190' => {
      'Header' => 'pldm_types.h',
      'Line' => '9',
      'Name' => 'anon-struct-pldm_types.h-9',
      'Size' => '1',
      'Type' => 'Struct'
    },
    '344' => {
      'Header' => 'pldm_types.h',
      'Line' => '19',
      'Memb' => {
        '0' => {
          'name' => 'byte',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'bits',
          'offset' => '0',
          'type' => '190'
        }
      },
      'Name' => 'union bitfield8_t',
      'Size' => '1',
      'Type' => 'Union'
    },
    '356' => {
      'BaseType' => '344',
      'Name' => 'bitfield8_t const',
      'Size' => '1',
      'Type' => 'Const'
    },
    '361' => {
      'Header' => 'pldm_types.h',
      'Line' => '25',
      'Memb' => {
        '0' => {
          'name' => 'alpha',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'update',
          'offset' => '1',
          'type' => '135'
        },
        '2' => {
          'name' => 'minor',
          'offset' => '2',
          'type' => '135'
        },
        '3' => {
          'name' => 'major',
          'offset' => '3',
          'type' => '135'
        }
      },
      'Name' => 'struct pldm_version',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '427' => {
      'BaseType' => '361',
      'Header' => 'pldm_types.h',
      'Line' => '30',
      'Name' => 'ver32_t',
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '439' => {
      'BaseType' => '427',
      'Name' => 'ver32_t const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '444' => {
      'Name' => 'float',
      'Size' => '4',
      'Type' => 'Intrinsic'
    },
    '795' => {
      'Header' => 'base.h',
      'Line' => '108',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_RESPONSE',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_REQUEST',
          'value' => '1'
        },
        '2' => {
          'name' => 'PLDM_RESERVED',
          'value' => '2'
        },
        '3' => {
          'name' => 'PLDM_ASYNC_REQUEST_NOTIFY',
          'value' => '3'
        }
      },
      'Name' => 'enum MessageType',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '807' => {
      'Header' => 'base.h',
      'Line' => '161',
      'Memb' => {
        '0' => {
          'name' => 'command',
          'offset' => '2',
          'type' => '135'
        }
      },
      'Name' => 'struct pldm_msg_hdr',
      'Size' => '3',
      'Type' => 'Struct'
    },
    '918' => {
      'BaseType' => '807',
      'Name' => 'struct pldm_msg_hdr const',
      'Size' => '3',
      'Type' => 'Const'
    },
    '923' => {
      'Header' => 'base.h',
      'Line' => '194',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '807'
        },
        '1' => {
          'name' => 'payload',
          'offset' => '3',
          'type' => '968'
        }
      },
      'Name' => 'struct pldm_msg',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '963' => {
      'BaseType' => '923',
      'Name' => 'struct pldm_msg const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '968' => {
      'BaseType' => '135',
      'Name' => 'uint8_t[1]',
      'Size' => '1',
      'Type' => 'Array'
    },
    '984' => {
      'Header' => 'base.h',
      'Line' => '261',
      'Memb' => {
        '0' => {
          'name' => 'msg_type',
          'offset' => '0',
          'type' => '795'
        },
        '1' => {
          'name' => 'instance',
          'offset' => '4',
          'type' => '135'
        },
        '2' => {
          'name' => 'pldm_type',
          'offset' => '5',
          'type' => '135'
        },
        '3' => {
          'name' => 'command',
          'offset' => '6',
          'type' => '135'
        },
        '4' => {
          'name' => 'completion_code',
          'offset' => '7',
          'type' => '135'
        }
      },
      'Name' => 'struct pldm_header_info',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '1064' => {
      'BaseType' => '984',
      'Name' => 'struct pldm_header_info const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '1231' => {
      'BaseType' => '1236',
      'Name' => 'void const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '1236' => {
      'BaseType' => '1',
      'Name' => 'void const',
      'Type' => 'Const'
    },
    '1237' => {
      'BaseType' => '356',
      'Name' => 'bitfield8_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '1412' => {
      'BaseType' => '923',
      'Name' => 'struct pldm_msg*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '1491' => {
      'BaseType' => '963',
      'Name' => 'struct pldm_msg const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '1496' => {
      'BaseType' => '135',
      'Name' => 'uint8_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '1501' => {
      'BaseType' => '427',
      'Name' => 'ver32_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '1595' => {
      'BaseType' => '439',
      'Name' => 'ver32_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '1642' => {
      'BaseType' => '147',
      'Name' => 'uint32_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '1711' => {
      'BaseType' => '918',
      'Name' => 'struct pldm_msg_hdr const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '1716' => {
      'BaseType' => '984',
      'Name' => 'struct pldm_header_info*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2671' => {
      'BaseType' => '164',
      'Name' => 'size_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '3131' => {
      'BaseType' => '1064',
      'Name' => 'struct pldm_header_info const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '4803' => {
      'BaseType' => '135',
      'Header' => 'base.h',
      'Line' => '19',
      'Name' => 'pldm_tid_t',
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '4815' => {
      'BaseType' => '135',
      'Header' => 'instance-id.h',
      'Line' => '13',
      'Name' => 'pldm_instance_id_t',
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '4827' => {
      'Header' => 'responder.h',
      'Line' => '10',
      'Memb' => {
        '0' => {
          'name' => 'tid',
          'offset' => '0',
          'type' => '4803'
        },
        '1' => {
          'name' => 'instance_id',
          'offset' => '1',
          'type' => '4815'
        },
        '2' => {
          'name' => 'type',
          'offset' => '2',
          'type' => '135'
        },
        '3' => {
          'name' => 'command',
          'offset' => '3',
          'type' => '135'
        },
        '4' => {
          'name' => 'next',
          'offset' => '8',
          'type' => '4907'
        }
      },
      'Name' => 'struct pldm_responder_cookie',
      'PrivateABI' => 1,
      'Size' => '16',
      'Type' => 'Struct'
    },
    '4907' => {
      'BaseType' => '4827',
      'Name' => 'struct pldm_responder_cookie*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '4912' => {
      'Header' => 'pldm.h',
      'Line' => '15',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_REQUESTER_SUCCESS',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_REQUESTER_OPEN_FAIL',
          'value' => '18446744073709551615 (-1)'
        },
        '2' => {
          'name' => 'PLDM_REQUESTER_NOT_PLDM_MSG',
          'value' => '18446744073709551614 (-2)'
        },
        '3' => {
          'name' => 'PLDM_REQUESTER_NOT_RESP_MSG',
          'value' => '18446744073709551613 (-3)'
        },
        '4' => {
          'name' => 'PLDM_REQUESTER_NOT_REQ_MSG',
          'value' => '18446744073709551612 (-4)'
        },
        '5' => {
          'name' => 'PLDM_REQUESTER_RESP_MSG_TOO_SMALL',
          'value' => '18446744073709551611 (-5)'
        },
        '6' => {
          'name' => 'PLDM_REQUESTER_INSTANCE_ID_MISMATCH',
          'value' => '18446744073709551610 (-6)'
        },
        '7' => {
          'name' => 'PLDM_REQUESTER_SEND_FAIL',
          'value' => '18446744073709551609 (-7)'
        },
        '8' => {
          'name' => 'PLDM_REQUESTER_RECV_FAIL',
          'value' => '18446744073709551608 (-8)'
        },
        '9' => {
          'name' => 'PLDM_REQUESTER_INVALID_RECV_LEN',
          'value' => '18446744073709551607 (-9)'
        },
        '10' => {
          'name' => 'PLDM_REQUESTER_SETUP_FAIL',
          'value' => '18446744073709551606 (-10)'
        },
        '11' => {
          'name' => 'PLDM_REQUESTER_INVALID_SETUP',
          'value' => '18446744073709551605 (-11)'
        },
        '12' => {
          'name' => 'PLDM_REQUESTER_POLL_FAIL',
          'value' => '18446744073709551604 (-12)'
        },
        '13' => {
          'name' => 'PLDM_REQUESTER_TRANSPORT_BUSY',
          'value' => '18446744073709551603 (-13)'
        }
      },
      'Name' => 'enum pldm_requester_error_codes',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '5433' => {
      'Name' => '_Bool',
      'Size' => '1',
      'Type' => 'Intrinsic'
    },
    '5555' => {
      'BaseType' => '67',
      'Header' => 'types.h',
      'Line' => '40',
      'Name' => '__uint16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '5593' => {
      'BaseType' => '126',
      'Header' => 'types.h',
      'Line' => '194',
      'Name' => '__ssize_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '5605' => {
      'BaseType' => '46',
      'Name' => 'char*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '5629' => {
      'BaseType' => '135',
      'Name' => 'uint8_t const',
      'Size' => '1',
      'Type' => 'Const'
    },
    '5634' => {
      'BaseType' => '5555',
      'Header' => 'stdint-uintn.h',
      'Line' => '25',
      'Name' => 'uint16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '5766' => {
      'BaseType' => '5593',
      'Header' => 'types.h',
      'Line' => '108',
      'Name' => 'ssize_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '5785' => {
      'BaseType' => '5629',
      'Name' => 'uint8_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '7300' => {
      'BaseType' => '46',
      'Name' => 'char const',
      'Size' => '1',
      'Type' => 'Const'
    },
    '7334' => {
      'BaseType' => '5634',
      'Name' => 'uint16_t const',
      'Size' => '2',
      'Type' => 'Const'
    },
    '7674' => {
      'Header' => 'utils.h',
      'Line' => '20',
      'Memb' => {
        '0' => {
          'name' => 'ptr',
          'offset' => '0',
          'type' => '5785'
        },
        '1' => {
          'name' => 'length',
          'offset' => '8',
          'type' => '164'
        }
      },
      'Name' => 'struct variable_field',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '8959' => {
      'BaseType' => '7300',
      'Name' => 'char const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '19243' => {
      'BaseType' => '344',
      'Name' => 'bitfield8_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '21012' => {
      'BaseType' => '807',
      'Name' => 'struct pldm_msg_hdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '21335' => {
      'BaseType' => '133',
      'Name' => 'void**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '24662' => {
      'BaseType' => '7674',
      'Name' => 'struct variable_field*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '26744' => {
      'BaseType' => '5634',
      'Name' => 'uint16_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '29983' => {
      'BaseType' => '81',
      'Header' => 'types.h',
      'Line' => '45',
      'Name' => '__uint64_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '30077' => {
      'BaseType' => '29983',
      'Header' => 'stdint-uintn.h',
      'Line' => '27',
      'Name' => 'uint64_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '30291' => {
      'Header' => 'bios.h',
      'Line' => '39',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_BIOS_STRING_TABLE',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_BIOS_ATTR_TABLE',
          'value' => '1'
        },
        '2' => {
          'name' => 'PLDM_BIOS_ATTR_VAL_TABLE',
          'value' => '2'
        }
      },
      'Name' => 'enum pldm_bios_table_types',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '30325' => {
      'Header' => 'bios.h',
      'Line' => '48',
      'Memb' => {
        '0' => {
          'name' => 'string_handle',
          'offset' => '0',
          'type' => '5634'
        },
        '1' => {
          'name' => 'string_length',
          'offset' => '2',
          'type' => '5634'
        },
        '2' => {
          'name' => 'name',
          'offset' => '4',
          'type' => '30382'
        }
      },
      'Name' => 'struct pldm_bios_string_table_entry',
      'Size' => '5',
      'Type' => 'Struct'
    },
    '30377' => {
      'BaseType' => '30325',
      'Name' => 'struct pldm_bios_string_table_entry const',
      'Size' => '5',
      'Type' => 'Const'
    },
    '30382' => {
      'BaseType' => '46',
      'Name' => 'char[1]',
      'Size' => '1',
      'Type' => 'Array'
    },
    '30398' => {
      'Header' => 'bios.h',
      'Line' => '54',
      'Memb' => {
        '0' => {
          'name' => 'attr_handle',
          'offset' => '0',
          'type' => '5634'
        },
        '1' => {
          'name' => 'attr_type',
          'offset' => '2',
          'type' => '135'
        },
        '2' => {
          'name' => 'string_handle',
          'offset' => '3',
          'type' => '5634'
        },
        '3' => {
          'name' => 'metadata',
          'offset' => '5',
          'type' => '968'
        }
      },
      'Name' => 'struct pldm_bios_attr_table_entry',
      'Size' => '6',
      'Type' => 'Struct'
    },
    '30463' => {
      'BaseType' => '30398',
      'Name' => 'struct pldm_bios_attr_table_entry const',
      'Size' => '6',
      'Type' => 'Const'
    },
    '30468' => {
      'Header' => 'bios.h',
      'Line' => '66',
      'Memb' => {
        '0' => {
          'name' => 'attr_handle',
          'offset' => '0',
          'type' => '5634'
        },
        '1' => {
          'name' => 'attr_type',
          'offset' => '2',
          'type' => '135'
        },
        '2' => {
          'name' => 'value',
          'offset' => '3',
          'type' => '968'
        }
      },
      'Name' => 'struct pldm_bios_attr_val_table_entry',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '30520' => {
      'BaseType' => '30468',
      'Name' => 'struct pldm_bios_attr_val_table_entry const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '30589' => {
      'Header' => 'bios_table.h',
      'Line' => '206',
      'Memb' => {
        '0' => {
          'name' => 'name_handle',
          'offset' => '0',
          'type' => '5634'
        },
        '1' => {
          'name' => 'read_only',
          'offset' => '2',
          'type' => '5433'
        },
        '2' => {
          'name' => 'pv_num',
          'offset' => '3',
          'type' => '135'
        },
        '3' => {
          'name' => 'pv_handle',
          'offset' => '8',
          'type' => '30692'
        },
        '4' => {
          'name' => 'def_num',
          'offset' => '22',
          'type' => '135'
        },
        '5' => {
          'name' => 'def_index',
          'offset' => '36',
          'type' => '5785'
        }
      },
      'Name' => 'struct pldm_bios_table_attr_entry_enum_info',
      'Size' => '32',
      'Type' => 'Struct'
    },
    '30680' => {
      'BaseType' => '30589',
      'Name' => 'struct pldm_bios_table_attr_entry_enum_info const',
      'Size' => '32',
      'Type' => 'Const'
    },
    '30692' => {
      'BaseType' => '7334',
      'Name' => 'uint16_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '30697' => {
      'Header' => 'bios_table.h',
      'Line' => '294',
      'Memb' => {
        '0' => {
          'name' => 'name_handle',
          'offset' => '0',
          'type' => '5634'
        },
        '1' => {
          'name' => 'read_only',
          'offset' => '2',
          'type' => '5433'
        },
        '2' => {
          'name' => 'string_type',
          'offset' => '3',
          'type' => '135'
        },
        '3' => {
          'name' => 'min_length',
          'offset' => '4',
          'type' => '5634'
        },
        '4' => {
          'name' => 'max_length',
          'offset' => '6',
          'type' => '5634'
        },
        '5' => {
          'name' => 'def_length',
          'offset' => '8',
          'type' => '5634'
        },
        '6' => {
          'name' => 'def_string',
          'offset' => '22',
          'type' => '8959'
        }
      },
      'Name' => 'struct pldm_bios_table_attr_entry_string_info',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '30809' => {
      'BaseType' => '30697',
      'Name' => 'struct pldm_bios_table_attr_entry_string_info const',
      'Size' => '24',
      'Type' => 'Const'
    },
    '30819' => {
      'Header' => 'bios_table.h',
      'Line' => '384',
      'Memb' => {
        '0' => {
          'name' => 'name_handle',
          'offset' => '0',
          'type' => '5634'
        },
        '1' => {
          'name' => 'read_only',
          'offset' => '2',
          'type' => '5433'
        },
        '2' => {
          'name' => 'lower_bound',
          'offset' => '8',
          'type' => '30077'
        },
        '3' => {
          'name' => 'upper_bound',
          'offset' => '22',
          'type' => '30077'
        },
        '4' => {
          'name' => 'scalar_increment',
          'offset' => '36',
          'type' => '147'
        },
        '5' => {
          'name' => 'default_value',
          'offset' => '50',
          'type' => '30077'
        }
      },
      'Name' => 'struct pldm_bios_table_attr_entry_integer_info',
      'Size' => '40',
      'Type' => 'Struct'
    },
    '30917' => {
      'BaseType' => '30819',
      'Name' => 'struct pldm_bios_table_attr_entry_integer_info const',
      'Size' => '40',
      'Type' => 'Const'
    },
    '31149' => {
      'Name' => 'ssize_t(*)(void const*)',
      'Param' => {
        '0' => {
          'type' => '1231'
        }
      },
      'Return' => '5766',
      'Size' => '8',
      'Type' => 'FuncPtr'
    },
    '31219' => {
      'Line' => '957',
      'Memb' => {
        '0' => {
          'name' => 'table_data',
          'offset' => '0',
          'type' => '5785'
        },
        '1' => {
          'name' => 'table_len',
          'offset' => '8',
          'type' => '164'
        },
        '2' => {
          'name' => 'current_pos',
          'offset' => '22',
          'type' => '164'
        },
        '3' => {
          'name' => 'entry_length_handler',
          'offset' => '36',
          'type' => '31149'
        }
      },
      'Name' => 'struct pldm_bios_table_iter',
      'PrivateABI' => 1,
      'Size' => '32',
      'Source' => 'bios_table.c',
      'Type' => 'Struct'
    },
    '31289' => {
      'BaseType' => '31219',
      'Name' => 'struct pldm_bios_table_iter const',
      'Size' => '32',
      'Type' => 'Const'
    },
    '32359' => {
      'BaseType' => '31219',
      'Name' => 'struct pldm_bios_table_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '32364' => {
      'BaseType' => '30520',
      'Name' => 'struct pldm_bios_attr_val_table_entry const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '32778' => {
      'BaseType' => '30463',
      'Name' => 'struct pldm_bios_attr_table_entry const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '33381' => {
      'BaseType' => '30377',
      'Name' => 'struct pldm_bios_string_table_entry const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '34544' => {
      'BaseType' => '31289',
      'Name' => 'struct pldm_bios_table_iter const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '38727' => {
      'BaseType' => '30077',
      'Name' => 'uint64_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '39004' => {
      'BaseType' => '30917',
      'Name' => 'struct pldm_bios_table_attr_entry_integer_info const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '39313' => {
      'BaseType' => '8959',
      'Name' => 'char const**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '40442' => {
      'BaseType' => '30809',
      'Name' => 'struct pldm_bios_table_attr_entry_string_info const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '41896' => {
      'BaseType' => '30680',
      'Name' => 'struct pldm_bios_table_attr_entry_enum_info const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '44109' => {
      'Header' => 'pldm_types.h',
      'Line' => '36',
      'Name' => 'anon-struct-pldm_types.h-36',
      'Size' => '2',
      'Type' => 'Struct'
    },
    '44375' => {
      'Header' => 'pldm_types.h',
      'Line' => '54',
      'Memb' => {
        '0' => {
          'name' => 'value',
          'offset' => '0',
          'type' => '5634'
        },
        '1' => {
          'name' => 'bits',
          'offset' => '0',
          'type' => '44109'
        }
      },
      'Name' => 'union bitfield16_t',
      'Size' => '2',
      'Type' => 'Union'
    },
    '52266' => {
      'BaseType' => '135',
      'Header' => 'pldm_types.h',
      'Line' => '32',
      'Name' => 'bool8_t',
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '52554' => {
      'Header' => 'pldm_types.h',
      'Line' => '58',
      'Name' => 'anon-struct-pldm_types.h-58',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '53042' => {
      'Header' => 'pldm_types.h',
      'Line' => '92',
      'Memb' => {
        '0' => {
          'name' => 'value',
          'offset' => '0',
          'type' => '147'
        },
        '1' => {
          'name' => 'bits',
          'offset' => '0',
          'type' => '52554'
        }
      },
      'Name' => 'union bitfield32_t',
      'Size' => '4',
      'Type' => 'Union'
    },
    '53054' => {
      'Header' => 'pldm_types.h',
      'Line' => '96',
      'Name' => 'anon-struct-pldm_types.h-96',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '53990' => {
      'Header' => 'pldm_types.h',
      'Line' => '162',
      'Memb' => {
        '0' => {
          'name' => 'value',
          'offset' => '0',
          'type' => '30077'
        },
        '1' => {
          'name' => 'bits',
          'offset' => '0',
          'type' => '53054'
        }
      },
      'Name' => 'union bitfield64_t',
      'Size' => '8',
      'Type' => 'Union'
    },
    '54021' => {
      'BaseType' => '164',
      'Name' => 'size_t const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '54085' => {
      'BaseType' => '7674',
      'Name' => 'struct variable_field const',
      'Size' => '16',
      'Type' => 'Const'
    },
    '55990' => {
      'BaseType' => '135',
      'Name' => 'uint8_t[8]',
      'Size' => '8',
      'Type' => 'Array'
    },
    '56006' => {
      'Header' => 'firmware_update.h',
      'Line' => '441',
      'Memb' => {
        '0' => {
          'name' => 'uuid',
          'offset' => '0',
          'type' => '56118'
        },
        '1' => {
          'name' => 'package_header_format_version',
          'offset' => '22',
          'type' => '135'
        },
        '2' => {
          'name' => 'package_header_size',
          'offset' => '23',
          'type' => '5634'
        },
        '3' => {
          'name' => 'package_release_date_time',
          'offset' => '25',
          'type' => '56134'
        },
        '4' => {
          'name' => 'component_bitmap_bit_length',
          'offset' => '50',
          'type' => '5634'
        },
        '5' => {
          'name' => 'package_version_string_type',
          'offset' => '52',
          'type' => '135'
        },
        '6' => {
          'name' => 'package_version_string_length',
          'offset' => '53',
          'type' => '135'
        }
      },
      'Name' => 'struct pldm_package_header_information',
      'Size' => '36',
      'Type' => 'Struct'
    },
    '56118' => {
      'BaseType' => '135',
      'Name' => 'uint8_t[16]',
      'Size' => '16',
      'Type' => 'Array'
    },
    '56134' => {
      'BaseType' => '135',
      'Name' => 'uint8_t[13]',
      'Size' => '13',
      'Type' => 'Array'
    },
    '56150' => {
      'Header' => 'firmware_update.h',
      'Line' => '455',
      'Memb' => {
        '0' => {
          'name' => 'record_length',
          'offset' => '0',
          'type' => '5634'
        },
        '1' => {
          'name' => 'descriptor_count',
          'offset' => '2',
          'type' => '135'
        },
        '2' => {
          'name' => 'device_update_option_flags',
          'offset' => '3',
          'type' => '53042'
        },
        '3' => {
          'name' => 'comp_image_set_version_string_type',
          'offset' => '7',
          'type' => '135'
        },
        '4' => {
          'name' => 'comp_image_set_version_string_length',
          'offset' => '8',
          'type' => '135'
        },
        '5' => {
          'name' => 'fw_device_pkg_data_length',
          'offset' => '9',
          'type' => '5634'
        }
      },
      'Name' => 'struct pldm_firmware_device_id_record',
      'Size' => '11',
      'Type' => 'Struct'
    },
    '56360' => {
      'Header' => 'firmware_update.h',
      'Line' => '489',
      'Memb' => {
        '0' => {
          'name' => 'comp_classification',
          'offset' => '0',
          'type' => '5634'
        },
        '1' => {
          'name' => 'comp_identifier',
          'offset' => '2',
          'type' => '5634'
        },
        '2' => {
          'name' => 'comp_comparison_stamp',
          'offset' => '4',
          'type' => '147'
        },
        '3' => {
          'name' => 'comp_options',
          'offset' => '8',
          'type' => '44375'
        },
        '4' => {
          'name' => 'requested_comp_activation_method',
          'offset' => '16',
          'type' => '44375'
        },
        '5' => {
          'name' => 'comp_location_offset',
          'offset' => '18',
          'type' => '147'
        },
        '6' => {
          'name' => 'comp_size',
          'offset' => '22',
          'type' => '147'
        },
        '7' => {
          'name' => 'comp_version_string_type',
          'offset' => '32',
          'type' => '135'
        },
        '8' => {
          'name' => 'comp_version_string_length',
          'offset' => '33',
          'type' => '135'
        }
      },
      'Name' => 'struct pldm_component_image_information',
      'Size' => '22',
      'Type' => 'Struct'
    },
    '56556' => {
      'Header' => 'firmware_update.h',
      'Line' => '515',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'capabilities_during_update',
          'offset' => '1',
          'type' => '53042'
        },
        '2' => {
          'name' => 'comp_count',
          'offset' => '5',
          'type' => '5634'
        },
        '3' => {
          'name' => 'active_comp_image_set_ver_str_type',
          'offset' => '7',
          'type' => '135'
        },
        '4' => {
          'name' => 'active_comp_image_set_ver_str_len',
          'offset' => '8',
          'type' => '135'
        },
        '5' => {
          'name' => 'pending_comp_image_set_ver_str_type',
          'offset' => '9',
          'type' => '135'
        },
        '6' => {
          'name' => 'pending_comp_image_set_ver_str_len',
          'offset' => '16',
          'type' => '135'
        }
      },
      'Name' => 'struct pldm_get_firmware_parameters_resp',
      'Size' => '11',
      'Type' => 'Struct'
    },
    '56757' => {
      'Header' => 'firmware_update.h',
      'Line' => '543',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'downstream_device_update_supported',
          'offset' => '1',
          'type' => '135'
        },
        '2' => {
          'name' => 'number_of_downstream_devices',
          'offset' => '2',
          'type' => '5634'
        },
        '3' => {
          'name' => 'max_number_of_downstream_devices',
          'offset' => '4',
          'type' => '5634'
        },
        '4' => {
          'name' => 'capabilities',
          'offset' => '8',
          'type' => '53042'
        }
      },
      'Name' => 'struct pldm_query_downstream_devices_resp',
      'Size' => '12',
      'Type' => 'Struct'
    },
    '56841' => {
      'Header' => 'firmware_update.h',
      'Line' => '555',
      'Memb' => {
        '0' => {
          'name' => 'comp_classification',
          'offset' => '0',
          'type' => '5634'
        },
        '1' => {
          'name' => 'comp_identifier',
          'offset' => '2',
          'type' => '5634'
        },
        '2' => {
          'name' => 'comp_classification_index',
          'offset' => '4',
          'type' => '135'
        },
        '3' => {
          'name' => 'active_comp_comparison_stamp',
          'offset' => '5',
          'type' => '147'
        },
        '4' => {
          'name' => 'active_comp_ver_str_type',
          'offset' => '9',
          'type' => '135'
        },
        '5' => {
          'name' => 'active_comp_ver_str_len',
          'offset' => '16',
          'type' => '135'
        },
        '6' => {
          'name' => 'active_comp_release_date',
          'offset' => '17',
          'type' => '55990'
        },
        '7' => {
          'name' => 'pending_comp_comparison_stamp',
          'offset' => '25',
          'type' => '147'
        },
        '8' => {
          'name' => 'pending_comp_ver_str_type',
          'offset' => '35',
          'type' => '135'
        },
        '9' => {
          'name' => 'pending_comp_ver_str_len',
          'offset' => '36',
          'type' => '135'
        },
        '10' => {
          'name' => 'pending_comp_release_date',
          'offset' => '37',
          'type' => '55990'
        },
        '11' => {
          'name' => 'comp_activation_methods',
          'offset' => '51',
          'type' => '44375'
        },
        '12' => {
          'name' => 'capabilities_during_update',
          'offset' => '53',
          'type' => '53042'
        }
      },
      'Name' => 'struct pldm_component_parameter_entry',
      'Size' => '39',
      'Type' => 'Struct'
    },
    '57154' => {
      'Header' => 'firmware_update.h',
      'Line' => '594',
      'Memb' => {
        '0' => {
          'name' => 'data_transfer_handle',
          'offset' => '0',
          'type' => '147'
        },
        '1' => {
          'name' => 'transfer_operation_flag',
          'offset' => '4',
          'type' => '135'
        }
      },
      'Name' => 'struct pldm_query_downstream_identifiers_req',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '57196' => {
      'BaseType' => '57154',
      'Name' => 'struct pldm_query_downstream_identifiers_req const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '57201' => {
      'Header' => 'firmware_update.h',
      'Line' => '608',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'next_data_transfer_handle',
          'offset' => '4',
          'type' => '147'
        },
        '2' => {
          'name' => 'transfer_flag',
          'offset' => '8',
          'type' => '135'
        },
        '3' => {
          'name' => 'downstream_devices_length',
          'offset' => '18',
          'type' => '147'
        },
        '4' => {
          'name' => 'number_of_downstream_devices',
          'offset' => '22',
          'type' => '5634'
        }
      },
      'Name' => 'struct pldm_query_downstream_identifiers_resp',
      'Size' => '20',
      'Type' => 'Struct'
    },
    '57285' => {
      'Header' => 'firmware_update.h',
      'Line' => '621',
      'Memb' => {
        '0' => {
          'name' => 'downstream_device_index',
          'offset' => '0',
          'type' => '5634'
        },
        '1' => {
          'name' => 'downstream_descriptor_count',
          'offset' => '2',
          'type' => '135'
        }
      },
      'Name' => 'struct pldm_downstream_device',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '57327' => {
      'Header' => 'firmware_update.h',
      'Line' => '627',
      'Memb' => {
        '0' => {
          'name' => 'field',
          'offset' => '0',
          'type' => '7674'
        },
        '1' => {
          'name' => 'devs',
          'offset' => '22',
          'type' => '164'
        }
      },
      'Name' => 'struct pldm_downstream_device_iter',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '57369' => {
      'Header' => 'firmware_update.h',
      'Line' => '701',
      'Memb' => {
        '0' => {
          'name' => 'descriptor_type',
          'offset' => '0',
          'type' => '5634'
        },
        '1' => {
          'name' => 'descriptor_length',
          'offset' => '2',
          'type' => '5634'
        },
        '2' => {
          'name' => 'descriptor_data',
          'offset' => '8',
          'type' => '1231'
        }
      },
      'Name' => 'struct pldm_descriptor',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '57441' => {
      'Header' => 'firmware_update.h',
      'Line' => '707',
      'Memb' => {
        '0' => {
          'name' => 'field',
          'offset' => '0',
          'type' => '24662'
        },
        '1' => {
          'name' => 'count',
          'offset' => '8',
          'type' => '164'
        }
      },
      'Name' => 'struct pldm_descriptor_iter',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '57488' => {
      'Header' => 'firmware_update.h',
      'Line' => '800',
      'Memb' => {
        '0' => {
          'name' => 'data_transfer_handle',
          'offset' => '0',
          'type' => '147'
        },
        '1' => {
          'name' => 'transfer_operation_flag',
          'offset' => '4',
          'type' => '135'
        }
      },
      'Name' => 'struct pldm_get_downstream_firmware_parameters_req',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '57530' => {
      'BaseType' => '57488',
      'Name' => 'struct pldm_get_downstream_firmware_parameters_req const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '57535' => {
      'Header' => 'firmware_update.h',
      'Line' => '815',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'next_data_transfer_handle',
          'offset' => '4',
          'type' => '147'
        },
        '2' => {
          'name' => 'transfer_flag',
          'offset' => '8',
          'type' => '135'
        },
        '3' => {
          'name' => 'fdp_capabilities_during_update',
          'offset' => '18',
          'type' => '53042'
        },
        '4' => {
          'name' => 'downstream_device_count',
          'offset' => '22',
          'type' => '5634'
        }
      },
      'Name' => 'struct pldm_get_downstream_firmware_parameters_resp',
      'Size' => '20',
      'Type' => 'Struct'
    },
    '57619' => {
      'Header' => 'firmware_update.h',
      'Line' => '833',
      'Memb' => {
        '0' => {
          'name' => 'downstream_device_index',
          'offset' => '0',
          'type' => '5634'
        },
        '1' => {
          'name' => 'active_comp_comparison_stamp',
          'offset' => '4',
          'type' => '147'
        },
        '2' => {
          'name' => 'active_comp_ver_str_type',
          'offset' => '8',
          'type' => '135'
        },
        '3' => {
          'name' => 'active_comp_ver_str_len',
          'offset' => '9',
          'type' => '135'
        },
        '4' => {
          'name' => 'active_comp_release_date',
          'offset' => '16',
          'type' => '57815'
        },
        '5' => {
          'name' => 'pending_comp_comparison_stamp',
          'offset' => '32',
          'type' => '147'
        },
        '6' => {
          'name' => 'pending_comp_ver_str_type',
          'offset' => '36',
          'type' => '135'
        },
        '7' => {
          'name' => 'pending_comp_ver_str_len',
          'offset' => '37',
          'type' => '135'
        },
        '8' => {
          'name' => 'pending_comp_release_date',
          'offset' => '38',
          'type' => '57815'
        },
        '9' => {
          'name' => 'comp_activation_methods',
          'offset' => '54',
          'type' => '44375'
        },
        '10' => {
          'name' => 'capabilities_during_update',
          'offset' => '64',
          'type' => '53042'
        },
        '11' => {
          'name' => 'active_comp_ver_str',
          'offset' => '72',
          'type' => '1231'
        },
        '12' => {
          'name' => 'pending_comp_ver_str',
          'offset' => '86',
          'type' => '1231'
        }
      },
      'Name' => 'struct pldm_downstream_device_parameters_entry',
      'Size' => '64',
      'Type' => 'Struct'
    },
    '57815' => {
      'BaseType' => '46',
      'Name' => 'char[9]',
      'Size' => '9',
      'Type' => 'Array'
    },
    '59033' => {
      'Header' => 'firmware_update.h',
      'Line' => '1347',
      'Memb' => {
        '0' => {
          'name' => 'field',
          'offset' => '0',
          'type' => '7674'
        },
        '1' => {
          'name' => 'entries',
          'offset' => '22',
          'type' => '164'
        }
      },
      'Name' => 'struct pldm_downstream_device_parameters_iter',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '60943' => {
      'BaseType' => '52266',
      'Name' => 'bool8_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '60948' => {
      'BaseType' => '53990',
      'Name' => 'bitfield64_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '64384' => {
      'BaseType' => '53042',
      'Name' => 'bitfield32_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '68462' => {
      'BaseType' => '44375',
      'Name' => 'bitfield16_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '78805' => {
      'BaseType' => '54085',
      'Name' => 'struct variable_field const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '94087' => {
      'BaseType' => '59033',
      'Name' => 'struct pldm_downstream_device_parameters_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '94092' => {
      'BaseType' => '57619',
      'Name' => 'struct pldm_downstream_device_parameters_entry*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '96776' => {
      'BaseType' => '57535',
      'Name' => 'struct pldm_get_downstream_firmware_parameters_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '97908' => {
      'BaseType' => '57530',
      'Name' => 'struct pldm_get_downstream_firmware_parameters_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '99088' => {
      'BaseType' => '57327',
      'Name' => 'struct pldm_downstream_device_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '99093' => {
      'BaseType' => '57285',
      'Name' => 'struct pldm_downstream_device*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '101791' => {
      'BaseType' => '57201',
      'Name' => 'struct pldm_query_downstream_identifiers_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '102923' => {
      'BaseType' => '57196',
      'Name' => 'struct pldm_query_downstream_identifiers_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '105524' => {
      'BaseType' => '56757',
      'Name' => 'struct pldm_query_downstream_devices_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '105971' => {
      'BaseType' => '56841',
      'Name' => 'struct pldm_component_parameter_entry*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '114629' => {
      'BaseType' => '56556',
      'Name' => 'struct pldm_get_firmware_parameters_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '117601' => {
      'BaseType' => '1496',
      'Name' => 'uint8_t**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '117943' => {
      'BaseType' => '56360',
      'Name' => 'struct pldm_component_image_information*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '120435' => {
      'BaseType' => '57441',
      'Name' => 'struct pldm_descriptor_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '120440' => {
      'BaseType' => '57369',
      'Name' => 'struct pldm_descriptor*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '120725' => {
      'BaseType' => '56150',
      'Name' => 'struct pldm_firmware_device_id_record*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '121180' => {
      'BaseType' => '56006',
      'Name' => 'struct pldm_package_header_information*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '130296' => {
      'BaseType' => '130313',
      'Header' => 'pdr.h',
      'Line' => '16',
      'Name' => 'pldm_pdr',
      'PrivateABI' => 1,
      'Size' => '24',
      'Type' => 'Typedef'
    },
    '130308' => {
      'BaseType' => '130296',
      'Name' => 'pldm_pdr const',
      'Size' => '24',
      'Type' => 'Const'
    },
    '130313' => {
      'Line' => '30',
      'Memb' => {
        '0' => {
          'name' => 'record_count',
          'offset' => '0',
          'type' => '147'
        },
        '1' => {
          'name' => 'size',
          'offset' => '4',
          'type' => '147'
        },
        '2' => {
          'name' => 'first',
          'offset' => '8',
          'type' => '131413'
        },
        '3' => {
          'name' => 'last',
          'offset' => '22',
          'type' => '131413'
        }
      },
      'Name' => 'struct pldm_pdr',
      'PrivateABI' => 1,
      'Size' => '24',
      'Source' => 'pdr.c',
      'Type' => 'Struct'
    },
    '130379' => {
      'BaseType' => '130396',
      'Header' => 'pdr.h',
      'Line' => '21',
      'Name' => 'pldm_pdr_record',
      'PrivateABI' => 1,
      'Size' => '32',
      'Type' => 'Typedef'
    },
    '130391' => {
      'BaseType' => '130379',
      'Name' => 'pldm_pdr_record const',
      'Size' => '32',
      'Type' => 'Const'
    },
    '130396' => {
      'Line' => '21',
      'Memb' => {
        '0' => {
          'name' => 'record_handle',
          'offset' => '0',
          'type' => '147'
        },
        '1' => {
          'name' => 'size',
          'offset' => '4',
          'type' => '147'
        },
        '2' => {
          'name' => 'data',
          'offset' => '8',
          'type' => '1496'
        },
        '3' => {
          'name' => 'next',
          'offset' => '22',
          'type' => '131401'
        },
        '4' => {
          'name' => 'is_remote',
          'offset' => '36',
          'type' => '5433'
        },
        '5' => {
          'name' => 'terminus_handle',
          'offset' => '38',
          'type' => '5634'
        }
      },
      'Name' => 'struct pldm_pdr_record',
      'PrivateABI' => 1,
      'Size' => '32',
      'Source' => 'pdr.c',
      'Type' => 'Struct'
    },
    '130488' => {
      'Header' => 'pdr.h',
      'Line' => '300',
      'Memb' => {
        '0' => {
          'name' => 'entity_type',
          'offset' => '0',
          'type' => '5634'
        },
        '1' => {
          'name' => 'entity_instance_num',
          'offset' => '2',
          'type' => '5634'
        },
        '2' => {
          'name' => 'entity_container_id',
          'offset' => '4',
          'type' => '5634'
        }
      },
      'Name' => 'struct pldm_entity',
      'Size' => '6',
      'Type' => 'Struct'
    },
    '130550' => {
      'BaseType' => '130488',
      'Header' => 'pdr.h',
      'Line' => '304',
      'Name' => 'pldm_entity',
      'Size' => '6',
      'Type' => 'Typedef'
    },
    '130591' => {
      'BaseType' => '130603',
      'Header' => 'pdr.h',
      'Line' => '314',
      'Name' => 'pldm_entity_association_tree',
      'PrivateABI' => 1,
      'Size' => '16',
      'Type' => 'Typedef'
    },
    '130603' => {
      'Line' => '499',
      'Memb' => {
        '0' => {
          'name' => 'root',
          'offset' => '0',
          'type' => '131418'
        },
        '1' => {
          'name' => 'last_used_container_id',
          'offset' => '8',
          'type' => '5634'
        }
      },
      'Name' => 'struct pldm_entity_association_tree',
      'PrivateABI' => 1,
      'Size' => '16',
      'Source' => 'pdr.c',
      'Type' => 'Struct'
    },
    '130646' => {
      'BaseType' => '130663',
      'Header' => 'pdr.h',
      'Line' => '319',
      'Name' => 'pldm_entity_node',
      'PrivateABI' => 1,
      'Size' => '40',
      'Type' => 'Typedef'
    },
    '130658' => {
      'BaseType' => '130646',
      'Name' => 'pldm_entity_node const',
      'Size' => '40',
      'Type' => 'Const'
    },
    '130663' => {
      'Line' => '504',
      'Memb' => {
        '0' => {
          'name' => 'entity',
          'offset' => '0',
          'type' => '130550'
        },
        '1' => {
          'name' => 'parent',
          'offset' => '6',
          'type' => '130550'
        },
        '2' => {
          'name' => 'remote_container_id',
          'offset' => '18',
          'type' => '5634'
        },
        '3' => {
          'name' => 'first_child',
          'offset' => '22',
          'type' => '131418'
        },
        '4' => {
          'name' => 'next_sibling',
          'offset' => '36',
          'type' => '131418'
        },
        '5' => {
          'name' => 'association_type',
          'offset' => '50',
          'type' => '135'
        }
      },
      'Name' => 'struct pldm_entity_node',
      'PrivateABI' => 1,
      'Size' => '40',
      'Source' => 'pdr.c',
      'Type' => 'Struct'
    },
    '130941' => {
      'Header' => 'platform.h',
      'Line' => '561',
      'Memb' => {
        '0' => {
          'name' => 'record_handle',
          'offset' => '0',
          'type' => '147'
        },
        '1' => {
          'name' => 'version',
          'offset' => '4',
          'type' => '135'
        },
        '2' => {
          'name' => 'type',
          'offset' => '5',
          'type' => '135'
        },
        '3' => {
          'name' => 'record_change_num',
          'offset' => '6',
          'type' => '5634'
        },
        '4' => {
          'name' => 'length',
          'offset' => '8',
          'type' => '5634'
        }
      },
      'Name' => 'struct pldm_pdr_hdr',
      'Size' => '10',
      'Type' => 'Struct'
    },
    '131401' => {
      'BaseType' => '130396',
      'Name' => 'struct pldm_pdr_record*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '131413' => {
      'BaseType' => '130379',
      'Name' => 'pldm_pdr_record*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '131418' => {
      'BaseType' => '130646',
      'Name' => 'pldm_entity_node*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '132657' => {
      'BaseType' => '130296',
      'Name' => 'pldm_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '133968' => {
      'BaseType' => '130391',
      'Name' => 'pldm_pdr_record const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '141202' => {
      'BaseType' => '130550',
      'Name' => 'pldm_entity*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '157324' => {
      'BaseType' => '141202',
      'Name' => 'pldm_entity**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '157388' => {
      'BaseType' => '130591',
      'Name' => 'pldm_entity_association_tree*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '157976' => {
      'BaseType' => '131418',
      'Name' => 'pldm_entity_node**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '158765' => {
      'BaseType' => '130308',
      'Name' => 'pldm_pdr const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '164242' => {
      'BaseType' => '130658',
      'Name' => 'pldm_entity_node const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '170115' => {
      'BaseType' => '88',
      'Header' => 'types.h',
      'Line' => '37',
      'Name' => '__int8_t',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '170146' => {
      'BaseType' => '107',
      'Header' => 'types.h',
      'Line' => '39',
      'Name' => '__int16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '170177' => {
      'BaseType' => '53',
      'Header' => 'types.h',
      'Line' => '41',
      'Name' => '__int32_t',
      'PrivateABI' => 1,
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '170215' => {
      'BaseType' => '5555',
      'Header' => 'types.h',
      'Line' => '55',
      'Name' => '__uint_least16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '170268' => {
      'BaseType' => '170115',
      'Header' => 'stdint-intn.h',
      'Line' => '24',
      'Name' => 'int8_t',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '170280' => {
      'BaseType' => '170146',
      'Header' => 'stdint-intn.h',
      'Line' => '25',
      'Name' => 'int16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '170292' => {
      'BaseType' => '170177',
      'Header' => 'stdint-intn.h',
      'Line' => '26',
      'Name' => 'int32_t',
      'PrivateABI' => 1,
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '170909' => {
      'BaseType' => '444',
      'Header' => 'pldm_types.h',
      'Line' => '164',
      'Name' => 'real32_t',
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '171624' => {
      'BaseType' => '170215',
      'Header' => 'uchar.h',
      'Line' => '51',
      'Name' => 'char16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '172457' => {
      'Header' => 'platform.h',
      'Line' => '339',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_SENSOR_OP_STATE',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_STATE_SENSOR_STATE',
          'value' => '1'
        },
        '2' => {
          'name' => 'PLDM_NUMERIC_SENSOR_STATE',
          'value' => '2'
        }
      },
      'Name' => 'enum sensor_event_class_states',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '172491' => {
      'BaseType' => '172457',
      'Name' => 'enum sensor_event_class_states const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '172799' => {
      'Header' => 'platform.h',
      'Line' => '636',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '130941'
        },
        '1' => {
          'name' => 'terminus_handle',
          'offset' => '16',
          'type' => '5634'
        },
        '2' => {
          'name' => 'sensor_id',
          'offset' => '18',
          'type' => '5634'
        },
        '3' => {
          'name' => 'entity_type',
          'offset' => '20',
          'type' => '5634'
        },
        '4' => {
          'name' => 'entity_instance',
          'offset' => '22',
          'type' => '5634'
        },
        '5' => {
          'name' => 'container_id',
          'offset' => '24',
          'type' => '5634'
        },
        '6' => {
          'name' => 'sensor_init',
          'offset' => '32',
          'type' => '135'
        },
        '7' => {
          'name' => 'sensor_auxiliary_names_pdr',
          'offset' => '33',
          'type' => '52266'
        },
        '8' => {
          'name' => 'composite_sensor_count',
          'offset' => '34',
          'type' => '135'
        },
        '9' => {
          'name' => 'possible_states',
          'offset' => '35',
          'type' => '968'
        }
      },
      'Name' => 'struct pldm_state_sensor_pdr',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '172953' => {
      'Header' => 'platform.h',
      'Line' => '653',
      'Memb' => {
        '0' => {
          'name' => 'state_set_id',
          'offset' => '0',
          'type' => '5634'
        },
        '1' => {
          'name' => 'possible_states_size',
          'offset' => '2',
          'type' => '135'
        },
        '2' => {
          'name' => 'states',
          'offset' => '3',
          'type' => '173015'
        }
      },
      'Name' => 'struct state_sensor_possible_states',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '173010' => {
      'BaseType' => '172953',
      'Name' => 'struct state_sensor_possible_states const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '173015' => {
      'BaseType' => '344',
      'Name' => 'bitfield8_t[1]',
      'Size' => '1',
      'Type' => 'Array'
    },
    '173031' => {
      'Header' => 'platform.h',
      'Line' => '663',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '130941'
        },
        '1' => {
          'name' => 'terminus_handle',
          'offset' => '16',
          'type' => '5634'
        },
        '2' => {
          'name' => 'effecter_id',
          'offset' => '18',
          'type' => '5634'
        },
        '3' => {
          'name' => 'entity_type',
          'offset' => '20',
          'type' => '5634'
        },
        '4' => {
          'name' => 'entity_instance',
          'offset' => '22',
          'type' => '5634'
        },
        '5' => {
          'name' => 'container_id',
          'offset' => '24',
          'type' => '5634'
        },
        '6' => {
          'name' => 'effecter_semantic_id',
          'offset' => '32',
          'type' => '5634'
        },
        '7' => {
          'name' => 'effecter_init',
          'offset' => '34',
          'type' => '135'
        },
        '8' => {
          'name' => 'has_description_pdr',
          'offset' => '35',
          'type' => '52266'
        },
        '9' => {
          'name' => 'composite_effecter_count',
          'offset' => '36',
          'type' => '135'
        },
        '10' => {
          'name' => 'possible_states',
          'offset' => '37',
          'type' => '968'
        }
      },
      'Name' => 'struct pldm_state_effecter_pdr',
      'Size' => '26',
      'Type' => 'Struct'
    },
    '173384' => {
      'Header' => 'platform.h',
      'Line' => '754',
      'Memb' => {
        '0' => {
          'name' => 'value_u8',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'value_s8',
          'offset' => '0',
          'type' => '170268'
        },
        '2' => {
          'name' => 'value_u16',
          'offset' => '0',
          'type' => '5634'
        },
        '3' => {
          'name' => 'value_s16',
          'offset' => '0',
          'type' => '170280'
        },
        '4' => {
          'name' => 'value_u32',
          'offset' => '0',
          'type' => '147'
        },
        '5' => {
          'name' => 'value_s32',
          'offset' => '0',
          'type' => '170292'
        },
        '6' => {
          'name' => 'value_f32',
          'offset' => '0',
          'type' => '170909'
        }
      },
      'Name' => 'union union_range_field_format',
      'Size' => '4',
      'Type' => 'Union'
    },
    '173981' => {
      'Header' => 'platform.h',
      'Line' => '811',
      'Memb' => {
        '0' => {
          'name' => 'value_u8',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'value_s8',
          'offset' => '0',
          'type' => '170268'
        },
        '2' => {
          'name' => 'value_u16',
          'offset' => '0',
          'type' => '5634'
        },
        '3' => {
          'name' => 'value_s16',
          'offset' => '0',
          'type' => '170280'
        },
        '4' => {
          'name' => 'value_u32',
          'offset' => '0',
          'type' => '147'
        },
        '5' => {
          'name' => 'value_s32',
          'offset' => '0',
          'type' => '170292'
        }
      },
      'Name' => 'union union_sensor_data_size',
      'Size' => '4',
      'Type' => 'Union'
    },
    '173994' => {
      'Header' => 'platform.h',
      'Line' => '818',
      'Memb' => {
        '0' => {
          'name' => 'record_handle',
          'offset' => '0',
          'type' => '147'
        },
        '1' => {
          'name' => 'version',
          'offset' => '4',
          'type' => '135'
        },
        '2' => {
          'name' => 'type',
          'offset' => '5',
          'type' => '135'
        },
        '3' => {
          'name' => 'record_change_num',
          'offset' => '6',
          'type' => '5634'
        },
        '4' => {
          'name' => 'length',
          'offset' => '8',
          'type' => '5634'
        }
      },
      'Name' => 'struct pldm_value_pdr_hdr',
      'Size' => '12',
      'Type' => 'Struct'
    },
    '174079' => {
      'Header' => 'platform.h',
      'Line' => '836',
      'Memb' => {
        '0' => {
          'name' => 'entity_instance_num',
          'offset' => '0',
          'type' => '5634'
        },
        '1' => {
          'name' => 'entity_instance',
          'offset' => '0',
          'type' => '5634'
        }
      },
      'Name' => 'anon-union-platform.h-836',
      'Size' => '2',
      'Type' => 'Union'
    },
    '174114' => {
      'Header' => 'platform.h',
      'Line' => '831',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '173994'
        },
        '1' => {
          'name' => 'terminus_handle',
          'offset' => '18',
          'type' => '5634'
        },
        '2' => {
          'name' => 'sensor_id',
          'offset' => '20',
          'type' => '5634'
        },
        '3' => {
          'name' => 'entity_type',
          'offset' => '22',
          'type' => '5634'
        },
        '4' => {
          'name' => 'unnamed0',
          'offset' => '24',
          'type' => '174079'
        },
        '5' => {
          'name' => 'container_id',
          'offset' => '32',
          'type' => '5634'
        },
        '6' => {
          'name' => 'sensor_init',
          'offset' => '34',
          'type' => '135'
        },
        '7' => {
          'name' => 'sensor_auxiliary_names_pdr',
          'offset' => '35',
          'type' => '52266'
        },
        '8' => {
          'name' => 'base_unit',
          'offset' => '36',
          'type' => '135'
        },
        '9' => {
          'name' => 'unit_modifier',
          'offset' => '37',
          'type' => '170268'
        },
        '10' => {
          'name' => 'rate_unit',
          'offset' => '38',
          'type' => '135'
        },
        '11' => {
          'name' => 'base_oem_unit_handle',
          'offset' => '39',
          'type' => '135'
        },
        '12' => {
          'name' => 'aux_unit',
          'offset' => '40',
          'type' => '135'
        },
        '13' => {
          'name' => 'aux_unit_modifier',
          'offset' => '41',
          'type' => '170268'
        },
        '14' => {
          'name' => 'aux_rate_unit',
          'offset' => '48',
          'type' => '135'
        },
        '15' => {
          'name' => 'rel',
          'offset' => '49',
          'type' => '135'
        },
        '16' => {
          'name' => 'aux_oem_unit_handle',
          'offset' => '50',
          'type' => '135'
        },
        '17' => {
          'name' => 'is_linear',
          'offset' => '51',
          'type' => '52266'
        },
        '18' => {
          'name' => 'sensor_data_size',
          'offset' => '52',
          'type' => '135'
        },
        '19' => {
          'name' => 'resolution',
          'offset' => '54',
          'type' => '170909'
        },
        '20' => {
          'name' => 'offset',
          'offset' => '64',
          'type' => '170909'
        },
        '21' => {
          'name' => 'accuracy',
          'offset' => '68',
          'type' => '5634'
        },
        '22' => {
          'name' => 'plus_tolerance',
          'offset' => '70',
          'type' => '135'
        },
        '23' => {
          'name' => 'minus_tolerance',
          'offset' => '71',
          'type' => '135'
        },
        '24' => {
          'name' => 'hysteresis',
          'offset' => '72',
          'type' => '173981'
        },
        '25' => {
          'name' => 'supported_thresholds',
          'offset' => '82',
          'type' => '344'
        },
        '26' => {
          'name' => 'threshold_and_hysteresis_volatility',
          'offset' => '83',
          'type' => '344'
        },
        '27' => {
          'name' => 'state_transition_interval',
          'offset' => '86',
          'type' => '170909'
        },
        '28' => {
          'name' => 'update_interval',
          'offset' => '96',
          'type' => '170909'
        },
        '29' => {
          'name' => 'max_readable',
          'offset' => '100',
          'type' => '173981'
        },
        '30' => {
          'name' => 'min_readable',
          'offset' => '104',
          'type' => '173981'
        },
        '31' => {
          'name' => 'range_field_format',
          'offset' => '114',
          'type' => '135'
        },
        '32' => {
          'name' => 'range_field_support',
          'offset' => '115',
          'type' => '344'
        },
        '33' => {
          'name' => 'nominal_value',
          'offset' => '118',
          'type' => '173384'
        },
        '34' => {
          'name' => 'normal_max',
          'offset' => '128',
          'type' => '173384'
        },
        '35' => {
          'name' => 'normal_min',
          'offset' => '132',
          'type' => '173384'
        },
        '36' => {
          'name' => 'warning_high',
          'offset' => '136',
          'type' => '173384'
        },
        '37' => {
          'name' => 'warning_low',
          'offset' => '146',
          'type' => '173384'
        },
        '38' => {
          'name' => 'critical_high',
          'offset' => '150',
          'type' => '173384'
        },
        '39' => {
          'name' => 'critical_low',
          'offset' => '256',
          'type' => '173384'
        },
        '40' => {
          'name' => 'fatal_high',
          'offset' => '260',
          'type' => '173384'
        },
        '41' => {
          'name' => 'fatal_low',
          'offset' => '264',
          'type' => '173384'
        }
      },
      'Name' => 'struct pldm_numeric_sensor_value_pdr',
      'Size' => '112',
      'Type' => 'Struct'
    },
    '174707' => {
      'BaseType' => '171624',
      'Header' => 'platform.h',
      'Line' => '879',
      'Name' => 'pldm_utf16be',
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '174720' => {
      'Header' => 'platform.h',
      'Line' => '881',
      'Memb' => {
        '0' => {
          'name' => 'tag',
          'offset' => '0',
          'type' => '5605'
        },
        '1' => {
          'name' => 'name',
          'offset' => '8',
          'type' => '174762'
        }
      },
      'Name' => 'struct pldm_entity_auxiliary_name',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '174762' => {
      'BaseType' => '174707',
      'Name' => 'pldm_utf16be*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '174767' => {
      'Header' => 'platform.h',
      'Line' => '891',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '173994'
        },
        '1' => {
          'name' => 'container',
          'offset' => '18',
          'type' => '130550'
        },
        '2' => {
          'name' => 'shared_name_count',
          'offset' => '24',
          'type' => '135'
        },
        '3' => {
          'name' => 'name_string_count',
          'offset' => '25',
          'type' => '135'
        },
        '4' => {
          'name' => 'names',
          'offset' => '36',
          'type' => '174881'
        },
        '5' => {
          'name' => 'auxiliary_name_data_size',
          'offset' => '50',
          'type' => '164'
        },
        '6' => {
          'name' => 'auxiliary_name_data',
          'offset' => '64',
          'type' => '174886'
        }
      },
      'Name' => 'struct pldm_entity_auxiliary_names_pdr',
      'Size' => '40',
      'Type' => 'Struct'
    },
    '174881' => {
      'BaseType' => '174720',
      'Name' => 'struct pldm_entity_auxiliary_name*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '174886' => {
      'BaseType' => '46',
      'Name' => 'char[]',
      'Size' => '8',
      'Type' => 'Array'
    },
    '174901' => {
      'Header' => 'platform.h',
      'Line' => '921',
      'Memb' => {
        '0' => {
          'name' => 'state_set_id',
          'offset' => '0',
          'type' => '5634'
        },
        '1' => {
          'name' => 'possible_states_size',
          'offset' => '2',
          'type' => '135'
        },
        '2' => {
          'name' => 'states',
          'offset' => '3',
          'type' => '173015'
        }
      },
      'Name' => 'struct state_effecter_possible_states',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '174958' => {
      'BaseType' => '174901',
      'Name' => 'struct state_effecter_possible_states const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '175159' => {
      'Header' => 'platform.h',
      'Line' => '991',
      'Memb' => {
        '0' => {
          'name' => 'set_request',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'effecter_state',
          'offset' => '1',
          'type' => '135'
        }
      },
      'Name' => 'struct state_field_for_state_effecter_set',
      'Size' => '2',
      'Type' => 'Struct'
    },
    '175202' => {
      'BaseType' => '175159',
      'Header' => 'platform.h',
      'Line' => '994',
      'Name' => 'set_effecter_state_field',
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '175215' => {
      'Header' => 'platform.h',
      'Line' => '1000',
      'Memb' => {
        '0' => {
          'name' => 'sensor_op_state',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'present_state',
          'offset' => '1',
          'type' => '135'
        },
        '2' => {
          'name' => 'previous_state',
          'offset' => '2',
          'type' => '135'
        },
        '3' => {
          'name' => 'event_state',
          'offset' => '3',
          'type' => '135'
        }
      },
      'Name' => 'struct state_field_for_get_state_sensor_readings',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '175286' => {
      'BaseType' => '175215',
      'Header' => 'platform.h',
      'Line' => '1008',
      'Name' => 'get_sensor_state_field',
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '175299' => {
      'Header' => 'platform.h',
      'Line' => '1014',
      'Memb' => {
        '0' => {
          'name' => 'effecter_op_state',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'pending_state',
          'offset' => '1',
          'type' => '135'
        },
        '2' => {
          'name' => 'present_state',
          'offset' => '2',
          'type' => '135'
        }
      },
      'Name' => 'struct state_field_for_get_state_effecter_states',
      'Size' => '3',
      'Type' => 'Struct'
    },
    '175356' => {
      'BaseType' => '175299',
      'Header' => 'platform.h',
      'Line' => '1018',
      'Name' => 'get_effecter_state_field',
      'Size' => '3',
      'Type' => 'Typedef'
    },
    '176085' => {
      'Header' => 'platform.h',
      'Line' => '1163',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'comp_effecter_count',
          'offset' => '1',
          'type' => '135'
        },
        '2' => {
          'name' => 'field',
          'offset' => '2',
          'type' => '176142'
        }
      },
      'Name' => 'struct pldm_get_state_effecter_states_resp',
      'Size' => '26',
      'Type' => 'Struct'
    },
    '176142' => {
      'BaseType' => '175356',
      'Name' => 'get_effecter_state_field[8]',
      'Size' => '24',
      'Type' => 'Array'
    },
    '176158' => {
      'Header' => 'platform.h',
      'Line' => '1173',
      'Memb' => {
        '0' => {
          'name' => 'sensor_id',
          'offset' => '0',
          'type' => '5634'
        },
        '1' => {
          'name' => 'sensor_event_class_type',
          'offset' => '2',
          'type' => '135'
        },
        '2' => {
          'name' => 'event_class',
          'offset' => '3',
          'type' => '968'
        }
      },
      'Name' => 'struct pldm_sensor_event_data',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '176272' => {
      'Header' => 'platform.h',
      'Line' => '1213',
      'Memb' => {
        '0' => {
          'name' => 'format_version',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'event_id',
          'offset' => '2',
          'type' => '5634'
        },
        '2' => {
          'name' => 'data_transfer_handle',
          'offset' => '4',
          'type' => '147'
        }
      },
      'Name' => 'struct pldm_message_poll_event',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '176334' => {
      'Header' => 'platform.h',
      'Line' => '1223',
      'Memb' => {
        '0' => {
          'name' => 'format_version',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'format_type',
          'offset' => '1',
          'type' => '135'
        },
        '2' => {
          'name' => 'event_data_length',
          'offset' => '2',
          'type' => '5634'
        },
        '3' => {
          'name' => 'event_data',
          'offset' => '4',
          'type' => '176405'
        }
      },
      'Name' => 'struct pldm_platform_cper_event',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '176405' => {
      'BaseType' => '135',
      'Name' => 'uint8_t[]',
      'Size' => '8',
      'Type' => 'Array'
    },
    '176561' => {
      'Header' => 'platform.h',
      'Line' => '1283',
      'Memb' => {
        '0' => {
          'name' => 'event_data_format',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'number_of_change_records',
          'offset' => '1',
          'type' => '135'
        },
        '2' => {
          'name' => 'change_records',
          'offset' => '2',
          'type' => '968'
        }
      },
      'Name' => 'struct pldm_pdr_repository_chg_event_data',
      'Size' => '3',
      'Type' => 'Struct'
    },
    '184892' => {
      'BaseType' => '176334',
      'Name' => 'struct pldm_platform_cper_event*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '188357' => {
      'BaseType' => '174767',
      'Name' => 'struct pldm_entity_auxiliary_names_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '197877' => {
      'BaseType' => '176085',
      'Name' => 'struct pldm_get_state_effecter_states_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '244024' => {
      'BaseType' => '2671',
      'Name' => 'size_t*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '246983' => {
      'BaseType' => '176272',
      'Name' => 'struct pldm_message_poll_event*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '248415' => {
      'BaseType' => '248425',
      'Name' => 'uint32_t const*const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '248420' => {
      'BaseType' => '159',
      'Name' => 'uint32_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '248425' => {
      'BaseType' => '248420',
      'Name' => 'uint32_t const*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '248430' => {
      'BaseType' => '176561',
      'Name' => 'struct pldm_pdr_repository_chg_event_data*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '292131' => {
      'BaseType' => '174114',
      'Name' => 'struct pldm_numeric_sensor_value_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '314249' => {
      'BaseType' => '176158',
      'Name' => 'struct pldm_sensor_event_data*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '314254' => {
      'BaseType' => '314249',
      'Name' => 'struct pldm_sensor_event_data*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '318229' => {
      'BaseType' => '175286',
      'Name' => 'get_sensor_state_field*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '341529' => {
      'BaseType' => '175202',
      'Name' => 'set_effecter_state_field*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '342505' => {
      'BaseType' => '172799',
      'Name' => 'struct pldm_state_sensor_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '342510' => {
      'BaseType' => '342505',
      'Name' => 'struct pldm_state_sensor_pdr*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '342515' => {
      'BaseType' => '173010',
      'Name' => 'struct state_sensor_possible_states const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '342520' => {
      'BaseType' => '342515',
      'Name' => 'struct state_sensor_possible_states const*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '342915' => {
      'BaseType' => '173031',
      'Name' => 'struct pldm_state_effecter_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '342920' => {
      'BaseType' => '342915',
      'Name' => 'struct pldm_state_effecter_pdr*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '342925' => {
      'BaseType' => '174958',
      'Name' => 'struct state_effecter_possible_states const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '342930' => {
      'BaseType' => '342925',
      'Name' => 'struct state_effecter_possible_states const*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '346414' => {
      'Line' => '19',
      'Memb' => {
        '0' => {
          'name' => 'prev',
          'offset' => '0',
          'type' => '4815'
        },
        '1' => {
          'name' => 'allocations',
          'offset' => '4',
          'type' => '147'
        }
      },
      'Name' => 'struct pldm_tid_state',
      'PrivateABI' => 1,
      'Size' => '8',
      'Source' => 'instance-id.c',
      'Type' => 'Struct'
    },
    '346453' => {
      'Line' => '24',
      'Memb' => {
        '0' => {
          'name' => 'state',
          'offset' => '0',
          'type' => '346495'
        },
        '1' => {
          'name' => 'lock_db_fd',
          'offset' => '8264',
          'type' => '53'
        }
      },
      'Name' => 'struct pldm_instance_db',
      'PrivateABI' => 1,
      'Size' => '2052',
      'Source' => 'instance-id.c',
      'Type' => 'Struct'
    },
    '346495' => {
      'BaseType' => '346414',
      'Name' => 'struct pldm_tid_state[256]',
      'Size' => '2048',
      'Type' => 'Array'
    },
    '347051' => {
      'BaseType' => '346453',
      'Name' => 'struct pldm_instance_db*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '347438' => {
      'BaseType' => '4815',
      'Name' => 'pldm_instance_id_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '347614' => {
      'BaseType' => '347051',
      'Name' => 'struct pldm_instance_db**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '348322' => {
      'BaseType' => '60',
      'Header' => 'int-ll64.h',
      'Line' => '21',
      'Name' => '__u8',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '348334' => {
      'BaseType' => '67',
      'Header' => 'int-ll64.h',
      'Line' => '24',
      'Name' => '__u16',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '348571' => {
      'Header' => 'socket.h',
      'Line' => '5',
      'Memb' => {
        '0' => {
          'name' => 'size',
          'offset' => '0',
          'type' => '53'
        },
        '1' => {
          'name' => 'socket',
          'offset' => '4',
          'type' => '53'
        },
        '2' => {
          'name' => 'max_size',
          'offset' => '8',
          'type' => '53'
        }
      },
      'Name' => 'struct pldm_socket_sndbuf',
      'PrivateABI' => 1,
      'Size' => '12',
      'Type' => 'Struct'
    },
    '348624' => {
      'BaseType' => '135',
      'Header' => 'pldm.h',
      'Line' => '13',
      'Name' => 'mctp_eid_t',
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '348738' => {
      'BaseType' => '4912',
      'Header' => 'pldm.h',
      'Line' => '30',
      'Name' => 'pldm_requester_rc_t',
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '348750' => {
      'Header' => 'transport.h',
      'Line' => '18',
      'Memb' => {
        '0' => {
          'name' => 'name',
          'offset' => '0',
          'type' => '8959'
        },
        '1' => {
          'name' => 'version',
          'offset' => '8',
          'type' => '135'
        },
        '2' => {
          'name' => 'recv',
          'offset' => '22',
          'type' => '348884'
        },
        '3' => {
          'name' => 'send',
          'offset' => '36',
          'type' => '348925'
        },
        '4' => {
          'name' => 'init_pollfd',
          'offset' => '50',
          'type' => '349006'
        }
      },
      'Name' => 'struct pldm_transport',
      'PrivateABI' => 1,
      'Size' => '40',
      'Type' => 'Struct'
    },
    '348864' => {
      'BaseType' => '348750',
      'Name' => 'struct pldm_transport*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '348869' => {
      'BaseType' => '4803',
      'Name' => 'pldm_tid_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '348884' => {
      'Name' => 'pldm_requester_rc_t(*)(struct pldm_transport*, pldm_tid_t*, void**, size_t*)',
      'Param' => {
        '0' => {
          'type' => '348864'
        },
        '1' => {
          'type' => '348869'
        },
        '2' => {
          'type' => '21335'
        },
        '3' => {
          'type' => '2671'
        }
      },
      'Return' => '348738',
      'Size' => '8',
      'Type' => 'FuncPtr'
    },
    '348925' => {
      'Name' => 'pldm_requester_rc_t(*)(struct pldm_transport*, pldm_tid_t, void const*, size_t)',
      'Param' => {
        '0' => {
          'type' => '348864'
        },
        '1' => {
          'type' => '4803'
        },
        '2' => {
          'type' => '1231'
        },
        '3' => {
          'type' => '164'
        }
      },
      'Return' => '348738',
      'Size' => '8',
      'Type' => 'FuncPtr'
    },
    '348950' => {
      'BaseType' => '348955',
      'Name' => 'struct pollfd*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '348955' => {
      'Header' => 'poll.h',
      'Line' => '36',
      'Memb' => {
        '0' => {
          'name' => 'fd',
          'offset' => '0',
          'type' => '53'
        },
        '1' => {
          'name' => 'events',
          'offset' => '4',
          'type' => '107'
        },
        '2' => {
          'name' => 'revents',
          'offset' => '6',
          'type' => '107'
        }
      },
      'Name' => 'struct pollfd',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Struct'
    },
    '349006' => {
      'Name' => 'int(*)(struct pldm_transport*, struct pollfd*)',
      'Param' => {
        '0' => {
          'type' => '348864'
        },
        '1' => {
          'type' => '348950'
        }
      },
      'Return' => '53',
      'Size' => '8',
      'Type' => 'FuncPtr'
    },
    '349011' => {
      'BaseType' => '67',
      'Header' => 'socket.h',
      'Line' => '10',
      'Name' => '__kernel_sa_family_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '349377' => {
      'Header' => 'mctp.h',
      'Line' => '18',
      'Memb' => {
        '0' => {
          'name' => 's_addr',
          'offset' => '0',
          'type' => '348624'
        }
      },
      'Name' => 'struct mctp_addr',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Struct'
    },
    '349404' => {
      'Header' => 'mctp.h',
      'Line' => '22',
      'Memb' => {
        '0' => {
          'name' => 'smctp_family',
          'offset' => '0',
          'type' => '349011'
        },
        '1' => {
          'name' => '__smctp_pad0',
          'offset' => '2',
          'type' => '348334'
        },
        '2' => {
          'name' => 'smctp_network',
          'offset' => '4',
          'type' => '74'
        },
        '3' => {
          'name' => 'smctp_addr',
          'offset' => '8',
          'type' => '349377'
        },
        '4' => {
          'name' => 'smctp_type',
          'offset' => '9',
          'type' => '348322'
        },
        '5' => {
          'name' => 'smctp_tag',
          'offset' => '16',
          'type' => '348322'
        },
        '6' => {
          'name' => '__smctp_pad1',
          'offset' => '17',
          'type' => '348322'
        }
      },
      'Name' => 'struct sockaddr_mctp',
      'PrivateABI' => 1,
      'Size' => '12',
      'Type' => 'Struct'
    },
    '349509' => {
      'BaseType' => '349404',
      'Name' => 'struct sockaddr_mctp const',
      'Size' => '12',
      'Type' => 'Const'
    },
    '349553' => {
      'Line' => '35',
      'Memb' => {
        '0' => {
          'name' => 'transport',
          'offset' => '0',
          'type' => '348750'
        },
        '1' => {
          'name' => 'socket',
          'offset' => '64',
          'type' => '53'
        },
        '2' => {
          'name' => 'tid_eid_map',
          'offset' => '68',
          'type' => '349646'
        },
        '3' => {
          'name' => 'socket_send_buf',
          'offset' => '768',
          'type' => '348571'
        },
        '4' => {
          'name' => 'bound',
          'offset' => '786',
          'type' => '5433'
        },
        '5' => {
          'name' => 'cookie_jar',
          'offset' => '800',
          'type' => '4827'
        }
      },
      'Name' => 'struct pldm_transport_af_mctp',
      'PrivateABI' => 1,
      'Size' => '336',
      'Source' => 'af-mctp.c',
      'Type' => 'Struct'
    },
    '349646' => {
      'BaseType' => '4803',
      'Name' => 'pldm_tid_t[256]',
      'Size' => '256',
      'Type' => 'Array'
    },
    '350447' => {
      'BaseType' => '349553',
      'Name' => 'struct pldm_transport_af_mctp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '350452' => {
      'BaseType' => '349509',
      'Name' => 'struct sockaddr_mctp const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '350765' => {
      'BaseType' => '350447',
      'Name' => 'struct pldm_transport_af_mctp**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '353875' => {
      'Line' => '26',
      'Memb' => {
        '0' => {
          'name' => 'transport',
          'offset' => '0',
          'type' => '348750'
        },
        '1' => {
          'name' => 'socket',
          'offset' => '64',
          'type' => '53'
        },
        '2' => {
          'name' => 'tid_eid_map',
          'offset' => '68',
          'type' => '349646'
        },
        '3' => {
          'name' => 'socket_send_buf',
          'offset' => '768',
          'type' => '348571'
        }
      },
      'Name' => 'struct pldm_transport_mctp_demux',
      'PrivateABI' => 1,
      'Size' => '312',
      'Source' => 'mctp-demux.c',
      'Type' => 'Struct'
    },
    '354480' => {
      'BaseType' => '353875',
      'Name' => 'struct pldm_transport_mctp_demux*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '354986' => {
      'BaseType' => '354480',
      'Name' => 'struct pldm_transport_mctp_demux**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '377520' => {
      'Header' => 'file_io.h',
      'Line' => '32',
      'Memb' => {
        '0' => {
          'name' => 'handle',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'length',
          'offset' => '4',
          'type' => '147'
        },
        '2' => {
          'name' => 'data',
          'offset' => '8',
          'type' => '176405'
        }
      },
      'Name' => 'struct pldm_oem_meta_file_io_write_req',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '377587' => {
      'Header' => 'file_io.h',
      'Line' => '45',
      'Memb' => {
        '0' => {
          'name' => 'transferFlag',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'offset',
          'offset' => '2',
          'type' => '5634'
        }
      },
      'Name' => 'struct pldm_oem_meta_file_io_read_data_info',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '377626' => {
      'Header' => 'file_io.h',
      'Line' => '55',
      'Memb' => {
        '0' => {
          'name' => 'size',
          'offset' => '0',
          'type' => '5634'
        },
        '1' => {
          'name' => 'crc32',
          'offset' => '4',
          'type' => '147'
        }
      },
      'Name' => 'struct pldm_oem_meta_file_io_read_attr_info',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '377665' => {
      'Header' => 'file_io.h',
      'Line' => '70',
      'Memb' => {
        '0' => {
          'name' => 'data',
          'offset' => '0',
          'type' => '377587'
        }
      },
      'Name' => 'anon-union-file_io.h-70',
      'Size' => '4',
      'Type' => 'Union'
    },
    '377683' => {
      'Header' => 'file_io.h',
      'Line' => '65',
      'Memb' => {
        '0' => {
          'name' => 'version',
          'offset' => '0',
          'type' => '164'
        },
        '1' => {
          'name' => 'handle',
          'offset' => '8',
          'type' => '135'
        },
        '2' => {
          'name' => 'option',
          'offset' => '9',
          'type' => '135'
        },
        '3' => {
          'name' => 'length',
          'offset' => '16',
          'type' => '135'
        },
        '4' => {
          'name' => 'info',
          'offset' => '18',
          'type' => '377665'
        }
      },
      'Name' => 'struct pldm_oem_meta_file_io_read_req',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '377761' => {
      'Header' => 'file_io.h',
      'Line' => '86',
      'Memb' => {
        '0' => {
          'name' => 'attr',
          'offset' => '0',
          'type' => '377626'
        },
        '1' => {
          'name' => 'data',
          'offset' => '0',
          'type' => '377587'
        }
      },
      'Name' => 'anon-union-file_io.h-86',
      'Size' => '8',
      'Type' => 'Union'
    },
    '377789' => {
      'Header' => 'file_io.h',
      'Line' => '80',
      'Memb' => {
        '0' => {
          'name' => 'version',
          'offset' => '0',
          'type' => '164'
        },
        '1' => {
          'name' => 'completion_code',
          'offset' => '8',
          'type' => '135'
        },
        '2' => {
          'name' => 'handle',
          'offset' => '9',
          'type' => '135'
        },
        '3' => {
          'name' => 'option',
          'offset' => '16',
          'type' => '135'
        },
        '4' => {
          'name' => 'length',
          'offset' => '17',
          'type' => '135'
        },
        '5' => {
          'name' => 'info',
          'offset' => '18',
          'type' => '377761'
        },
        '6' => {
          'name' => 'data',
          'offset' => '32',
          'type' => '176405'
        }
      },
      'Name' => 'struct pldm_oem_meta_file_io_read_resp',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '381773' => {
      'BaseType' => '377789',
      'Name' => 'struct pldm_oem_meta_file_io_read_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '384031' => {
      'BaseType' => '377683',
      'Name' => 'struct pldm_oem_meta_file_io_read_req*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '384467' => {
      'BaseType' => '377520',
      'Name' => 'struct pldm_oem_meta_file_io_write_req*',
      'Size' => '8',
      'Type' => 'Pointer'
    }
  },
  'UndefinedSymbols' => {
    'libpldm.so.0.12.0' => {
      '_ITM_deregisterTMCloneTable' => 0,
      '_ITM_registerTMCloneTable' => 0,
      '__assert_fail@GLIBC_2.2.5' => 0,
      '__cxa_finalize@GLIBC_2.2.5' => 0,
      '__errno_location@GLIBC_2.2.5' => 0,
      '__gmon_start__' => 0,
      '__isoc23_strtol@GLIBC_2.38' => 0,
      '__memcpy_chk@GLIBC_2.3.4' => 0,
      '__recv_chk@GLIBC_2.4' => 0,
      '__recvfrom_chk@GLIBC_2.4' => 0,
      '__stack_chk_fail@GLIBC_2.4' => 0,
      'bind@GLIBC_2.2.5' => 0,
      'calloc@GLIBC_2.2.5' => 0,
      'clock_gettime@GLIBC_2.17' => 0,
      'close@GLIBC_2.2.5' => 0,
      'connect@GLIBC_2.2.5' => 0,
      'dup@GLIBC_2.2.5' => 0,
      'fclose@GLIBC_2.2.5' => 0,
      'fcntl64@GLIBC_2.28' => 0,
      'fgets@GLIBC_2.2.5' => 0,
      'fopen64@GLIBC_2.2.5' => 0,
      'free@GLIBC_2.2.5' => 0,
      'getsockopt@GLIBC_2.2.5' => 0,
      'malloc@GLIBC_2.2.5' => 0,
      'memcmp@GLIBC_2.2.5' => 0,
      'memcpy@GLIBC_2.14' => 0,
      'memmem@GLIBC_2.2.5' => 0,
      'open64@GLIBC_2.2.5' => 0,
      'poll@GLIBC_2.2.5' => 0,
      'ppoll@GLIBC_2.4' => 0,
      'recv@GLIBC_2.2.5' => 0,
      'recvmsg@GLIBC_2.2.5' => 0,
      'sendmsg@GLIBC_2.2.5' => 0,
      'sendto@GLIBC_2.2.5' => 0,
      'setsockopt@GLIBC_2.2.5' => 0,
      'socket@GLIBC_2.2.5' => 0,
      'stat64@GLIBC_2.33' => 0,
      'strlen@GLIBC_2.2.5' => 0,
      'strnlen@GLIBC_2.2.5' => 0,
      'timerfd_create@GLIBC_2.8' => 0,
      'timerfd_settime@GLIBC_2.8' => 0,
      'write@GLIBC_2.2.5' => 0
    }
  },
  'WordSize' => '8'
};
