$VAR1 = {
  'ABI_DUMPER_VERSION' => '1.4',
  'ABI_DUMP_VERSION' => '3.5',
  'Arch' => 'x86_64',
  'GccVersion' => '15.2.0',
  'Headers' => {
    'af-mctp.h' => 1,
    'base.h' => 1,
    'bcd.h' => 1,
    'bios.h' => 1,
    'bios_table.h' => 1,
    'edac.h' => 1,
    'file.h' => 1,
    'file_io.h' => 1,
    'firmware_update.h' => 1,
    'fru.h' => 1,
    'host.h' => 1,
    'instance-id.h' => 1,
    'mctp-demux.h' => 1,
    'pdr.h' => 1,
    'platform.h' => 1,
    'pldm.h' => 1,
    'pldm_types.h' => 1,
    'transport.h' => 1,
    'utils.h' => 1
  },
  'Language' => 'C',
  'LibraryName' => 'libpldm.so.0.14.0',
  'LibraryVersion' => '0.14.0',
  'NameSpaces' => {},
  'Needed' => {
    'libc.so.6' => 1
  },
  'PublicABI' => '1',
  'Sources' => {
    'af-mctp.c' => 1,
    'bios_table.c' => 1,
    'instance-id.c' => 1,
    'mctp-demux.c' => 1,
    'pdr.c' => 1
  },
  'SymbolInfo' => {
    '186' => {
      'Alias' => 'pldm_bcd_dec2bcd32',
      'Header' => 'bcd.h',
      'Line' => '51',
      'Param' => {
        '0' => {
          'name' => 'dec',
          'type' => '174'
        }
      },
      'Return' => '174',
      'ShortName' => 'dec2bcd32'
    },
    '315' => {
      'Alias' => 'pldm_bcd_bcd2dec32',
      'Header' => 'bcd.h',
      'Line' => '44',
      'Param' => {
        '0' => {
          'name' => 'bcd',
          'type' => '174'
        }
      },
      'Return' => '174',
      'ShortName' => 'bcd2dec32'
    },
    '418' => {
      'Alias' => 'pldm_bcd_dec2bcd16',

      'pldm_entity_association_tree_copy_root' => 1,
      'pldm_entity_association_tree_delete_node' => 1,
      'pldm_entity_association_tree_destroy' => 1,
      'pldm_entity_association_tree_destroy_root' => 1,
      'pldm_entity_association_tree_find' => 1,
      'pldm_entity_association_tree_find_with_locality' => 1,
      'pldm_entity_association_tree_init' => 1,
      'pldm_entity_association_tree_visit' => 1,
      'pldm_entity_extract' => 1,
      'pldm_entity_get_num_children' => 1,
      'pldm_entity_get_parent' => 1,
      'pldm_entity_is_exist_parent' => 1,
      'pldm_entity_is_node_parent' => 1,
      'pldm_entity_node_get_remote_container_id' => 1,
      'pldm_find_entity_ref_in_tree' => 1,
      'pldm_instance_db_destroy' => 1,
      'pldm_instance_db_init' => 1,
      'pldm_instance_db_init_default' => 1,
      'pldm_instance_id_alloc' => 1,
      'pldm_instance_id_free' => 1,
      'pldm_is_current_parent_child' => 1,
      'pldm_is_empty_entity_assoc_tree' => 1,
      'pldm_msg_hdr_correlate_response' => 1,
      'pldm_oem_meta_file_io_read_resp_data' => 1,
      'pldm_oem_meta_file_io_write_req_data' => 1,
      'pldm_package_component_image_information_iter_init' => 1,
      'pldm_package_downstream_device_id_record_iter_init' => 1,
      'pldm_package_firmware_device_id_record_iter_init' => 1,
      'pldm_pdr_add' => 1,
      'pldm_pdr_add_fru_record_set' => 1,
      'pldm_pdr_delete_by_effecter_id' => 1,
      'pldm_pdr_delete_by_record_handle' => 1,
      'pldm_pdr_delete_by_sensor_id' => 1,
      'pldm_pdr_destroy' => 1,
      'pldm_pdr_find_last_in_range' => 1,
      'pldm_pdr_find_record' => 1,
      'pldm_pdr_find_record_by_type' => 1,
      'pldm_pdr_fru_record_set_find_by_rsi' => 1,
      'pldm_pdr_get_next_record' => 1,
      'pldm_pdr_get_record_count' => 1,
      'pldm_pdr_get_record_handle' => 1,
      'pldm_pdr_get_repo_size' => 1,
      'pldm_pdr_init' => 1,
      'pldm_pdr_record_is_remote' => 1,
      'pldm_pdr_remove_fru_record_set_by_rsi' => 1,
      'pldm_pdr_remove_pdrs_by_terminus_handle' => 1,
      'pldm_pdr_remove_remote_pdrs' => 1,
      'pldm_pdr_update_TL_pdr' => 1,
      'pldm_platform_cper_event_event_data' => 1,
      'pldm_transport_af_mctp_bind' => 1,
      'pldm_transport_af_mctp_core' => 1,
      'pldm_transport_af_mctp_destroy' => 1,
      'pldm_transport_af_mctp_init' => 1,
      'pldm_transport_af_mctp_init_pollfd' => 1,
      'pldm_transport_af_mctp_map_tid' => 1,
      'pldm_transport_af_mctp_unmap_tid' => 1,
      'pldm_transport_mctp_demux_core' => 1,
      'pldm_transport_mctp_demux_destroy' => 1,
      'pldm_transport_mctp_demux_init' => 1,
      'pldm_transport_mctp_demux_init_pollfd' => 1,
      'pldm_transport_mctp_demux_map_tid' => 1,
      'pldm_transport_mctp_demux_unmap_tid' => 1,
      'pldm_transport_poll' => 1,
      'pldm_transport_recv_msg' => 1,
      'pldm_transport_send_msg' => 1,
      'pldm_transport_send_recv_msg' => 1,
      'unpack_pldm_header' => 1,
      'ver2str' => 1
    }
  },
  'Target' => 'unix',
  'TypeInfo' => {
    '1' => {
      'Name' => 'void',
      'Type' => 'Intrinsic'
    },
    '51' => {
      'Name' => 'unsigned char',
      'Size' => '1',
      'Type' => 'Intrinsic'
    },
    '58' => {
      'Name' => 'unsigned short',
      'Size' => '2',
      'Type' => 'Intrinsic'
    },
    '65' => {
      'Name' => 'unsigned int',
      'Size' => '4',
      'Type' => 'Intrinsic'
    },
    '72' => {
      'Name' => 'unsigned long',
      'Size' => '8',
      'Type' => 'Intrinsic'
    },
    '79' => {
      'Name' => 'signed char',
      'Size' => '1',
      'Type' => 'Intrinsic'
    },
    '86' => {
      'BaseType' => '51',
      'Header' => 'types.h',
      'Line' => '38',
      'Name' => '__uint8_t',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '98' => {
      'Name' => 'short',
      'Size' => '2',
      'Type' => 'Intrinsic'
    },
    '105' => {
      'BaseType' => '58',
      'Header' => 'types.h',
      'Line' => '40',
      'Name' => '__uint16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '117' => {
      'Name' => 'int',
      'Size' => '4',
      'Type' => 'Intrinsic'
    },
    '124' => {
      'BaseType' => '65',
      'Header' => 'types.h',
      'Line' => '42',
      'Name' => '__uint32_t',
      'PrivateABI' => 1,
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '136' => {
      'Name' => 'long',
      'Size' => '8',
      'Type' => 'Intrinsic'
    },
    '143' => {
      'Name' => 'char',
      'Size' => '1',
      'Type' => 'Intrinsic'
    },
    '150' => {
      'BaseType' => '86',
      'Header' => 'stdint-uintn.h',
      'Line' => '24',
      'Name' => 'uint8_t',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '162' => {
      'BaseType' => '105',
      'Header' => 'stdint-uintn.h',
      'Line' => '25',
      'Name' => 'uint16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '174' => {
      'BaseType' => '124',
      'Header' => 'stdint-uintn.h',
      'Line' => '26',
      'Name' => 'uint32_t',
      'PrivateABI' => 1,
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '852' => {
      'BaseType' => '1',
      'Name' => 'void*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '878' => {
      'BaseType' => '174',
      'Name' => 'uint32_t const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '883' => {
      'BaseType' => '72',
      'Header' => 'stddef.h',
      'Line' => '229',
      'Name' => 'size_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '909' => {
      'Header' => 'pldm_types.h',
      'Line' => '13',
      'Name' => 'struct bits8',
      'Size' => '1',
      'Type' => 'Struct'
    },
    '1067' => {
      'Header' => 'pldm_types.h',
      'Line' => '23',
      'Memb' => {
        '0' => {
          'name' => 'byte',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'bits',
          'offset' => '0',
          'type' => '909'
        }
      },
      'Name' => 'union bitfield8_t',
      'Size' => '1',
      'Type' => 'Union'
    },
    '1079' => {
      'BaseType' => '1067',
      'Name' => 'bitfield8_t const',
      'Size' => '1',
      'Type' => 'Const'
    },
    '1084' => {
      'Header' => 'pldm_types.h',
      'Line' => '29',
      'Memb' => {
        '0' => {
          'name' => 'alpha',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'update',
          'offset' => '1',
          'type' => '150'
        },
        '2' => {
          'name' => 'minor',
          'offset' => '2',
          'type' => '150'
        },
        '3' => {
          'name' => 'major',
          'offset' => '3',
          'type' => '150'
        }
      },
      'Name' => 'struct pldm_version',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '1150' => {
      'BaseType' => '1084',
      'Header' => 'pldm_types.h',
      'Line' => '34',
      'Name' => 'ver32_t',
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '1162' => {
      'BaseType' => '1150',
      'Name' => 'ver32_t const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '1167' => {
      'Name' => 'float',
      'Size' => '4',
      'Type' => 'Intrinsic'
    },
    '1608' => {
      'Header' => 'base.h',
      'Line' => '130',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_RESPONSE',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_REQUEST',
          'value' => '1'
        },
        '2' => {
          'name' => 'PLDM_RESERVED',
          'value' => '2'
        },
        '3' => {
          'name' => 'PLDM_ASYNC_REQUEST_NOTIFY',
          'value' => '3'
        }
      },
      'Name' => 'enum MessageType',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '1620' => {
      'Header' => 'base.h',
      'Line' => '183',
      'Memb' => {
        '0' => {
          'name' => 'command',
          'offset' => '2',
          'type' => '150'
        }
      },
      'Name' => 'struct pldm_msg_hdr',
      'Size' => '3',
      'Type' => 'Struct'
    },
    '1731' => {
      'BaseType' => '1620',
      'Name' => 'struct pldm_msg_hdr const',
      'Size' => '3',
      'Type' => 'Const'
    },
    '1736' => {
      'Header' => 'base.h',
      'Line' => '216',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '1620'
        },
        '1' => {
          'name' => 'payload',
          'offset' => '3',
          'type' => '1781'
        }
      },
      'Name' => 'struct pldm_msg',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '1776' => {
      'BaseType' => '1736',
      'Name' => 'struct pldm_msg const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '1781' => {
      'BaseType' => '150',
      'Name' => 'uint8_t[1]',
      'Size' => '1',
      'Type' => 'Array'
    },
    '1797' => {
      'Header' => 'base.h',
      'Line' => '283',
      'Memb' => {
        '0' => {
          'name' => 'msg_type',
          'offset' => '0',
          'type' => '1608'
        },
        '1' => {
          'name' => 'instance',
          'offset' => '4',
          'type' => '150'
        },
        '2' => {
          'name' => 'pldm_type',
          'offset' => '5',
          'type' => '150'
        },
        '3' => {
          'name' => 'command',
          'offset' => '6',
          'type' => '150'
        },
        '4' => {
          'name' => 'completion_code',
          'offset' => '7',
          'type' => '150'
        }
      },
      'Name' => 'struct pldm_header_info',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '1877' => {
      'BaseType' => '1797',
      'Name' => 'struct pldm_header_info const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '1882' => {
      'BaseType' => '1067',
      'Name' => 'bitfield8_t[8]',
      'Size' => '8',
      'Type' => 'Array'
    },
    '2044' => {
      'BaseType' => '2049',
      'Name' => 'void const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2049' => {
      'BaseType' => '1',
      'Name' => 'void const',
      'Type' => 'Const'
    },
    '2050' => {
      'BaseType' => '1079',
      'Name' => 'bitfield8_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2225' => {
      'BaseType' => '1736',
      'Name' => 'struct pldm_msg*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2304' => {
      'BaseType' => '1776',
      'Name' => 'struct pldm_msg const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2309' => {
      'BaseType' => '150',
      'Name' => 'uint8_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2314' => {
      'BaseType' => '1150',
      'Name' => 'ver32_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2408' => {
      'BaseType' => '1162',
      'Name' => 'ver32_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2455' => {
      'BaseType' => '174',
      'Name' => 'uint32_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2524' => {
      'BaseType' => '1731',
      'Name' => 'struct pldm_msg_hdr const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2529' => {
      'BaseType' => '1797',
      'Name' => 'struct pldm_header_info*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '3484' => {
      'BaseType' => '883',
      'Name' => 'size_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '3944' => {
      'BaseType' => '1877',
      'Name' => 'struct pldm_header_info const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '5617' => {
      'BaseType' => '150',
      'Name' => 'uint8_t const',
      'Size' => '1',
      'Type' => 'Const'
    },
    '5828' => {
      'BaseType' => '5617',
      'Name' => 'uint8_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '6366' => {
      'BaseType' => '150',
      'Header' => 'base.h',
      'Line' => '19',
      'Name' => 'pldm_tid_t',
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '6378' => {
      'BaseType' => '150',
      'Header' => 'instance-id.h',
      'Line' => '13',
      'Name' => 'pldm_instance_id_t',
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '6390' => {
      'Header' => 'responder.h',
      'Line' => '10',
      'Memb' => {
        '0' => {
          'name' => 'tid',
          'offset' => '0',
          'type' => '6366'
        },
        '1' => {
          'name' => 'instance_id',
          'offset' => '1',
          'type' => '6378'
        },
        '2' => {
          'name' => 'type',
          'offset' => '2',
          'type' => '150'
        },
        '3' => {
          'name' => 'command',
          'offset' => '3',
          'type' => '150'
        },
        '4' => {
          'name' => 'next',
          'offset' => '8',
          'type' => '6470'
        }
      },
      'Name' => 'struct pldm_responder_cookie',
      'PrivateABI' => 1,
      'Size' => '16',
      'Type' => 'Struct'
    },
    '6470' => {
      'BaseType' => '6390',
      'Name' => 'struct pldm_responder_cookie*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '6475' => {
      'Header' => 'pldm.h',
      'Line' => '15',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_REQUESTER_SUCCESS',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_REQUESTER_OPEN_FAIL',
          'value' => '18446744073709551615 (-1)'
        },
        '2' => {
          'name' => 'PLDM_REQUESTER_NOT_PLDM_MSG',
          'value' => '18446744073709551614 (-2)'
        },
        '3' => {
          'name' => 'PLDM_REQUESTER_NOT_RESP_MSG',
          'value' => '18446744073709551613 (-3)'
        },
        '4' => {
          'name' => 'PLDM_REQUESTER_NOT_REQ_MSG',
          'value' => '18446744073709551612 (-4)'
        },
        '5' => {
          'name' => 'PLDM_REQUESTER_RESP_MSG_TOO_SMALL',
          'value' => '18446744073709551611 (-5)'
        },
        '6' => {
          'name' => 'PLDM_REQUESTER_INSTANCE_ID_MISMATCH',
          'value' => '18446744073709551610 (-6)'
        },
        '7' => {
          'name' => 'PLDM_REQUESTER_SEND_FAIL',
          'value' => '18446744073709551609 (-7)'
        },
        '8' => {
          'name' => 'PLDM_REQUESTER_RECV_FAIL',
          'value' => '18446744073709551608 (-8)'
        },
        '9' => {
          'name' => 'PLDM_REQUESTER_INVALID_RECV_LEN',
          'value' => '18446744073709551607 (-9)'
        },
        '10' => {
          'name' => 'PLDM_REQUESTER_SETUP_FAIL',
          'value' => '18446744073709551606 (-10)'
        },
        '11' => {
          'name' => 'PLDM_REQUESTER_INVALID_SETUP',
          'value' => '18446744073709551605 (-11)'
        },
        '12' => {
          'name' => 'PLDM_REQUESTER_POLL_FAIL',
          'value' => '18446744073709551604 (-12)'
        },
        '13' => {
          'name' => 'PLDM_REQUESTER_TRANSPORT_BUSY',
          'value' => '18446744073709551603 (-13)'
        }
      },
      'Name' => 'enum pldm_requester_error_codes',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '6996' => {
      'Name' => '_Bool',
      'Size' => '1',
      'Type' => 'Intrinsic'
    },
    '7149' => {
      'BaseType' => '136',
      'Header' => 'types.h',
      'Line' => '194',
      'Name' => '__ssize_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '7161' => {
      'BaseType' => '143',
      'Name' => 'char*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '7305' => {
      'BaseType' => '7149',
      'Header' => 'types.h',
      'Line' => '108',
      'Name' => 'ssize_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '7984' => {
      'BaseType' => '143',
      'Name' => 'char const',
      'Size' => '1',
      'Type' => 'Const'
    },
    '8018' => {
      'BaseType' => '162',
      'Name' => 'uint16_t const',
      'Size' => '2',
      'Type' => 'Const'
    },
    '8362' => {
      'Header' => 'utils.h',
      'Line' => '22',
      'Memb' => {
        '0' => {
          'name' => 'ptr',
          'offset' => '0',
          'type' => '5828'
        },
        '1' => {
          'name' => 'length',
          'offset' => '8',
          'type' => '883'
        }
      },
      'Name' => 'struct variable_field',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '9440' => {
      'Header' => 'base.h',
      'Line' => '367',
      'Memb' => {
        '0' => {
          'name' => 'pldm_type',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'transfer_opflag',
          'offset' => '1',
          'type' => '150'
        },
        '2' => {
          'name' => 'transfer_ctx',
          'offset' => '4',
          'type' => '174'
        },
        '3' => {
          'name' => 'transfer_handle',
          'offset' => '8',
          'type' => '174'
        },
        '4' => {
          'name' => 'section_offset',
          'offset' => '18',
          'type' => '174'
        },
        '5' => {
          'name' => 'section_length',
          'offset' => '22',
          'type' => '174'
        }
      },
      'Name' => 'struct pldm_base_multipart_receive_req',
      'Size' => '20',
      'Type' => 'Struct'
    },
    '9531' => {
      'BaseType' => '9440',
      'Name' => 'struct pldm_base_multipart_receive_req const',
      'Size' => '20',
      'Type' => 'Const'
    },
    '9536' => {
      'Header' => 'base.h',
      'Line' => '385',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'transfer_flag',
          'offset' => '1',
          'type' => '150'
        },
        '2' => {
          'name' => 'next_transfer_handle',
          'offset' => '4',
          'type' => '174'
        },
        '3' => {
          'name' => 'data',
          'offset' => '8',
          'type' => '8362'
        }
      },
      'Name' => 'struct pldm_base_multipart_receive_resp',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '9606' => {
      'Header' => 'base.h',
      'Line' => '397',
      'Memb' => {
        '0' => {
          'name' => 'requester_part_size',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'requester_protocol_support',
          'offset' => '2',
          'type' => '1882'
        }
      },
      'Name' => 'struct pldm_base_negotiate_transfer_params_req',
      'Size' => '10',
      'Type' => 'Struct'
    },
    '9645' => {
      'BaseType' => '9606',
      'Name' => 'struct pldm_base_negotiate_transfer_params_req const',
      'Size' => '10',
      'Type' => 'Const'
    },
    '9650' => {
      'Header' => 'base.h',
      'Line' => '406',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'responder_part_size',
          'offset' => '2',
          'type' => '162'
        },
        '2' => {
          'name' => 'responder_protocol_support',
          'offset' => '4',
          'type' => '1882'
        }
      },
      'Name' => 'struct pldm_base_negotiate_transfer_params_resp',
      'Size' => '12',
      'Type' => 'Struct'
    },
    '9739' => {
      'BaseType' => '7984',
      'Name' => 'char const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '11893' => {
      'BaseType' => '9650',
      'Name' => 'struct pldm_base_negotiate_transfer_params_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '17404' => {
      'BaseType' => '9645',
      'Name' => 'struct pldm_base_negotiate_transfer_params_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '24961' => {
      'BaseType' => '9536',
      'Name' => 'struct pldm_base_multipart_receive_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '27715' => {
      'BaseType' => '9531',
      'Name' => 'struct pldm_base_multipart_receive_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '33566' => {
      'BaseType' => '1067',
      'Name' => 'bitfield8_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '35334' => {
      'BaseType' => '1620',
      'Name' => 'struct pldm_msg_hdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '39586' => {
      'BaseType' => '8362',
      'Name' => 'struct variable_field*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '41668' => {
      'BaseType' => '162',
      'Name' => 'uint16_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '44918' => {
      'BaseType' => '72',
      'Header' => 'types.h',
      'Line' => '45',
      'Name' => '__uint64_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '45012' => {
      'BaseType' => '44918',
      'Header' => 'stdint-uintn.h',
      'Line' => '27',
      'Name' => 'uint64_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '45310' => {
      'Header' => 'bios.h',
      'Line' => '39',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_BIOS_STRING_TABLE',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_BIOS_ATTR_TABLE',
          'value' => '1'
        },
        '2' => {
          'name' => 'PLDM_BIOS_ATTR_VAL_TABLE',
          'value' => '2'
        }
      },
      'Name' => 'enum pldm_bios_table_types',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '45344' => {
      'Header' => 'bios.h',
      'Line' => '48',
      'Memb' => {
        '0' => {
          'name' => 'string_handle',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'string_length',
          'offset' => '2',
          'type' => '162'
        },
        '2' => {
          'name' => 'name',
          'offset' => '4',
          'type' => '45401'
        }
      },
      'Name' => 'struct pldm_bios_string_table_entry',
      'Size' => '5',
      'Type' => 'Struct'
    },
    '45396' => {
      'BaseType' => '45344',
      'Name' => 'struct pldm_bios_string_table_entry const',
      'Size' => '5',
      'Type' => 'Const'
    },
    '45401' => {
      'BaseType' => '143',
      'Name' => 'char[1]',
      'Size' => '1',
      'Type' => 'Array'
    },
    '45417' => {
      'Header' => 'bios.h',
      'Line' => '54',
      'Memb' => {
        '0' => {
          'name' => 'attr_handle',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'attr_type',
          'offset' => '2',
          'type' => '150'
        },
        '2' => {
          'name' => 'string_handle',
          'offset' => '3',
          'type' => '162'
        },
        '3' => {
          'name' => 'metadata',
          'offset' => '5',
          'type' => '1781'
        }
      },
      'Name' => 'struct pldm_bios_attr_table_entry',
      'Size' => '6',
      'Type' => 'Struct'
    },
    '45482' => {
      'BaseType' => '45417',
      'Name' => 'struct pldm_bios_attr_table_entry const',
      'Size' => '6',
      'Type' => 'Const'
    },
    '45487' => {
      'Header' => 'bios.h',
      'Line' => '66',
      'Memb' => {
        '0' => {
          'name' => 'attr_handle',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'attr_type',
          'offset' => '2',
          'type' => '150'
        },
        '2' => {
          'name' => 'value',
          'offset' => '3',
          'type' => '1781'
        }
      },
      'Name' => 'struct pldm_bios_attr_val_table_entry',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '45539' => {
      'BaseType' => '45487',
      'Name' => 'struct pldm_bios_attr_val_table_entry const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '45608' => {
      'Header' => 'bios_table.h',
      'Line' => '206',
      'Memb' => {
        '0' => {
          'name' => 'name_handle',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'read_only',
          'offset' => '2',
          'type' => '6996'
        },
        '2' => {
          'name' => 'pv_num',
          'offset' => '3',
          'type' => '150'
        },
        '3' => {
          'name' => 'pv_handle',
          'offset' => '8',
          'type' => '45711'
        },
        '4' => {
          'name' => 'def_num',
          'offset' => '22',
          'type' => '150'
        },
        '5' => {
          'name' => 'def_index',
          'offset' => '36',
          'type' => '5828'
        }
      },
      'Name' => 'struct pldm_bios_table_attr_entry_enum_info',
      'Size' => '32',
      'Type' => 'Struct'
    },
    '45699' => {
      'BaseType' => '45608',
      'Name' => 'struct pldm_bios_table_attr_entry_enum_info const',
      'Size' => '32',
      'Type' => 'Const'
    },
    '45711' => {
      'BaseType' => '8018',
      'Name' => 'uint16_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '45716' => {
      'Header' => 'bios_table.h',
      'Line' => '294',
      'Memb' => {
        '0' => {
          'name' => 'name_handle',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'read_only',
          'offset' => '2',
          'type' => '6996'
        },
        '2' => {
          'name' => 'string_type',
          'offset' => '3',
          'type' => '150'
        },
        '3' => {
          'name' => 'min_length',
          'offset' => '4',
          'type' => '162'
        },
        '4' => {
          'name' => 'max_length',
          'offset' => '6',
          'type' => '162'
        },
        '5' => {
          'name' => 'def_length',
          'offset' => '8',
          'type' => '162'
        },
        '6' => {
          'name' => 'def_string',
          'offset' => '22',
          'type' => '9739'
        }
      },
      'Name' => 'struct pldm_bios_table_attr_entry_string_info',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '45828' => {
      'BaseType' => '45716',
      'Name' => 'struct pldm_bios_table_attr_entry_string_info const',
      'Size' => '24',
      'Type' => 'Const'
    },
    '45838' => {
      'Header' => 'bios_table.h',
      'Line' => '384',
      'Memb' => {
        '0' => {
          'name' => 'name_handle',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'read_only',
          'offset' => '2',
          'type' => '6996'
        },
        '2' => {
          'name' => 'lower_bound',
          'offset' => '8',
          'type' => '45012'
        },
        '3' => {
          'name' => 'upper_bound',
          'offset' => '22',
          'type' => '45012'
        },
        '4' => {
          'name' => 'scalar_increment',
          'offset' => '36',
          'type' => '174'
        },
        '5' => {
          'name' => 'default_value',
          'offset' => '50',
          'type' => '45012'
        }
      },
      'Name' => 'struct pldm_bios_table_attr_entry_integer_info',
      'Size' => '40',
      'Type' => 'Struct'
    },
    '45936' => {
      'BaseType' => '45838',
      'Name' => 'struct pldm_bios_table_attr_entry_integer_info const',
      'Size' => '40',
      'Type' => 'Const'
    },
    '46168' => {
      'Name' => 'ssize_t(*)(void const*)',
      'Param' => {
        '0' => {
          'type' => '2044'
        }
      },
      'Return' => '7305',
      'Size' => '8',
      'Type' => 'FuncPtr'
    },
    '46238' => {
      'Line' => '957',
      'Memb' => {
        '0' => {
          'name' => 'table_data',
          'offset' => '0',
          'type' => '5828'
        },
        '1' => {
          'name' => 'table_len',
          'offset' => '8',
          'type' => '883'
        },
        '2' => {
          'name' => 'current_pos',
          'offset' => '22',
          'type' => '883'
        },
        '3' => {
          'name' => 'entry_length_handler',
          'offset' => '36',
          'type' => '46168'
        }
      },
      'Name' => 'struct pldm_bios_table_iter',
      'PrivateABI' => 1,
      'Size' => '32',
      'Source' => 'bios_table.c',
      'Type' => 'Struct'
    },
    '46308' => {
      'BaseType' => '46238',
      'Name' => 'struct pldm_bios_table_iter const',
      'Size' => '32',
      'Type' => 'Const'
    },
    '47378' => {
      'BaseType' => '46238',
      'Name' => 'struct pldm_bios_table_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '47383' => {
      'BaseType' => '45539',
      'Name' => 'struct pldm_bios_attr_val_table_entry const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '47797' => {
      'BaseType' => '45482',
      'Name' => 'struct pldm_bios_attr_table_entry const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '48400' => {
      'BaseType' => '45396',
      'Name' => 'struct pldm_bios_string_table_entry const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '49563' => {
      'BaseType' => '46308',
      'Name' => 'struct pldm_bios_table_iter const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '53746' => {
      'BaseType' => '45012',
      'Name' => 'uint64_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '54023' => {
      'BaseType' => '45936',
      'Name' => 'struct pldm_bios_table_attr_entry_integer_info const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '54290' => {
      'BaseType' => '9739',
      'Name' => 'char const**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '55419' => {
      'BaseType' => '45828',
      'Name' => 'struct pldm_bios_table_attr_entry_string_info const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '56873' => {
      'BaseType' => '45699',
      'Name' => 'struct pldm_bios_table_attr_entry_enum_info const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '59094' => {
      'Header' => 'pldm_types.h',
      'Line' => '40',
      'Name' => 'struct bits16',
      'Size' => '2',
      'Type' => 'Struct'
    },
    '59364' => {
      'Header' => 'pldm_types.h',
      'Line' => '58',
      'Memb' => {
        '0' => {
          'name' => 'value',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'bits',
          'offset' => '0',
          'type' => '59094'
        }
      },
      'Name' => 'union bitfield16_t',
      'Size' => '2',
      'Type' => 'Union'
    },
    '60148' => {
      'Header' => 'file.h',
      'Line' => '53',
      'Memb' => {
        '0' => {
          'name' => 'file_identifier',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'file_attribute',
          'offset' => '2',
          'type' => '59364'
        }
      },
      'Name' => 'struct pldm_file_df_open_req',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '60188' => {
      'BaseType' => '60148',
      'Name' => 'struct pldm_file_df_open_req const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '60193' => {
      'Header' => 'file.h',
      'Line' => '62',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'file_descriptor',
          'offset' => '2',
          'type' => '162'
        }
      },
      'Name' => 'struct pldm_file_df_open_resp',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '60238' => {
      'Header' => 'file.h',
      'Line' => '71',
      'Memb' => {
        '0' => {
          'name' => 'file_descriptor',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'df_close_options',
          'offset' => '2',
          'type' => '59364'
        }
      },
      'Name' => 'struct pldm_file_df_close_req',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '60278' => {
      'BaseType' => '60238',
      'Name' => 'struct pldm_file_df_close_req const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '60283' => {
      'Header' => 'file.h',
      'Line' => '80',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '150'
        }
      },
      'Name' => 'struct pldm_file_df_close_resp',
      'Size' => '1',
      'Type' => 'Struct'
    },
    '60315' => {
      'Header' => 'file.h',
      'Line' => '88',
      'Memb' => {
        '0' => {
          'name' => 'file_descriptor',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'requester_max_interval',
          'offset' => '4',
          'type' => '174'
        }
      },
      'Name' => 'struct pldm_file_df_heartbeat_req',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '60355' => {
      'BaseType' => '60315',
      'Name' => 'struct pldm_file_df_heartbeat_req const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '60360' => {
      'Header' => 'file.h',
      'Line' => '97',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'responder_max_interval',
          'offset' => '4',
          'type' => '174'
        }
      },
      'Name' => 'struct pldm_file_df_heartbeat_resp',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '61969' => {
      'BaseType' => '60360',
      'Name' => 'struct pldm_file_df_heartbeat_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '63548' => {
      'BaseType' => '60355',
      'Name' => 'struct pldm_file_df_heartbeat_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '63689' => {
      'BaseType' => '60283',
      'Name' => 'struct pldm_file_df_close_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '67980' => {
      'BaseType' => '60278',
      'Name' => 'struct pldm_file_df_close_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '69730' => {
      'BaseType' => '60193',
      'Name' => 'struct pldm_file_df_open_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '74316' => {
      'BaseType' => '60188',
      'Name' => 'struct pldm_file_df_open_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '76047' => {
      'BaseType' => '150',
      'Header' => 'pldm_types.h',
      'Line' => '36',
      'Name' => 'bool8_t',
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '76339' => {
      'Header' => 'pldm_types.h',
      'Line' => '62',
      'Name' => 'struct bits32',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '76831' => {
      'Header' => 'pldm_types.h',
      'Line' => '96',
      'Memb' => {
        '0' => {
          'name' => 'value',
          'offset' => '0',
          'type' => '174'
        },
        '1' => {
          'name' => 'bits',
          'offset' => '0',
          'type' => '76339'
        }
      },
      'Name' => 'union bitfield32_t',
      'Size' => '4',
      'Type' => 'Union'
    },
    '76843' => {
      'Header' => 'pldm_types.h',
      'Line' => '100',
      'Name' => 'struct bits64',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '77783' => {
      'Header' => 'pldm_types.h',
      'Line' => '166',
      'Memb' => {
        '0' => {
          'name' => 'value',
          'offset' => '0',
          'type' => '45012'
        },
        '1' => {
          'name' => 'bits',
          'offset' => '0',
          'type' => '76843'
        }
      },
      'Name' => 'union bitfield64_t',
      'Size' => '8',
      'Type' => 'Union'
    },
    '77802' => {
      'BaseType' => '77814',
      'Header' => 'pldm_types.h',
      'Line' => '170',
      'Name' => 'pldm_uuid',
      'Size' => '16',
      'Type' => 'Typedef'
    },
    '77814' => {
      'BaseType' => '150',
      'Name' => 'uint8_t[16]',
      'Size' => '16',
      'Type' => 'Array'
    },
    '77830' => {
      'BaseType' => '77814',
      'Name' => 'uint8_t[16] const',
      'Size' => '16',
      'Type' => 'Const'
    },
    '77859' => {
      'BaseType' => '883',
      'Name' => 'size_t const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '77924' => {
      'BaseType' => '8362',
      'Name' => 'struct variable_field const',
      'Size' => '16',
      'Type' => 'Const'
    },
    '80064' => {
      'BaseType' => '150',
      'Name' => 'uint8_t[8]',
      'Size' => '8',
      'Type' => 'Array'
    },
    '80080' => {
      'Header' => 'firmware_update.h',
      'Line' => '466',
      'Memb' => {
        '0' => {
          'name' => 'uuid',
          'offset' => '0',
          'type' => '77814'
        },
        '1' => {
          'name' => 'package_header_format_version',
          'offset' => '22',
          'type' => '150'
        },
        '2' => {
          'name' => 'package_header_size',
          'offset' => '23',
          'type' => '162'
        },
        '3' => {
          'name' => 'package_release_date_time',
          'offset' => '25',
          'type' => '80193'
        },
        '4' => {
          'name' => 'component_bitmap_bit_length',
          'offset' => '50',
          'type' => '162'
        },
        '5' => {
          'name' => 'package_version_string_type',
          'offset' => '52',
          'type' => '150'
        },
        '6' => {
          'name' => 'package_version_string_length',
          'offset' => '53',
          'type' => '150'
        }
      },
      'Name' => 'struct pldm_package_header_information',
      'Size' => '36',
      'Type' => 'Struct'
    },
    '80193' => {
      'BaseType' => '150',
      'Name' => 'uint8_t[13]',
      'Size' => '13',
      'Type' => 'Array'
    },
    '80209' => {
      'Header' => 'firmware_update.h',
      'Line' => '480',
      'Memb' => {
        '0' => {
          'name' => 'record_length',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'descriptor_count',
          'offset' => '2',
          'type' => '150'
        },
        '2' => {
          'name' => 'device_update_option_flags',
          'offset' => '3',
          'type' => '76831'
        },
        '3' => {
          'name' => 'comp_image_set_version_string_type',
          'offset' => '7',
          'type' => '150'
        },
        '4' => {
          'name' => 'comp_image_set_version_string_length',
          'offset' => '8',
          'type' => '150'
        },
        '5' => {
          'name' => 'fw_device_pkg_data_length',
          'offset' => '9',
          'type' => '162'
        }
      },
      'Name' => 'struct pldm_firmware_device_id_record',
      'Size' => '11',
      'Type' => 'Struct'
    },
    '80422' => {
      'Header' => 'firmware_update.h',
      'Line' => '514',
      'Memb' => {
        '0' => {
          'name' => 'comp_classification',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'comp_identifier',
          'offset' => '2',
          'type' => '162'
        },
        '2' => {
          'name' => 'comp_comparison_stamp',
          'offset' => '4',
          'type' => '174'
        },
        '3' => {
          'name' => 'comp_options',
          'offset' => '8',
          'type' => '59364'
        },
        '4' => {
          'name' => 'requested_comp_activation_method',
          'offset' => '16',
          'type' => '59364'
        },
        '5' => {
          'name' => 'comp_location_offset',
          'offset' => '18',
          'type' => '174'
        },
        '6' => {
          'name' => 'comp_size',
          'offset' => '22',
          'type' => '174'
        },
        '7' => {
          'name' => 'comp_version_string_type',
          'offset' => '32',
          'type' => '150'
        },
        '8' => {
          'name' => 'comp_version_string_length',
          'offset' => '33',
          'type' => '150'
        }
      },
      'Name' => 'struct pldm_component_image_information',
      'Size' => '22',
      'Type' => 'Struct'
    },
    '80620' => {
      'Header' => 'firmware_update.h',
      'Line' => '540',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'capabilities_during_update',
          'offset' => '1',
          'type' => '76831'
        },
        '2' => {
          'name' => 'comp_count',
          'offset' => '5',
          'type' => '162'
        },
        '3' => {
          'name' => 'active_comp_image_set_ver_str_type',
          'offset' => '7',
          'type' => '150'
        },
        '4' => {
          'name' => 'active_comp_image_set_ver_str_len',
          'offset' => '8',
          'type' => '150'
        },
        '5' => {
          'name' => 'pending_comp_image_set_ver_str_type',
          'offset' => '9',
          'type' => '150'
        },
        '6' => {
          'name' => 'pending_comp_image_set_ver_str_len',
          'offset' => '16',
          'type' => '150'
        }
      },
      'Name' => 'struct pldm_get_firmware_parameters_resp',
      'Size' => '11',
      'Type' => 'Struct'
    },
    '80823' => {
      'Header' => 'firmware_update.h',
      'Line' => '568',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'downstream_device_update_supported',
          'offset' => '1',
          'type' => '150'
        },
        '2' => {
          'name' => 'number_of_downstream_devices',
          'offset' => '2',
          'type' => '162'
        },
        '3' => {
          'name' => 'max_number_of_downstream_devices',
          'offset' => '4',
          'type' => '162'
        },
        '4' => {
          'name' => 'capabilities',
          'offset' => '8',
          'type' => '76831'
        }
      },
      'Name' => 'struct pldm_query_downstream_devices_resp',
      'Size' => '12',
      'Type' => 'Struct'
    },
    '80908' => {
      'Header' => 'firmware_update.h',
      'Line' => '580',
      'Memb' => {
        '0' => {
          'name' => 'comp_classification',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'comp_identifier',
          'offset' => '2',
          'type' => '162'
        },
        '2' => {
          'name' => 'comp_classification_index',
          'offset' => '4',
          'type' => '150'
        },
        '3' => {
          'name' => 'active_comp_comparison_stamp',
          'offset' => '5',
          'type' => '174'
        },
        '4' => {
          'name' => 'active_comp_ver_str_type',
          'offset' => '9',
          'type' => '150'
        },
        '5' => {
          'name' => 'active_comp_ver_str_len',
          'offset' => '16',
          'type' => '150'
        },
        '6' => {
          'name' => 'active_comp_release_date',
          'offset' => '17',
          'type' => '80064'
        },
        '7' => {
          'name' => 'pending_comp_comparison_stamp',
          'offset' => '25',
          'type' => '174'
        },
        '8' => {
          'name' => 'pending_comp_ver_str_type',
          'offset' => '35',
          'type' => '150'
        },
        '9' => {
          'name' => 'pending_comp_ver_str_len',
          'offset' => '36',
          'type' => '150'
        },
        '10' => {
          'name' => 'pending_comp_release_date',
          'offset' => '37',
          'type' => '80064'
        },
        '11' => {
          'name' => 'comp_activation_methods',
          'offset' => '51',
          'type' => '59364'
        },
        '12' => {
          'name' => 'capabilities_during_update',
          'offset' => '53',
          'type' => '76831'
        }
      },
      'Name' => 'struct pldm_component_parameter_entry',
      'Size' => '39',
      'Type' => 'Struct'
    },
    '81223' => {
      'Header' => 'firmware_update.h',
      'Line' => '619',
      'Memb' => {
        '0' => {
          'name' => 'data_transfer_handle',
          'offset' => '0',
          'type' => '174'
        },
        '1' => {
          'name' => 'transfer_operation_flag',
          'offset' => '4',
          'type' => '150'
        }
      },
      'Name' => 'struct pldm_query_downstream_identifiers_req',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '81266' => {
      'BaseType' => '81223',
      'Name' => 'struct pldm_query_downstream_identifiers_req const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '81271' => {
      'Header' => 'firmware_update.h',
      'Line' => '633',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'next_data_transfer_handle',
          'offset' => '4',
          'type' => '174'
        },
        '2' => {
          'name' => 'transfer_flag',
          'offset' => '8',
          'type' => '150'
        },
        '3' => {
          'name' => 'downstream_devices_length',
          'offset' => '18',
          'type' => '174'
        },
        '4' => {
          'name' => 'number_of_downstream_devices',
          'offset' => '22',
          'type' => '162'
        }
      },
      'Name' => 'struct pldm_query_downstream_identifiers_resp',
      'Size' => '20',
      'Type' => 'Struct'
    },
    '81356' => {
      'Header' => 'firmware_update.h',
      'Line' => '646',
      'Memb' => {
        '0' => {
          'name' => 'downstream_device_index',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'downstream_descriptor_count',
          'offset' => '2',
          'type' => '150'
        }
      },
      'Name' => 'struct pldm_downstream_device',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '81399' => {
      'Header' => 'firmware_update.h',
      'Line' => '652',
      'Memb' => {
        '0' => {
          'name' => 'field',
          'offset' => '0',
          'type' => '8362'
        },
        '1' => {
          'name' => 'devs',
          'offset' => '22',
          'type' => '883'
        }
      },
      'Name' => 'struct pldm_downstream_device_iter',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '81442' => {
      'Header' => 'firmware_update.h',
      'Line' => '726',
      'Memb' => {
        '0' => {
          'name' => 'descriptor_type',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'descriptor_length',
          'offset' => '2',
          'type' => '162'
        },
        '2' => {
          'name' => 'descriptor_data',
          'offset' => '8',
          'type' => '2044'
        }
      },
      'Name' => 'struct pldm_descriptor',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '81515' => {
      'Header' => 'firmware_update.h',
      'Line' => '732',
      'Memb' => {
        '0' => {
          'name' => 'field',
          'offset' => '0',
          'type' => '39586'
        },
        '1' => {
          'name' => 'count',
          'offset' => '8',
          'type' => '883'
        }
      },
      'Name' => 'struct pldm_descriptor_iter',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '81563' => {
      'Header' => 'firmware_update.h',
      'Line' => '825',
      'Memb' => {
        '0' => {
          'name' => 'data_transfer_handle',
          'offset' => '0',
          'type' => '174'
        },
        '1' => {
          'name' => 'transfer_operation_flag',
          'offset' => '4',
          'type' => '150'
        }
      },
      'Name' => 'struct pldm_get_downstream_firmware_parameters_req',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '81606' => {
      'BaseType' => '81563',
      'Name' => 'struct pldm_get_downstream_firmware_parameters_req const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '81611' => {
      'Header' => 'firmware_update.h',
      'Line' => '840',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'next_data_transfer_handle',
          'offset' => '4',
          'type' => '174'
        },
        '2' => {
          'name' => 'transfer_flag',
          'offset' => '8',
          'type' => '150'
        },
        '3' => {
          'name' => 'fdp_capabilities_during_update',
          'offset' => '18',
          'type' => '76831'
        },
        '4' => {
          'name' => 'downstream_device_count',
          'offset' => '22',
          'type' => '162'
        }
      },
      'Name' => 'struct pldm_get_downstream_firmware_parameters_resp',
      'Size' => '20',
      'Type' => 'Struct'
    },
    '81696' => {
      'Header' => 'firmware_update.h',
      'Line' => '858',
      'Memb' => {
        '0' => {
          'name' => 'downstream_device_index',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'active_comp_comparison_stamp',
          'offset' => '4',
          'type' => '174'
        },
        '2' => {
          'name' => 'active_comp_ver_str_type',
          'offset' => '8',
          'type' => '150'
        },
        '3' => {
          'name' => 'active_comp_ver_str_len',
          'offset' => '9',
          'type' => '150'
        },
        '4' => {
          'name' => 'active_comp_release_date',
          'offset' => '16',
          'type' => '81893'
        },
        '5' => {
          'name' => 'pending_comp_comparison_stamp',
          'offset' => '32',
          'type' => '174'
        },
        '6' => {
          'name' => 'pending_comp_ver_str_type',
          'offset' => '36',
          'type' => '150'
        },
        '7' => {
          'name' => 'pending_comp_ver_str_len',
          'offset' => '37',
          'type' => '150'
        },
        '8' => {
          'name' => 'pending_comp_release_date',
          'offset' => '38',
          'type' => '81893'
        },
        '9' => {
          'name' => 'comp_activation_methods',
          'offset' => '54',
          'type' => '59364'
        },
        '10' => {
          'name' => 'capabilities_during_update',
          'offset' => '64',
          'type' => '76831'
        },
        '11' => {
          'name' => 'active_comp_ver_str',
          'offset' => '72',
          'type' => '2044'
        },
        '12' => {
          'name' => 'pending_comp_ver_str',
          'offset' => '86',
          'type' => '2044'
        }
      },
      'Name' => 'struct pldm_downstream_device_parameters_entry',
      'Size' => '64',
      'Type' => 'Struct'
    },
    '81893' => {
      'BaseType' => '143',
      'Name' => 'char[9]',
      'Size' => '9',
      'Type' => 'Array'
    },
    '83264' => {
      'Header' => 'firmware_update.h',
      'Line' => '1395',
      'Memb' => {
        '0' => {
          'name' => 'field',
          'offset' => '0',
          'type' => '8362'
        },
        '1' => {
          'name' => 'entries',
          'offset' => '22',
          'type' => '883'
        }
      },
      'Name' => 'struct pldm_downstream_device_parameters_iter',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '83307' => {
      'Header' => 'firmware_update.h',
      'Line' => '2249',
      'Memb' => {
        '0' => {
          'name' => 'magic',
          'offset' => '0',
          'type' => '878'
        },
        '1' => {
          'name' => 'version',
          'offset' => '4',
          'type' => '5617'
        }
      },
      'Name' => 'anon-struct-firmware_update.h-2249',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '83344' => {
      'Header' => 'firmware_update.h',
      'Line' => '2268',
      'Memb' => {
        '0' => {
          'name' => 'identifier',
          'offset' => '0',
          'type' => '77830'
        },
        '1' => {
          'name' => 'revision',
          'offset' => '22',
          'type' => '5617'
        }
      },
      'Name' => 'anon-struct-firmware_update.h-2268',
      'Size' => '17',
      'Type' => 'Struct'
    },
    '83381' => {
      'Header' => 'firmware_update.h',
      'Line' => '2248',
      'Memb' => {
        '0' => {
          'name' => 'meta',
          'offset' => '0',
          'type' => '83307'
        },
        '1' => {
          'name' => 'format',
          'offset' => '8',
          'type' => '83344'
        }
      },
      'Name' => 'struct pldm_package_format_pin',
      'Size' => '28',
      'Type' => 'Struct'
    },
    '83424' => {
      'BaseType' => '83381',
      'Name' => 'struct pldm_package_format_pin const',
      'Size' => '28',
      'Type' => 'Const'
    },
    '83429' => {
      'Header' => 'firmware_update.h',
      'Line' => '2277',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_PACKAGE_PARSE_INIT',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_PACKAGE_PARSE_COMPLETE',
          'value' => '1'
        },
        '2' => {
          'name' => 'PLDM_PACKAGE_PARSE_HEADER',
          'value' => '2'
        },
        '3' => {
          'name' => 'PLDM_PACKAGE_PARSE_FIRMWARE_DEVICES',
          'value' => '3'
        },
        '4' => {
          'name' => 'PLDM_PACKAGE_PARSE_DOWNSTREAM_DEVICES',
          'value' => '4'
        },
        '5' => {
          'name' => 'PLDM_PACKAGE_PARSE_COMPONENT_IMAGE_INFORMATION',
          'value' => '5'
        }
      },
      'Name' => 'enum pldm_package_parse',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '83481' => {
      'Header' => 'firmware_update.h',
      'Line' => '2286',
      'Memb' => {
        '0' => {
          'name' => 'field',
          'offset' => '0',
          'type' => '8362'
        },
        '1' => {
          'name' => 'entries',
          'offset' => '22',
          'type' => '883'
        }
      },
      'Name' => 'struct pldm_package_iter',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '83524' => {
      'Header' => 'firmware_update.h',
      'Line' => '2299',
      'Memb' => {
        '0' => {
          'name' => 'package_header_identifier',
          'offset' => '0',
          'type' => '77802'
        },
        '1' => {
          'name' => 'package_header_format_revision',
          'offset' => '22',
          'type' => '150'
        },
        '2' => {
          'name' => 'package_release_date_time',
          'offset' => '23',
          'type' => '80193'
        },
        '3' => {
          'name' => 'component_bitmap_bit_length',
          'offset' => '48',
          'type' => '162'
        },
        '4' => {
          'name' => 'package_version_string_type',
          'offset' => '50',
          'type' => '150'
        },
        '5' => {
          'name' => 'package_version_string',
          'offset' => '64',
          'type' => '8362'
        }
      },
      'Name' => 'struct pldm__package_header_information',
      'Size' => '56',
      'Type' => 'Struct'
    },
    '83623' => {
      'BaseType' => '83524',
      'Header' => 'firmware_update.h',
      'Line' => '2312',
      'Name' => 'pldm_package_header_information_pad',
      'Size' => '56',
      'Type' => 'Typedef'
    },
    '83636' => {
      'BaseType' => '83623',
      'Name' => 'pldm_package_header_information_pad const',
      'Size' => '56',
      'Type' => 'Const'
    },
    '83641' => {
      'Header' => 'firmware_update.h',
      'Line' => '2315',
      'Memb' => {
        '0' => {
          'name' => 'bitmap',
          'offset' => '0',
          'type' => '8362'
        }
      },
      'Name' => 'struct pldm_package_component_bitmap',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '83670' => {
      'Header' => 'firmware_update.h',
      'Line' => '2327',
      'Memb' => {
        '0' => {
          'name' => 'descriptor_count',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'device_update_option_flags',
          'offset' => '4',
          'type' => '76831'
        },
        '2' => {
          'name' => 'component_image_set_version_string_type',
          'offset' => '8',
          'type' => '150'
        },
        '3' => {
          'name' => 'component_image_set_version_string',
          'offset' => '22',
          'type' => '8362'
        },
        '4' => {
          'name' => 'applicable_components',
          'offset' => '50',
          'type' => '83641'
        },
        '5' => {
          'name' => 'record_descriptors',
          'offset' => '72',
          'type' => '8362'
        },
        '6' => {
          'name' => 'firmware_device_package_data',
          'offset' => '100',
          'type' => '8362'
        },
        '7' => {
          'name' => 'reference_manifest_data',
          'offset' => '128',
          'type' => '8362'
        }
      },
      'Name' => 'struct pldm_package_firmware_device_id_record',
      'Size' => '96',
      'Type' => 'Struct'
    },
    '83797' => {
      'Header' => 'firmware_update.h',
      'Line' => '2378',
      'Memb' => {
        '0' => {
          'name' => 'descriptor_count',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'update_option_flags',
          'offset' => '4',
          'type' => '76831'
        },
        '2' => {
          'name' => 'self_contained_activation_min_version_string_type',
          'offset' => '8',
          'type' => '150'
        },
        '3' => {
          'name' => 'self_contained_activation_min_version_string',
          'offset' => '22',
          'type' => '8362'
        },
        '4' => {
          'name' => 'self_contained_activation_min_version_comparison_stamp',
          'offset' => '50',
          'type' => '174'
        },
        '5' => {
          'name' => 'applicable_components',
          'offset' => '64',
          'type' => '83641'
        },
        '6' => {
          'name' => 'record_descriptors',
          'offset' => '86',
          'type' => '8362'
        },
        '7' => {
          'name' => 'package_data',
          'offset' => '114',
          'type' => '8362'
        },
        '8' => {
          'name' => 'reference_manifest_data',
          'offset' => '136',
          'type' => '8362'
        }
      },
      'Name' => 'struct pldm_package_downstream_device_id_record',
      'Size' => '104',
      'Type' => 'Struct'
    },
    '83938' => {
      'Header' => 'firmware_update.h',
      'Line' => '2428',
      'Memb' => {
        '0' => {
          'name' => 'component_classification',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'component_identifier',
          'offset' => '2',
          'type' => '162'
        },
        '2' => {
          'name' => 'component_comparison_stamp',
          'offset' => '4',
          'type' => '174'
        },
        '3' => {
          'name' => 'component_options',
          'offset' => '8',
          'type' => '59364'
        },
        '4' => {
          'name' => 'requested_component_activation_method',
          'offset' => '16',
          'type' => '59364'
        },
        '5' => {
          'name' => 'component_image',
          'offset' => '22',
          'type' => '8362'
        },
        '6' => {
          'name' => 'component_version_string_type',
          'offset' => '50',
          'type' => '150'
        },
        '7' => {
          'name' => 'component_version_string',
          'offset' => '64',
          'type' => '8362'
        },
        '8' => {
          'name' => 'component_opaque_data',
          'offset' => '86',
          'type' => '8362'
        }
      },
      'Name' => 'struct pldm_package_component_image_information',
      'Size' => '72',
      'Type' => 'Struct'
    },
    '84079' => {
      'Header' => 'firmware_update.h',
      'Line' => '2469',
      'Memb' => {
        '0' => {
          'name' => 'pin',
          'offset' => '0',
          'type' => '84190'
        },
        '1' => {
          'name' => 'hdr',
          'offset' => '8',
          'type' => '84195'
        },
        '2' => {
          'name' => 'state',
          'offset' => '22',
          'type' => '83429'
        },
        '3' => {
          'name' => 'flags',
          'offset' => '32',
          'type' => '174'
        },
        '4' => {
          'name' => 'package',
          'offset' => '36',
          'type' => '8362'
        },
        '5' => {
          'name' => 'areas',
          'offset' => '64',
          'type' => '8362'
        },
        '6' => {
          'name' => 'iter',
          'offset' => '86',
          'type' => '83481'
        }
      },
      'Name' => 'struct pldm_package',
      'Size' => '80',
      'Type' => 'Struct'
    },
    '84190' => {
      'BaseType' => '83424',
      'Name' => 'struct pldm_package_format_pin const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '84195' => {
      'BaseType' => '83636',
      'Name' => 'pldm_package_header_information_pad const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '91075' => {
      'BaseType' => '84079',
      'Name' => 'struct pldm_package*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '91080' => {
      'BaseType' => '83938',
      'Name' => 'struct pldm_package_component_image_information*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '99169' => {
      'BaseType' => '83797',
      'Name' => 'struct pldm_package_downstream_device_id_record*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '100822' => {
      'BaseType' => '83670',
      'Name' => 'struct pldm_package_firmware_device_id_record*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '102574' => {
      'BaseType' => '83623',
      'Name' => 'pldm_package_header_information_pad*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '104650' => {
      'BaseType' => '76047',
      'Name' => 'bool8_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '104655' => {
      'BaseType' => '77783',
      'Name' => 'bitfield64_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '108716' => {
      'BaseType' => '76831',
      'Name' => 'bitfield32_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '113828' => {
      'BaseType' => '59364',
      'Name' => 'bitfield16_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '126537' => {
      'BaseType' => '77924',
      'Name' => 'struct variable_field const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '153410' => {
      'BaseType' => '83264',
      'Name' => 'struct pldm_downstream_device_parameters_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '153415' => {
      'BaseType' => '81696',
      'Name' => 'struct pldm_downstream_device_parameters_entry*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '156879' => {
      'BaseType' => '81611',
      'Name' => 'struct pldm_get_downstream_firmware_parameters_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '158328' => {
      'BaseType' => '81606',
      'Name' => 'struct pldm_get_downstream_firmware_parameters_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '159894' => {
      'BaseType' => '81399',
      'Name' => 'struct pldm_downstream_device_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '159899' => {
      'BaseType' => '81356',
      'Name' => 'struct pldm_downstream_device*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '163360' => {
      'BaseType' => '81271',
      'Name' => 'struct pldm_query_downstream_identifiers_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '164809' => {
      'BaseType' => '81266',
      'Name' => 'struct pldm_query_downstream_identifiers_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '168182' => {
      'BaseType' => '80823',
      'Name' => 'struct pldm_query_downstream_devices_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '168629' => {
      'BaseType' => '80908',
      'Name' => 'struct pldm_component_parameter_entry*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '178973' => {
      'BaseType' => '80620',
      'Name' => 'struct pldm_get_firmware_parameters_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '182599' => {
      'BaseType' => '2309',
      'Name' => 'uint8_t**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '182941' => {
      'BaseType' => '80422',
      'Name' => 'struct pldm_component_image_information*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '185919' => {
      'BaseType' => '81515',
      'Name' => 'struct pldm_descriptor_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '185924' => {
      'BaseType' => '81442',
      'Name' => 'struct pldm_descriptor*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '186308' => {
      'BaseType' => '80209',
      'Name' => 'struct pldm_firmware_device_id_record*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '195071' => {
      'BaseType' => '852',
      'Name' => 'void**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '195572' => {
      'BaseType' => '80080',
      'Name' => 'struct pldm_package_header_information*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '212886' => {
      'BaseType' => '212903',
      'Header' => 'pdr.h',
      'Line' => '16',
      'Name' => 'pldm_pdr',
      'PrivateABI' => 1,
      'Size' => '24',
      'Type' => 'Typedef'
    },
    '212898' => {
      'BaseType' => '212886',
      'Name' => 'pldm_pdr const',
      'Size' => '24',
      'Type' => 'Const'
    },
    '212903' => {
      'Line' => '31',
      'Memb' => {
        '0' => {
          'name' => 'record_count',
          'offset' => '0',
          'type' => '174'
        },
        '1' => {
          'name' => 'size',
          'offset' => '4',
          'type' => '174'
        },
        '2' => {
          'name' => 'first',
          'offset' => '8',
          'type' => '214367'
        },
        '3' => {
          'name' => 'last',
          'offset' => '22',
          'type' => '214367'
        }
      },
      'Name' => 'struct pldm_pdr',
      'PrivateABI' => 1,
      'Size' => '24',
      'Source' => 'pdr.c',
      'Type' => 'Struct'
    },
    '212969' => {
      'BaseType' => '212986',
      'Header' => 'pdr.h',
      'Line' => '21',
      'Name' => 'pldm_pdr_record',
      'PrivateABI' => 1,
      'Size' => '32',
      'Type' => 'Typedef'
    },
    '212981' => {
      'BaseType' => '212969',
      'Name' => 'pldm_pdr_record const',
      'Size' => '32',
      'Type' => 'Const'
    },
    '212986' => {
      'Line' => '22',
      'Memb' => {
        '0' => {
          'name' => 'record_handle',
          'offset' => '0',
          'type' => '174'
        },
        '1' => {
          'name' => 'size',
          'offset' => '4',
          'type' => '174'
        },
        '2' => {
          'name' => 'data',
          'offset' => '8',
          'type' => '2309'
        },
        '3' => {
          'name' => 'next',
          'offset' => '22',
          'type' => '214355'
        },
        '4' => {
          'name' => 'is_remote',
          'offset' => '36',
          'type' => '6996'
        },
        '5' => {
          'name' => 'terminus_handle',
          'offset' => '38',
          'type' => '162'
        }
      },
      'Name' => 'struct pldm_pdr_record',
      'PrivateABI' => 1,
      'Size' => '32',
      'Source' => 'pdr.c',
      'Type' => 'Struct'
    },
    '213078' => {
      'Header' => 'pdr.h',
      'Line' => '327',
      'Memb' => {
        '0' => {
          'name' => 'entity_type',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'entity_instance_num',
          'offset' => '2',
          'type' => '162'
        },
        '2' => {
          'name' => 'entity_container_id',
          'offset' => '4',
          'type' => '162'
        }
      },
      'Name' => 'struct pldm_entity',
      'Size' => '6',
      'Type' => 'Struct'
    },
    '213140' => {
      'BaseType' => '213078',
      'Header' => 'pdr.h',
      'Line' => '331',
      'Name' => 'pldm_entity',
      'Size' => '6',
      'Type' => 'Typedef'
    },
    '213152' => {
      'BaseType' => '213140',
      'Name' => 'pldm_entity const',
      'Size' => '6',
      'Type' => 'Const'
    },
    '213186' => {
      'BaseType' => '213198',
      'Header' => 'pdr.h',
      'Line' => '341',
      'Name' => 'pldm_entity_association_tree',
      'PrivateABI' => 1,
      'Size' => '16',
      'Type' => 'Typedef'
    },
    '213198' => {
      'Line' => '648',
      'Memb' => {
        '0' => {
          'name' => 'root',
          'offset' => '0',
          'type' => '214372'
        },
        '1' => {
          'name' => 'last_used_container_id',
          'offset' => '8',
          'type' => '162'
        }
      },
      'Name' => 'struct pldm_entity_association_tree',
      'PrivateABI' => 1,
      'Size' => '16',
      'Source' => 'pdr.c',
      'Type' => 'Struct'
    },
    '213241' => {
      'BaseType' => '213258',
      'Header' => 'pdr.h',
      'Line' => '346',
      'Name' => 'pldm_entity_node',
      'PrivateABI' => 1,
      'Size' => '40',
      'Type' => 'Typedef'
    },
    '213253' => {
      'BaseType' => '213241',
      'Name' => 'pldm_entity_node const',
      'Size' => '40',
      'Type' => 'Const'
    },
    '213258' => {
      'Line' => '653',
      'Memb' => {
        '0' => {
          'name' => 'entity',
          'offset' => '0',
          'type' => '213140'
        },
        '1' => {
          'name' => 'parent',
          'offset' => '6',
          'type' => '213140'
        },
        '2' => {
          'name' => 'remote_container_id',
          'offset' => '18',
          'type' => '162'
        },
        '3' => {
          'name' => 'first_child',
          'offset' => '22',
          'type' => '214372'
        },
        '4' => {
          'name' => 'next_sibling',
          'offset' => '36',
          'type' => '214372'
        },
        '5' => {
          'name' => 'association_type',
          'offset' => '50',
          'type' => '150'
        }
      },
      'Name' => 'struct pldm_entity_node',
      'PrivateABI' => 1,
      'Size' => '40',
      'Source' => 'pdr.c',
      'Type' => 'Struct'
    },
    '213573' => {
      'Header' => 'platform.h',
      'Line' => '576',
      'Memb' => {
        '0' => {
          'name' => 'record_handle',
          'offset' => '0',
          'type' => '174'
        },
        '1' => {
          'name' => 'version',
          'offset' => '4',
          'type' => '150'
        },
        '2' => {
          'name' => 'type',
          'offset' => '5',
          'type' => '150'
        },
        '3' => {
          'name' => 'record_change_num',
          'offset' => '6',
          'type' => '162'
        },
        '4' => {
          'name' => 'length',
          'offset' => '8',
          'type' => '162'
        }
      },
      'Name' => 'struct pldm_pdr_hdr',
      'Size' => '10',
      'Type' => 'Struct'
    },
    '214022' => {
      'Header' => 'platform.h',
      'Line' => '651',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '213573'
        },
        '1' => {
          'name' => 'terminus_handle',
          'offset' => '16',
          'type' => '162'
        },
        '2' => {
          'name' => 'sensor_id',
          'offset' => '18',
          'type' => '162'
        },
        '3' => {
          'name' => 'entity_type',
          'offset' => '20',
          'type' => '162'
        },
        '4' => {
          'name' => 'entity_instance',
          'offset' => '22',
          'type' => '162'
        },
        '5' => {
          'name' => 'container_id',
          'offset' => '24',
          'type' => '162'
        },
        '6' => {
          'name' => 'sensor_init',
          'offset' => '32',
          'type' => '150'
        },
        '7' => {
          'name' => 'sensor_auxiliary_names_pdr',
          'offset' => '33',
          'type' => '76047'
        },
        '8' => {
          'name' => 'composite_sensor_count',
          'offset' => '34',
          'type' => '150'
        },
        '9' => {
          'name' => 'possible_states',
          'offset' => '35',
          'type' => '1781'
        }
      },
      'Name' => 'struct pldm_state_sensor_pdr',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '214176' => {
      'Header' => 'platform.h',
      'Line' => '678',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '213573'
        },
        '1' => {
          'name' => 'terminus_handle',
          'offset' => '16',
          'type' => '162'
        },
        '2' => {
          'name' => 'effecter_id',
          'offset' => '18',
          'type' => '162'
        },
        '3' => {
          'name' => 'entity_type',
          'offset' => '20',
          'type' => '162'
        },
        '4' => {
          'name' => 'entity_instance',
          'offset' => '22',
          'type' => '162'
        },
        '5' => {
          'name' => 'container_id',
          'offset' => '24',
          'type' => '162'
        },
        '6' => {
          'name' => 'effecter_semantic_id',
          'offset' => '32',
          'type' => '162'
        },
        '7' => {
          'name' => 'effecter_init',
          'offset' => '34',
          'type' => '150'
        },
        '8' => {
          'name' => 'has_description_pdr',
          'offset' => '35',
          'type' => '76047'
        },
        '9' => {
          'name' => 'composite_effecter_count',
          'offset' => '36',
          'type' => '150'
        },
        '10' => {
          'name' => 'possible_states',
          'offset' => '37',
          'type' => '1781'
        }
      },
      'Name' => 'struct pldm_state_effecter_pdr',
      'Size' => '26',
      'Type' => 'Struct'
    },
    '214355' => {
      'BaseType' => '212986',
      'Name' => 'struct pldm_pdr_record*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '214367' => {
      'BaseType' => '212969',
      'Name' => 'pldm_pdr_record*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '214372' => {
      'BaseType' => '213241',
      'Name' => 'pldm_entity_node*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '214739' => {
      'BaseType' => '213186',
      'Name' => 'pldm_entity_association_tree*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '214744' => {
      'BaseType' => '213152',
      'Name' => 'pldm_entity const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '216228' => {
      'BaseType' => '212886',
      'Name' => 'pldm_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '217883' => {
      'BaseType' => '212981',
      'Name' => 'pldm_pdr_record const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '226602' => {
      'BaseType' => '213140',
      'Name' => 'pldm_entity*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '246479' => {
      'BaseType' => '226602',
      'Name' => 'pldm_entity**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '247126' => {
      'BaseType' => '214372',
      'Name' => 'pldm_entity_node**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '247915' => {
      'BaseType' => '212898',
      'Name' => 'pldm_pdr const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '253388' => {
      'BaseType' => '213253',
      'Name' => 'pldm_entity_node const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '260233' => {
      'BaseType' => '214176',
      'Name' => 'struct pldm_state_effecter_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '265924' => {
      'BaseType' => '214022',
      'Name' => 'struct pldm_state_sensor_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '271144' => {
      'BaseType' => '79',
      'Header' => 'types.h',
      'Line' => '37',
      'Name' => '__int8_t',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '271175' => {
      'BaseType' => '98',
      'Header' => 'types.h',
      'Line' => '39',
      'Name' => '__int16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '271206' => {
      'BaseType' => '117',
      'Header' => 'types.h',
      'Line' => '41',
      'Name' => '__int32_t',
      'PrivateABI' => 1,
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '271244' => {
      'BaseType' => '105',
      'Header' => 'types.h',
      'Line' => '55',
      'Name' => '__uint_least16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '271297' => {
      'BaseType' => '271144',
      'Header' => 'stdint-intn.h',
      'Line' => '24',
      'Name' => 'int8_t',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '271309' => {
      'BaseType' => '271175',
      'Header' => 'stdint-intn.h',
      'Line' => '25',
      'Name' => 'int16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '271321' => {
      'BaseType' => '271206',
      'Header' => 'stdint-intn.h',
      'Line' => '26',
      'Name' => 'int32_t',
      'PrivateABI' => 1,
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '271946' => {
      'BaseType' => '1167',
      'Header' => 'pldm_types.h',
      'Line' => '168',
      'Name' => 'real32_t',
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '272749' => {
      'BaseType' => '271244',
      'Header' => 'uchar.h',
      'Line' => '51',
      'Name' => 'char16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '273666' => {
      'Header' => 'platform.h',
      'Line' => '345',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_SENSOR_OP_STATE',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_STATE_SENSOR_STATE',
          'value' => '1'
        },
        '2' => {
          'name' => 'PLDM_NUMERIC_SENSOR_STATE',
          'value' => '2'
        }
      },
      'Name' => 'enum sensor_event_class_states',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '273700' => {
      'BaseType' => '273666',
      'Name' => 'enum sensor_event_class_states const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '274196' => {
      'Header' => 'platform.h',
      'Line' => '668',
      'Memb' => {
        '0' => {
          'name' => 'state_set_id',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'possible_states_size',
          'offset' => '2',
          'type' => '150'
        },
        '2' => {
          'name' => 'states',
          'offset' => '3',
          'type' => '274258'
        }
      },
      'Name' => 'struct state_sensor_possible_states',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '274253' => {
      'BaseType' => '274196',
      'Name' => 'struct state_sensor_possible_states const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '274258' => {
      'BaseType' => '1067',
      'Name' => 'bitfield8_t[1]',
      'Size' => '1',
      'Type' => 'Array'
    },
    '274631' => {
      'Header' => 'platform.h',
      'Line' => '769',
      'Memb' => {
        '0' => {
          'name' => 'value_u8',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'value_s8',
          'offset' => '0',
          'type' => '271297'
        },
        '2' => {
          'name' => 'value_u16',
          'offset' => '0',
          'type' => '162'
        },
        '3' => {
          'name' => 'value_s16',
          'offset' => '0',
          'type' => '271309'
        },
        '4' => {
          'name' => 'value_u32',
          'offset' => '0',
          'type' => '174'
        },
        '5' => {
          'name' => 'value_s32',
          'offset' => '0',
          'type' => '271321'
        },
        '6' => {
          'name' => 'value_f32',
          'offset' => '0',
          'type' => '271946'
        }
      },
      'Name' => 'union union_range_field_format',
      'Size' => '4',
      'Type' => 'Union'
    },
    '275230' => {
      'Header' => 'platform.h',
      'Line' => '826',
      'Memb' => {
        '0' => {
          'name' => 'value_u8',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'value_s8',
          'offset' => '0',
          'type' => '271297'
        },
        '2' => {
          'name' => 'value_u16',
          'offset' => '0',
          'type' => '162'
        },
        '3' => {
          'name' => 'value_s16',
          'offset' => '0',
          'type' => '271309'
        },
        '4' => {
          'name' => 'value_u32',
          'offset' => '0',
          'type' => '174'
        },
        '5' => {
          'name' => 'value_s32',
          'offset' => '0',
          'type' => '271321'
        }
      },
      'Name' => 'union union_sensor_data_size',
      'Size' => '4',
      'Type' => 'Union'
    },
    '275243' => {
      'Header' => 'platform.h',
      'Line' => '833',
      'Memb' => {
        '0' => {
          'name' => 'record_handle',
          'offset' => '0',
          'type' => '174'
        },
        '1' => {
          'name' => 'version',
          'offset' => '4',
          'type' => '150'
        },
        '2' => {
          'name' => 'type',
          'offset' => '5',
          'type' => '150'
        },
        '3' => {
          'name' => 'record_change_num',
          'offset' => '6',
          'type' => '162'
        },
        '4' => {
          'name' => 'length',
          'offset' => '8',
          'type' => '162'
        }
      },
      'Name' => 'struct pldm_value_pdr_hdr',
      'Size' => '12',
      'Type' => 'Struct'
    },
    '275328' => {
      'Header' => 'platform.h',
      'Line' => '851',
      'Memb' => {
        '0' => {
          'name' => 'entity_instance_num',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'entity_instance',
          'offset' => '0',
          'type' => '162'
        }
      },
      'Name' => 'anon-union-platform.h-851',
      'Size' => '2',
      'Type' => 'Union'
    },
    '275363' => {
      'Header' => 'platform.h',
      'Line' => '846',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '275243'
        },
        '1' => {
          'name' => 'terminus_handle',
          'offset' => '18',
          'type' => '162'
        },
        '2' => {
          'name' => 'sensor_id',
          'offset' => '20',
          'type' => '162'
        },
        '3' => {
          'name' => 'entity_type',
          'offset' => '22',
          'type' => '162'
        },
        '4' => {
          'name' => 'unnamed0',
          'offset' => '24',
          'type' => '275328'
        },
        '5' => {
          'name' => 'container_id',
          'offset' => '32',
          'type' => '162'
        },
        '6' => {
          'name' => 'sensor_init',
          'offset' => '34',
          'type' => '150'
        },
        '7' => {
          'name' => 'sensor_auxiliary_names_pdr',
          'offset' => '35',
          'type' => '76047'
        },
        '8' => {
          'name' => 'base_unit',
          'offset' => '36',
          'type' => '150'
        },
        '9' => {
          'name' => 'unit_modifier',
          'offset' => '37',
          'type' => '271297'
        },
        '10' => {
          'name' => 'rate_unit',
          'offset' => '38',
          'type' => '150'
        },
        '11' => {
          'name' => 'base_oem_unit_handle',
          'offset' => '39',
          'type' => '150'
        },
        '12' => {
          'name' => 'aux_unit',
          'offset' => '40',
          'type' => '150'
        },
        '13' => {
          'name' => 'aux_unit_modifier',
          'offset' => '41',
          'type' => '271297'
        },
        '14' => {
          'name' => 'aux_rate_unit',
          'offset' => '48',
          'type' => '150'
        },
        '15' => {
          'name' => 'rel',
          'offset' => '49',
          'type' => '150'
        },
        '16' => {
          'name' => 'aux_oem_unit_handle',
          'offset' => '50',
          'type' => '150'
        },
        '17' => {
          'name' => 'is_linear',
          'offset' => '51',
          'type' => '76047'
        },
        '18' => {
          'name' => 'sensor_data_size',
          'offset' => '52',
          'type' => '150'
        },
        '19' => {
          'name' => 'resolution',
          'offset' => '54',
          'type' => '271946'
        },
        '20' => {
          'name' => 'offset',
          'offset' => '64',
          'type' => '271946'
        },
        '21' => {
          'name' => 'accuracy',
          'offset' => '68',
          'type' => '162'
        },
        '22' => {
          'name' => 'plus_tolerance',
          'offset' => '70',
          'type' => '150'
        },
        '23' => {
          'name' => 'minus_tolerance',
          'offset' => '71',
          'type' => '150'
        },
        '24' => {
          'name' => 'hysteresis',
          'offset' => '72',
          'type' => '275230'
        },
        '25' => {
          'name' => 'supported_thresholds',
          'offset' => '82',
          'type' => '1067'
        },
        '26' => {
          'name' => 'threshold_and_hysteresis_volatility',
          'offset' => '83',
          'type' => '1067'
        },
        '27' => {
          'name' => 'state_transition_interval',
          'offset' => '86',
          'type' => '271946'
        },
        '28' => {
          'name' => 'update_interval',
          'offset' => '96',
          'type' => '271946'
        },
        '29' => {
          'name' => 'max_readable',
          'offset' => '100',
          'type' => '275230'
        },
        '30' => {
          'name' => 'min_readable',
          'offset' => '104',
          'type' => '275230'
        },
        '31' => {
          'name' => 'range_field_format',
          'offset' => '114',
          'type' => '150'
        },
        '32' => {
          'name' => 'range_field_support',
          'offset' => '115',
          'type' => '1067'
        },
        '33' => {
          'name' => 'nominal_value',
          'offset' => '118',
          'type' => '274631'
        },
        '34' => {
          'name' => 'normal_max',
          'offset' => '128',
          'type' => '274631'
        },
        '35' => {
          'name' => 'normal_min',
          'offset' => '132',
          'type' => '274631'
        },
        '36' => {
          'name' => 'warning_high',
          'offset' => '136',
          'type' => '274631'
        },
        '37' => {
          'name' => 'warning_low',
          'offset' => '146',
          'type' => '274631'
        },
        '38' => {
          'name' => 'critical_high',
          'offset' => '150',
          'type' => '274631'
        },
        '39' => {
          'name' => 'critical_low',
          'offset' => '256',
          'type' => '274631'
        },
        '40' => {
          'name' => 'fatal_high',
          'offset' => '260',
          'type' => '274631'
        },
        '41' => {
          'name' => 'fatal_low',
          'offset' => '264',
          'type' => '274631'
        }
      },
      'Name' => 'struct pldm_numeric_sensor_value_pdr',
      'Size' => '112',
      'Type' => 'Struct'
    },
    '275956' => {
      'BaseType' => '272749',
      'Header' => 'platform.h',
      'Line' => '894',
      'Name' => 'pldm_utf16be',
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '275969' => {
      'Header' => 'platform.h',
      'Line' => '896',
      'Memb' => {
        '0' => {
          'name' => 'tag',
          'offset' => '0',
          'type' => '7161'
        },
        '1' => {
          'name' => 'name',
          'offset' => '8',
          'type' => '276011'
        }
      },
      'Name' => 'struct pldm_entity_auxiliary_name',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '276011' => {
      'BaseType' => '275956',
      'Name' => 'pldm_utf16be*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '276016' => {
      'Header' => 'platform.h',
      'Line' => '906',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '275243'
        },
        '1' => {
          'name' => 'container',
          'offset' => '18',
          'type' => '213140'
        },
        '2' => {
          'name' => 'shared_name_count',
          'offset' => '24',
          'type' => '150'
        },
        '3' => {
          'name' => 'name_string_count',
          'offset' => '25',
          'type' => '150'
        },
        '4' => {
          'name' => 'names',
          'offset' => '36',
          'type' => '276130'
        },
        '5' => {
          'name' => 'auxiliary_name_data_size',
          'offset' => '50',
          'type' => '883'
        },
        '6' => {
          'name' => 'auxiliary_name_data',
          'offset' => '64',
          'type' => '276135'
        }
      },
      'Name' => 'struct pldm_entity_auxiliary_names_pdr',
      'Size' => '40',
      'Type' => 'Struct'
    },
    '276130' => {
      'BaseType' => '275969',
      'Name' => 'struct pldm_entity_auxiliary_name*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '276135' => {
      'BaseType' => '143',
      'Name' => 'char[]',
      'Size' => '8',
      'Type' => 'Array'
    },
    '276150' => {
      'Header' => 'platform.h',
      'Line' => '936',
      'Memb' => {
        '0' => {
          'name' => 'state_set_id',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'possible_states_size',
          'offset' => '2',
          'type' => '150'
        },
        '2' => {
          'name' => 'states',
          'offset' => '3',
          'type' => '274258'
        }
      },
      'Name' => 'struct state_effecter_possible_states',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '276207' => {
      'BaseType' => '276150',
      'Name' => 'struct state_effecter_possible_states const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '276212' => {
      'Header' => 'platform.h',
      'Line' => '960',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '275243'
        },
        '1' => {
          'name' => 'terminus_handle',
          'offset' => '18',
          'type' => '162'
        },
        '2' => {
          'name' => 'file_identifier',
          'offset' => '20',
          'type' => '162'
        },
        '3' => {
          'name' => 'container',
          'offset' => '22',
          'type' => '213140'
        },
        '4' => {
          'name' => 'superior_directory_file_identifier',
          'offset' => '34',
          'type' => '162'
        },
        '5' => {
          'name' => 'file_classification',
          'offset' => '36',
          'type' => '150'
        },
        '6' => {
          'name' => 'oem_file_classification',
          'offset' => '37',
          'type' => '150'
        },
        '7' => {
          'name' => 'file_capabilities',
          'offset' => '38',
          'type' => '59364'
        },
        '8' => {
          'name' => 'file_version',
          'offset' => '40',
          'type' => '1150'
        },
        '9' => {
          'name' => 'file_maximum_size',
          'offset' => '50',
          'type' => '174'
        },
        '10' => {
          'name' => 'file_maximum_file_descriptor_count',
          'offset' => '54',
          'type' => '150'
        },
        '11' => {
          'name' => 'file_name',
          'offset' => '64',
          'type' => '8362'
        },
        '12' => {
          'name' => 'oem_file_classification_name',
          'offset' => '86',
          'type' => '8362'
        }
      },
      'Name' => 'struct pldm_platform_file_descriptor_pdr',
      'Size' => '72',
      'Type' => 'Struct'
    },
    '276413' => {
      'Header' => 'platform.h',
      'Line' => '1006',
      'Memb' => {
        '0' => {
          'name' => 'set_request',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'effecter_state',
          'offset' => '1',
          'type' => '150'
        }
      },
      'Name' => 'struct state_field_for_state_effecter_set',
      'Size' => '2',
      'Type' => 'Struct'
    },
    '276456' => {
      'BaseType' => '276413',
      'Header' => 'platform.h',
      'Line' => '1009',
      'Name' => 'set_effecter_state_field',
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '276469' => {
      'Header' => 'platform.h',
      'Line' => '1015',
      'Memb' => {
        '0' => {
          'name' => 'sensor_op_state',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'present_state',
          'offset' => '1',
          'type' => '150'
        },
        '2' => {
          'name' => 'previous_state',
          'offset' => '2',
          'type' => '150'
        },
        '3' => {
          'name' => 'event_state',
          'offset' => '3',
          'type' => '150'
        }
      },
      'Name' => 'struct state_field_for_get_state_sensor_readings',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '276540' => {
      'BaseType' => '276469',
      'Header' => 'platform.h',
      'Line' => '1023',
      'Name' => 'get_sensor_state_field',
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '276553' => {
      'Header' => 'platform.h',
      'Line' => '1029',
      'Memb' => {
        '0' => {
          'name' => 'effecter_op_state',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'pending_state',
          'offset' => '1',
          'type' => '150'
        },
        '2' => {
          'name' => 'present_state',
          'offset' => '2',
          'type' => '150'
        }
      },
      'Name' => 'struct state_field_for_get_state_effecter_states',
      'Size' => '3',
      'Type' => 'Struct'
    },
    '276610' => {
      'BaseType' => '276553',
      'Header' => 'platform.h',
      'Line' => '1033',
      'Name' => 'get_effecter_state_field',
      'Size' => '3',
      'Type' => 'Typedef'
    },
    '277094' => {
      'Header' => 'platform.h',
      'Line' => '1106',
      'Memb' => {
        '0' => {
          'name' => 'mctp_eid',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'vendor_specific',
          'offset' => '0',
          'type' => '8362'
        }
      },
      'Name' => 'anon-union-platform.h-1106',
      'Size' => '16',
      'Type' => 'Union'
    },
    '277128' => {
      'Header' => 'platform.h',
      'Line' => '1103',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'transport_protocol_type',
          'offset' => '1',
          'type' => '150'
        },
        '2' => {
          'name' => 'event_receiver_address',
          'offset' => '8',
          'type' => '277094'
        }
      },
      'Name' => 'struct pldm_get_event_receiver_resp',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '277430' => {
      'Header' => 'platform.h',
      'Line' => '1191',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'comp_effecter_count',
          'offset' => '1',
          'type' => '150'
        },
        '2' => {
          'name' => 'field',
          'offset' => '2',
          'type' => '277487'
        }
      },
      'Name' => 'struct pldm_get_state_effecter_states_resp',
      'Size' => '26',
      'Type' => 'Struct'
    },
    '277487' => {
      'BaseType' => '276610',
      'Name' => 'get_effecter_state_field[8]',
      'Size' => '24',
      'Type' => 'Array'
    },
    '277503' => {
      'Header' => 'platform.h',
      'Line' => '1201',
      'Memb' => {
        '0' => {
          'name' => 'sensor_id',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'sensor_event_class_type',
          'offset' => '2',
          'type' => '150'
        },
        '2' => {
          'name' => 'event_class',
          'offset' => '3',
          'type' => '1781'
        }
      },
      'Name' => 'struct pldm_sensor_event_data',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '277617' => {
      'Header' => 'platform.h',
      'Line' => '1241',
      'Memb' => {
        '0' => {
          'name' => 'format_version',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'event_id',
          'offset' => '2',
          'type' => '162'
        },
        '2' => {
          'name' => 'data_transfer_handle',
          'offset' => '4',
          'type' => '174'
        }
      },
      'Name' => 'struct pldm_message_poll_event',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '277679' => {
      'Header' => 'platform.h',
      'Line' => '1251',
      'Memb' => {
        '0' => {
          'name' => 'format_version',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'format_type',
          'offset' => '1',
          'type' => '150'
        },
        '2' => {
          'name' => 'event_data_length',
          'offset' => '2',
          'type' => '162'
        },
        '3' => {
          'name' => 'event_data',
          'offset' => '4',
          'type' => '277750'
        }
      },
      'Name' => 'struct pldm_platform_cper_event',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '277750' => {
      'BaseType' => '150',
      'Name' => 'uint8_t[]',
      'Size' => '8',
      'Type' => 'Array'
    },
    '277906' => {
      'Header' => 'platform.h',
      'Line' => '1311',
      'Memb' => {
        '0' => {
          'name' => 'event_data_format',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'number_of_change_records',
          'offset' => '1',
          'type' => '150'
        },
        '2' => {
          'name' => 'change_records',
          'offset' => '2',
          'type' => '1781'
        }
      },
      'Name' => 'struct pldm_pdr_repository_chg_event_data',
      'Size' => '3',
      'Type' => 'Struct'
    },
    '286304' => {
      'BaseType' => '3484',
      'Name' => 'size_t*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '295308' => {
      'BaseType' => '276212',
      'Name' => 'struct pldm_platform_file_descriptor_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '295367' => {
      'BaseType' => '277679',
      'Name' => 'struct pldm_platform_cper_event*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '299787' => {
      'BaseType' => '276016',
      'Name' => 'struct pldm_entity_auxiliary_names_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '311693' => {
      'BaseType' => '277430',
      'Name' => 'struct pldm_get_state_effecter_states_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '358405' => {
      'BaseType' => '277128',
      'Name' => 'struct pldm_get_event_receiver_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '377766' => {
      'BaseType' => '277617',
      'Name' => 'struct pldm_message_poll_event*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '379451' => {
      'BaseType' => '379461',
      'Name' => 'uint32_t const*const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '379456' => {
      'BaseType' => '878',
      'Name' => 'uint32_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '379461' => {
      'BaseType' => '379456',
      'Name' => 'uint32_t const*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '379466' => {
      'BaseType' => '277906',
      'Name' => 'struct pldm_pdr_repository_chg_event_data*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '429882' => {
      'BaseType' => '275363',
      'Name' => 'struct pldm_numeric_sensor_value_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '457621' => {
      'BaseType' => '277503',
      'Name' => 'struct pldm_sensor_event_data*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '457626' => {
      'BaseType' => '457621',
      'Name' => 'struct pldm_sensor_event_data*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '462654' => {
      'BaseType' => '276540',
      'Name' => 'get_sensor_state_field*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '490638' => {
      'BaseType' => '276456',
      'Name' => 'set_effecter_state_field*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '491619' => {
      'BaseType' => '265924',
      'Name' => 'struct pldm_state_sensor_pdr*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '491624' => {
      'BaseType' => '274253',
      'Name' => 'struct state_sensor_possible_states const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '491629' => {
      'BaseType' => '491624',
      'Name' => 'struct state_sensor_possible_states const*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '492029' => {
      'BaseType' => '260233',
      'Name' => 'struct pldm_state_effecter_pdr*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '492034' => {
      'BaseType' => '276207',
      'Name' => 'struct state_effecter_possible_states const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '492039' => {
      'BaseType' => '492034',
      'Name' => 'struct state_effecter_possible_states const*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '496428' => {
      'Line' => '19',
      'Memb' => {
        '0' => {
          'name' => 'prev',
          'offset' => '0',
          'type' => '6378'
        },
        '1' => {
          'name' => 'allocations',
          'offset' => '4',
          'type' => '174'
        }
      },
      'Name' => 'struct pldm_tid_state',
      'PrivateABI' => 1,
      'Size' => '8',
      'Source' => 'instance-id.c',
      'Type' => 'Struct'
    },
    '496467' => {
      'Line' => '24',
      'Memb' => {
        '0' => {
          'name' => 'state',
          'offset' => '0',
          'type' => '496509'
        },
        '1' => {
          'name' => 'lock_db_fd',
          'offset' => '8264',
          'type' => '117'
        }
      },
      'Name' => 'struct pldm_instance_db',
      'PrivateABI' => 1,
      'Size' => '2052',
      'Source' => 'instance-id.c',
      'Type' => 'Struct'
    },
    '496509' => {
      'BaseType' => '496428',
      'Name' => 'struct pldm_tid_state[256]',
      'Size' => '2048',
      'Type' => 'Array'
    },
    '497065' => {
      'BaseType' => '496467',
      'Name' => 'struct pldm_instance_db*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '497452' => {
      'BaseType' => '6378',
      'Name' => 'pldm_instance_id_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '497628' => {
      'BaseType' => '497065',
      'Name' => 'struct pldm_instance_db**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '498341' => {
      'BaseType' => '51',
      'Header' => 'int-ll64.h',
      'Line' => '21',
      'Name' => '__u8',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '498353' => {
      'BaseType' => '58',
      'Header' => 'int-ll64.h',
      'Line' => '24',
      'Name' => '__u16',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '498590' => {
      'Header' => 'socket.h',
      'Line' => '5',
      'Memb' => {
        '0' => {
          'name' => 'size',
          'offset' => '0',
          'type' => '117'
        },
        '1' => {
          'name' => 'socket',
          'offset' => '4',
          'type' => '117'
        },
        '2' => {
          'name' => 'max_size',
          'offset' => '8',
          'type' => '117'
        }
      },
      'Name' => 'struct pldm_socket_sndbuf',
      'PrivateABI' => 1,
      'Size' => '12',
      'Type' => 'Struct'
    },
    '498643' => {
      'BaseType' => '150',
      'Header' => 'pldm.h',
      'Line' => '13',
      'Name' => 'mctp_eid_t',
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '498757' => {
      'BaseType' => '6475',
      'Header' => 'pldm.h',
      'Line' => '30',
      'Name' => 'pldm_requester_rc_t',
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '498769' => {
      'Header' => 'transport.h',
      'Line' => '18',
      'Memb' => {
        '0' => {
          'name' => 'name',
          'offset' => '0',
          'type' => '9739'
        },
        '1' => {
          'name' => 'version',
          'offset' => '8',
          'type' => '150'
        },
        '2' => {
          'name' => 'recv',
          'offset' => '22',
          'type' => '498903'
        },
        '3' => {
          'name' => 'send',
          'offset' => '36',
          'type' => '498944'
        },
        '4' => {
          'name' => 'init_pollfd',
          'offset' => '50',
          'type' => '499025'
        }
      },
      'Name' => 'struct pldm_transport',
      'PrivateABI' => 1,
      'Size' => '40',
      'Type' => 'Struct'
    },
    '498883' => {
      'BaseType' => '498769',
      'Name' => 'struct pldm_transport*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '498888' => {
      'BaseType' => '6366',
      'Name' => 'pldm_tid_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '498903' => {
      'Name' => 'pldm_requester_rc_t(*)(struct pldm_transport*, pldm_tid_t*, void**, size_t*)',
      'Param' => {
        '0' => {
          'type' => '498883'
        },
        '1' => {
          'type' => '498888'
        },
        '2' => {
          'type' => '195071'
        },
        '3' => {
          'type' => '3484'
        }
      },
      'Return' => '498757',
      'Size' => '8',
      'Type' => 'FuncPtr'
    },
    '498944' => {
      'Name' => 'pldm_requester_rc_t(*)(struct pldm_transport*, pldm_tid_t, void const*, size_t)',
      'Param' => {
        '0' => {
          'type' => '498883'
        },
        '1' => {
          'type' => '6366'
        },
        '2' => {
          'type' => '2044'
        },
        '3' => {
          'type' => '883'
        }
      },
      'Return' => '498757',
      'Size' => '8',
      'Type' => 'FuncPtr'
    },
    '498969' => {
      'BaseType' => '498974',
      'Name' => 'struct pollfd*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '498974' => {
      'Header' => 'poll.h',
      'Line' => '36',
      'Memb' => {
        '0' => {
          'name' => 'fd',
          'offset' => '0',
          'type' => '117'
        },
        '1' => {
          'name' => 'events',
          'offset' => '4',
          'type' => '98'
        },
        '2' => {
          'name' => 'revents',
          'offset' => '6',
          'type' => '98'
        }
      },
      'Name' => 'struct pollfd',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Struct'
    },
    '499025' => {
      'Name' => 'int(*)(struct pldm_transport*, struct pollfd*)',
      'Param' => {
        '0' => {
          'type' => '498883'
        },
        '1' => {
          'type' => '498969'
        }
      },
      'Return' => '117',
      'Size' => '8',
      'Type' => 'FuncPtr'
    },
    '499030' => {
      'BaseType' => '58',
      'Header' => 'socket.h',
      'Line' => '10',
      'Name' => '__kernel_sa_family_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '499405' => {
      'Header' => 'mctp.h',
      'Line' => '18',
      'Memb' => {
        '0' => {
          'name' => 's_addr',
          'offset' => '0',
          'type' => '498643'
        }
      },
      'Name' => 'struct mctp_addr',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Struct'
    },
    '499432' => {
      'Header' => 'mctp.h',
      'Line' => '22',
      'Memb' => {
        '0' => {
          'name' => 'smctp_family',
          'offset' => '0',
          'type' => '499030'
        },
        '1' => {
          'name' => '__smctp_pad0',
          'offset' => '2',
          'type' => '498353'
        },
        '2' => {
          'name' => 'smctp_network',
          'offset' => '4',
          'type' => '65'
        },
        '3' => {
          'name' => 'smctp_addr',
          'offset' => '8',
          'type' => '499405'
        },
        '4' => {
          'name' => 'smctp_type',
          'offset' => '9',
          'type' => '498341'
        },
        '5' => {
          'name' => 'smctp_tag',
          'offset' => '16',
          'type' => '498341'
        },
        '6' => {
          'name' => '__smctp_pad1',
          'offset' => '17',
          'type' => '498341'
        }
      },
      'Name' => 'struct sockaddr_mctp',
      'PrivateABI' => 1,
      'Size' => '12',
      'Type' => 'Struct'
    },
    '499537' => {
      'BaseType' => '499432',
      'Name' => 'struct sockaddr_mctp const',
      'Size' => '12',
      'Type' => 'Const'
    },
    '499581' => {
      'Line' => '35',
      'Memb' => {
        '0' => {
          'name' => 'transport',
          'offset' => '0',
          'type' => '498769'
        },
        '1' => {
          'name' => 'socket',
          'offset' => '64',
          'type' => '117'
        },
        '2' => {
          'name' => 'tid_eid_map',
          'offset' => '68',
          'type' => '499674'
        },
        '3' => {
          'name' => 'socket_send_buf',
          'offset' => '768',
          'type' => '498590'
        },
        '4' => {
          'name' => 'bound',
          'offset' => '786',
          'type' => '6996'
        },
        '5' => {
          'name' => 'cookie_jar',
          'offset' => '800',
          'type' => '6390'
        }
      },
      'Name' => 'struct pldm_transport_af_mctp',
      'PrivateABI' => 1,
      'Size' => '336',
      'Source' => 'af-mctp.c',
      'Type' => 'Struct'
    },
    '499674' => {
      'BaseType' => '6366',
      'Name' => 'pldm_tid_t[256]',
      'Size' => '256',
      'Type' => 'Array'
    },
    '500475' => {
      'BaseType' => '499581',
      'Name' => 'struct pldm_transport_af_mctp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '500480' => {
      'BaseType' => '499537',
      'Name' => 'struct sockaddr_mctp const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '500793' => {
      'BaseType' => '500475',
      'Name' => 'struct pldm_transport_af_mctp**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '503917' => {
      'Line' => '26',
      'Memb' => {
        '0' => {
          'name' => 'transport',
          'offset' => '0',
          'type' => '498769'
        },
        '1' => {
          'name' => 'socket',
          'offset' => '64',
          'type' => '117'
        },
        '2' => {
          'name' => 'tid_eid_map',
          'offset' => '68',
          'type' => '499674'
        },
        '3' => {
          'name' => 'socket_send_buf',
          'offset' => '768',
          'type' => '498590'
        }
      },
      'Name' => 'struct pldm_transport_mctp_demux',
      'PrivateABI' => 1,
      'Size' => '312',
      'Source' => 'mctp-demux.c',
      'Type' => 'Struct'
    },
    '504522' => {
      'BaseType' => '503917',
      'Name' => 'struct pldm_transport_mctp_demux*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '505028' => {
      'BaseType' => '504522',
      'Name' => 'struct pldm_transport_mctp_demux**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '527869' => {
      'Header' => 'file_io.h',
      'Line' => '32',
      'Memb' => {
        '0' => {
          'name' => 'handle',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'length',
          'offset' => '4',
          'type' => '174'
        },
        '2' => {
          'name' => 'data',
          'offset' => '8',
          'type' => '277750'
        }
      },
      'Name' => 'struct pldm_oem_meta_file_io_write_req',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '527936' => {
      'Header' => 'file_io.h',
      'Line' => '45',
      'Memb' => {
        '0' => {
          'name' => 'transferFlag',
          'offset' => '0',
          'type' => '150'
        },
        '1' => {
          'name' => 'offset',
          'offset' => '2',
          'type' => '162'
        }
      },
      'Name' => 'struct pldm_oem_meta_file_io_read_data_info',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '527975' => {
      'Header' => 'file_io.h',
      'Line' => '55',
      'Memb' => {
        '0' => {
          'name' => 'size',
          'offset' => '0',
          'type' => '162'
        },
        '1' => {
          'name' => 'crc32',
          'offset' => '4',
          'type' => '174'
        }
      },
      'Name' => 'struct pldm_oem_meta_file_io_read_attr_info',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '528014' => {
      'Header' => 'file_io.h',
      'Line' => '70',
      'Memb' => {
        '0' => {
          'name' => 'data',
          'offset' => '0',
          'type' => '527936'
        }
      },
      'Name' => 'anon-union-file_io.h-70',
      'Size' => '4',
      'Type' => 'Union'
    },
    '528032' => {
      'Header' => 'file_io.h',
      'Line' => '65',
      'Memb' => {
        '0' => {
          'name' => 'version',
          'offset' => '0',
          'type' => '883'
        },
        '1' => {
          'name' => 'handle',
          'offset' => '8',
          'type' => '150'
        },
        '2' => {
          'name' => 'option',
          'offset' => '9',
          'type' => '150'
        },
        '3' => {
          'name' => 'length',
          'offset' => '16',
          'type' => '150'
        },
        '4' => {
          'name' => 'info',
          'offset' => '18',
          'type' => '528014'
        }
      },
      'Name' => 'struct pldm_oem_meta_file_io_read_req',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '528110' => {
      'Header' => 'file_io.h',
      'Line' => '86',
      'Memb' => {
        '0' => {
          'name' => 'attr',
          'offset' => '0',
          'type' => '527975'
        },
        '1' => {
          'name' => 'data',
          'offset' => '0',
          'type' => '527936'
        }
      },
      'Name' => 'anon-union-file_io.h-86',
      'Size' => '8',
      'Type' => 'Union'
    },
    '528138' => {
      'Header' => 'file_io.h',
      'Line' => '80',
      'Memb' => {
        '0' => {
          'name' => 'version',
          'offset' => '0',
          'type' => '883'
        },
        '1' => {
          'name' => 'completion_code',
          'offset' => '8',
          'type' => '150'
        },
        '2' => {
          'name' => 'handle',
          'offset' => '9',
          'type' => '150'
        },
        '3' => {
          'name' => 'option',
          'offset' => '16',
          'type' => '150'
        },
        '4' => {
          'name' => 'length',
          'offset' => '17',
          'type' => '150'
        },
        '5' => {
          'name' => 'info',
          'offset' => '18',
          'type' => '528110'
        },
        '6' => {
          'name' => 'data',
          'offset' => '32',
          'type' => '277750'
        }
      },
      'Name' => 'struct pldm_oem_meta_file_io_read_resp',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '532970' => {
      'BaseType' => '528138',
      'Name' => 'struct pldm_oem_meta_file_io_read_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '535855' => {
      'BaseType' => '528032',
      'Name' => 'struct pldm_oem_meta_file_io_read_req*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '536294' => {
      'BaseType' => '527869',
      'Name' => 'struct pldm_oem_meta_file_io_write_req*',
      'Size' => '8',
      'Type' => 'Pointer'
    }
  },
  'UndefinedSymbols' => {
    'libpldm.so.0.14.0' => {
      '_ITM_deregisterTMCloneTable' => 0,
      '_ITM_registerTMCloneTable' => 0,
      '__assert_fail@GLIBC_2.2.5' => 0,
      '__cxa_finalize@GLIBC_2.2.5' => 0,
      '__errno_location@GLIBC_2.2.5' => 0,
      '__gmon_start__' => 0,
      '__isoc23_strtol@GLIBC_2.38' => 0,
      '__memcpy_chk@GLIBC_2.3.4' => 0,
      '__recv_chk@GLIBC_2.4' => 0,
      '__recvfrom_chk@GLIBC_2.4' => 0,
      '__stack_chk_fail@GLIBC_2.4' => 0,
      'bind@GLIBC_2.2.5' => 0,
      'calloc@GLIBC_2.2.5' => 0,
      'clock_gettime@GLIBC_2.17' => 0,
      'close@GLIBC_2.2.5' => 0,
      'connect@GLIBC_2.2.5' => 0,
      'dup@GLIBC_2.2.5' => 0,
      'fclose@GLIBC_2.2.5' => 0,
      'fcntl64@GLIBC_2.28' => 0,
      'fgets@GLIBC_2.2.5' => 0,
      'fopen64@GLIBC_2.2.5' => 0,
      'free@GLIBC_2.2.5' => 0,
      'getsockopt@GLIBC_2.2.5' => 0,
      'malloc@GLIBC_2.2.5' => 0,
      'memcmp@GLIBC_2.2.5' => 0,
      'memcpy@GLIBC_2.14' => 0,
      'memmem@GLIBC_2.2.5' => 0,
      'open64@GLIBC_2.2.5' => 0,
      'poll@GLIBC_2.2.5' => 0,
      'ppoll@GLIBC_2.4' => 0,
      'recv@GLIBC_2.2.5' => 0,
      'recvmsg@GLIBC_2.2.5' => 0,
      'sendmsg@GLIBC_2.2.5' => 0,
      'sendto@GLIBC_2.2.5' => 0,
      'setsockopt@GLIBC_2.2.5' => 0,
      'socket@GLIBC_2.2.5' => 0,
      'stat64@GLIBC_2.33' => 0,
      'strlen@GLIBC_2.2.5' => 0,
      'strnlen@GLIBC_2.2.5' => 0,
      'timerfd_create@GLIBC_2.8' => 0,
      'timerfd_settime@GLIBC_2.8' => 0,
      'write@GLIBC_2.2.5' => 0
    }
  },
  'WordSize' => '8'
};
