$VAR1 = {
          'ABI_DUMPER_VERSION' => '1.4',
          'ABI_DUMP_VERSION' => '3.5',
          'Arch' => 'x86_64',
          'GccVersion' => '15.0.1',
          'Headers' => {
                         'af-mctp.h' => 1,
                         'base.h' => 1,
                         'bios.h' => 1,
                         'bios_table.h' => 1,
                         'control.h' => 1,
                         'file.h' => 1,
                         'file_io.h' => 1,
                         'firmware_fd.h' => 1,
                         'firmware_update.h' => 1,
                         'fru.h' => 1,
                         'host.h' => 1,
                         'instance-id.h' => 1,
                         'mctp-demux.h' => 1,
                         'pdr.h' => 1,
                         'platform.h' => 1,
                         'pldm.h' => 1,
                         'pldm_types.h' => 1,
                         'transport.h' => 1,
                         'utils.h' => 1
                       },
          'Language' => 'C',
          'LibraryName' => 'libpldm.so.0.13.0',
          'LibraryVersion' => '0.13.0',
          'NameSpaces' => {},
          'Needed' => {
                        'libc.so.6' => 1
                      },
          'PublicABI' => '1',
          'Sources' => {
                         'af-mctp.c' => 1,
                         'bios_table.c' => 1,
                         'instance-id.c' => 1,
                         'mctp-demux.c' => 1,

                                                  'pldm_pdr_get_record_count' => 1,
                                                  'pldm_pdr_get_record_handle' => 1,
                                                  'pldm_pdr_get_repo_size' => 1,
                                                  'pldm_pdr_get_terminus_handle' => 1,
                                                  'pldm_pdr_init' => 1,
                                                  'pldm_pdr_record_is_remote' => 1,
                                                  'pldm_pdr_remove_fru_record_set_by_rsi' => 1,
                                                  'pldm_pdr_remove_pdrs_by_terminus_handle' => 1,
                                                  'pldm_pdr_remove_remote_pdrs' => 1,
                                                  'pldm_pdr_update_TL_pdr' => 1,
                                                  'pldm_platform_cper_event_event_data' => 1,
                                                  'pldm_transport_af_mctp_bind' => 1,
                                                  'pldm_transport_af_mctp_core' => 1,
                                                  'pldm_transport_af_mctp_destroy' => 1,
                                                  'pldm_transport_af_mctp_init' => 1,
                                                  'pldm_transport_af_mctp_init_pollfd' => 1,
                                                  'pldm_transport_af_mctp_map_tid' => 1,
                                                  'pldm_transport_af_mctp_unmap_tid' => 1,
                                                  'pldm_transport_mctp_demux_core' => 1,
                                                  'pldm_transport_mctp_demux_destroy' => 1,
                                                  'pldm_transport_mctp_demux_init' => 1,
                                                  'pldm_transport_mctp_demux_init_pollfd' => 1,
                                                  'pldm_transport_mctp_demux_map_tid' => 1,
                                                  'pldm_transport_mctp_demux_unmap_tid' => 1,
                                                  'pldm_transport_poll' => 1,
                                                  'pldm_transport_recv_msg' => 1,
                                                  'pldm_transport_send_msg' => 1,
                                                  'pldm_transport_send_recv_msg' => 1,
                                                  'pldm_transport_test_core' => 1,
                                                  'pldm_transport_test_destroy' => 1,
                                                  'pldm_transport_test_init' => 1,
                                                  'pldm_transport_test_init_pollfd' => 1,
                                                  'unpack_pldm_header' => 1,
                                                  'ver2str' => 1
                                                }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '51' => {
                                    'Name' => 'char',
                                    'Size' => '1',
                                    'Type' => 'Intrinsic'
                                  },
                          '58' => {
                                    'Name' => 'int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  },
                          '65' => {
                                    'Name' => 'unsigned char',
                                    'Size' => '1',
                                    'Type' => 'Intrinsic'
                                  },
                          '72' => {
                                    'Name' => 'unsigned short',
                                    'Size' => '2',
                                    'Type' => 'Intrinsic'
                                  },
                          '79' => {
                                    'Name' => 'unsigned int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  },
                          '86' => {
                                    'Name' => 'unsigned long',
                                    'Size' => '8',
                                    'Type' => 'Intrinsic'
                                  },
                          '93' => {
                                    'Name' => 'signed char',
                                    'Size' => '1',
                                    'Type' => 'Intrinsic'
                                  },
                          '100' => {
                                     'BaseType' => '65',
                                     'Header' => 'types.h',
                                     'Line' => '38',
                                     'Name' => '__uint8_t',
                                     'PrivateABI' => 1,
                                     'Size' => '1',
                                     'Type' => 'Typedef'
                                   },
                          '112' => {
                                     'Name' => 'short',
                                     'Size' => '2',
                                     'Type' => 'Intrinsic'
                                   },
                          '119' => {
                                     'BaseType' => '79',
                                     'Header' => 'types.h',
                                     'Line' => '42',
                                     'Name' => '__uint32_t',
                                     'PrivateABI' => 1,
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '131' => {
                                     'Name' => 'long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '138' => {
                                     'BaseType' => '1',
                                     'Name' => 'void*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '140' => {
                                     'BaseType' => '100',
                                     'Header' => 'stdint-uintn.h',
                                     'Line' => '24',
                                     'Name' => 'uint8_t',
                                     'PrivateABI' => 1,
                                     'Size' => '1',
                                     'Type' => 'Typedef'
                                   },
                          '152' => {
                                     'BaseType' => '119',
                                     'Header' => 'stdint-uintn.h',
                                     'Line' => '26',
                                     'Name' => 'uint32_t',
                                     'PrivateABI' => 1,
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '164' => {
                                     'BaseType' => '152',
                                     'Name' => 'uint32_t const',
                                     'Size' => '4',
                                     'Type' => 'Const'
                                   },
                          '169' => {
                                     'BaseType' => '86',
                                     'Header' => 'stddef.h',
                                     'Line' => '214',
                                     'Name' => 'size_t',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '195' => {
                                     'Header' => 'pldm_types.h',
                                     'Line' => '9',
                                     'Name' => 'anon-struct-pldm_types.h-9',
                                     'Size' => '1',
                                     'Type' => 'Struct'
                                   },
                          '349' => {
                                     'Header' => 'pldm_types.h',
                                     'Line' => '19',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'byte',
                                                          'offset' => '0',
                                                          'type' => '140'
                                                        },
                                                 '1' => {
                                                          'name' => 'bits',
                                                          'offset' => '0',
                                                          'type' => '195'
                                                        }
                                               },
                                     'Name' => 'union bitfield8_t',
                                     'Size' => '1',
                                     'Type' => 'Union'
                                   },
                          '361' => {
                                     'BaseType' => '349',
                                     'Name' => 'bitfield8_t const',
                                     'Size' => '1',
                                     'Type' => 'Const'
                                   },
                          '366' => {
                                     'Header' => 'pldm_types.h',
                                     'Line' => '25',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'alpha',
                                                          'offset' => '0',
                                                          'type' => '140'
                                                        },
                                                 '1' => {
                                                          'name' => 'update',
                                                          'offset' => '1',
                                                          'type' => '140'
                                                        },
                                                 '2' => {
                                                          'name' => 'minor',
                                                          'offset' => '2',
                                                          'type' => '140'
                                                        },
                                                 '3' => {
                                                          'name' => 'major',
                                                          'offset' => '3',
                                                          'type' => '140'
                                                        }
                                               },
                                     'Name' => 'struct pldm_version',
                                     'Size' => '4',
                                     'Type' => 'Struct'
                                   },
                          '432' => {
                                     'BaseType' => '366',
                                     'Header' => 'pldm_types.h',
                                     'Line' => '30',
                                     'Name' => 'ver32_t',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '444' => {
                                     'BaseType' => '432',
                                     'Name' => 'ver32_t const',
                                     'Size' => '4',
                                     'Type' => 'Const'
                                   },
                          '449' => {
                                     'Name' => 'float',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '884' => {
                                     'Header' => 'base.h',
                                     'Line' => '129',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'PLDM_RESPONSE',
                                                          'value' => '0'
                                                        },
                                                 '1' => {
                                                          'name' => 'PLDM_REQUEST',
                                                          'value' => '1'
                                                        },
                                                 '2' => {
                                                          'name' => 'PLDM_RESERVED',
                                                          'value' => '2'
                                                        },
                                                 '3' => {
                                                          'name' => 'PLDM_ASYNC_REQUEST_NOTIFY',
                                                          'value' => '3'
                                                        }
                                               },
                                     'Name' => 'enum MessageType',
                                     'Size' => '4',
                                     'Type' => 'Enum'
                                   },
                          '896' => {
                                     'Header' => 'base.h',
                                     'Line' => '182',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'command',
                                                          'offset' => '2',
                                                          'type' => '140'
                                                        }
                                               },
                                     'Name' => 'struct pldm_msg_hdr',
                                     'Size' => '3',
                                     'Type' => 'Struct'
                                   },
                          '1007' => {
                                      'BaseType' => '896',
                                      'Name' => 'struct pldm_msg_hdr const',
                                      'Size' => '3',
                                      'Type' => 'Const'
                                    },
                          '1012' => {
                                      'Header' => 'base.h',
                                      'Line' => '215',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'hdr',
                                                           'offset' => '0',
                                                           'type' => '896'
                                                         },
                                                  '1' => {
                                                           'name' => 'payload',
                                                           'offset' => '3',
                                                           'type' => '1057'
                                                         }
                                                },
                                      'Name' => 'struct pldm_msg',
                                      'Size' => '4',
                                      'Type' => 'Struct'
                                    },
                          '1052' => {
                                      'BaseType' => '1012',
                                      'Name' => 'struct pldm_msg const',
                                      'Size' => '4',
                                      'Type' => 'Const'
                                    },
                          '1057' => {
                                      'BaseType' => '140',
                                      'Name' => 'uint8_t[1]',
                                      'Size' => '1',
                                      'Type' => 'Array'
                                    },
                          '1073' => {
                                      'Header' => 'base.h',
                                      'Line' => '282',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'msg_type',
                                                           'offset' => '0',
                                                           'type' => '884'
                                                         },
                                                  '1' => {
                                                           'name' => 'instance',
                                                           'offset' => '4',
                                                           'type' => '140'
                                                         },
                                                  '2' => {
                                                           'name' => 'pldm_type',
                                                           'offset' => '5',
                                                           'type' => '140'
                                                         },
                                                  '3' => {
                                                           'name' => 'command',
                                                           'offset' => '6',
                                                           'type' => '140'
                                                         },
                                                  '4' => {
                                                           'name' => 'completion_code',
                                                           'offset' => '7',
                                                           'type' => '140'
                                                         }
                                                },
                                      'Name' => 'struct pldm_header_info',
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '1153' => {
                                      'BaseType' => '1073',
                                      'Name' => 'struct pldm_header_info const',
                                      'Size' => '8',
                                      'Type' => 'Const'
                                    },
                          '1158' => {
                                      'BaseType' => '349',
                                      'Name' => 'bitfield8_t[8]',
                                      'Size' => '8',
                                      'Type' => 'Array'
                                    },
                          '1249' => {
                                      'Header' => 'control-internal.h',
                                      'Line' => '15',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'versions',
                                                           'offset' => '0',
                                                           'type' => '1320'
                                                         },
                                                  '1' => {
                                                           'name' => 'versions_count',
                                                           'offset' => '8',
                                                           'type' => '140'
                                                         },
                                                  '2' => {
                                                           'name' => 'commands',
                                                           'offset' => '22',
                                                           'type' => '1326'
                                                         },
                                                  '3' => {
                                                           'name' => 'pldm_type',
                                                           'offset' => '36',
                                                           'type' => '140'
                                                         }
                                                },
                                      'Name' => 'struct pldm_type_versions',
                                      'PrivateABI' => 1,
                                      'Size' => '32',
                                      'Type' => 'Struct'
                                    },
                          '1320' => {
                                      'BaseType' => '1325',
                                      'Name' => 'void const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1325' => {
                                      'BaseType' => '1',
                                      'Name' => 'void const',
                                      'Type' => 'Const'
                                    },
                          '1326' => {
                                      'BaseType' => '361',
                                      'Name' => 'bitfield8_t const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1331' => {
                                      'Header' => 'control-internal.h',
                                      'Line' => '28',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'types',
                                                           'offset' => '0',
                                                           'type' => '1358'
                                                         }
                                                },
                                      'Name' => 'struct pldm_control',
                                      'PrivateABI' => 1,
                                      'Size' => '192',
                                      'Type' => 'Struct'
                                    },
                          '1358' => {
                                      'BaseType' => '1249',
                                      'Name' => 'struct pldm_type_versions[6]',
                                      'Size' => '192',
                                      'Type' => 'Array'
                                    },
                          '1501' => {
                                      'BaseType' => '1012',
                                      'Name' => 'struct pldm_msg*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1580' => {
                                      'BaseType' => '1052',
                                      'Name' => 'struct pldm_msg const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1585' => {
                                      'BaseType' => '140',
                                      'Name' => 'uint8_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1590' => {
                                      'BaseType' => '432',
                                      'Name' => 'ver32_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1684' => {
                                      'BaseType' => '444',
                                      'Name' => 'ver32_t const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1731' => {
                                      'BaseType' => '152',
                                      'Name' => 'uint32_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1800' => {
                                      'BaseType' => '1007',
                                      'Name' => 'struct pldm_msg_hdr const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1805' => {
                                      'BaseType' => '1073',
                                      'Name' => 'struct pldm_header_info*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1992' => {
                                      'BaseType' => '1331',
                                      'Name' => 'struct pldm_control*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2760' => {
                                      'BaseType' => '169',
                                      'Name' => 'size_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '3220' => {
                                      'BaseType' => '1153',
                                      'Name' => 'struct pldm_header_info const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4897' => {
                                      'BaseType' => '140',
                                      'Header' => 'base.h',
                                      'Line' => '19',
                                      'Name' => 'pldm_tid_t',
                                      'Size' => '1',
                                      'Type' => 'Typedef'
                                    },
                          '4909' => {
                                      'BaseType' => '140',
                                      'Header' => 'instance-id.h',
                                      'Line' => '13',
                                      'Name' => 'pldm_instance_id_t',
                                      'Size' => '1',
                                      'Type' => 'Typedef'
                                    },
                          '4921' => {
                                      'Header' => 'responder.h',
                                      'Line' => '10',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'tid',
                                                           'offset' => '0',
                                                           'type' => '4897'
                                                         },
                                                  '1' => {
                                                           'name' => 'instance_id',
                                                           'offset' => '1',
                                                           'type' => '4909'
                                                         },
                                                  '2' => {
                                                           'name' => 'type',
                                                           'offset' => '2',
                                                           'type' => '140'
                                                         },
                                                  '3' => {
                                                           'name' => 'command',
                                                           'offset' => '3',
                                                           'type' => '140'
                                                         },
                                                  '4' => {
                                                           'name' => 'next',
                                                           'offset' => '8',
                                                           'type' => '5001'
                                                         }
                                                },
                                      'Name' => 'struct pldm_responder_cookie',
                                      'PrivateABI' => 1,
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '5001' => {
                                      'BaseType' => '4921',
                                      'Name' => 'struct pldm_responder_cookie*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '5006' => {
                                      'Header' => 'pldm.h',
                                      'Line' => '15',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'PLDM_REQUESTER_SUCCESS',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'PLDM_REQUESTER_OPEN_FAIL',
                                                           'value' => '18446744073709551615 (-1)'
                                                         },
                                                  '2' => {
                                                           'name' => 'PLDM_REQUESTER_NOT_PLDM_MSG',
                                                           'value' => '18446744073709551614 (-2)'
                                                         },
                                                  '3' => {
                                                           'name' => 'PLDM_REQUESTER_NOT_RESP_MSG',
                                                           'value' => '18446744073709551613 (-3)'
                                                         },
                                                  '4' => {
                                                           'name' => 'PLDM_REQUESTER_NOT_REQ_MSG',
                                                           'value' => '18446744073709551612 (-4)'
                                                         },
                                                  '5' => {
                                                           'name' => 'PLDM_REQUESTER_RESP_MSG_TOO_SMALL',
                                                           'value' => '18446744073709551611 (-5)'
                                                         },
                                                  '6' => {
                                                           'name' => 'PLDM_REQUESTER_INSTANCE_ID_MISMATCH',
                                                           'value' => '18446744073709551610 (-6)'
                                                         },
                                                  '7' => {
                                                           'name' => 'PLDM_REQUESTER_SEND_FAIL',
                                                           'value' => '18446744073709551609 (-7)'
                                                         },
                                                  '8' => {
                                                           'name' => 'PLDM_REQUESTER_RECV_FAIL',
                                                           'value' => '18446744073709551608 (-8)'
                                                         },
                                                  '9' => {
                                                           'name' => 'PLDM_REQUESTER_INVALID_RECV_LEN',
                                                           'value' => '18446744073709551607 (-9)'
                                                         },
                                                  '10' => {
                                                            'name' => 'PLDM_REQUESTER_SETUP_FAIL',
                                                            'value' => '18446744073709551606 (-10)'
                                                          },
                                                  '11' => {
                                                            'name' => 'PLDM_REQUESTER_INVALID_SETUP',
                                                            'value' => '18446744073709551605 (-11)'
                                                          },
                                                  '12' => {
                                                            'name' => 'PLDM_REQUESTER_POLL_FAIL',
                                                            'value' => '18446744073709551604 (-12)'
                                                          },
                                                  '13' => {
                                                            'name' => 'PLDM_REQUESTER_TRANSPORT_BUSY',
                                                            'value' => '18446744073709551603 (-13)'
                                                          }
                                                },
                                      'Name' => 'enum pldm_requester_error_codes',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '5527' => {
                                      'Name' => '_Bool',
                                      'Size' => '1',
                                      'Type' => 'Intrinsic'
                                    },
                          '5654' => {
                                      'BaseType' => '72',
                                      'Header' => 'types.h',
                                      'Line' => '40',
                                      'Name' => '__uint16_t',
                                      'PrivateABI' => 1,
                                      'Size' => '2',
                                      'Type' => 'Typedef'
                                    },
                          '5692' => {
                                      'BaseType' => '131',
                                      'Header' => 'types.h',
                                      'Line' => '194',
                                      'Name' => '__ssize_t',
                                      'PrivateABI' => 1,
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '5704' => {
                                      'BaseType' => '51',
                                      'Name' => 'char*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '5728' => {
                                      'BaseType' => '140',
                                      'Name' => 'uint8_t const',
                                      'Size' => '1',
                                      'Type' => 'Const'
                                    },
                          '5733' => {
                                      'BaseType' => '5654',
                                      'Header' => 'stdint-uintn.h',
                                      'Line' => '25',
                                      'Name' => 'uint16_t',
                                      'PrivateABI' => 1,
                                      'Size' => '2',
                                      'Type' => 'Typedef'
                                    },
                          '5865' => {
                                      'BaseType' => '5692',
                                      'Header' => 'types.h',
                                      'Line' => '108',
                                      'Name' => 'ssize_t',
                                      'PrivateABI' => 1,
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '5884' => {
                                      'BaseType' => '5728',
                                      'Name' => 'uint8_t const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7507' => {
                                      'BaseType' => '51',
                                      'Name' => 'char const',
                                      'Size' => '1',
                                      'Type' => 'Const'
                                    },
                          '7541' => {
                                      'BaseType' => '5733',
                                      'Name' => 'uint16_t const',
                                      'Size' => '2',
                                      'Type' => 'Const'
                                    },
                          '7881' => {
                                      'Header' => 'utils.h',
                                      'Line' => '20',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ptr',
                                                           'offset' => '0',
                                                           'type' => '5884'
                                                         },
                                                  '1' => {
                                                           'name' => 'length',
                                                           'offset' => '8',
                                                           'type' => '169'
                                                         }
                                                },
                                      'Name' => 'struct variable_field',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '8998' => {
                                      'Header' => 'base.h',
                                      'Line' => '366',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'pldm_type',
                                                           'offset' => '0',
                                                           'type' => '140'
                                                         },
                                                  '1' => {
                                                           'name' => 'transfer_opflag',
                                                           'offset' => '1',
                                                           'type' => '140'
                                                         },
                                                  '2' => {
                                                           'name' => 'transfer_ctx',
                                                           'offset' => '2',
                                                           'type' => '152'
                                                         },
                                                  '3' => {
                                                           'name' => 'transfer_handle',
                                                           'offset' => '6',
                                                           'type' => '152'
                                                         },
                                                  '4' => {
                                                           'name' => 'section_offset',
                                                           'offset' => '16',
                                                           'type' => '152'
                                                         },
                                                  '5' => {
                                                           'name' => 'section_length',
                                                           'offset' => '20',
                                                           'type' => '152'
                                                         }
                                                },
                                      'Name' => 'struct pldm_multipart_receive_req',
                                      'Size' => '18',
                                      'Type' => 'Struct'
                                    },
                          '9089' => {
                                      'BaseType' => '8998',
                                      'Name' => 'struct pldm_multipart_receive_req const',
                                      'Size' => '18',
                                      'Type' => 'Const'
                                    },
                          '9094' => {
                                      'Header' => 'base.h',
                                      'Line' => '384',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'completion_code',
                                                           'offset' => '0',
                                                           'type' => '140'
                                                         },
                                                  '1' => {
                                                           'name' => 'transfer_flag',
                                                           'offset' => '1',
                                                           'type' => '140'
                                                         },
                                                  '2' => {
                                                           'name' => 'next_transfer_handle',
                                                           'offset' => '4',
                                                           'type' => '152'
                                                         },
                                                  '3' => {
                                                           'name' => 'data',
                                                           'offset' => '8',
                                                           'type' => '7881'
                                                         }
                                                },
                                      'Name' => 'struct pldm_multipart_receive_resp',
                                      'Size' => '24',
                                      'Type' => 'Struct'
                                    },
                          '9159' => {
                                      'BaseType' => '9094',
                                      'Name' => 'struct pldm_multipart_receive_resp const',
                                      'Size' => '24',
                                      'Type' => 'Const'
                                    },
                          '9164' => {
                                      'Header' => 'base.h',
                                      'Line' => '396',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'requester_part_size',
                                                           'offset' => '0',
                                                           'type' => '5733'
                                                         },
                                                  '1' => {
                                                           'name' => 'requester_protocol_support',
                                                           'offset' => '2',
                                                           'type' => '1158'
                                                         }
                                                },
                                      'Name' => 'struct pldm_base_negotiate_transfer_params_req',
                                      'Size' => '10',
                                      'Type' => 'Struct'
                                    },
                          '9203' => {
                                      'BaseType' => '9164',
                                      'Name' => 'struct pldm_base_negotiate_transfer_params_req const',
                                      'Size' => '10',
                                      'Type' => 'Const'
                                    },
                          '9208' => {
                                      'Header' => 'base.h',
                                      'Line' => '405',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'completion_code',
                                                           'offset' => '0',
                                                           'type' => '140'
                                                         },
                                                  '1' => {
                                                           'name' => 'responder_part_size',
                                                           'offset' => '2',
                                                           'type' => '5733'
                                                         },
                                                  '2' => {
                                                           'name' => 'responder_protocol_support',
                                                           'offset' => '4',
                                                           'type' => '1158'
                                                         }
                                                },
                                      'Name' => 'struct pldm_base_negotiate_transfer_params_resp',
                                      'Size' => '12',
                                      'Type' => 'Struct'
                                    },
                          '9294' => {
                                      'BaseType' => '7507',
                                      'Name' => 'char const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '10994' => {
                                       'BaseType' => '9208',
                                       'Name' => 'struct pldm_base_negotiate_transfer_params_resp*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '12264' => {
                                       'BaseType' => '9203',
                                       'Name' => 'struct pldm_base_negotiate_transfer_params_req const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '15850' => {
                                       'BaseType' => '9159',
                                       'Name' => 'struct pldm_multipart_receive_resp const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '18280' => {
                                       'BaseType' => '9094',
                                       'Name' => 'struct pldm_multipart_receive_resp*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '20367' => {
                                       'BaseType' => '9089',
                                       'Name' => 'struct pldm_multipart_receive_req const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '23205' => {
                                       'BaseType' => '349',
                                       'Name' => 'bitfield8_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '24977' => {
                                       'BaseType' => '896',
                                       'Name' => 'struct pldm_msg_hdr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '25355' => {
                                       'BaseType' => '138',
                                       'Name' => 'void**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '28771' => {
                                       'BaseType' => '7881',
                                       'Name' => 'struct variable_field*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '30853' => {
                                       'BaseType' => '5733',
                                       'Name' => 'uint16_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '34103' => {
                                       'BaseType' => '86',
                                       'Header' => 'types.h',
                                       'Line' => '45',
                                       'Name' => '__uint64_t',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '34197' => {
                                       'BaseType' => '34103',
                                       'Header' => 'stdint-uintn.h',
                                       'Line' => '27',
                                       'Name' => 'uint64_t',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '34495' => {
                                       'Header' => 'bios.h',
                                       'Line' => '39',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'PLDM_BIOS_STRING_TABLE',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'PLDM_BIOS_ATTR_TABLE',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'PLDM_BIOS_ATTR_VAL_TABLE',
                                                            'value' => '2'
                                                          }
                                                 },
                                       'Name' => 'enum pldm_bios_table_types',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '34529' => {
                                       'Header' => 'bios.h',
                                       'Line' => '48',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'string_handle',
                                                            'offset' => '0',
                                                            'type' => '5733'
                                                          },
                                                   '1' => {
                                                            'name' => 'string_length',
                                                            'offset' => '2',
                                                            'type' => '5733'
                                                          },
                                                   '2' => {
                                                            'name' => 'name',
                                                            'offset' => '4',
                                                            'type' => '34586'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_string_table_entry',
                                       'Size' => '5',
                                       'Type' => 'Struct'
                                     },
                          '34581' => {
                                       'BaseType' => '34529',
                                       'Name' => 'struct pldm_bios_string_table_entry const',
                                       'Size' => '5',
                                       'Type' => 'Const'
                                     },
                          '34586' => {
                                       'BaseType' => '51',
                                       'Name' => 'char[1]',
                                       'Size' => '1',
                                       'Type' => 'Array'
                                     },
                          '34602' => {
                                       'Header' => 'bios.h',
                                       'Line' => '54',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'attr_handle',
                                                            'offset' => '0',
                                                            'type' => '5733'
                                                          },
                                                   '1' => {
                                                            'name' => 'attr_type',
                                                            'offset' => '2',
                                                            'type' => '140'
                                                          },
                                                   '2' => {
                                                            'name' => 'string_handle',
                                                            'offset' => '3',
                                                            'type' => '5733'
                                                          },
                                                   '3' => {
                                                            'name' => 'metadata',
                                                            'offset' => '5',
                                                            'type' => '1057'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_attr_table_entry',
                                       'Size' => '6',
                                       'Type' => 'Struct'
                                     },
                          '34667' => {
                                       'BaseType' => '34602',
                                       'Name' => 'struct pldm_bios_attr_table_entry const',
                                       'Size' => '6',
                                       'Type' => 'Const'
                                     },
                          '34672' => {
                                       'Header' => 'bios.h',
                                       'Line' => '66',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'attr_handle',
                                                            'offset' => '0',
                                                            'type' => '5733'
                                                          },
                                                   '1' => {
                                                            'name' => 'attr_type',
                                                            'offset' => '2',
                                                            'type' => '140'
                                                          },
                                                   '2' => {
                                                            'name' => 'value',
                                                            'offset' => '3',
                                                            'type' => '1057'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_attr_val_table_entry',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '34724' => {
                                       'BaseType' => '34672',
                                       'Name' => 'struct pldm_bios_attr_val_table_entry const',
                                       'Size' => '4',
                                       'Type' => 'Const'
                                     },
                          '34793' => {
                                       'Header' => 'bios_table.h',
                                       'Line' => '206',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'name_handle',
                                                            'offset' => '0',
                                                            'type' => '5733'
                                                          },
                                                   '1' => {
                                                            'name' => 'read_only',
                                                            'offset' => '2',
                                                            'type' => '5527'
                                                          },
                                                   '2' => {
                                                            'name' => 'pv_num',
                                                            'offset' => '3',
                                                            'type' => '140'
                                                          },
                                                   '3' => {
                                                            'name' => 'pv_handle',
                                                            'offset' => '8',
                                                            'type' => '34896'
                                                          },
                                                   '4' => {
                                                            'name' => 'def_num',
                                                            'offset' => '22',
                                                            'type' => '140'
                                                          },
                                                   '5' => {
                                                            'name' => 'def_index',
                                                            'offset' => '36',
                                                            'type' => '5884'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_table_attr_entry_enum_info',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '34884' => {
                                       'BaseType' => '34793',
                                       'Name' => 'struct pldm_bios_table_attr_entry_enum_info const',
                                       'Size' => '32',
                                       'Type' => 'Const'
                                     },
                          '34896' => {
                                       'BaseType' => '7541',
                                       'Name' => 'uint16_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '34901' => {
                                       'Header' => 'bios_table.h',
                                       'Line' => '294',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'name_handle',
                                                            'offset' => '0',
                                                            'type' => '5733'
                                                          },
                                                   '1' => {
                                                            'name' => 'read_only',
                                                            'offset' => '2',
                                                            'type' => '5527'
                                                          },
                                                   '2' => {
                                                            'name' => 'string_type',
                                                            'offset' => '3',
                                                            'type' => '140'
                                                          },
                                                   '3' => {
                                                            'name' => 'min_length',
                                                            'offset' => '4',
                                                            'type' => '5733'
                                                          },
                                                   '4' => {
                                                            'name' => 'max_length',
                                                            'offset' => '6',
                                                            'type' => '5733'
                                                          },
                                                   '5' => {
                                                            'name' => 'def_length',
                                                            'offset' => '8',
                                                            'type' => '5733'
                                                          },
                                                   '6' => {
                                                            'name' => 'def_string',
                                                            'offset' => '22',
                                                            'type' => '9294'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_table_attr_entry_string_info',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '35013' => {
                                       'BaseType' => '34901',
                                       'Name' => 'struct pldm_bios_table_attr_entry_string_info const',
                                       'Size' => '24',
                                       'Type' => 'Const'
                                     },
                          '35023' => {
                                       'Header' => 'bios_table.h',
                                       'Line' => '384',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'name_handle',
                                                            'offset' => '0',
                                                            'type' => '5733'
                                                          },
                                                   '1' => {
                                                            'name' => 'read_only',
                                                            'offset' => '2',
                                                            'type' => '5527'
                                                          },
                                                   '2' => {
                                                            'name' => 'lower_bound',
                                                            'offset' => '8',
                                                            'type' => '34197'
                                                          },
                                                   '3' => {
                                                            'name' => 'upper_bound',
                                                            'offset' => '22',
                                                            'type' => '34197'
                                                          },
                                                   '4' => {
                                                            'name' => 'scalar_increment',
                                                            'offset' => '36',
                                                            'type' => '152'
                                                          },
                                                   '5' => {
                                                            'name' => 'default_value',
                                                            'offset' => '50',
                                                            'type' => '34197'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_table_attr_entry_integer_info',
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '35121' => {
                                       'BaseType' => '35023',
                                       'Name' => 'struct pldm_bios_table_attr_entry_integer_info const',
                                       'Size' => '40',
                                       'Type' => 'Const'
                                     },
                          '35353' => {
                                       'Name' => 'ssize_t(*)(void const*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '1320'
                                                           }
                                                  },
                                       'Return' => '5865',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '35423' => {
                                       'Line' => '957',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'table_data',
                                                            'offset' => '0',
                                                            'type' => '5884'
                                                          },
                                                   '1' => {
                                                            'name' => 'table_len',
                                                            'offset' => '8',
                                                            'type' => '169'
                                                          },
                                                   '2' => {
                                                            'name' => 'current_pos',
                                                            'offset' => '22',
                                                            'type' => '169'
                                                          },
                                                   '3' => {
                                                            'name' => 'entry_length_handler',
                                                            'offset' => '36',
                                                            'type' => '35353'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_bios_table_iter',
                                       'PrivateABI' => 1,
                                       'Size' => '32',
                                       'Source' => 'bios_table.c',
                                       'Type' => 'Struct'
                                     },
                          '35493' => {
                                       'BaseType' => '35423',
                                       'Name' => 'struct pldm_bios_table_iter const',
                                       'Size' => '32',
                                       'Type' => 'Const'
                                     },
                          '36563' => {
                                       'BaseType' => '35423',
                                       'Name' => 'struct pldm_bios_table_iter*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '36568' => {
                                       'BaseType' => '34724',
                                       'Name' => 'struct pldm_bios_attr_val_table_entry const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '36982' => {
                                       'BaseType' => '34667',
                                       'Name' => 'struct pldm_bios_attr_table_entry const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '37585' => {
                                       'BaseType' => '34581',
                                       'Name' => 'struct pldm_bios_string_table_entry const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '38748' => {
                                       'BaseType' => '35493',
                                       'Name' => 'struct pldm_bios_table_iter const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '42931' => {
                                       'BaseType' => '34197',
                                       'Name' => 'uint64_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '43208' => {
                                       'BaseType' => '35121',
                                       'Name' => 'struct pldm_bios_table_attr_entry_integer_info const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '43475' => {
                                       'BaseType' => '9294',
                                       'Name' => 'char const**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '44604' => {
                                       'BaseType' => '35013',
                                       'Name' => 'struct pldm_bios_table_attr_entry_string_info const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '46058' => {
                                       'BaseType' => '34884',
                                       'Name' => 'struct pldm_bios_table_attr_entry_enum_info const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '48281' => {
                                       'Header' => 'pldm_types.h',
                                       'Line' => '36',
                                       'Name' => 'anon-struct-pldm_types.h-36',
                                       'Size' => '2',
                                       'Type' => 'Struct'
                                     },
                          '48547' => {
                                       'Header' => 'pldm_types.h',
                                       'Line' => '54',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'value',
                                                            'offset' => '0',
                                                            'type' => '5733'
                                                          },
                                                   '1' => {
                                                            'name' => 'bits',
                                                            'offset' => '0',
                                                            'type' => '48281'
                                                          }
                                                 },
                                       'Name' => 'union bitfield16_t',
                                       'Size' => '2',
                                       'Type' => 'Union'
                                     },
                          '49285' => {
                                       'Header' => 'file.h',
                                       'Line' => '53',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'file_identifier',
                                                            'offset' => '0',
                                                            'type' => '5733'
                                                          },
                                                   '1' => {
                                                            'name' => 'file_attribute',
                                                            'offset' => '2',
                                                            'type' => '48547'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_file_df_open_req',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '49324' => {
                                       'BaseType' => '49285',
                                       'Name' => 'struct pldm_file_df_open_req const',
                                       'Size' => '4',
                                       'Type' => 'Const'
                                     },
                          '49329' => {
                                       'Header' => 'file.h',
                                       'Line' => '62',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'completion_code',
                                                            'offset' => '0',
                                                            'type' => '140'
                                                          },
                                                   '1' => {
                                                            'name' => 'file_descriptor',
                                                            'offset' => '2',
                                                            'type' => '5733'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_file_df_open_resp',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '49368' => {
                                       'BaseType' => '49329',
                                       'Name' => 'struct pldm_file_df_open_resp const',
                                       'Size' => '4',
                                       'Type' => 'Const'
                                     },
                          '49373' => {
                                       'Header' => 'file.h',
                                       'Line' => '71',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'file_descriptor',
                                                            'offset' => '0',
                                                            'type' => '5733'
                                                          },
                                                   '1' => {
                                                            'name' => 'df_close_options',
                                                            'offset' => '2',
                                                            'type' => '48547'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_file_df_close_req',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '49412' => {
                                       'BaseType' => '49373',
                                       'Name' => 'struct pldm_file_df_close_req const',
                                       'Size' => '4',
                                       'Type' => 'Const'
                                     },
                          '49417' => {
                                       'Header' => 'file.h',
                                       'Line' => '80',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'completion_code',
                                                            'offset' => '0',
                                                            'type' => '140'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_file_df_close_resp',
                                       'Size' => '1',
                                       'Type' => 'Struct'
                                     },
                          '49443' => {
                                       'BaseType' => '49417',
                                       'Name' => 'struct pldm_file_df_close_resp const',
                                       'Size' => '1',
                                       'Type' => 'Const'
                                     },
                          '49448' => {
                                       'Header' => 'file.h',
                                       'Line' => '88',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'file_descriptor',
                                                            'offset' => '0',
                                                            'type' => '5733'
                                                          },
                                                   '1' => {
                                                            'name' => 'requester_max_interval',
                                                            'offset' => '4',
                                                            'type' => '152'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_file_df_heartbeat_req',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '49487' => {
                                       'BaseType' => '49448',
                                       'Name' => 'struct pldm_file_df_heartbeat_req const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '49492' => {
                                       'Header' => 'file.h',
                                       'Line' => '97',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'completion_code',
                                                            'offset' => '0',
                                                            'type' => '140'
                                                          },
                                                   '1' => {
                                                            'name' => 'responder_max_interval',
                                                            'offset' => '4',
                                                            'type' => '152'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_file_df_heartbeat_resp',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '50781' => {
                                       'BaseType' => '49492',
                                       'Name' => 'struct pldm_file_df_heartbeat_resp*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '51885' => {
                                       'BaseType' => '49487',
                                       'Name' => 'struct pldm_file_df_heartbeat_req const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '52016' => {
                                       'BaseType' => '49417',
                                       'Name' => 'struct pldm_file_df_close_resp*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '52921' => {
                                       'BaseType' => '49443',
                                       'Name' => 'struct pldm_file_df_close_resp const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '54100' => {
                                       'BaseType' => '49373',
                                       'Name' => 'struct pldm_file_df_close_req*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '55182' => {
                                       'BaseType' => '49412',
                                       'Name' => 'struct pldm_file_df_close_req const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '56515' => {
                                       'BaseType' => '49329',
                                       'Name' => 'struct pldm_file_df_open_resp*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '57671' => {
                                       'BaseType' => '49368',
                                       'Name' => 'struct pldm_file_df_open_resp const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '58845' => {
                                       'BaseType' => '49285',
                                       'Name' => 'struct pldm_file_df_open_req*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '59927' => {
                                       'BaseType' => '49324',
                                       'Name' => 'struct pldm_file_df_open_req const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '61253' => {
                                       'BaseType' => '140',
                                       'Header' => 'pldm_types.h',
                                       'Line' => '32',
                                       'Name' => 'bool8_t',
                                       'Size' => '1',
                                       'Type' => 'Typedef'
                                     },
                          '61541' => {
                                       'Header' => 'pldm_types.h',
                                       'Line' => '58',
                                       'Name' => 'anon-struct-pldm_types.h-58',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '62029' => {
                                       'Header' => 'pldm_types.h',
                                       'Line' => '92',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'value',
                                                            'offset' => '0',
                                                            'type' => '152'
                                                          },
                                                   '1' => {
                                                            'name' => 'bits',
                                                            'offset' => '0',
                                                            'type' => '61541'
                                                          }
                                                 },
                                       'Name' => 'union bitfield32_t',
                                       'Size' => '4',
                                       'Type' => 'Union'
                                     },
                          '62041' => {
                                       'Header' => 'pldm_types.h',
                                       'Line' => '96',
                                       'Name' => 'anon-struct-pldm_types.h-96',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '62977' => {
                                       'Header' => 'pldm_types.h',
                                       'Line' => '162',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'value',
                                                            'offset' => '0',
                                                            'type' => '34197'
                                                          },
                                                   '1' => {
                                                            'name' => 'bits',
                                                            'offset' => '0',
                                                            'type' => '62041'
                                                          }
                                                 },
                                       'Name' => 'union bitfield64_t',
                                       'Size' => '8',
                                       'Type' => 'Union'
                                     },
                          '62996' => {
                                       'BaseType' => '63008',
                                       'Header' => 'pldm_types.h',
                                       'Line' => '166',
                                       'Name' => 'pldm_uuid',
                                       'Size' => '16',
                                       'Type' => 'Typedef'
                                     },
                          '63008' => {
                                       'BaseType' => '140',
                                       'Name' => 'uint8_t[16]',
                                       'Size' => '16',
                                       'Type' => 'Array'
                                     },
                          '63024' => {
                                       'BaseType' => '63008',
                                       'Name' => 'uint8_t[16] const',
                                       'Size' => '16',
                                       'Type' => 'Const'
                                     },
                          '63053' => {
                                       'BaseType' => '169',
                                       'Name' => 'size_t const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '63117' => {
                                       'BaseType' => '7881',
                                       'Name' => 'struct variable_field const',
                                       'Size' => '16',
                                       'Type' => 'Const'
                                     },
                          '64134' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '171',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'PLDM_STR_TYPE_UNKNOWN',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'PLDM_STR_TYPE_ASCII',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'PLDM_STR_TYPE_UTF_8',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'PLDM_STR_TYPE_UTF_16',
                                                            'value' => '3'
                                                          },
                                                   '4' => {
                                                            'name' => 'PLDM_STR_TYPE_UTF_16LE',
                                                            'value' => '4'
                                                          },
                                                   '5' => {
                                                            'name' => 'PLDM_STR_TYPE_UTF_16BE',
                                                            'value' => '5'
                                                          }
                                                 },
                                       'Name' => 'enum pldm_firmware_update_string_type',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '64493' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '274',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'PLDM_CRC_COMP_CAN_BE_UPDATED',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'PLDM_CRC_COMP_COMPARISON_STAMP_IDENTICAL',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'PLDM_CRC_COMP_COMPARISON_STAMP_LOWER',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'PLDM_CRC_INVALID_COMP_COMPARISON_STAMP',
                                                            'value' => '3'
                                                          },
                                                   '4' => {
                                                            'name' => 'PLDM_CRC_COMP_CONFLICT',
                                                            'value' => '4'
                                                          },
                                                   '5' => {
                                                            'name' => 'PLDM_CRC_COMP_PREREQUISITES_NOT_MET',
                                                            'value' => '5'
                                                          },
                                                   '6' => {
                                                            'name' => 'PLDM_CRC_COMP_NOT_SUPPORTED',
                                                            'value' => '6'
                                                          },
                                                   '7' => {
                                                            'name' => 'PLDM_CRC_COMP_SECURITY_RESTRICTIONS',
                                                            'value' => '7'
                                                          },
                                                   '8' => {
                                                            'name' => 'PLDM_CRC_INCOMPLETE_COMP_IMAGE_SET',
                                                            'value' => '8'
                                                          },
                                                   '9' => {
                                                            'name' => 'PLDM_CRC_ACTIVE_IMAGE_NOT_UPDATEABLE_SUBSEQUENTLY',
                                                            'value' => '9'
                                                          },
                                                   '10' => {
                                                             'name' => 'PLDM_CRC_COMP_VER_STR_IDENTICAL',
                                                             'value' => '10'
                                                           },
                                                   '11' => {
                                                             'name' => 'PLDM_CRC_COMP_VER_STR_LOWER',
                                                             'value' => '11'
                                                           },
                                                   '12' => {
                                                             'name' => 'PLDM_CRC_VENDOR_COMP_RESP_CODE_RANGE_MIN',
                                                             'value' => '208'
                                                           },
                                                   '13' => {
                                                             'name' => 'PLDM_CRC_VENDOR_COMP_RESP_CODE_RANGE_MAX',
                                                             'value' => '239'
                                                           }
                                                 },
                                       'Name' => 'enum pldm_component_response_codes',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '64801' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '378',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'PLDM_FD_STATE_IDLE',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'PLDM_FD_STATE_LEARN_COMPONENTS',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'PLDM_FD_STATE_READY_XFER',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'PLDM_FD_STATE_DOWNLOAD',
                                                            'value' => '3'
                                                          },
                                                   '4' => {
                                                            'name' => 'PLDM_FD_STATE_VERIFY',
                                                            'value' => '4'
                                                          },
                                                   '5' => {
                                                            'name' => 'PLDM_FD_STATE_APPLY',
                                                            'value' => '5'
                                                          },
                                                   '6' => {
                                                            'name' => 'PLDM_FD_STATE_ACTIVATE',
                                                            'value' => '6'
                                                          }
                                                 },
                                       'Name' => 'enum pldm_firmware_device_states',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '64957' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '411',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'PLDM_FD_INITIALIZATION',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'PLDM_FD_ACTIVATE_FW',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'PLDM_FD_CANCEL_UPDATE',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'PLDM_FD_TIMEOUT_LEARN_COMPONENT',
                                                            'value' => '3'
                                                          },
                                                   '4' => {
                                                            'name' => 'PLDM_FD_TIMEOUT_READY_XFER',
                                                            'value' => '4'
                                                          },
                                                   '5' => {
                                                            'name' => 'PLDM_FD_TIMEOUT_DOWNLOAD',
                                                            'value' => '5'
                                                          },
                                                   '6' => {
                                                            'name' => 'PLDM_FD_TIMEOUT_VERIFY',
                                                            'value' => '6'
                                                          },
                                                   '7' => {
                                                            'name' => 'PLDM_FD_TIMEOUT_APPLY',
                                                            'value' => '7'
                                                          },
                                                   '8' => {
                                                            'name' => 'PLDM_FD_STATUS_VENDOR_DEFINED_MIN',
                                                            'value' => '200'
                                                          },
                                                   '9' => {
                                                            'name' => 'PLDM_FD_STATUS_VENDOR_DEFINED_MAX',
                                                            'value' => '255'
                                                          }
                                                 },
                                       'Name' => 'enum pldm_get_status_reason_code_values',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '65089' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '446',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'str_type',
                                                            'offset' => '0',
                                                            'type' => '64134'
                                                          },
                                                   '1' => {
                                                            'name' => 'str_len',
                                                            'offset' => '4',
                                                            'type' => '140'
                                                          },
                                                   '2' => {
                                                            'name' => 'str_data',
                                                            'offset' => '5',
                                                            'type' => '65146'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_firmware_string',
                                       'Size' => '72',
                                       'Type' => 'Struct'
                                     },
                          '65146' => {
                                       'BaseType' => '140',
                                       'Name' => 'uint8_t[64]',
                                       'Size' => '64',
                                       'Type' => 'Array'
                                     },
                          '65162' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '456',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comparison_stamp',
                                                            'offset' => '0',
                                                            'type' => '152'
                                                          },
                                                   '1' => {
                                                            'name' => 'str',
                                                            'offset' => '4',
                                                            'type' => '65089'
                                                          },
                                                   '2' => {
                                                            'name' => 'date',
                                                            'offset' => '118',
                                                            'type' => '65218'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_firmware_version',
                                       'Size' => '84',
                                       'Type' => 'Struct'
                                     },
                          '65218' => {
                                       'BaseType' => '140',
                                       'Name' => 'uint8_t[8]',
                                       'Size' => '8',
                                       'Type' => 'Array'
                                     },
                          '65234' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '466',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'uuid',
                                                            'offset' => '0',
                                                            'type' => '63008'
                                                          },
                                                   '1' => {
                                                            'name' => 'package_header_format_version',
                                                            'offset' => '22',
                                                            'type' => '140'
                                                          },
                                                   '2' => {
                                                            'name' => 'package_header_size',
                                                            'offset' => '23',
                                                            'type' => '5733'
                                                          },
                                                   '3' => {
                                                            'name' => 'package_release_date_time',
                                                            'offset' => '25',
                                                            'type' => '65347'
                                                          },
                                                   '4' => {
                                                            'name' => 'component_bitmap_bit_length',
                                                            'offset' => '50',
                                                            'type' => '5733'
                                                          },
                                                   '5' => {
                                                            'name' => 'package_version_string_type',
                                                            'offset' => '52',
                                                            'type' => '140'
                                                          },
                                                   '6' => {
                                                            'name' => 'package_version_string_length',
                                                            'offset' => '53',
                                                            'type' => '140'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_package_header_information',
                                       'Size' => '36',
                                       'Type' => 'Struct'
                                     },
                          '65347' => {
                                       'BaseType' => '140',
                                       'Name' => 'uint8_t[13]',
                                       'Size' => '13',
                                       'Type' => 'Array'
                                     },
                          '65363' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '480',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'record_length',
                                                            'offset' => '0',
                                                            'type' => '5733'
                                                          },
                                                   '1' => {
                                                            'name' => 'descriptor_count',
                                                            'offset' => '2',
                                                            'type' => '140'
                                                          },
                                                   '2' => {
                                                            'name' => 'device_update_option_flags',
                                                            'offset' => '3',
                                                            'type' => '62029'
                                                          },
                                                   '3' => {
                                                            'name' => 'comp_image_set_version_string_type',
                                                            'offset' => '7',
                                                            'type' => '140'
                                                          },
                                                   '4' => {
                                                            'name' => 'comp_image_set_version_string_length',
                                                            'offset' => '8',
                                                            'type' => '140'
                                                          },
                                                   '5' => {
                                                            'name' => 'fw_device_pkg_data_length',
                                                            'offset' => '9',
                                                            'type' => '5733'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_firmware_device_id_record',
                                       'Size' => '11',
                                       'Type' => 'Struct'
                                     },
                          '65576' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '514',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_classification',
                                                            'offset' => '0',
                                                            'type' => '5733'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_identifier',
                                                            'offset' => '2',
                                                            'type' => '5733'
                                                          },
                                                   '2' => {
                                                            'name' => 'comp_comparison_stamp',
                                                            'offset' => '4',
                                                            'type' => '152'
                                                          },
                                                   '3' => {
                                                            'name' => 'comp_options',
                                                            'offset' => '8',
                                                            'type' => '48547'
                                                          },
                                                   '4' => {
                                                            'name' => 'requested_comp_activation_method',
                                                            'offset' => '16',
                                                            'type' => '48547'
                                                          },
                                                   '5' => {
                                                            'name' => 'comp_location_offset',
                                                            'offset' => '18',
                                                            'type' => '152'
                                                          },
                                                   '6' => {
                                                            'name' => 'comp_size',
                                                            'offset' => '22',
                                                            'type' => '152'
                                                          },
                                                   '7' => {
                                                            'name' => 'comp_version_string_type',
                                                            'offset' => '32',
                                                            'type' => '140'
                                                          },
                                                   '8' => {
                                                            'name' => 'comp_version_string_length',
                                                            'offset' => '33',
                                                            'type' => '140'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_component_image_information',
                                       'Size' => '22',
                                       'Type' => 'Struct'
                                     },
                          '65774' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '540',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'completion_code',
                                                            'offset' => '0',
                                                            'type' => '140'
                                                          },
                                                   '1' => {
                                                            'name' => 'capabilities_during_update',
                                                            'offset' => '1',
                                                            'type' => '62029'
                                                          },
                                                   '2' => {
                                                            'name' => 'comp_count',
                                                            'offset' => '5',
                                                            'type' => '5733'
                                                          },
                                                   '3' => {
                                                            'name' => 'active_comp_image_set_ver_str_type',
                                                            'offset' => '7',
                                                            'type' => '140'
                                                          },
                                                   '4' => {
                                                            'name' => 'active_comp_image_set_ver_str_len',
                                                            'offset' => '8',
                                                            'type' => '140'
                                                          },
                                                   '5' => {
                                                            'name' => 'pending_comp_image_set_ver_str_type',
                                                            'offset' => '9',
                                                            'type' => '140'
                                                          },
                                                   '6' => {
                                                            'name' => 'pending_comp_image_set_ver_str_len',
                                                            'offset' => '16',
                                                            'type' => '140'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_get_firmware_parameters_resp',
                                       'Size' => '11',
                                       'Type' => 'Struct'
                                     },
                          '65887' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '554',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'completion_code',
                                                            'offset' => '0',
                                                            'type' => '140'
                                                          },
                                                   '1' => {
                                                            'name' => 'capabilities_during_update',
                                                            'offset' => '4',
                                                            'type' => '62029'
                                                          },
                                                   '2' => {
                                                            'name' => 'comp_count',
                                                            'offset' => '8',
                                                            'type' => '5733'
                                                          },
                                                   '3' => {
                                                            'name' => 'active_comp_image_set_ver_str',
                                                            'offset' => '18',
                                                            'type' => '65089'
                                                          },
                                                   '4' => {
                                                            'name' => 'pending_comp_image_set_ver_str',
                                                            'offset' => '132',
                                                            'type' => '65089'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_get_firmware_parameters_resp_full',
                                       'Size' => '156',
                                       'Type' => 'Struct'
                                     },
                          '65972' => {
                                       'BaseType' => '65887',
                                       'Name' => 'struct pldm_get_firmware_parameters_resp_full const',
                                       'Size' => '156',
                                       'Type' => 'Const'
                                     },
                          '65977' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '568',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'completion_code',
                                                            'offset' => '0',
                                                            'type' => '140'
                                                          },
                                                   '1' => {
                                                            'name' => 'downstream_device_update_supported',
                                                            'offset' => '1',
                                                            'type' => '140'
                                                          },
                                                   '2' => {
                                                            'name' => 'number_of_downstream_devices',
                                                            'offset' => '2',
                                                            'type' => '5733'
                                                          },
                                                   '3' => {
                                                            'name' => 'max_number_of_downstream_devices',
                                                            'offset' => '4',
                                                            'type' => '5733'
                                                          },
                                                   '4' => {
                                                            'name' => 'capabilities',
                                                            'offset' => '8',
                                                            'type' => '62029'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_query_downstream_devices_resp',
                                       'Size' => '12',
                                       'Type' => 'Struct'
                                     },
                          '66062' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '580',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_classification',
                                                            'offset' => '0',
                                                            'type' => '5733'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_identifier',
                                                            'offset' => '2',
                                                            'type' => '5733'
                                                          },
                                                   '2' => {
                                                            'name' => 'comp_classification_index',
                                                            'offset' => '4',
                                                            'type' => '140'
                                                          },
                                                   '3' => {
                                                            'name' => 'active_comp_comparison_stamp',
                                                            'offset' => '5',
                                                            'type' => '152'
                                                          },
                                                   '4' => {
                                                            'name' => 'active_comp_ver_str_type',
                                                            'offset' => '9',
                                                            'type' => '140'
                                                          },
                                                   '5' => {
                                                            'name' => 'active_comp_ver_str_len',
                                                            'offset' => '16',
                                                            'type' => '140'
                                                          },
                                                   '6' => {
                                                            'name' => 'active_comp_release_date',
                                                            'offset' => '17',
                                                            'type' => '65218'
                                                          },
                                                   '7' => {
                                                            'name' => 'pending_comp_comparison_stamp',
                                                            'offset' => '25',
                                                            'type' => '152'
                                                          },
                                                   '8' => {
                                                            'name' => 'pending_comp_ver_str_type',
                                                            'offset' => '35',
                                                            'type' => '140'
                                                          },
                                                   '9' => {
                                                            'name' => 'pending_comp_ver_str_len',
                                                            'offset' => '36',
                                                            'type' => '140'
                                                          },
                                                   '10' => {
                                                             'name' => 'pending_comp_release_date',
                                                             'offset' => '37',
                                                             'type' => '65218'
                                                           },
                                                   '11' => {
                                                             'name' => 'comp_activation_methods',
                                                             'offset' => '51',
                                                             'type' => '48547'
                                                           },
                                                   '12' => {
                                                             'name' => 'capabilities_during_update',
                                                             'offset' => '53',
                                                             'type' => '62029'
                                                           }
                                                 },
                                       'Name' => 'struct pldm_component_parameter_entry',
                                       'Size' => '39',
                                       'Type' => 'Struct'
                                     },
                          '66259' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '602',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_classification',
                                                            'offset' => '0',
                                                            'type' => '5733'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_identifier',
                                                            'offset' => '2',
                                                            'type' => '5733'
                                                          },
                                                   '2' => {
                                                            'name' => 'comp_classification_index',
                                                            'offset' => '4',
                                                            'type' => '140'
                                                          },
                                                   '3' => {
                                                            'name' => 'active_ver',
                                                            'offset' => '8',
                                                            'type' => '65162'
                                                          },
                                                   '4' => {
                                                            'name' => 'pending_ver',
                                                            'offset' => '146',
                                                            'type' => '65162'
                                                          },
                                                   '5' => {
                                                            'name' => 'comp_activation_methods',
                                                            'offset' => '374',
                                                            'type' => '48547'
                                                          },
                                                   '6' => {
                                                            'name' => 'capabilities_during_update',
                                                            'offset' => '384',
                                                            'type' => '62029'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_component_parameter_entry_full',
                                       'Size' => '184',
                                       'Type' => 'Struct'
                                     },
                          '66372' => {
                                       'BaseType' => '66259',
                                       'Name' => 'struct pldm_component_parameter_entry_full const',
                                       'Size' => '184',
                                       'Type' => 'Const'
                                     },
                          '66377' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '619',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'data_transfer_handle',
                                                            'offset' => '0',
                                                            'type' => '152'
                                                          },
                                                   '1' => {
                                                            'name' => 'transfer_operation_flag',
                                                            'offset' => '4',
                                                            'type' => '140'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_query_downstream_identifiers_req',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '66420' => {
                                       'BaseType' => '66377',
                                       'Name' => 'struct pldm_query_downstream_identifiers_req const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '66425' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '633',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'completion_code',
                                                            'offset' => '0',
                                                            'type' => '140'
                                                          },
                                                   '1' => {
                                                            'name' => 'next_data_transfer_handle',
                                                            'offset' => '4',
                                                            'type' => '152'
                                                          },
                                                   '2' => {
                                                            'name' => 'transfer_flag',
                                                            'offset' => '8',
                                                            'type' => '140'
                                                          },
                                                   '3' => {
                                                            'name' => 'downstream_devices_length',
                                                            'offset' => '18',
                                                            'type' => '152'
                                                          },
                                                   '4' => {
                                                            'name' => 'number_of_downstream_devices',
                                                            'offset' => '22',
                                                            'type' => '5733'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_query_downstream_identifiers_resp',
                                       'Size' => '20',
                                       'Type' => 'Struct'
                                     },
                          '66510' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '646',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'downstream_device_index',
                                                            'offset' => '0',
                                                            'type' => '5733'
                                                          },
                                                   '1' => {
                                                            'name' => 'downstream_descriptor_count',
                                                            'offset' => '2',
                                                            'type' => '140'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_downstream_device',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '66553' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '652',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'field',
                                                            'offset' => '0',
                                                            'type' => '7881'
                                                          },
                                                   '1' => {
                                                            'name' => 'devs',
                                                            'offset' => '22',
                                                            'type' => '169'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_downstream_device_iter',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '66596' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '726',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'descriptor_type',
                                                            'offset' => '0',
                                                            'type' => '5733'
                                                          },
                                                   '1' => {
                                                            'name' => 'descriptor_length',
                                                            'offset' => '2',
                                                            'type' => '5733'
                                                          },
                                                   '2' => {
                                                            'name' => 'descriptor_data',
                                                            'offset' => '8',
                                                            'type' => '1320'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_descriptor',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '66653' => {
                                       'BaseType' => '66596',
                                       'Name' => 'struct pldm_descriptor const',
                                       'Size' => '16',
                                       'Type' => 'Const'
                                     },
                          '66669' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '732',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'field',
                                                            'offset' => '0',
                                                            'type' => '28771'
                                                          },
                                                   '1' => {
                                                            'name' => 'count',
                                                            'offset' => '8',
                                                            'type' => '169'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_descriptor_iter',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '66717' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '825',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'data_transfer_handle',
                                                            'offset' => '0',
                                                            'type' => '152'
                                                          },
                                                   '1' => {
                                                            'name' => 'transfer_operation_flag',
                                                            'offset' => '4',
                                                            'type' => '140'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_get_downstream_firmware_parameters_req',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '66760' => {
                                       'BaseType' => '66717',
                                       'Name' => 'struct pldm_get_downstream_firmware_parameters_req const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '66765' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '840',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'completion_code',
                                                            'offset' => '0',
                                                            'type' => '140'
                                                          },
                                                   '1' => {
                                                            'name' => 'next_data_transfer_handle',
                                                            'offset' => '4',
                                                            'type' => '152'
                                                          },
                                                   '2' => {
                                                            'name' => 'transfer_flag',
                                                            'offset' => '8',
                                                            'type' => '140'
                                                          },
                                                   '3' => {
                                                            'name' => 'fdp_capabilities_during_update',
                                                            'offset' => '18',
                                                            'type' => '62029'
                                                          },
                                                   '4' => {
                                                            'name' => 'downstream_device_count',
                                                            'offset' => '22',
                                                            'type' => '5733'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_get_downstream_firmware_parameters_resp',
                                       'Size' => '20',
                                       'Type' => 'Struct'
                                     },
                          '66850' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '858',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'downstream_device_index',
                                                            'offset' => '0',
                                                            'type' => '5733'
                                                          },
                                                   '1' => {
                                                            'name' => 'active_comp_comparison_stamp',
                                                            'offset' => '4',
                                                            'type' => '152'
                                                          },
                                                   '2' => {
                                                            'name' => 'active_comp_ver_str_type',
                                                            'offset' => '8',
                                                            'type' => '140'
                                                          },
                                                   '3' => {
                                                            'name' => 'active_comp_ver_str_len',
                                                            'offset' => '9',
                                                            'type' => '140'
                                                          },
                                                   '4' => {
                                                            'name' => 'active_comp_release_date',
                                                            'offset' => '16',
                                                            'type' => '67047'
                                                          },
                                                   '5' => {
                                                            'name' => 'pending_comp_comparison_stamp',
                                                            'offset' => '32',
                                                            'type' => '152'
                                                          },
                                                   '6' => {
                                                            'name' => 'pending_comp_ver_str_type',
                                                            'offset' => '36',
                                                            'type' => '140'
                                                          },
                                                   '7' => {
                                                            'name' => 'pending_comp_ver_str_len',
                                                            'offset' => '37',
                                                            'type' => '140'
                                                          },
                                                   '8' => {
                                                            'name' => 'pending_comp_release_date',
                                                            'offset' => '38',
                                                            'type' => '67047'
                                                          },
                                                   '9' => {
                                                            'name' => 'comp_activation_methods',
                                                            'offset' => '54',
                                                            'type' => '48547'
                                                          },
                                                   '10' => {
                                                             'name' => 'capabilities_during_update',
                                                             'offset' => '64',
                                                             'type' => '62029'
                                                           },
                                                   '11' => {
                                                             'name' => 'active_comp_ver_str',
                                                             'offset' => '72',
                                                             'type' => '1320'
                                                           },
                                                   '12' => {
                                                             'name' => 'pending_comp_ver_str',
                                                             'offset' => '86',
                                                             'type' => '1320'
                                                           }
                                                 },
                                       'Name' => 'struct pldm_downstream_device_parameters_entry',
                                       'Size' => '64',
                                       'Type' => 'Struct'
                                     },
                          '67047' => {
                                       'BaseType' => '51',
                                       'Name' => 'char[9]',
                                       'Size' => '9',
                                       'Type' => 'Array'
                                     },
                          '67162' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '898',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'max_transfer_size',
                                                            'offset' => '0',
                                                            'type' => '152'
                                                          },
                                                   '1' => {
                                                            'name' => 'num_of_comp',
                                                            'offset' => '4',
                                                            'type' => '5733'
                                                          },
                                                   '2' => {
                                                            'name' => 'max_outstanding_transfer_req',
                                                            'offset' => '6',
                                                            'type' => '140'
                                                          },
                                                   '3' => {
                                                            'name' => 'pkg_data_len',
                                                            'offset' => '8',
                                                            'type' => '5733'
                                                          },
                                                   '4' => {
                                                            'name' => 'image_set_ver',
                                                            'offset' => '18',
                                                            'type' => '65089'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_request_update_req_full',
                                       'Size' => '84',
                                       'Type' => 'Struct'
                                     },
                          '67247' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '911',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'completion_code',
                                                            'offset' => '0',
                                                            'type' => '140'
                                                          },
                                                   '1' => {
                                                            'name' => 'fd_meta_data_len',
                                                            'offset' => '1',
                                                            'type' => '5733'
                                                          },
                                                   '2' => {
                                                            'name' => 'fd_will_send_pkg_data',
                                                            'offset' => '3',
                                                            'type' => '140'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_request_update_resp',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '67304' => {
                                       'BaseType' => '67247',
                                       'Name' => 'struct pldm_request_update_resp const',
                                       'Size' => '4',
                                       'Type' => 'Const'
                                     },
                          '67309' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '921',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'maximum_downstream_device_transfer_size',
                                                            'offset' => '0',
                                                            'type' => '152'
                                                          },
                                                   '1' => {
                                                            'name' => 'maximum_outstanding_transfer_requests',
                                                            'offset' => '4',
                                                            'type' => '140'
                                                          },
                                                   '2' => {
                                                            'name' => 'downstream_device_package_data_length',
                                                            'offset' => '6',
                                                            'type' => '5733'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_request_downstream_device_update_req',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '67366' => {
                                       'BaseType' => '67309',
                                       'Name' => 'struct pldm_request_downstream_device_update_req const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '67371' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '932',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'completion_code',
                                                            'offset' => '0',
                                                            'type' => '140'
                                                          },
                                                   '1' => {
                                                            'name' => 'downstream_device_meta_data_length',
                                                            'offset' => '2',
                                                            'type' => '5733'
                                                          },
                                                   '2' => {
                                                            'name' => 'downstream_device_will_send_get_package_data',
                                                            'offset' => '4',
                                                            'type' => '140'
                                                          },
                                                   '3' => {
                                                            'name' => 'get_package_data_maximum_transfer_size',
                                                            'offset' => '6',
                                                            'type' => '5733'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_request_downstream_device_update_resp',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '67442' => {
                                       'BaseType' => '67371',
                                       'Name' => 'struct pldm_request_downstream_device_update_resp const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '67560' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '961',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'transfer_flag',
                                                            'offset' => '0',
                                                            'type' => '140'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_classification',
                                                            'offset' => '2',
                                                            'type' => '5733'
                                                          },
                                                   '2' => {
                                                            'name' => 'comp_identifier',
                                                            'offset' => '4',
                                                            'type' => '5733'
                                                          },
                                                   '3' => {
                                                            'name' => 'comp_classification_index',
                                                            'offset' => '6',
                                                            'type' => '140'
                                                          },
                                                   '4' => {
                                                            'name' => 'comp_comparison_stamp',
                                                            'offset' => '8',
                                                            'type' => '152'
                                                          },
                                                   '5' => {
                                                            'name' => 'version',
                                                            'offset' => '18',
                                                            'type' => '65089'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_pass_component_table_req_full',
                                       'Size' => '84',
                                       'Type' => 'Struct'
                                     },
                          '67659' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '974',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'completion_code',
                                                            'offset' => '0',
                                                            'type' => '140'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_resp',
                                                            'offset' => '1',
                                                            'type' => '140'
                                                          },
                                                   '2' => {
                                                            'name' => 'comp_resp_code',
                                                            'offset' => '2',
                                                            'type' => '140'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_pass_component_table_resp',
                                       'Size' => '3',
                                       'Type' => 'Struct'
                                     },
                          '67716' => {
                                       'BaseType' => '67659',
                                       'Name' => 'struct pldm_pass_component_table_resp const',
                                       'Size' => '3',
                                       'Type' => 'Const'
                                     },
                          '67848' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '1002',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'comp_classification',
                                                            'offset' => '0',
                                                            'type' => '5733'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_identifier',
                                                            'offset' => '2',
                                                            'type' => '5733'
                                                          },
                                                   '2' => {
                                                            'name' => 'comp_classification_index',
                                                            'offset' => '4',
                                                            'type' => '140'
                                                          },
                                                   '3' => {
                                                            'name' => 'comp_comparison_stamp',
                                                            'offset' => '8',
                                                            'type' => '152'
                                                          },
                                                   '4' => {
                                                            'name' => 'version',
                                                            'offset' => '18',
                                                            'type' => '65089'
                                                          },
                                                   '5' => {
                                                            'name' => 'comp_image_size',
                                                            'offset' => '132',
                                                            'type' => '152'
                                                          },
                                                   '6' => {
                                                            'name' => 'update_option_flags',
                                                            'offset' => '136',
                                                            'type' => '62029'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_update_component_req_full',
                                       'Size' => '92',
                                       'Type' => 'Struct'
                                     },
                          '67961' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '1018',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'completion_code',
                                                            'offset' => '0',
                                                            'type' => '140'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_compatibility_resp',
                                                            'offset' => '1',
                                                            'type' => '140'
                                                          },
                                                   '2' => {
                                                            'name' => 'comp_compatibility_resp_code',
                                                            'offset' => '2',
                                                            'type' => '140'
                                                          },
                                                   '3' => {
                                                            'name' => 'update_option_flags_enabled',
                                                            'offset' => '3',
                                                            'type' => '62029'
                                                          },
                                                   '4' => {
                                                            'name' => 'time_before_req_fw_data',
                                                            'offset' => '7',
                                                            'type' => '5733'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_update_component_resp',
                                       'Size' => '9',
                                       'Type' => 'Struct'
                                     },
                          '68046' => {
                                       'BaseType' => '67961',
                                       'Name' => 'struct pldm_update_component_resp const',
                                       'Size' => '9',
                                       'Type' => 'Const'
                                     },
                          '68051' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '1030',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'offset',
                                                            'offset' => '0',
                                                            'type' => '152'
                                                          },
                                                   '1' => {
                                                            'name' => 'length',
                                                            'offset' => '4',
                                                            'type' => '152'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_request_firmware_data_req',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '68094' => {
                                       'BaseType' => '68051',
                                       'Name' => 'struct pldm_request_firmware_data_req const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '68099' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '1039',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'apply_result',
                                                            'offset' => '0',
                                                            'type' => '140'
                                                          },
                                                   '1' => {
                                                            'name' => 'comp_activation_methods_modification',
                                                            'offset' => '1',
                                                            'type' => '48547'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_apply_complete_req',
                                       'Size' => '3',
                                       'Type' => 'Struct'
                                     },
                          '68142' => {
                                       'BaseType' => '68099',
                                       'Name' => 'struct pldm_apply_complete_req const',
                                       'Size' => '3',
                                       'Type' => 'Const'
                                     },
                          '68176' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '1056',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'completion_code',
                                                            'offset' => '0',
                                                            'type' => '140'
                                                          },
                                                   '1' => {
                                                            'name' => 'estimated_time_activation',
                                                            'offset' => '1',
                                                            'type' => '5733'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_activate_firmware_resp',
                                       'Size' => '3',
                                       'Type' => 'Struct'
                                     },
                          '68219' => {
                                       'BaseType' => '68176',
                                       'Name' => 'struct pldm_activate_firmware_resp const',
                                       'Size' => '3',
                                       'Type' => 'Const'
                                     },
                          '68224' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '1065',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'completion_code',
                                                            'offset' => '0',
                                                            'type' => '140'
                                                          },
                                                   '1' => {
                                                            'name' => 'current_state',
                                                            'offset' => '1',
                                                            'type' => '140'
                                                          },
                                                   '2' => {
                                                            'name' => 'previous_state',
                                                            'offset' => '2',
                                                            'type' => '140'
                                                          },
                                                   '3' => {
                                                            'name' => 'aux_state',
                                                            'offset' => '3',
                                                            'type' => '140'
                                                          },
                                                   '4' => {
                                                            'name' => 'aux_state_status',
                                                            'offset' => '4',
                                                            'type' => '140'
                                                          },
                                                   '5' => {
                                                            'name' => 'progress_percent',
                                                            'offset' => '5',
                                                            'type' => '140'
                                                          },
                                                   '6' => {
                                                            'name' => 'reason_code',
                                                            'offset' => '6',
                                                            'type' => '140'
                                                          },
                                                   '7' => {
                                                            'name' => 'update_option_flags_enabled',
                                                            'offset' => '7',
                                                            'type' => '62029'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_get_status_resp',
                                       'Size' => '11',
                                       'Type' => 'Struct'
                                     },
                          '68351' => {
                                       'BaseType' => '68224',
                                       'Name' => 'struct pldm_get_status_resp const',
                                       'Size' => '11',
                                       'Type' => 'Const'
                                     },
                          '68356' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '1080',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'completion_code',
                                                            'offset' => '0',
                                                            'type' => '140'
                                                          },
                                                   '1' => {
                                                            'name' => 'non_functioning_component_indication',
                                                            'offset' => '1',
                                                            'type' => '61253'
                                                          },
                                                   '2' => {
                                                            'name' => 'non_functioning_component_bitmap',
                                                            'offset' => '2',
                                                            'type' => '34197'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_cancel_update_resp',
                                       'Size' => '10',
                                       'Type' => 'Struct'
                                     },
                          '68413' => {
                                       'BaseType' => '68356',
                                       'Name' => 'struct pldm_cancel_update_resp const',
                                       'Size' => '10',
                                       'Type' => 'Const'
                                     },
                          '68418' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '1395',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'field',
                                                            'offset' => '0',
                                                            'type' => '7881'
                                                          },
                                                   '1' => {
                                                            'name' => 'entries',
                                                            'offset' => '22',
                                                            'type' => '169'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_downstream_device_parameters_iter',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '68461' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '2249',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'magic',
                                                            'offset' => '0',
                                                            'type' => '164'
                                                          },
                                                   '1' => {
                                                            'name' => 'version',
                                                            'offset' => '4',
                                                            'type' => '5728'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-firmware_update.h-2249',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '68498' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '2268',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'identifier',
                                                            'offset' => '0',
                                                            'type' => '63024'
                                                          },
                                                   '1' => {
                                                            'name' => 'revision',
                                                            'offset' => '22',
                                                            'type' => '5728'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-firmware_update.h-2268',
                                       'Size' => '17',
                                       'Type' => 'Struct'
                                     },
                          '68535' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '2248',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'meta',
                                                            'offset' => '0',
                                                            'type' => '68461'
                                                          },
                                                   '1' => {
                                                            'name' => 'format',
                                                            'offset' => '8',
                                                            'type' => '68498'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_package_format_pin',
                                       'Size' => '28',
                                       'Type' => 'Struct'
                                     },
                          '68578' => {
                                       'BaseType' => '68535',
                                       'Name' => 'struct pldm_package_format_pin const',
                                       'Size' => '28',
                                       'Type' => 'Const'
                                     },
                          '68583' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '2284',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'package_header_identifier',
                                                            'offset' => '0',
                                                            'type' => '62996'
                                                          },
                                                   '1' => {
                                                            'name' => 'package_header_format_revision',
                                                            'offset' => '22',
                                                            'type' => '140'
                                                          },
                                                   '2' => {
                                                            'name' => 'package_release_date_time',
                                                            'offset' => '23',
                                                            'type' => '65347'
                                                          },
                                                   '3' => {
                                                            'name' => 'component_bitmap_bit_length',
                                                            'offset' => '48',
                                                            'type' => '5733'
                                                          },
                                                   '4' => {
                                                            'name' => 'package_version_string_type',
                                                            'offset' => '50',
                                                            'type' => '140'
                                                          },
                                                   '5' => {
                                                            'name' => 'package_version_string',
                                                            'offset' => '64',
                                                            'type' => '7881'
                                                          },
                                                   '6' => {
                                                            'name' => 'areas',
                                                            'offset' => '86',
                                                            'type' => '7881'
                                                          },
                                                   '7' => {
                                                            'name' => 'package',
                                                            'offset' => '114',
                                                            'type' => '7881'
                                                          }
                                                 },
                                       'Name' => 'struct pldm__package_header_information',
                                       'Size' => '88',
                                       'Type' => 'Struct'
                                     },
                          '68710' => {
                                       'BaseType' => '68583',
                                       'Header' => 'firmware_update.h',
                                       'Line' => '2300',
                                       'Name' => 'pldm_package_header_information_pad',
                                       'Size' => '88',
                                       'Type' => 'Typedef'
                                     },
                          '68723' => {
                                       'BaseType' => '68710',
                                       'Name' => 'pldm_package_header_information_pad const',
                                       'Size' => '88',
                                       'Type' => 'Const'
                                     },
                          '68728' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '2303',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'bitmap',
                                                            'offset' => '0',
                                                            'type' => '7881'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_package_component_bitmap',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '68757' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '2315',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'descriptor_count',
                                                            'offset' => '0',
                                                            'type' => '140'
                                                          },
                                                   '1' => {
                                                            'name' => 'device_update_option_flags',
                                                            'offset' => '4',
                                                            'type' => '62029'
                                                          },
                                                   '2' => {
                                                            'name' => 'component_image_set_version_string_type',
                                                            'offset' => '8',
                                                            'type' => '140'
                                                          },
                                                   '3' => {
                                                            'name' => 'component_image_set_version_string',
                                                            'offset' => '22',
                                                            'type' => '7881'
                                                          },
                                                   '4' => {
                                                            'name' => 'applicable_components',
                                                            'offset' => '50',
                                                            'type' => '68728'
                                                          },
                                                   '5' => {
                                                            'name' => 'record_descriptors',
                                                            'offset' => '72',
                                                            'type' => '7881'
                                                          },
                                                   '6' => {
                                                            'name' => 'firmware_device_package_data',
                                                            'offset' => '100',
                                                            'type' => '7881'
                                                          },
                                                   '7' => {
                                                            'name' => 'reference_manifest_data',
                                                            'offset' => '128',
                                                            'type' => '7881'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_package_firmware_device_id_record',
                                       'Size' => '96',
                                       'Type' => 'Struct'
                                     },
                          '68884' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '2366',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'descriptor_count',
                                                            'offset' => '0',
                                                            'type' => '140'
                                                          },
                                                   '1' => {
                                                            'name' => 'update_option_flags',
                                                            'offset' => '4',
                                                            'type' => '62029'
                                                          },
                                                   '2' => {
                                                            'name' => 'self_contained_activation_min_version_string_type',
                                                            'offset' => '8',
                                                            'type' => '140'
                                                          },
                                                   '3' => {
                                                            'name' => 'self_contained_activation_min_version_string',
                                                            'offset' => '22',
                                                            'type' => '7881'
                                                          },
                                                   '4' => {
                                                            'name' => 'self_contained_activation_min_version_comparison_stamp',
                                                            'offset' => '50',
                                                            'type' => '152'
                                                          },
                                                   '5' => {
                                                            'name' => 'applicable_components',
                                                            'offset' => '64',
                                                            'type' => '68728'
                                                          },
                                                   '6' => {
                                                            'name' => 'record_descriptors',
                                                            'offset' => '86',
                                                            'type' => '7881'
                                                          },
                                                   '7' => {
                                                            'name' => 'package_data',
                                                            'offset' => '114',
                                                            'type' => '7881'
                                                          },
                                                   '8' => {
                                                            'name' => 'reference_manifest_data',
                                                            'offset' => '136',
                                                            'type' => '7881'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_package_downstream_device_id_record',
                                       'Size' => '104',
                                       'Type' => 'Struct'
                                     },
                          '69025' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '2416',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'component_classification',
                                                            'offset' => '0',
                                                            'type' => '5733'
                                                          },
                                                   '1' => {
                                                            'name' => 'component_identifier',
                                                            'offset' => '2',
                                                            'type' => '5733'
                                                          },
                                                   '2' => {
                                                            'name' => 'component_comparison_stamp',
                                                            'offset' => '4',
                                                            'type' => '152'
                                                          },
                                                   '3' => {
                                                            'name' => 'component_options',
                                                            'offset' => '8',
                                                            'type' => '48547'
                                                          },
                                                   '4' => {
                                                            'name' => 'requested_component_activation_method',
                                                            'offset' => '16',
                                                            'type' => '48547'
                                                          },
                                                   '5' => {
                                                            'name' => 'component_image',
                                                            'offset' => '22',
                                                            'type' => '7881'
                                                          },
                                                   '6' => {
                                                            'name' => 'component_version_string_type',
                                                            'offset' => '50',
                                                            'type' => '140'
                                                          },
                                                   '7' => {
                                                            'name' => 'component_version_string',
                                                            'offset' => '64',
                                                            'type' => '7881'
                                                          },
                                                   '8' => {
                                                            'name' => 'component_opaque_data',
                                                            'offset' => '86',
                                                            'type' => '7881'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_package_component_image_information',
                                       'Size' => '72',
                                       'Type' => 'Struct'
                                     },
                          '69166' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '2443',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'field',
                                                            'offset' => '0',
                                                            'type' => '7881'
                                                          },
                                                   '1' => {
                                                            'name' => 'entries',
                                                            'offset' => '22',
                                                            'type' => '169'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_package_firmware_device_id_record_iter',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '69209' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '2448',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'field',
                                                            'offset' => '0',
                                                            'type' => '7881'
                                                          },
                                                   '1' => {
                                                            'name' => 'entries',
                                                            'offset' => '22',
                                                            'type' => '169'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_package_downstream_device_id_record_iter',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '69252' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '2453',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'field',
                                                            'offset' => '0',
                                                            'type' => '7881'
                                                          },
                                                   '1' => {
                                                            'name' => 'entries',
                                                            'offset' => '22',
                                                            'type' => '169'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_package_component_image_information_iter',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '69295' => {
                                       'Header' => 'firmware_update.h',
                                       'Line' => '2472',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hdr',
                                                            'offset' => '0',
                                                            'type' => '69363'
                                                          },
                                                   '1' => {
                                                            'name' => 'fds',
                                                            'offset' => '8',
                                                            'type' => '69166'
                                                          },
                                                   '2' => {
                                                            'name' => 'dds',
                                                            'offset' => '50',
                                                            'type' => '69209'
                                                          },
                                                   '3' => {
                                                            'name' => 'infos',
                                                            'offset' => '86',
                                                            'type' => '69252'
                                                          }
                                                 },
                                       'Name' => 'struct pldm_package_iter',
                                       'Size' => '80',
                                       'Type' => 'Struct'
                                     },
                          '69363' => {
                                       'BaseType' => '68723',
                                       'Name' => 'pldm_package_header_information_pad const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '74776' => {
                                       'BaseType' => '69252',
                                       'Name' => 'struct pldm_package_component_image_information_iter*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '74781' => {
                                       'BaseType' => '69025',
                                       'Name' => 'struct pldm_package_component_image_information*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '75797' => {
                                       'BaseType' => '69166',
                                       'Name' => 'struct pldm_package_firmware_device_id_record_iter*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '75802' => {
                                       'BaseType' => '69209',
                                       'Name' => 'struct pldm_package_downstream_device_id_record_iter*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '80626' => {
                                       'BaseType' => '68884',
                                       'Name' => 'struct pldm_package_downstream_device_id_record*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '81750' => {
                                       'BaseType' => '68757',
                                       'Name' => 'struct pldm_package_firmware_device_id_record*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '82816' => {
                                       'BaseType' => '68578',
                                       'Name' => 'struct pldm_package_format_pin const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '82821' => {
                                       'BaseType' => '68710',
                                       'Name' => 'pldm_package_header_information_pad*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '82826' => {
                                       'BaseType' => '69295',
                                       'Name' => 'struct pldm_package_iter*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '84257' => {
                                       'BaseType' => '68413',
                                       'Name' => 'struct pldm_cancel_update_resp const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '84449' => {
                                       'BaseType' => '61253',
                                       'Name' => 'bool8_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '84454' => {
                                       'BaseType' => '62977',
                                       'Name' => 'bitfield64_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '87500' => {
                                       'BaseType' => '68351',
                                       'Name' => 'struct pldm_get_status_resp const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '87832' => {
                                       'BaseType' => '62029',
                                       'Name' => 'bitfield32_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '89202' => {
                                       'BaseType' => '68219',
                                       'Name' => 'struct pldm_activate_firmware_resp const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '90354' => {
                                       'BaseType' => '5527',
                                       'Name' => '_Bool*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '91738' => {
                                       'BaseType' => '68142',
                                       'Name' => 'struct pldm_apply_complete_req const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '91853' => {
                                       'BaseType' => '48547',
                                       'Name' => 'bitfield16_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '95652' => {
                                       'BaseType' => '68094',
                                       'Name' => 'struct pldm_request_firmware_data_req const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '97687' => {
                                       'BaseType' => '68046',
                                       'Name' => 'struct pldm_update_component_resp const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '101558' => {
                                        'BaseType' => '67848',
                                        'Name' => 'struct pldm_update_component_req_full*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '102032' => {
                                        'BaseType' => '63117',
                                        'Name' => 'struct variable_field const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '103460' => {
                                        'BaseType' => '67716',
                                        'Name' => 'struct pldm_pass_component_table_resp const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '106885' => {
                                        'BaseType' => '67560',
                                        'Name' => 'struct pldm_pass_component_table_req_full*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '108799' => {
                                        'BaseType' => '67304',
                                        'Name' => 'struct pldm_request_update_resp const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '111866' => {
                                        'BaseType' => '67162',
                                        'Name' => 'struct pldm_request_update_req_full*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '114055' => {
                                        'BaseType' => '67371',
                                        'Name' => 'struct pldm_request_downstream_device_update_resp*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '115733' => {
                                        'BaseType' => '67442',
                                        'Name' => 'struct pldm_request_downstream_device_update_resp const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '117171' => {
                                        'BaseType' => '67309',
                                        'Name' => 'struct pldm_request_downstream_device_update_req*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '118611' => {
                                        'BaseType' => '67366',
                                        'Name' => 'struct pldm_request_downstream_device_update_req const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '123360' => {
                                        'BaseType' => '68418',
                                        'Name' => 'struct pldm_downstream_device_parameters_iter*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '123365' => {
                                        'BaseType' => '66850',
                                        'Name' => 'struct pldm_downstream_device_parameters_entry*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '126007' => {
                                        'BaseType' => '66765',
                                        'Name' => 'struct pldm_get_downstream_firmware_parameters_resp*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '127122' => {
                                        'BaseType' => '66760',
                                        'Name' => 'struct pldm_get_downstream_firmware_parameters_req const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '128278' => {
                                        'BaseType' => '66553',
                                        'Name' => 'struct pldm_downstream_device_iter*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '128283' => {
                                        'BaseType' => '66510',
                                        'Name' => 'struct pldm_downstream_device*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '130939' => {
                                        'BaseType' => '66425',
                                        'Name' => 'struct pldm_query_downstream_identifiers_resp*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '132054' => {
                                        'BaseType' => '66420',
                                        'Name' => 'struct pldm_query_downstream_identifiers_req const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '134619' => {
                                        'BaseType' => '65977',
                                        'Name' => 'struct pldm_query_downstream_devices_resp*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '135066' => {
                                        'BaseType' => '66062',
                                        'Name' => 'struct pldm_component_parameter_entry*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '139985' => {
                                        'BaseType' => '66372',
                                        'Name' => 'struct pldm_component_parameter_entry_full const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '143263' => {
                                        'BaseType' => '65972',
                                        'Name' => 'struct pldm_get_firmware_parameters_resp_full const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '143488' => {
                                        'BaseType' => '65774',
                                        'Name' => 'struct pldm_get_firmware_parameters_resp*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '146257' => {
                                        'BaseType' => '66653',
                                        'Name' => 'struct pldm_descriptor const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '146418' => {
                                        'BaseType' => '1585',
                                        'Name' => 'uint8_t**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '146760' => {
                                        'BaseType' => '65576',
                                        'Name' => 'struct pldm_component_image_information*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '149222' => {
                                        'BaseType' => '66669',
                                        'Name' => 'struct pldm_descriptor_iter*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '149227' => {
                                        'BaseType' => '66596',
                                        'Name' => 'struct pldm_descriptor*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '149611' => {
                                        'BaseType' => '65363',
                                        'Name' => 'struct pldm_firmware_device_id_record*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '156461' => {
                                        'BaseType' => '65234',
                                        'Name' => 'struct pldm_package_header_information*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '171348' => {
                                        'BaseType' => '171365',
                                        'Header' => 'pdr.h',
                                        'Line' => '16',
                                        'Name' => 'pldm_pdr',
                                        'PrivateABI' => 1,
                                        'Size' => '24',
                                        'Type' => 'Typedef'
                                      },
                          '171360' => {
                                        'BaseType' => '171348',
                                        'Name' => 'pldm_pdr const',
                                        'Size' => '24',
                                        'Type' => 'Const'
                                      },
                          '171365' => {
                                        'Line' => '30',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'record_count',
                                                             'offset' => '0',
                                                             'type' => '152'
                                                           },
                                                    '1' => {
                                                             'name' => 'size',
                                                             'offset' => '4',
                                                             'type' => '152'
                                                           },
                                                    '2' => {
                                                             'name' => 'first',
                                                             'offset' => '8',
                                                             'type' => '172792'
                                                           },
                                                    '3' => {
                                                             'name' => 'last',
                                                             'offset' => '22',
                                                             'type' => '172792'
                                                           }
                                                  },
                                        'Name' => 'struct pldm_pdr',
                                        'PrivateABI' => 1,
                                        'Size' => '24',
                                        'Source' => 'pdr.c',
                                        'Type' => 'Struct'
                                      },
                          '171431' => {
                                        'BaseType' => '171448',
                                        'Header' => 'pdr.h',
                                        'Line' => '21',
                                        'Name' => 'pldm_pdr_record',
                                        'PrivateABI' => 1,
                                        'Size' => '32',
                                        'Type' => 'Typedef'
                                      },
                          '171443' => {
                                        'BaseType' => '171431',
                                        'Name' => 'pldm_pdr_record const',
                                        'Size' => '32',
                                        'Type' => 'Const'
                                      },
                          '171448' => {
                                        'Line' => '21',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'record_handle',
                                                             'offset' => '0',
                                                             'type' => '152'
                                                           },
                                                    '1' => {
                                                             'name' => 'size',
                                                             'offset' => '4',
                                                             'type' => '152'
                                                           },
                                                    '2' => {
                                                             'name' => 'data',
                                                             'offset' => '8',
                                                             'type' => '1585'
                                                           },
                                                    '3' => {
                                                             'name' => 'next',
                                                             'offset' => '22',
                                                             'type' => '172780'
                                                           },
                                                    '4' => {
                                                             'name' => 'is_remote',
                                                             'offset' => '36',
                                                             'type' => '5527'
                                                           },
                                                    '5' => {
                                                             'name' => 'terminus_handle',
                                                             'offset' => '38',
                                                             'type' => '5733'
                                                           }
                                                  },
                                        'Name' => 'struct pldm_pdr_record',
                                        'PrivateABI' => 1,
                                        'Size' => '32',
                                        'Source' => 'pdr.c',
                                        'Type' => 'Struct'
                                      },
                          '171540' => {
                                        'Header' => 'pdr.h',
                                        'Line' => '327',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'entity_type',
                                                             'offset' => '0',
                                                             'type' => '5733'
                                                           },
                                                    '1' => {
                                                             'name' => 'entity_instance_num',
                                                             'offset' => '2',
                                                             'type' => '5733'
                                                           },
                                                    '2' => {
                                                             'name' => 'entity_container_id',
                                                             'offset' => '4',
                                                             'type' => '5733'
                                                           }
                                                  },
                                        'Name' => 'struct pldm_entity',
                                        'Size' => '6',
                                        'Type' => 'Struct'
                                      },
                          '171602' => {
                                        'BaseType' => '171540',
                                        'Header' => 'pdr.h',
                                        'Line' => '331',
                                        'Name' => 'pldm_entity',
                                        'Size' => '6',
                                        'Type' => 'Typedef'
                                      },
                          '171614' => {
                                        'BaseType' => '171602',
                                        'Name' => 'pldm_entity const',
                                        'Size' => '6',
                                        'Type' => 'Const'
                                      },
                          '171648' => {
                                        'BaseType' => '171660',
                                        'Header' => 'pdr.h',
                                        'Line' => '341',
                                        'Name' => 'pldm_entity_association_tree',
                                        'PrivateABI' => 1,
                                        'Size' => '16',
                                        'Type' => 'Typedef'
                                      },
                          '171660' => {
                                        'Line' => '647',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'root',
                                                             'offset' => '0',
                                                             'type' => '172797'
                                                           },
                                                    '1' => {
                                                             'name' => 'last_used_container_id',
                                                             'offset' => '8',
                                                             'type' => '5733'
                                                           }
                                                  },
                                        'Name' => 'struct pldm_entity_association_tree',
                                        'PrivateABI' => 1,
                                        'Size' => '16',
                                        'Source' => 'pdr.c',
                                        'Type' => 'Struct'
                                      },
                          '171703' => {
                                        'BaseType' => '171720',
                                        'Header' => 'pdr.h',
                                        'Line' => '346',
                                        'Name' => 'pldm_entity_node',
                                        'PrivateABI' => 1,
                                        'Size' => '40',
                                        'Type' => 'Typedef'
                                      },
                          '171715' => {
                                        'BaseType' => '171703',
                                        'Name' => 'pldm_entity_node const',
                                        'Size' => '40',
                                        'Type' => 'Const'
                                      },
                          '171720' => {
                                        'Line' => '652',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'entity',
                                                             'offset' => '0',
                                                             'type' => '171602'
                                                           },
                                                    '1' => {
                                                             'name' => 'parent',
                                                             'offset' => '6',
                                                             'type' => '171602'
                                                           },
                                                    '2' => {
                                                             'name' => 'remote_container_id',
                                                             'offset' => '18',
                                                             'type' => '5733'
                                                           },
                                                    '3' => {
                                                             'name' => 'first_child',
                                                             'offset' => '22',
                                                             'type' => '172797'
                                                           },
                                                    '4' => {
                                                             'name' => 'next_sibling',
                                                             'offset' => '36',
                                                             'type' => '172797'
                                                           },
                                                    '5' => {
                                                             'name' => 'association_type',
                                                             'offset' => '50',
                                                             'type' => '140'
                                                           }
                                                  },
                                        'Name' => 'struct pldm_entity_node',
                                        'PrivateABI' => 1,
                                        'Size' => '40',
                                        'Source' => 'pdr.c',
                                        'Type' => 'Struct'
                                      },
                          '171998' => {
                                        'Header' => 'platform.h',
                                        'Line' => '575',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'record_handle',
                                                             'offset' => '0',
                                                             'type' => '152'
                                                           },
                                                    '1' => {
                                                             'name' => 'version',
                                                             'offset' => '4',
                                                             'type' => '140'
                                                           },
                                                    '2' => {
                                                             'name' => 'type',
                                                             'offset' => '5',
                                                             'type' => '140'
                                                           },
                                                    '3' => {
                                                             'name' => 'record_change_num',
                                                             'offset' => '6',
                                                             'type' => '5733'
                                                           },
                                                    '4' => {
                                                             'name' => 'length',
                                                             'offset' => '8',
                                                             'type' => '5733'
                                                           }
                                                  },
                                        'Name' => 'struct pldm_pdr_hdr',
                                        'Size' => '10',
                                        'Type' => 'Struct'
                                      },
                          '172447' => {
                                        'Header' => 'platform.h',
                                        'Line' => '650',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'hdr',
                                                             'offset' => '0',
                                                             'type' => '171998'
                                                           },
                                                    '1' => {
                                                             'name' => 'terminus_handle',
                                                             'offset' => '16',
                                                             'type' => '5733'
                                                           },
                                                    '2' => {
                                                             'name' => 'sensor_id',
                                                             'offset' => '18',
                                                             'type' => '5733'
                                                           },
                                                    '3' => {
                                                             'name' => 'entity_type',
                                                             'offset' => '20',
                                                             'type' => '5733'
                                                           },
                                                    '4' => {
                                                             'name' => 'entity_instance',
                                                             'offset' => '22',
                                                             'type' => '5733'
                                                           },
                                                    '5' => {
                                                             'name' => 'container_id',
                                                             'offset' => '24',
                                                             'type' => '5733'
                                                           },
                                                    '6' => {
                                                             'name' => 'sensor_init',
                                                             'offset' => '32',
                                                             'type' => '140'
                                                           },
                                                    '7' => {
                                                             'name' => 'sensor_auxiliary_names_pdr',
                                                             'offset' => '33',
                                                             'type' => '61253'
                                                           },
                                                    '8' => {
                                                             'name' => 'composite_sensor_count',
                                                             'offset' => '34',
                                                             'type' => '140'
                                                           },
                                                    '9' => {
                                                             'name' => 'possible_states',
                                                             'offset' => '35',
                                                             'type' => '1057'
                                                           }
                                                  },
                                        'Name' => 'struct pldm_state_sensor_pdr',
                                        'Size' => '24',
                                        'Type' => 'Struct'
                                      },
                          '172601' => {
                                        'Header' => 'platform.h',
                                        'Line' => '677',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'hdr',
                                                             'offset' => '0',
                                                             'type' => '171998'
                                                           },
                                                    '1' => {
                                                             'name' => 'terminus_handle',
                                                             'offset' => '16',
                                                             'type' => '5733'
                                                           },
                                                    '2' => {
                                                             'name' => 'effecter_id',
                                                             'offset' => '18',
                                                             'type' => '5733'
                                                           },
                                                    '3' => {
                                                             'name' => 'entity_type',
                                                             'offset' => '20',
                                                             'type' => '5733'
                                                           },
                                                    '4' => {
                                                             'name' => 'entity_instance',
                                                             'offset' => '22',
                                                             'type' => '5733'
                                                           },
                                                    '5' => {
                                                             'name' => 'container_id',
                                                             'offset' => '24',
                                                             'type' => '5733'
                                                           },
                                                    '6' => {
                                                             'name' => 'effecter_semantic_id',
                                                             'offset' => '32',
                                                             'type' => '5733'
                                                           },
                                                    '7' => {
                                                             'name' => 'effecter_init',
                                                             'offset' => '34',
                                                             'type' => '140'
                                                           },
                                                    '8' => {
                                                             'name' => 'has_description_pdr',
                                                             'offset' => '35',
                                                             'type' => '61253'
                                                           },
                                                    '9' => {
                                                             'name' => 'composite_effecter_count',
                                                             'offset' => '36',
                                                             'type' => '140'
                                                           },
                                                    '10' => {
                                                              'name' => 'possible_states',
                                                              'offset' => '37',
                                                              'type' => '1057'
                                                            }
                                                  },
                                        'Name' => 'struct pldm_state_effecter_pdr',
                                        'Size' => '26',
                                        'Type' => 'Struct'
                                      },
                          '172780' => {
                                        'BaseType' => '171448',
                                        'Name' => 'struct pldm_pdr_record*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '172792' => {
                                        'BaseType' => '171431',
                                        'Name' => 'pldm_pdr_record*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '172797' => {
                                        'BaseType' => '171703',
                                        'Name' => 'pldm_entity_node*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '173164' => {
                                        'BaseType' => '171648',
                                        'Name' => 'pldm_entity_association_tree*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '173169' => {
                                        'BaseType' => '171614',
                                        'Name' => 'pldm_entity const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '174291' => {
                                        'BaseType' => '171348',
                                        'Name' => 'pldm_pdr*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '175584' => {
                                        'BaseType' => '171443',
                                        'Name' => 'pldm_pdr_record const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '182692' => {
                                        'BaseType' => '171602',
                                        'Name' => 'pldm_entity*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '198648' => {
                                        'BaseType' => '182692',
                                        'Name' => 'pldm_entity**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '199295' => {
                                        'BaseType' => '172797',
                                        'Name' => 'pldm_entity_node**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '200084' => {
                                        'BaseType' => '171360',
                                        'Name' => 'pldm_pdr const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '205557' => {
                                        'BaseType' => '171715',
                                        'Name' => 'pldm_entity_node const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '211337' => {
                                        'BaseType' => '172601',
                                        'Name' => 'struct pldm_state_effecter_pdr*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '216223' => {
                                        'BaseType' => '172447',
                                        'Name' => 'struct pldm_state_sensor_pdr*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '220888' => {
                                        'BaseType' => '93',
                                        'Header' => 'types.h',
                                        'Line' => '37',
                                        'Name' => '__int8_t',
                                        'PrivateABI' => 1,
                                        'Size' => '1',
                                        'Type' => 'Typedef'
                                      },
                          '220919' => {
                                        'BaseType' => '112',
                                        'Header' => 'types.h',
                                        'Line' => '39',
                                        'Name' => '__int16_t',
                                        'PrivateABI' => 1,
                                        'Size' => '2',
                                        'Type' => 'Typedef'
                                      },
                          '220950' => {
                                        'BaseType' => '58',
                                        'Header' => 'types.h',
                                        'Line' => '41',
                                        'Name' => '__int32_t',
                                        'PrivateABI' => 1,
                                        'Size' => '4',
                                        'Type' => 'Typedef'
                                      },
                          '220988' => {
                                        'BaseType' => '5654',
                                        'Header' => 'types.h',
                                        'Line' => '55',
                                        'Name' => '__uint_least16_t',
                                        'PrivateABI' => 1,
                                        'Size' => '2',
                                        'Type' => 'Typedef'
                                      },
                          '221041' => {
                                        'BaseType' => '220888',
                                        'Header' => 'stdint-intn.h',
                                        'Line' => '24',
                                        'Name' => 'int8_t',
                                        'PrivateABI' => 1,
                                        'Size' => '1',
                                        'Type' => 'Typedef'
                                      },
                          '221053' => {
                                        'BaseType' => '220919',
                                        'Header' => 'stdint-intn.h',
                                        'Line' => '25',
                                        'Name' => 'int16_t',
                                        'PrivateABI' => 1,
                                        'Size' => '2',
                                        'Type' => 'Typedef'
                                      },
                          '221065' => {
                                        'BaseType' => '220950',
                                        'Header' => 'stdint-intn.h',
                                        'Line' => '26',
                                        'Name' => 'int32_t',
                                        'PrivateABI' => 1,
                                        'Size' => '4',
                                        'Type' => 'Typedef'
                                      },
                          '221682' => {
                                        'BaseType' => '449',
                                        'Header' => 'pldm_types.h',
                                        'Line' => '164',
                                        'Name' => 'real32_t',
                                        'Size' => '4',
                                        'Type' => 'Typedef'
                                      },
                          '222481' => {
                                        'BaseType' => '220988',
                                        'Header' => 'uchar.h',
                                        'Line' => '51',
                                        'Name' => 'char16_t',
                                        'PrivateABI' => 1,
                                        'Size' => '2',
                                        'Type' => 'Typedef'
                                      },
                          '222758' => {
                                        'Header' => 'platform.h',
                                        'Line' => '202',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'PLDM_NO_EVENT_GENERATION',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'PLDM_EVENTS_DISABLED',
                                                             'value' => '1'
                                                           },
                                                    '2' => {
                                                             'name' => 'PLDM_EVENTS_ENABLED',
                                                             'value' => '2'
                                                           },
                                                    '3' => {
                                                             'name' => 'PLDM_OP_EVENTS_ONLY_ENABLED',
                                                             'value' => '3'
                                                           },
                                                    '4' => {
                                                             'name' => 'PLDM_STATE_EVENTS_ONLY_ENABLED',
                                                             'value' => '4'
                                                           }
                                                  },
                                        'Name' => 'enum pldm_sensor_event_message_enable',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '223360' => {
                                        'Header' => 'platform.h',
                                        'Line' => '344',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'PLDM_SENSOR_OP_STATE',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'PLDM_STATE_SENSOR_STATE',
                                                             'value' => '1'
                                                           },
                                                    '2' => {
                                                             'name' => 'PLDM_NUMERIC_SENSOR_STATE',
                                                             'value' => '2'
                                                           }
                                                  },
                                        'Name' => 'enum sensor_event_class_states',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '223394' => {
                                        'BaseType' => '223360',
                                        'Name' => 'enum sensor_event_class_states const',
                                        'Size' => '4',
                                        'Type' => 'Const'
                                      },
                          '223399' => {
                                        'Header' => 'platform.h',
                                        'Line' => '366',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'PLDM_SET_SENSOR_ENABLED',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'PLDM_SET_SENSOR_DISABLED',
                                                             'value' => '1'
                                                           },
                                                    '2' => {
                                                             'name' => 'PLDM_SET_SENSOR_UNAVAILABLE',
                                                             'value' => '2'
                                                           }
                                                  },
                                        'Name' => 'enum pldm_set_sensor_operational_state',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '223890' => {
                                        'Header' => 'platform.h',
                                        'Line' => '667',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'state_set_id',
                                                             'offset' => '0',
                                                             'type' => '5733'
                                                           },
                                                    '1' => {
                                                             'name' => 'possible_states_size',
                                                             'offset' => '2',
                                                             'type' => '140'
                                                           },
                                                    '2' => {
                                                             'name' => 'states',
                                                             'offset' => '3',
                                                             'type' => '223952'
                                                           }
                                                  },
                                        'Name' => 'struct state_sensor_possible_states',
                                        'Size' => '4',
                                        'Type' => 'Struct'
                                      },
                          '223947' => {
                                        'BaseType' => '223890',
                                        'Name' => 'struct state_sensor_possible_states const',
                                        'Size' => '4',
                                        'Type' => 'Const'
                                      },
                          '223952' => {
                                        'BaseType' => '349',
                                        'Name' => 'bitfield8_t[1]',
                                        'Size' => '1',
                                        'Type' => 'Array'
                                      },
                          '224218' => {
                                        'Header' => 'platform.h',
                                        'Line' => '752',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'value_u8',
                                                             'offset' => '0',
                                                             'type' => '140'
                                                           },
                                                    '1' => {
                                                             'name' => 'value_s8',
                                                             'offset' => '0',
                                                             'type' => '221041'
                                                           },
                                                    '2' => {
                                                             'name' => 'value_u16',
                                                             'offset' => '0',
                                                             'type' => '5733'
                                                           },
                                                    '3' => {
                                                             'name' => 'value_s16',
                                                             'offset' => '0',
                                                             'type' => '221053'
                                                           },
                                                    '4' => {
                                                             'name' => 'value_u32',
                                                             'offset' => '0',
                                                             'type' => '152'
                                                           },
                                                    '5' => {
                                                             'name' => 'value_s32',
                                                             'offset' => '0',
                                                             'type' => '221065'
                                                           }
                                                  },
                                        'Name' => 'union union_effecter_data_size',
                                        'Size' => '4',
                                        'Type' => 'Union'
                                      },
                          '224325' => {
                                        'Header' => 'platform.h',
                                        'Line' => '768',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'value_u8',
                                                             'offset' => '0',
                                                             'type' => '140'
                                                           },
                                                    '1' => {
                                                             'name' => 'value_s8',
                                                             'offset' => '0',
                                                             'type' => '221041'
                                                           },
                                                    '2' => {
                                                             'name' => 'value_u16',
                                                             'offset' => '0',
                                                             'type' => '5733'
                                                           },
                                                    '3' => {
                                                             'name' => 'value_s16',
                                                             'offset' => '0',
                                                             'type' => '221053'
                                                           },
                                                    '4' => {
                                                             'name' => 'value_u32',
                                                             'offset' => '0',
                                                             'type' => '152'
                                                           },
                                                    '5' => {
                                                             'name' => 'value_s32',
                                                             'offset' => '0',
                                                             'type' => '221065'
                                                           },
                                                    '6' => {
                                                             'name' => 'value_f32',
                                                             'offset' => '0',
                                                             'type' => '221682'
                                                           }
                                                  },
                                        'Name' => 'union union_range_field_format',
                                        'Size' => '4',
                                        'Type' => 'Union'
                                      },
                          '224338' => {
                                        'Header' => 'platform.h',
                                        'Line' => '774',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'hdr',
                                                             'offset' => '0',
                                                             'type' => '171998'
                                                           },
                                                    '1' => {
                                                             'name' => 'terminus_handle',
                                                             'offset' => '16',
                                                             'type' => '5733'
                                                           },
                                                    '2' => {
                                                             'name' => 'effecter_id',
                                                             'offset' => '18',
                                                             'type' => '5733'
                                                           },
                                                    '3' => {
                                                             'name' => 'entity_type',
                                                             'offset' => '20',
                                                             'type' => '5733'
                                                           },
                                                    '4' => {
                                                             'name' => 'entity_instance',
                                                             'offset' => '22',
                                                             'type' => '5733'
                                                           },
                                                    '5' => {
                                                             'name' => 'container_id',
                                                             'offset' => '24',
                                                             'type' => '5733'
                                                           },
                                                    '6' => {
                                                             'name' => 'effecter_semantic_id',
                                                             'offset' => '32',
                                                             'type' => '5733'
                                                           },
                                                    '7' => {
                                                             'name' => 'effecter_init',
                                                             'offset' => '34',
                                                             'type' => '140'
                                                           },
                                                    '8' => {
                                                             'name' => 'effecter_auxiliary_names',
                                                             'offset' => '35',
                                                             'type' => '61253'
                                                           },
                                                    '9' => {
                                                             'name' => 'base_unit',
                                                             'offset' => '36',
                                                             'type' => '140'
                                                           },
                                                    '10' => {
                                                              'name' => 'unit_modifier',
                                                              'offset' => '37',
                                                              'type' => '221041'
                                                            },
                                                    '11' => {
                                                              'name' => 'rate_unit',
                                                              'offset' => '38',
                                                              'type' => '140'
                                                            },
                                                    '12' => {
                                                              'name' => 'base_oem_unit_handle',
                                                              'offset' => '39',
                                                              'type' => '140'
                                                            },
                                                    '13' => {
                                                              'name' => 'aux_unit',
                                                              'offset' => '40',
                                                              'type' => '140'
                                                            },
                                                    '14' => {
                                                              'name' => 'aux_unit_modifier',
                                                              'offset' => '41',
                                                              'type' => '221041'
                                                            },
                                                    '15' => {
                                                              'name' => 'aux_rate_unit',
                                                              'offset' => '48',
                                                              'type' => '140'
                                                            },
                                                    '16' => {
                                                              'name' => 'aux_oem_unit_handle',
                                                              'offset' => '49',
                                                              'type' => '140'
                                                            },
                                                    '17' => {
                                                              'name' => 'is_linear',
                                                              'offset' => '50',
                                                              'type' => '61253'
                                                            },
                                                    '18' => {
                                                              'name' => 'effecter_data_size',
                                                              'offset' => '51',
                                                              'type' => '140'
                                                            },
                                                    '19' => {
                                                              'name' => 'resolution',
                                                              'offset' => '52',
                                                              'type' => '221682'
                                                            },
                                                    '20' => {
                                                              'name' => 'offset',
                                                              'offset' => '56',
                                                              'type' => '221682'
                                                            },
                                                    '21' => {
                                                              'name' => 'accuracy',
                                                              'offset' => '66',
                                                              'type' => '5733'
                                                            },
                                                    '22' => {
                                                              'name' => 'plus_tolerance',
                                                              'offset' => '68',
                                                              'type' => '140'
                                                            },
                                                    '23' => {
                                                              'name' => 'minus_tolerance',
                                                              'offset' => '69',
                                                              'type' => '140'
                                                            },
                                                    '24' => {
                                                              'name' => 'state_transition_interval',
                                                              'offset' => '70',
                                                              'type' => '221682'
                                                            },
                                                    '25' => {
                                                              'name' => 'transition_interval',
                                                              'offset' => '80',
                                                              'type' => '221682'
                                                            },
                                                    '26' => {
                                                              'name' => 'max_settable',
                                                              'offset' => '84',
                                                              'type' => '224218'
                                                            },
                                                    '27' => {
                                                              'name' => 'min_settable',
                                                              'offset' => '88',
                                                              'type' => '224218'
                                                            },
                                                    '28' => {
                                                              'name' => 'range_field_format',
                                                              'offset' => '98',
                                                              'type' => '140'
                                                            },
                                                    '29' => {
                                                              'name' => 'range_field_support',
                                                              'offset' => '99',
                                                              'type' => '349'
                                                            },
                                                    '30' => {
                                                              'name' => 'nominal_value',
                                                              'offset' => '100',
                                                              'type' => '224325'
                                                            },
                                                    '31' => {
                                                              'name' => 'normal_max',
                                                              'offset' => '104',
                                                              'type' => '224325'
                                                            },
                                                    '32' => {
                                                              'name' => 'normal_min',
                                                              'offset' => '114',
                                                              'type' => '224325'
                                                            },
                                                    '33' => {
                                                              'name' => 'rated_max',
                                                              'offset' => '118',
                                                              'type' => '224325'
                                                            },
                                                    '34' => {
                                                              'name' => 'rated_min',
                                                              'offset' => '128',
                                                              'type' => '224325'
                                                            }
                                                  },
                                        'Name' => 'struct pldm_numeric_effecter_value_pdr',
                                        'Size' => '84',
                                        'Type' => 'Struct'
                                      },
                          '224924' => {
                                        'Header' => 'platform.h',
                                        'Line' => '825',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'value_u8',
                                                             'offset' => '0',
                                                             'type' => '140'
                                                           },
                                                    '1' => {
                                                             'name' => 'value_s8',
                                                             'offset' => '0',
                                                             'type' => '221041'
                                                           },
                                                    '2' => {
                                                             'name' => 'value_u16',
                                                             'offset' => '0',
                                                             'type' => '5733'
                                                           },
                                                    '3' => {
                                                             'name' => 'value_s16',
                                                             'offset' => '0',
                                                             'type' => '221053'
                                                           },
                                                    '4' => {
                                                             'name' => 'value_u32',
                                                             'offset' => '0',
                                                             'type' => '152'
                                                           },
                                                    '5' => {
