$VAR1 = {
  'ABI_DUMPER_VERSION' => '1.2',
  'ABI_DUMP_VERSION' => '3.5',
  'Arch' => 'x86_64',
  'GccVersion' => '14.2.0',
  'Headers' => {
    'af-mctp.h' => 1,
    'base.h' => 1,
    'bios.h' => 1,
    'bios_table.h' => 1,
    'file_io.h' => 1,
    'firmware_update.h' => 1,
    'fru.h' => 1,
    'host.h' => 1,
    'instance-id.h' => 1,
    'mctp-demux.h' => 1,
    'pdr.h' => 1,
    'platform.h' => 1,
    'pldm.h' => 1,
    'pldm_types.h' => 1,
    'transport.h' => 1,
    'utils.h' => 1
  },
  'Language' => 'C',
  'LibraryName' => 'libpldm.so.0.13.0',
  'LibraryVersion' => '0.13.0',
  'NameSpaces' => {},
  'Needed' => {
    'libc.so.6' => 1
  },
  'PublicABI' => '1',
  'Sources' => {
    'af-mctp.c' => 1,
    'bios_table.c' => 1,
    'instance-id.c' => 1,
    'mctp-demux.c' => 1,
    'pdr.c' => 1
  },
  'SymbolInfo' => {
    '1376' => {
      'Header' => 'base.h',
      'Line' => '744',
      'Param' => {
        '0' => {
          'name' => 'instance_id',
          'type' => '135'
        },
        '1' => {
          'name' => 'type',
          'type' => '135'
        },
        '2' => {
          'name' => 'command',
          'type' => '135'
        },
        '3' => {
          'name' => 'cc',
          'type' => '135'
        },
        '4' => {
          'name' => 'msg',
          'type' => '1418'
        }
      },
      'Return' => '53',
      'ShortName' => 'encode_cc_only_resp'
    },
    '1423' => {
      'Header' => 'base.h',
      'Line' => '585',

      'pldm_entity_association_pdr_extract' => 1,
      'pldm_entity_association_tree_add' => 1,
      'pldm_entity_association_tree_add_entity' => 1,
      'pldm_entity_association_tree_copy_root' => 1,
      'pldm_entity_association_tree_destroy' => 1,
      'pldm_entity_association_tree_destroy_root' => 1,
      'pldm_entity_association_tree_find' => 1,
      'pldm_entity_association_tree_find_with_locality' => 1,
      'pldm_entity_association_tree_init' => 1,
      'pldm_entity_association_tree_visit' => 1,
      'pldm_entity_extract' => 1,
      'pldm_entity_get_num_children' => 1,
      'pldm_entity_get_parent' => 1,
      'pldm_entity_is_exist_parent' => 1,
      'pldm_entity_is_node_parent' => 1,
      'pldm_entity_node_get_remote_container_id' => 1,
      'pldm_find_entity_ref_in_tree' => 1,
      'pldm_instance_db_destroy' => 1,
      'pldm_instance_db_init' => 1,
      'pldm_instance_db_init_default' => 1,
      'pldm_instance_id_alloc' => 1,
      'pldm_instance_id_free' => 1,
      'pldm_is_current_parent_child' => 1,
      'pldm_is_empty_entity_assoc_tree' => 1,
      'pldm_msg_hdr_correlate_response' => 1,
      'pldm_oem_meta_file_io_read_resp_data' => 1,
      'pldm_oem_meta_file_io_write_req_data' => 1,
      'pldm_package_component_image_information_iter_init' => 1,
      'pldm_package_downstream_device_id_record_iter_init' => 1,
      'pldm_package_firmware_device_id_record_iter_init' => 1,
      'pldm_pdr_add' => 1,
      'pldm_pdr_add_fru_record_set' => 1,
      'pldm_pdr_delete_by_record_handle' => 1,
      'pldm_pdr_destroy' => 1,
      'pldm_pdr_find_last_in_range' => 1,
      'pldm_pdr_find_record' => 1,
      'pldm_pdr_find_record_by_type' => 1,
      'pldm_pdr_fru_record_set_find_by_rsi' => 1,
      'pldm_pdr_get_next_record' => 1,
      'pldm_pdr_get_record_count' => 1,
      'pldm_pdr_get_record_handle' => 1,
      'pldm_pdr_get_repo_size' => 1,
      'pldm_pdr_init' => 1,
      'pldm_pdr_record_is_remote' => 1,
      'pldm_pdr_remove_pdrs_by_terminus_handle' => 1,
      'pldm_pdr_remove_remote_pdrs' => 1,
      'pldm_pdr_update_TL_pdr' => 1,
      'pldm_platform_cper_event_event_data' => 1,
      'pldm_transport_af_mctp_bind' => 1,
      'pldm_transport_af_mctp_core' => 1,
      'pldm_transport_af_mctp_destroy' => 1,
      'pldm_transport_af_mctp_init' => 1,
      'pldm_transport_af_mctp_init_pollfd' => 1,
      'pldm_transport_af_mctp_map_tid' => 1,
      'pldm_transport_af_mctp_unmap_tid' => 1,
      'pldm_transport_mctp_demux_core' => 1,
      'pldm_transport_mctp_demux_destroy' => 1,
      'pldm_transport_mctp_demux_init' => 1,
      'pldm_transport_mctp_demux_init_pollfd' => 1,
      'pldm_transport_mctp_demux_map_tid' => 1,
      'pldm_transport_mctp_demux_unmap_tid' => 1,
      'pldm_transport_poll' => 1,
      'pldm_transport_recv_msg' => 1,
      'pldm_transport_send_msg' => 1,
      'pldm_transport_send_recv_msg' => 1,
      'unpack_pldm_header' => 1,
      'ver2str' => 1
    }
  },
  'Target' => 'unix',
  'TypeInfo' => {
    '1' => {
      'Name' => 'void',
      'Type' => 'Intrinsic'
    },
    '46' => {
      'Name' => 'char',
      'Size' => '1',
      'Type' => 'Intrinsic'
    },
    '53' => {
      'Name' => 'int',
      'Size' => '4',
      'Type' => 'Intrinsic'
    },
    '60' => {
      'Name' => 'unsigned char',
      'Size' => '1',
      'Type' => 'Intrinsic'
    },
    '67' => {
      'Name' => 'unsigned short',
      'Size' => '2',
      'Type' => 'Intrinsic'
    },
    '74' => {
      'Name' => 'unsigned int',
      'Size' => '4',
      'Type' => 'Intrinsic'
    },
    '81' => {
      'Name' => 'unsigned long',
      'Size' => '8',
      'Type' => 'Intrinsic'
    },
    '88' => {
      'Name' => 'signed char',
      'Size' => '1',
      'Type' => 'Intrinsic'
    },
    '95' => {
      'BaseType' => '60',
      'Header' => 'types.h',
      'Line' => '38',
      'Name' => '__uint8_t',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '107' => {
      'Name' => 'short',
      'Size' => '2',
      'Type' => 'Intrinsic'
    },
    '114' => {
      'BaseType' => '74',
      'Header' => 'types.h',
      'Line' => '42',
      'Name' => '__uint32_t',
      'PrivateABI' => 1,
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '126' => {
      'Name' => 'long',
      'Size' => '8',
      'Type' => 'Intrinsic'
    },
    '133' => {
      'BaseType' => '1',
      'Name' => 'void*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '135' => {
      'BaseType' => '95',
      'Header' => 'stdint-uintn.h',
      'Line' => '24',
      'Name' => 'uint8_t',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '147' => {
      'BaseType' => '114',
      'Header' => 'stdint-uintn.h',
      'Line' => '26',
      'Name' => 'uint32_t',
      'PrivateABI' => 1,
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '159' => {
      'BaseType' => '147',
      'Name' => 'uint32_t const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '164' => {
      'BaseType' => '81',
      'Header' => 'stddef.h',
      'Line' => '214',
      'Name' => 'size_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '190' => {
      'Header' => 'pldm_types.h',
      'Line' => '9',
      'Name' => 'anon-struct-pldm_types.h-9',
      'Size' => '1',
      'Type' => 'Struct'
    },
    '344' => {
      'Header' => 'pldm_types.h',
      'Line' => '19',
      'Memb' => {
        '0' => {
          'name' => 'byte',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'bits',
          'offset' => '0',
          'type' => '190'
        }
      },
      'Name' => 'union bitfield8_t',
      'Size' => '1',
      'Type' => 'Union'
    },
    '356' => {
      'BaseType' => '344',
      'Name' => 'bitfield8_t const',
      'Size' => '1',
      'Type' => 'Const'
    },
    '361' => {
      'Header' => 'pldm_types.h',
      'Line' => '25',
      'Memb' => {
        '0' => {
          'name' => 'alpha',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'update',
          'offset' => '1',
          'type' => '135'
        },
        '2' => {
          'name' => 'minor',
          'offset' => '2',
          'type' => '135'
        },
        '3' => {
          'name' => 'major',
          'offset' => '3',
          'type' => '135'
        }
      },
      'Name' => 'struct pldm_version',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '427' => {
      'BaseType' => '361',
      'Header' => 'pldm_types.h',
      'Line' => '30',
      'Name' => 'ver32_t',
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '439' => {
      'BaseType' => '427',
      'Name' => 'ver32_t const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '444' => {
      'Name' => 'float',
      'Size' => '4',
      'Type' => 'Intrinsic'
    },
    '801' => {
      'Header' => 'base.h',
      'Line' => '109',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_RESPONSE',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_REQUEST',
          'value' => '1'
        },
        '2' => {
          'name' => 'PLDM_RESERVED',
          'value' => '2'
        },
        '3' => {
          'name' => 'PLDM_ASYNC_REQUEST_NOTIFY',
          'value' => '3'
        }
      },
      'Name' => 'enum MessageType',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '813' => {
      'Header' => 'base.h',
      'Line' => '162',
      'Memb' => {
        '0' => {
          'name' => 'command',
          'offset' => '2',
          'type' => '135'
        }
      },
      'Name' => 'struct pldm_msg_hdr',
      'Size' => '3',
      'Type' => 'Struct'
    },
    '924' => {
      'BaseType' => '813',
      'Name' => 'struct pldm_msg_hdr const',
      'Size' => '3',
      'Type' => 'Const'
    },
    '929' => {
      'Header' => 'base.h',
      'Line' => '195',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '813'
        },
        '1' => {
          'name' => 'payload',
          'offset' => '3',
          'type' => '974'
        }
      },
      'Name' => 'struct pldm_msg',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '969' => {
      'BaseType' => '929',
      'Name' => 'struct pldm_msg const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '974' => {
      'BaseType' => '135',
      'Name' => 'uint8_t[1]',
      'Size' => '1',
      'Type' => 'Array'
    },
    '990' => {
      'Header' => 'base.h',
      'Line' => '262',
      'Memb' => {
        '0' => {
          'name' => 'msg_type',
          'offset' => '0',
          'type' => '801'
        },
        '1' => {
          'name' => 'instance',
          'offset' => '4',
          'type' => '135'
        },
        '2' => {
          'name' => 'pldm_type',
          'offset' => '5',
          'type' => '135'
        },
        '3' => {
          'name' => 'command',
          'offset' => '6',
          'type' => '135'
        },
        '4' => {
          'name' => 'completion_code',
          'offset' => '7',
          'type' => '135'
        }
      },
      'Name' => 'struct pldm_header_info',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '1070' => {
      'BaseType' => '990',
      'Name' => 'struct pldm_header_info const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '1237' => {
      'BaseType' => '1242',
      'Name' => 'void const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '1242' => {
      'BaseType' => '1',
      'Name' => 'void const',
      'Type' => 'Const'
    },
    '1243' => {
      'BaseType' => '356',
      'Name' => 'bitfield8_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '1418' => {
      'BaseType' => '929',
      'Name' => 'struct pldm_msg*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '1497' => {
      'BaseType' => '969',
      'Name' => 'struct pldm_msg const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '1502' => {
      'BaseType' => '135',
      'Name' => 'uint8_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '1507' => {
      'BaseType' => '427',
      'Name' => 'ver32_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '1601' => {
      'BaseType' => '439',
      'Name' => 'ver32_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '1648' => {
      'BaseType' => '147',
      'Name' => 'uint32_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '1717' => {
      'BaseType' => '924',
      'Name' => 'struct pldm_msg_hdr const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '1722' => {
      'BaseType' => '990',
      'Name' => 'struct pldm_header_info*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '2677' => {
      'BaseType' => '164',
      'Name' => 'size_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '3137' => {
      'BaseType' => '1070',
      'Name' => 'struct pldm_header_info const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '4809' => {
      'BaseType' => '135',
      'Header' => 'base.h',
      'Line' => '19',
      'Name' => 'pldm_tid_t',
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '4821' => {
      'BaseType' => '135',
      'Header' => 'instance-id.h',
      'Line' => '13',
      'Name' => 'pldm_instance_id_t',
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '4833' => {
      'Header' => 'responder.h',
      'Line' => '10',
      'Memb' => {
        '0' => {
          'name' => 'tid',
          'offset' => '0',
          'type' => '4809'
        },
        '1' => {
          'name' => 'instance_id',
          'offset' => '1',
          'type' => '4821'
        },
        '2' => {
          'name' => 'type',
          'offset' => '2',
          'type' => '135'
        },
        '3' => {
          'name' => 'command',
          'offset' => '3',
          'type' => '135'
        },
        '4' => {
          'name' => 'next',
          'offset' => '8',
          'type' => '4913'
        }
      },
      'Name' => 'struct pldm_responder_cookie',
      'PrivateABI' => 1,
      'Size' => '16',
      'Type' => 'Struct'
    },
    '4913' => {
      'BaseType' => '4833',
      'Name' => 'struct pldm_responder_cookie*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '4918' => {
      'Header' => 'pldm.h',
      'Line' => '15',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_REQUESTER_SUCCESS',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_REQUESTER_OPEN_FAIL',
          'value' => '18446744073709551615 (-1)'
        },
        '2' => {
          'name' => 'PLDM_REQUESTER_NOT_PLDM_MSG',
          'value' => '18446744073709551614 (-2)'
        },
        '3' => {
          'name' => 'PLDM_REQUESTER_NOT_RESP_MSG',
          'value' => '18446744073709551613 (-3)'
        },
        '4' => {
          'name' => 'PLDM_REQUESTER_NOT_REQ_MSG',
          'value' => '18446744073709551612 (-4)'
        },
        '5' => {
          'name' => 'PLDM_REQUESTER_RESP_MSG_TOO_SMALL',
          'value' => '18446744073709551611 (-5)'
        },
        '6' => {
          'name' => 'PLDM_REQUESTER_INSTANCE_ID_MISMATCH',
          'value' => '18446744073709551610 (-6)'
        },
        '7' => {
          'name' => 'PLDM_REQUESTER_SEND_FAIL',
          'value' => '18446744073709551609 (-7)'
        },
        '8' => {
          'name' => 'PLDM_REQUESTER_RECV_FAIL',
          'value' => '18446744073709551608 (-8)'
        },
        '9' => {
          'name' => 'PLDM_REQUESTER_INVALID_RECV_LEN',
          'value' => '18446744073709551607 (-9)'
        },
        '10' => {
          'name' => 'PLDM_REQUESTER_SETUP_FAIL',
          'value' => '18446744073709551606 (-10)'
        },
        '11' => {
          'name' => 'PLDM_REQUESTER_INVALID_SETUP',
          'value' => '18446744073709551605 (-11)'
        },
        '12' => {
          'name' => 'PLDM_REQUESTER_POLL_FAIL',
          'value' => '18446744073709551604 (-12)'
        },
        '13' => {
          'name' => 'PLDM_REQUESTER_TRANSPORT_BUSY',
          'value' => '18446744073709551603 (-13)'
        }
      },
      'Name' => 'enum pldm_requester_error_codes',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '5439' => {
      'Name' => '_Bool',
      'Size' => '1',
      'Type' => 'Intrinsic'
    },
    '5561' => {
      'BaseType' => '67',
      'Header' => 'types.h',
      'Line' => '40',
      'Name' => '__uint16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '5599' => {
      'BaseType' => '126',
      'Header' => 'types.h',
      'Line' => '194',
      'Name' => '__ssize_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '5611' => {
      'BaseType' => '46',
      'Name' => 'char*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '5635' => {
      'BaseType' => '135',
      'Name' => 'uint8_t const',
      'Size' => '1',
      'Type' => 'Const'
    },
    '5640' => {
      'BaseType' => '5561',
      'Header' => 'stdint-uintn.h',
      'Line' => '25',
      'Name' => 'uint16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '5772' => {
      'BaseType' => '5599',
      'Header' => 'types.h',
      'Line' => '108',
      'Name' => 'ssize_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '5791' => {
      'BaseType' => '5635',
      'Name' => 'uint8_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '7306' => {
      'BaseType' => '46',
      'Name' => 'char const',
      'Size' => '1',
      'Type' => 'Const'
    },
    '7340' => {
      'BaseType' => '5640',
      'Name' => 'uint16_t const',
      'Size' => '2',
      'Type' => 'Const'
    },
    '7680' => {
      'Header' => 'utils.h',
      'Line' => '20',
      'Memb' => {
        '0' => {
          'name' => 'ptr',
          'offset' => '0',
          'type' => '5791'
        },
        '1' => {
          'name' => 'length',
          'offset' => '8',
          'type' => '164'
        }
      },
      'Name' => 'struct variable_field',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '8971' => {
      'BaseType' => '7306',
      'Name' => 'char const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '20030' => {
      'BaseType' => '344',
      'Name' => 'bitfield8_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '21799' => {
      'BaseType' => '813',
      'Name' => 'struct pldm_msg_hdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '22122' => {
      'BaseType' => '133',
      'Name' => 'void**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '25455' => {
      'BaseType' => '7680',
      'Name' => 'struct variable_field*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '27537' => {
      'BaseType' => '5640',
      'Name' => 'uint16_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '30776' => {
      'BaseType' => '81',
      'Header' => 'types.h',
      'Line' => '45',
      'Name' => '__uint64_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '30870' => {
      'BaseType' => '30776',
      'Header' => 'stdint-uintn.h',
      'Line' => '27',
      'Name' => 'uint64_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '31090' => {
      'Header' => 'bios.h',
      'Line' => '39',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_BIOS_STRING_TABLE',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_BIOS_ATTR_TABLE',
          'value' => '1'
        },
        '2' => {
          'name' => 'PLDM_BIOS_ATTR_VAL_TABLE',
          'value' => '2'
        }
      },
      'Name' => 'enum pldm_bios_table_types',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '31124' => {
      'Header' => 'bios.h',
      'Line' => '48',
      'Memb' => {
        '0' => {
          'name' => 'string_handle',
          'offset' => '0',
          'type' => '5640'
        },
        '1' => {
          'name' => 'string_length',
          'offset' => '2',
          'type' => '5640'
        },
        '2' => {
          'name' => 'name',
          'offset' => '4',
          'type' => '31181'
        }
      },
      'Name' => 'struct pldm_bios_string_table_entry',
      'Size' => '5',
      'Type' => 'Struct'
    },
    '31176' => {
      'BaseType' => '31124',
      'Name' => 'struct pldm_bios_string_table_entry const',
      'Size' => '5',
      'Type' => 'Const'
    },
    '31181' => {
      'BaseType' => '46',
      'Name' => 'char[1]',
      'Size' => '1',
      'Type' => 'Array'
    },
    '31197' => {
      'Header' => 'bios.h',
      'Line' => '54',
      'Memb' => {
        '0' => {
          'name' => 'attr_handle',
          'offset' => '0',
          'type' => '5640'
        },
        '1' => {
          'name' => 'attr_type',
          'offset' => '2',
          'type' => '135'
        },
        '2' => {
          'name' => 'string_handle',
          'offset' => '3',
          'type' => '5640'
        },
        '3' => {
          'name' => 'metadata',
          'offset' => '5',
          'type' => '974'
        }
      },
      'Name' => 'struct pldm_bios_attr_table_entry',
      'Size' => '6',
      'Type' => 'Struct'
    },
    '31262' => {
      'BaseType' => '31197',
      'Name' => 'struct pldm_bios_attr_table_entry const',
      'Size' => '6',
      'Type' => 'Const'
    },
    '31267' => {
      'Header' => 'bios.h',
      'Line' => '66',
      'Memb' => {
        '0' => {
          'name' => 'attr_handle',
          'offset' => '0',
          'type' => '5640'
        },
        '1' => {
          'name' => 'attr_type',
          'offset' => '2',
          'type' => '135'
        },
        '2' => {
          'name' => 'value',
          'offset' => '3',
          'type' => '974'
        }
      },
      'Name' => 'struct pldm_bios_attr_val_table_entry',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '31319' => {
      'BaseType' => '31267',
      'Name' => 'struct pldm_bios_attr_val_table_entry const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '31388' => {
      'Header' => 'bios_table.h',
      'Line' => '206',
      'Memb' => {
        '0' => {
          'name' => 'name_handle',
          'offset' => '0',
          'type' => '5640'
        },
        '1' => {
          'name' => 'read_only',
          'offset' => '2',
          'type' => '5439'
        },
        '2' => {
          'name' => 'pv_num',
          'offset' => '3',
          'type' => '135'
        },
        '3' => {
          'name' => 'pv_handle',
          'offset' => '8',
          'type' => '31491'
        },
        '4' => {
          'name' => 'def_num',
          'offset' => '22',
          'type' => '135'
        },
        '5' => {
          'name' => 'def_index',
          'offset' => '36',
          'type' => '5791'
        }
      },
      'Name' => 'struct pldm_bios_table_attr_entry_enum_info',
      'Size' => '32',
      'Type' => 'Struct'
    },
    '31479' => {
      'BaseType' => '31388',
      'Name' => 'struct pldm_bios_table_attr_entry_enum_info const',
      'Size' => '32',
      'Type' => 'Const'
    },
    '31491' => {
      'BaseType' => '7340',
      'Name' => 'uint16_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '31496' => {
      'Header' => 'bios_table.h',
      'Line' => '294',
      'Memb' => {
        '0' => {
          'name' => 'name_handle',
          'offset' => '0',
          'type' => '5640'
        },
        '1' => {
          'name' => 'read_only',
          'offset' => '2',
          'type' => '5439'
        },
        '2' => {
          'name' => 'string_type',
          'offset' => '3',
          'type' => '135'
        },
        '3' => {
          'name' => 'min_length',
          'offset' => '4',
          'type' => '5640'
        },
        '4' => {
          'name' => 'max_length',
          'offset' => '6',
          'type' => '5640'
        },
        '5' => {
          'name' => 'def_length',
          'offset' => '8',
          'type' => '5640'
        },
        '6' => {
          'name' => 'def_string',
          'offset' => '22',
          'type' => '8971'
        }
      },
      'Name' => 'struct pldm_bios_table_attr_entry_string_info',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '31608' => {
      'BaseType' => '31496',
      'Name' => 'struct pldm_bios_table_attr_entry_string_info const',
      'Size' => '24',
      'Type' => 'Const'
    },
    '31618' => {
      'Header' => 'bios_table.h',
      'Line' => '384',
      'Memb' => {
        '0' => {
          'name' => 'name_handle',
          'offset' => '0',
          'type' => '5640'
        },
        '1' => {
          'name' => 'read_only',
          'offset' => '2',
          'type' => '5439'
        },
        '2' => {
          'name' => 'lower_bound',
          'offset' => '8',
          'type' => '30870'
        },
        '3' => {
          'name' => 'upper_bound',
          'offset' => '22',
          'type' => '30870'
        },
        '4' => {
          'name' => 'scalar_increment',
          'offset' => '36',
          'type' => '147'
        },
        '5' => {
          'name' => 'default_value',
          'offset' => '50',
          'type' => '30870'
        }
      },
      'Name' => 'struct pldm_bios_table_attr_entry_integer_info',
      'Size' => '40',
      'Type' => 'Struct'
    },
    '31716' => {
      'BaseType' => '31618',
      'Name' => 'struct pldm_bios_table_attr_entry_integer_info const',
      'Size' => '40',
      'Type' => 'Const'
    },
    '31948' => {
      'Name' => 'ssize_t(*)(void const*)',
      'Param' => {
        '0' => {
          'type' => '1237'
        }
      },
      'Return' => '5772',
      'Size' => '8',
      'Type' => 'FuncPtr'
    },
    '32018' => {
      'Line' => '957',
      'Memb' => {
        '0' => {
          'name' => 'table_data',
          'offset' => '0',
          'type' => '5791'
        },
        '1' => {
          'name' => 'table_len',
          'offset' => '8',
          'type' => '164'
        },
        '2' => {
          'name' => 'current_pos',
          'offset' => '22',
          'type' => '164'
        },
        '3' => {
          'name' => 'entry_length_handler',
          'offset' => '36',
          'type' => '31948'
        }
      },
      'Name' => 'struct pldm_bios_table_iter',
      'PrivateABI' => 1,
      'Size' => '32',
      'Source' => 'bios_table.c',
      'Type' => 'Struct'
    },
    '32088' => {
      'BaseType' => '32018',
      'Name' => 'struct pldm_bios_table_iter const',
      'Size' => '32',
      'Type' => 'Const'
    },
    '33158' => {
      'BaseType' => '32018',
      'Name' => 'struct pldm_bios_table_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '33163' => {
      'BaseType' => '31319',
      'Name' => 'struct pldm_bios_attr_val_table_entry const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '33577' => {
      'BaseType' => '31262',
      'Name' => 'struct pldm_bios_attr_table_entry const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '34180' => {
      'BaseType' => '31176',
      'Name' => 'struct pldm_bios_string_table_entry const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '35343' => {
      'BaseType' => '32088',
      'Name' => 'struct pldm_bios_table_iter const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '39526' => {
      'BaseType' => '30870',
      'Name' => 'uint64_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '39803' => {
      'BaseType' => '31716',
      'Name' => 'struct pldm_bios_table_attr_entry_integer_info const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '40112' => {
      'BaseType' => '8971',
      'Name' => 'char const**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '41241' => {
      'BaseType' => '31608',
      'Name' => 'struct pldm_bios_table_attr_entry_string_info const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '42695' => {
      'BaseType' => '31479',
      'Name' => 'struct pldm_bios_table_attr_entry_enum_info const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '44908' => {
      'Header' => 'pldm_types.h',
      'Line' => '36',
      'Name' => 'anon-struct-pldm_types.h-36',
      'Size' => '2',
      'Type' => 'Struct'
    },
    '45174' => {
      'Header' => 'pldm_types.h',
      'Line' => '54',
      'Memb' => {
        '0' => {
          'name' => 'value',
          'offset' => '0',
          'type' => '5640'
        },
        '1' => {
          'name' => 'bits',
          'offset' => '0',
          'type' => '44908'
        }
      },
      'Name' => 'union bitfield16_t',
      'Size' => '2',
      'Type' => 'Union'
    },
    '53071' => {
      'BaseType' => '135',
      'Header' => 'pldm_types.h',
      'Line' => '32',
      'Name' => 'bool8_t',
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '53359' => {
      'Header' => 'pldm_types.h',
      'Line' => '58',
      'Name' => 'anon-struct-pldm_types.h-58',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '53847' => {
      'Header' => 'pldm_types.h',
      'Line' => '92',
      'Memb' => {
        '0' => {
          'name' => 'value',
          'offset' => '0',
          'type' => '147'
        },
        '1' => {
          'name' => 'bits',
          'offset' => '0',
          'type' => '53359'
        }
      },
      'Name' => 'union bitfield32_t',
      'Size' => '4',
      'Type' => 'Union'
    },
    '53859' => {
      'Header' => 'pldm_types.h',
      'Line' => '96',
      'Name' => 'anon-struct-pldm_types.h-96',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '54795' => {
      'Header' => 'pldm_types.h',
      'Line' => '162',
      'Memb' => {
        '0' => {
          'name' => 'value',
          'offset' => '0',
          'type' => '30870'
        },
        '1' => {
          'name' => 'bits',
          'offset' => '0',
          'type' => '53859'
        }
      },
      'Name' => 'union bitfield64_t',
      'Size' => '8',
      'Type' => 'Union'
    },
    '54814' => {
      'BaseType' => '54826',
      'Header' => 'pldm_types.h',
      'Line' => '166',
      'Name' => 'pldm_uuid',
      'Size' => '16',
      'Type' => 'Typedef'
    },
    '54826' => {
      'BaseType' => '135',
      'Name' => 'uint8_t[16]',
      'Size' => '16',
      'Type' => 'Array'
    },
    '54842' => {
      'BaseType' => '54826',
      'Name' => 'uint8_t[16] const',
      'Size' => '16',
      'Type' => 'Const'
    },
    '54871' => {
      'BaseType' => '164',
      'Name' => 'size_t const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '54935' => {
      'BaseType' => '7680',
      'Name' => 'struct variable_field const',
      'Size' => '16',
      'Type' => 'Const'
    },
    '56884' => {
      'BaseType' => '135',
      'Name' => 'uint8_t[8]',
      'Size' => '8',
      'Type' => 'Array'
    },
    '56900' => {
      'Header' => 'firmware_update.h',
      'Line' => '450',
      'Memb' => {
        '0' => {
          'name' => 'uuid',
          'offset' => '0',
          'type' => '54826'
        },
        '1' => {
          'name' => 'package_header_format_version',
          'offset' => '22',
          'type' => '135'
        },
        '2' => {
          'name' => 'package_header_size',
          'offset' => '23',
          'type' => '5640'
        },
        '3' => {
          'name' => 'package_release_date_time',
          'offset' => '25',
          'type' => '57013'
        },
        '4' => {
          'name' => 'component_bitmap_bit_length',
          'offset' => '50',
          'type' => '5640'
        },
        '5' => {
          'name' => 'package_version_string_type',
          'offset' => '52',
          'type' => '135'
        },
        '6' => {
          'name' => 'package_version_string_length',
          'offset' => '53',
          'type' => '135'
        }
      },
      'Name' => 'struct pldm_package_header_information',
      'Size' => '36',
      'Type' => 'Struct'
    },
    '57013' => {
      'BaseType' => '135',
      'Name' => 'uint8_t[13]',
      'Size' => '13',
      'Type' => 'Array'
    },
    '57029' => {
      'Header' => 'firmware_update.h',
      'Line' => '464',
      'Memb' => {
        '0' => {
          'name' => 'record_length',
          'offset' => '0',
          'type' => '5640'
        },
        '1' => {
          'name' => 'descriptor_count',
          'offset' => '2',
          'type' => '135'
        },
        '2' => {
          'name' => 'device_update_option_flags',
          'offset' => '3',
          'type' => '53847'
        },
        '3' => {
          'name' => 'comp_image_set_version_string_type',
          'offset' => '7',
          'type' => '135'
        },
        '4' => {
          'name' => 'comp_image_set_version_string_length',
          'offset' => '8',
          'type' => '135'
        },
        '5' => {
          'name' => 'fw_device_pkg_data_length',
          'offset' => '9',
          'type' => '5640'
        }
      },
      'Name' => 'struct pldm_firmware_device_id_record',
      'Size' => '11',
      'Type' => 'Struct'
    },
    '57242' => {
      'Header' => 'firmware_update.h',
      'Line' => '498',
      'Memb' => {
        '0' => {
          'name' => 'comp_classification',
          'offset' => '0',
          'type' => '5640'
        },
        '1' => {
          'name' => 'comp_identifier',
          'offset' => '2',
          'type' => '5640'
        },
        '2' => {
          'name' => 'comp_comparison_stamp',
          'offset' => '4',
          'type' => '147'
        },
        '3' => {
          'name' => 'comp_options',
          'offset' => '8',
          'type' => '45174'
        },
        '4' => {
          'name' => 'requested_comp_activation_method',
          'offset' => '16',
          'type' => '45174'
        },
        '5' => {
          'name' => 'comp_location_offset',
          'offset' => '18',
          'type' => '147'
        },
        '6' => {
          'name' => 'comp_size',
          'offset' => '22',
          'type' => '147'
        },
        '7' => {
          'name' => 'comp_version_string_type',
          'offset' => '32',
          'type' => '135'
        },
        '8' => {
          'name' => 'comp_version_string_length',
          'offset' => '33',
          'type' => '135'
        }
      },
      'Name' => 'struct pldm_component_image_information',
      'Size' => '22',
      'Type' => 'Struct'
    },
    '57440' => {
      'Header' => 'firmware_update.h',
      'Line' => '524',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'capabilities_during_update',
          'offset' => '1',
          'type' => '53847'
        },
        '2' => {
          'name' => 'comp_count',
          'offset' => '5',
          'type' => '5640'
        },
        '3' => {
          'name' => 'active_comp_image_set_ver_str_type',
          'offset' => '7',
          'type' => '135'
        },
        '4' => {
          'name' => 'active_comp_image_set_ver_str_len',
          'offset' => '8',
          'type' => '135'
        },
        '5' => {
          'name' => 'pending_comp_image_set_ver_str_type',
          'offset' => '9',
          'type' => '135'
        },
        '6' => {
          'name' => 'pending_comp_image_set_ver_str_len',
          'offset' => '16',
          'type' => '135'
        }
      },
      'Name' => 'struct pldm_get_firmware_parameters_resp',
      'Size' => '11',
      'Type' => 'Struct'
    },
    '57643' => {
      'Header' => 'firmware_update.h',
      'Line' => '552',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'downstream_device_update_supported',
          'offset' => '1',
          'type' => '135'
        },
        '2' => {
          'name' => 'number_of_downstream_devices',
          'offset' => '2',
          'type' => '5640'
        },
        '3' => {
          'name' => 'max_number_of_downstream_devices',
          'offset' => '4',
          'type' => '5640'
        },
        '4' => {
          'name' => 'capabilities',
          'offset' => '8',
          'type' => '53847'
        }
      },
      'Name' => 'struct pldm_query_downstream_devices_resp',
      'Size' => '12',
      'Type' => 'Struct'
    },
    '57728' => {
      'Header' => 'firmware_update.h',
      'Line' => '564',
      'Memb' => {
        '0' => {
          'name' => 'comp_classification',
          'offset' => '0',
          'type' => '5640'
        },
        '1' => {
          'name' => 'comp_identifier',
          'offset' => '2',
          'type' => '5640'
        },
        '2' => {
          'name' => 'comp_classification_index',
          'offset' => '4',
          'type' => '135'
        },
        '3' => {
          'name' => 'active_comp_comparison_stamp',
          'offset' => '5',
          'type' => '147'
        },
        '4' => {
          'name' => 'active_comp_ver_str_type',
          'offset' => '9',
          'type' => '135'
        },
        '5' => {
          'name' => 'active_comp_ver_str_len',
          'offset' => '16',
          'type' => '135'
        },
        '6' => {
          'name' => 'active_comp_release_date',
          'offset' => '17',
          'type' => '56884'
        },
        '7' => {
          'name' => 'pending_comp_comparison_stamp',
          'offset' => '25',
          'type' => '147'
        },
        '8' => {
          'name' => 'pending_comp_ver_str_type',
          'offset' => '35',
          'type' => '135'
        },
        '9' => {
          'name' => 'pending_comp_ver_str_len',
          'offset' => '36',
          'type' => '135'
        },
        '10' => {
          'name' => 'pending_comp_release_date',
          'offset' => '37',
          'type' => '56884'
        },
        '11' => {
          'name' => 'comp_activation_methods',
          'offset' => '51',
          'type' => '45174'
        },
        '12' => {
          'name' => 'capabilities_during_update',
          'offset' => '53',
          'type' => '53847'
        }
      },
      'Name' => 'struct pldm_component_parameter_entry',
      'Size' => '39',
      'Type' => 'Struct'
    },
    '58043' => {
      'Header' => 'firmware_update.h',
      'Line' => '603',
      'Memb' => {
        '0' => {
          'name' => 'data_transfer_handle',
          'offset' => '0',
          'type' => '147'
        },
        '1' => {
          'name' => 'transfer_operation_flag',
          'offset' => '4',
          'type' => '135'
        }
      },
      'Name' => 'struct pldm_query_downstream_identifiers_req',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '58086' => {
      'BaseType' => '58043',
      'Name' => 'struct pldm_query_downstream_identifiers_req const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '58091' => {
      'Header' => 'firmware_update.h',
      'Line' => '617',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'next_data_transfer_handle',
          'offset' => '4',
          'type' => '147'
        },
        '2' => {
          'name' => 'transfer_flag',
          'offset' => '8',
          'type' => '135'
        },
        '3' => {
          'name' => 'downstream_devices_length',
          'offset' => '18',
          'type' => '147'
        },
        '4' => {
          'name' => 'number_of_downstream_devices',
          'offset' => '22',
          'type' => '5640'
        }
      },
      'Name' => 'struct pldm_query_downstream_identifiers_resp',
      'Size' => '20',
      'Type' => 'Struct'
    },
    '58176' => {
      'Header' => 'firmware_update.h',
      'Line' => '630',
      'Memb' => {
        '0' => {
          'name' => 'downstream_device_index',
          'offset' => '0',
          'type' => '5640'
        },
        '1' => {
          'name' => 'downstream_descriptor_count',
          'offset' => '2',
          'type' => '135'
        }
      },
      'Name' => 'struct pldm_downstream_device',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '58219' => {
      'Header' => 'firmware_update.h',
      'Line' => '636',
      'Memb' => {
        '0' => {
          'name' => 'field',
          'offset' => '0',
          'type' => '7680'
        },
        '1' => {
          'name' => 'devs',
          'offset' => '22',
          'type' => '164'
        }
      },
      'Name' => 'struct pldm_downstream_device_iter',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '58262' => {
      'Header' => 'firmware_update.h',
      'Line' => '710',
      'Memb' => {
        '0' => {
          'name' => 'descriptor_type',
          'offset' => '0',
          'type' => '5640'
        },
        '1' => {
          'name' => 'descriptor_length',
          'offset' => '2',
          'type' => '5640'
        },
        '2' => {
          'name' => 'descriptor_data',
          'offset' => '8',
          'type' => '1237'
        }
      },
      'Name' => 'struct pldm_descriptor',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '58335' => {
      'Header' => 'firmware_update.h',
      'Line' => '716',
      'Memb' => {
        '0' => {
          'name' => 'field',
          'offset' => '0',
          'type' => '25455'
        },
        '1' => {
          'name' => 'count',
          'offset' => '8',
          'type' => '164'
        }
      },
      'Name' => 'struct pldm_descriptor_iter',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '58383' => {
      'Header' => 'firmware_update.h',
      'Line' => '809',
      'Memb' => {
        '0' => {
          'name' => 'data_transfer_handle',
          'offset' => '0',
          'type' => '147'
        },
        '1' => {
          'name' => 'transfer_operation_flag',
          'offset' => '4',
          'type' => '135'
        }
      },
      'Name' => 'struct pldm_get_downstream_firmware_parameters_req',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '58426' => {
      'BaseType' => '58383',
      'Name' => 'struct pldm_get_downstream_firmware_parameters_req const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '58431' => {
      'Header' => 'firmware_update.h',
      'Line' => '824',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'next_data_transfer_handle',
          'offset' => '4',
          'type' => '147'
        },
        '2' => {
          'name' => 'transfer_flag',
          'offset' => '8',
          'type' => '135'
        },
        '3' => {
          'name' => 'fdp_capabilities_during_update',
          'offset' => '18',
          'type' => '53847'
        },
        '4' => {
          'name' => 'downstream_device_count',
          'offset' => '22',
          'type' => '5640'
        }
      },
      'Name' => 'struct pldm_get_downstream_firmware_parameters_resp',
      'Size' => '20',
      'Type' => 'Struct'
    },
    '58516' => {
      'Header' => 'firmware_update.h',
      'Line' => '842',
      'Memb' => {
        '0' => {
          'name' => 'downstream_device_index',
          'offset' => '0',
          'type' => '5640'
        },
        '1' => {
          'name' => 'active_comp_comparison_stamp',
          'offset' => '4',
          'type' => '147'
        },
        '2' => {
          'name' => 'active_comp_ver_str_type',
          'offset' => '8',
          'type' => '135'
        },
        '3' => {
          'name' => 'active_comp_ver_str_len',
          'offset' => '9',
          'type' => '135'
        },
        '4' => {
          'name' => 'active_comp_release_date',
          'offset' => '16',
          'type' => '58713'
        },
        '5' => {
          'name' => 'pending_comp_comparison_stamp',
          'offset' => '32',
          'type' => '147'
        },
        '6' => {
          'name' => 'pending_comp_ver_str_type',
          'offset' => '36',
          'type' => '135'
        },
        '7' => {
          'name' => 'pending_comp_ver_str_len',
          'offset' => '37',
          'type' => '135'
        },
        '8' => {
          'name' => 'pending_comp_release_date',
          'offset' => '38',
          'type' => '58713'
        },
        '9' => {
          'name' => 'comp_activation_methods',
          'offset' => '54',
          'type' => '45174'
        },
        '10' => {
          'name' => 'capabilities_during_update',
          'offset' => '64',
          'type' => '53847'
        },
        '11' => {
          'name' => 'active_comp_ver_str',
          'offset' => '72',
          'type' => '1237'
        },
        '12' => {
          'name' => 'pending_comp_ver_str',
          'offset' => '86',
          'type' => '1237'
        }
      },
      'Name' => 'struct pldm_downstream_device_parameters_entry',
      'Size' => '64',
      'Type' => 'Struct'
    },
    '58713' => {
      'BaseType' => '46',
      'Name' => 'char[9]',
      'Size' => '9',
      'Type' => 'Array'
    },
    '60084' => {
      'Header' => 'firmware_update.h',
      'Line' => '1379',
      'Memb' => {
        '0' => {
          'name' => 'field',
          'offset' => '0',
          'type' => '7680'
        },
        '1' => {
          'name' => 'entries',
          'offset' => '22',
          'type' => '164'
        }
      },
      'Name' => 'struct pldm_downstream_device_parameters_iter',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '60127' => {
      'Header' => 'firmware_update.h',
      'Line' => '2222',
      'Memb' => {
        '0' => {
          'name' => 'magic',
          'offset' => '0',
          'type' => '159'
        },
        '1' => {
          'name' => 'version',
          'offset' => '4',
          'type' => '5635'
        }
      },
      'Name' => 'anon-struct-firmware_update.h-2222',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '60164' => {
      'Header' => 'firmware_update.h',
      'Line' => '2229',
      'Memb' => {
        '0' => {
          'name' => 'identifier',
          'offset' => '0',
          'type' => '54842'
        },
        '1' => {
          'name' => 'revision',
          'offset' => '22',
          'type' => '5635'
        }
      },
      'Name' => 'anon-struct-firmware_update.h-2229',
      'Size' => '17',
      'Type' => 'Struct'
    },
    '60201' => {
      'Header' => 'firmware_update.h',
      'Line' => '2221',
      'Memb' => {
        '0' => {
          'name' => 'meta',
          'offset' => '0',
          'type' => '60127'
        },
        '1' => {
          'name' => 'format',
          'offset' => '8',
          'type' => '60164'
        }
      },
      'Name' => 'struct pldm_package_format_pin',
      'Size' => '28',
      'Type' => 'Struct'
    },
    '60244' => {
      'BaseType' => '60201',
      'Name' => 'struct pldm_package_format_pin const',
      'Size' => '28',
      'Type' => 'Const'
    },
    '60249' => {
      'Header' => 'firmware_update.h',
      'Line' => '2245',
      'Memb' => {
        '0' => {
          'name' => 'package_header_identifier',
          'offset' => '0',
          'type' => '54814'
        },
        '1' => {
          'name' => 'package_header_format_revision',
          'offset' => '22',
          'type' => '135'
        },
        '2' => {
          'name' => 'package_release_date_time',
          'offset' => '23',
          'type' => '57013'
        },
        '3' => {
          'name' => 'component_bitmap_bit_length',
          'offset' => '48',
          'type' => '5640'
        },
        '4' => {
          'name' => 'package_version_string_type',
          'offset' => '50',
          'type' => '135'
        },
        '5' => {
          'name' => 'package_version_string',
          'offset' => '64',
          'type' => '7680'
        },
        '6' => {
          'name' => 'areas',
          'offset' => '86',
          'type' => '7680'
        },
        '7' => {
          'name' => 'package',
          'offset' => '114',
          'type' => '7680'
        }
      },
      'Name' => 'struct pldm__package_header_information',
      'Size' => '88',
      'Type' => 'Struct'
    },
    '60376' => {
      'BaseType' => '60249',
      'Header' => 'firmware_update.h',
      'Line' => '2261',
      'Name' => 'pldm_package_header_information_pad',
      'Size' => '88',
      'Type' => 'Typedef'
    },
    '60389' => {
      'BaseType' => '60376',
      'Name' => 'pldm_package_header_information_pad const',
      'Size' => '88',
      'Type' => 'Const'
    },
    '60394' => {
      'Header' => 'firmware_update.h',
      'Line' => '2264',
      'Memb' => {
        '0' => {
          'name' => 'bitmap',
          'offset' => '0',
          'type' => '7680'
        }
      },
      'Name' => 'struct pldm_package_component_bitmap',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '60423' => {
      'Header' => 'firmware_update.h',
      'Line' => '2276',
      'Memb' => {
        '0' => {
          'name' => 'descriptor_count',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'device_update_option_flags',
          'offset' => '4',
          'type' => '53847'
        },
        '2' => {
          'name' => 'component_image_set_version_string_type',
          'offset' => '8',
          'type' => '135'
        },
        '3' => {
          'name' => 'component_image_set_version_string',
          'offset' => '22',
          'type' => '7680'
        },
        '4' => {
          'name' => 'applicable_components',
          'offset' => '50',
          'type' => '60394'
        },
        '5' => {
          'name' => 'record_descriptors',
          'offset' => '72',
          'type' => '7680'
        },
        '6' => {
          'name' => 'firmware_device_package_data',
          'offset' => '100',
          'type' => '7680'
        },
        '7' => {
          'name' => 'reference_manifest_data',
          'offset' => '128',
          'type' => '7680'
        }
      },
      'Name' => 'struct pldm_package_firmware_device_id_record',
      'Size' => '96',
      'Type' => 'Struct'
    },
    '60550' => {
      'Header' => 'firmware_update.h',
      'Line' => '2324',
      'Memb' => {
        '0' => {
          'name' => 'descriptor_count',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'update_option_flags',
          'offset' => '4',
          'type' => '53847'
        },
        '2' => {
          'name' => 'self_contained_activation_min_version_string_type',
          'offset' => '8',
          'type' => '135'
        },
        '3' => {
          'name' => 'self_contained_activation_min_version_string',
          'offset' => '22',
          'type' => '7680'
        },
        '4' => {
          'name' => 'self_contained_activation_min_version_comparison_stamp',
          'offset' => '50',
          'type' => '147'
        },
        '5' => {
          'name' => 'applicable_components',
          'offset' => '64',
          'type' => '60394'
        },
        '6' => {
          'name' => 'record_descriptors',
          'offset' => '86',
          'type' => '7680'
        },
        '7' => {
          'name' => 'package_data',
          'offset' => '114',
          'type' => '7680'
        },
        '8' => {
          'name' => 'reference_manifest_data',
          'offset' => '136',
          'type' => '7680'
        }
      },
      'Name' => 'struct pldm_package_downstream_device_id_record',
      'Size' => '104',
      'Type' => 'Struct'
    },
    '60691' => {
      'Header' => 'firmware_update.h',
      'Line' => '2374',
      'Memb' => {
        '0' => {
          'name' => 'component_classification',
          'offset' => '0',
          'type' => '5640'
        },
        '1' => {
          'name' => 'component_identifier',
          'offset' => '2',
          'type' => '5640'
        },
        '2' => {
          'name' => 'component_comparison_stamp',
          'offset' => '4',
          'type' => '147'
        },
        '3' => {
          'name' => 'component_options',
          'offset' => '8',
          'type' => '45174'
        },
        '4' => {
          'name' => 'requested_component_activation_method',
          'offset' => '16',
          'type' => '45174'
        },
        '5' => {
          'name' => 'component_image',
          'offset' => '22',
          'type' => '7680'
        },
        '6' => {
          'name' => 'component_version_string_type',
          'offset' => '50',
          'type' => '135'
        },
        '7' => {
          'name' => 'component_version_string',
          'offset' => '64',
          'type' => '7680'
        },
        '8' => {
          'name' => 'component_opaque_data',
          'offset' => '86',
          'type' => '7680'
        }
      },
      'Name' => 'struct pldm_package_component_image_information',
      'Size' => '72',
      'Type' => 'Struct'
    },
    '60832' => {
      'Header' => 'firmware_update.h',
      'Line' => '2401',
      'Memb' => {
        '0' => {
          'name' => 'field',
          'offset' => '0',
          'type' => '7680'
        },
        '1' => {
          'name' => 'entries',
          'offset' => '22',
          'type' => '164'
        }
      },
      'Name' => 'struct pldm_package_firmware_device_id_record_iter',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '60875' => {
      'Header' => 'firmware_update.h',
      'Line' => '2406',
      'Memb' => {
        '0' => {
          'name' => 'field',
          'offset' => '0',
          'type' => '7680'
        },
        '1' => {
          'name' => 'entries',
          'offset' => '22',
          'type' => '164'
        }
      },
      'Name' => 'struct pldm_package_downstream_device_id_record_iter',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '60918' => {
      'Header' => 'firmware_update.h',
      'Line' => '2411',
      'Memb' => {
        '0' => {
          'name' => 'field',
          'offset' => '0',
          'type' => '7680'
        },
        '1' => {
          'name' => 'entries',
          'offset' => '22',
          'type' => '164'
        }
      },
      'Name' => 'struct pldm_package_component_image_information_iter',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '60961' => {
      'Header' => 'firmware_update.h',
      'Line' => '2430',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '61029'
        },
        '1' => {
          'name' => 'fds',
          'offset' => '8',
          'type' => '60832'
        },
        '2' => {
          'name' => 'dds',
          'offset' => '50',
          'type' => '60875'
        },
        '3' => {
          'name' => 'infos',
          'offset' => '86',
          'type' => '60918'
        }
      },
      'Name' => 'struct pldm_package_iter',
      'Size' => '80',
      'Type' => 'Struct'
    },
    '61029' => {
      'BaseType' => '60389',
      'Name' => 'pldm_package_header_information_pad const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '66545' => {
      'BaseType' => '60918',
      'Name' => 'struct pldm_package_component_image_information_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '66550' => {
      'BaseType' => '60691',
      'Name' => 'struct pldm_package_component_image_information*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '67564' => {
      'BaseType' => '60875',
      'Name' => 'struct pldm_package_downstream_device_id_record_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '72536' => {
      'BaseType' => '60550',
      'Name' => 'struct pldm_package_downstream_device_id_record*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '73534' => {
      'BaseType' => '60832',
      'Name' => 'struct pldm_package_firmware_device_id_record_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '73668' => {
      'BaseType' => '60423',
      'Name' => 'struct pldm_package_firmware_device_id_record*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '74758' => {
      'BaseType' => '60244',
      'Name' => 'struct pldm_package_format_pin const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '74763' => {
      'BaseType' => '60376',
      'Name' => 'pldm_package_header_information_pad*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '74768' => {
      'BaseType' => '60961',
      'Name' => 'struct pldm_package_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '76421' => {
      'BaseType' => '53071',
      'Name' => 'bool8_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '76426' => {
      'BaseType' => '54795',
      'Name' => 'bitfield64_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '79864' => {
      'BaseType' => '53847',
      'Name' => 'bitfield32_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '83945' => {
      'BaseType' => '45174',
      'Name' => 'bitfield16_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '94292' => {
      'BaseType' => '54935',
      'Name' => 'struct variable_field const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '115995' => {
      'BaseType' => '60084',
      'Name' => 'struct pldm_downstream_device_parameters_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '116000' => {
      'BaseType' => '58516',
      'Name' => 'struct pldm_downstream_device_parameters_entry*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '118684' => {
      'BaseType' => '58431',
      'Name' => 'struct pldm_get_downstream_firmware_parameters_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '119817' => {
      'BaseType' => '58426',
      'Name' => 'struct pldm_get_downstream_firmware_parameters_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '120997' => {
      'BaseType' => '58219',
      'Name' => 'struct pldm_downstream_device_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '121002' => {
      'BaseType' => '58176',
      'Name' => 'struct pldm_downstream_device*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '123700' => {
      'BaseType' => '58091',
      'Name' => 'struct pldm_query_downstream_identifiers_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '124833' => {
      'BaseType' => '58086',
      'Name' => 'struct pldm_query_downstream_identifiers_req const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '127434' => {
      'BaseType' => '57643',
      'Name' => 'struct pldm_query_downstream_devices_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '127881' => {
      'BaseType' => '57728',
      'Name' => 'struct pldm_component_parameter_entry*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '136539' => {
      'BaseType' => '57440',
      'Name' => 'struct pldm_get_firmware_parameters_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '139511' => {
      'BaseType' => '1502',
      'Name' => 'uint8_t**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '139853' => {
      'BaseType' => '57242',
      'Name' => 'struct pldm_component_image_information*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '142345' => {
      'BaseType' => '58335',
      'Name' => 'struct pldm_descriptor_iter*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '142350' => {
      'BaseType' => '58262',
      'Name' => 'struct pldm_descriptor*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '142734' => {
      'BaseType' => '57029',
      'Name' => 'struct pldm_firmware_device_id_record*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '149628' => {
      'BaseType' => '56900',
      'Name' => 'struct pldm_package_header_information*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '164233' => {
      'BaseType' => '164250',
      'Header' => 'pdr.h',
      'Line' => '16',
      'Name' => 'pldm_pdr',
      'PrivateABI' => 1,
      'Size' => '24',
      'Type' => 'Typedef'
    },
    '164245' => {
      'BaseType' => '164233',
      'Name' => 'pldm_pdr const',
      'Size' => '24',
      'Type' => 'Const'
    },
    '164250' => {
      'Line' => '30',
      'Memb' => {
        '0' => {
          'name' => 'record_count',
          'offset' => '0',
          'type' => '147'
        },
        '1' => {
          'name' => 'size',
          'offset' => '4',
          'type' => '147'
        },
        '2' => {
          'name' => 'first',
          'offset' => '8',
          'type' => '165677'
        },
        '3' => {
          'name' => 'last',
          'offset' => '22',
          'type' => '165677'
        }
      },
      'Name' => 'struct pldm_pdr',
      'PrivateABI' => 1,
      'Size' => '24',
      'Source' => 'pdr.c',
      'Type' => 'Struct'
    },
    '164316' => {
      'BaseType' => '164333',
      'Header' => 'pdr.h',
      'Line' => '21',
      'Name' => 'pldm_pdr_record',
      'PrivateABI' => 1,
      'Size' => '32',
      'Type' => 'Typedef'
    },
    '164328' => {
      'BaseType' => '164316',
      'Name' => 'pldm_pdr_record const',
      'Size' => '32',
      'Type' => 'Const'
    },
    '164333' => {
      'Line' => '21',
      'Memb' => {
        '0' => {
          'name' => 'record_handle',
          'offset' => '0',
          'type' => '147'
        },
        '1' => {
          'name' => 'size',
          'offset' => '4',
          'type' => '147'
        },
        '2' => {
          'name' => 'data',
          'offset' => '8',
          'type' => '1502'
        },
        '3' => {
          'name' => 'next',
          'offset' => '22',
          'type' => '165665'
        },
        '4' => {
          'name' => 'is_remote',
          'offset' => '36',
          'type' => '5439'
        },
        '5' => {
          'name' => 'terminus_handle',
          'offset' => '38',
          'type' => '5640'
        }
      },
      'Name' => 'struct pldm_pdr_record',
      'PrivateABI' => 1,
      'Size' => '32',
      'Source' => 'pdr.c',
      'Type' => 'Struct'
    },
    '164425' => {
      'Header' => 'pdr.h',
      'Line' => '327',
      'Memb' => {
        '0' => {
          'name' => 'entity_type',
          'offset' => '0',
          'type' => '5640'
        },
        '1' => {
          'name' => 'entity_instance_num',
          'offset' => '2',
          'type' => '5640'
        },
        '2' => {
          'name' => 'entity_container_id',
          'offset' => '4',
          'type' => '5640'
        }
      },
      'Name' => 'struct pldm_entity',
      'Size' => '6',
      'Type' => 'Struct'
    },
    '164487' => {
      'BaseType' => '164425',
      'Header' => 'pdr.h',
      'Line' => '331',
      'Name' => 'pldm_entity',
      'Size' => '6',
      'Type' => 'Typedef'
    },
    '164533' => {
      'BaseType' => '164545',
      'Header' => 'pdr.h',
      'Line' => '341',
      'Name' => 'pldm_entity_association_tree',
      'PrivateABI' => 1,
      'Size' => '16',
      'Type' => 'Typedef'
    },
    '164545' => {
      'Line' => '647',
      'Memb' => {
        '0' => {
          'name' => 'root',
          'offset' => '0',
          'type' => '165682'
        },
        '1' => {
          'name' => 'last_used_container_id',
          'offset' => '8',
          'type' => '5640'
        }
      },
      'Name' => 'struct pldm_entity_association_tree',
      'PrivateABI' => 1,
      'Size' => '16',
      'Source' => 'pdr.c',
      'Type' => 'Struct'
    },
    '164588' => {
      'BaseType' => '164605',
      'Header' => 'pdr.h',
      'Line' => '346',
      'Name' => 'pldm_entity_node',
      'PrivateABI' => 1,
      'Size' => '40',
      'Type' => 'Typedef'
    },
    '164600' => {
      'BaseType' => '164588',
      'Name' => 'pldm_entity_node const',
      'Size' => '40',
      'Type' => 'Const'
    },
    '164605' => {
      'Line' => '652',
      'Memb' => {
        '0' => {
          'name' => 'entity',
          'offset' => '0',
          'type' => '164487'
        },
        '1' => {
          'name' => 'parent',
          'offset' => '6',
          'type' => '164487'
        },
        '2' => {
          'name' => 'remote_container_id',
          'offset' => '18',
          'type' => '5640'
        },
        '3' => {
          'name' => 'first_child',
          'offset' => '22',
          'type' => '165682'
        },
        '4' => {
          'name' => 'next_sibling',
          'offset' => '36',
          'type' => '165682'
        },
        '5' => {
          'name' => 'association_type',
          'offset' => '50',
          'type' => '135'
        }
      },
      'Name' => 'struct pldm_entity_node',
      'PrivateABI' => 1,
      'Size' => '40',
      'Source' => 'pdr.c',
      'Type' => 'Struct'
    },
    '164883' => {
      'Header' => 'platform.h',
      'Line' => '563',
      'Memb' => {
        '0' => {
          'name' => 'record_handle',
          'offset' => '0',
          'type' => '147'
        },
        '1' => {
          'name' => 'version',
          'offset' => '4',
          'type' => '135'
        },
        '2' => {
          'name' => 'type',
          'offset' => '5',
          'type' => '135'
        },
        '3' => {
          'name' => 'record_change_num',
          'offset' => '6',
          'type' => '5640'
        },
        '4' => {
          'name' => 'length',
          'offset' => '8',
          'type' => '5640'
        }
      },
      'Name' => 'struct pldm_pdr_hdr',
      'Size' => '10',
      'Type' => 'Struct'
    },
    '165332' => {
      'Header' => 'platform.h',
      'Line' => '638',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '164883'
        },
        '1' => {
          'name' => 'terminus_handle',
          'offset' => '16',
          'type' => '5640'
        },
        '2' => {
          'name' => 'sensor_id',
          'offset' => '18',
          'type' => '5640'
        },
        '3' => {
          'name' => 'entity_type',
          'offset' => '20',
          'type' => '5640'
        },
        '4' => {
          'name' => 'entity_instance',
          'offset' => '22',
          'type' => '5640'
        },
        '5' => {
          'name' => 'container_id',
          'offset' => '24',
          'type' => '5640'
        },
        '6' => {
          'name' => 'sensor_init',
          'offset' => '32',
          'type' => '135'
        },
        '7' => {
          'name' => 'sensor_auxiliary_names_pdr',
          'offset' => '33',
          'type' => '53071'
        },
        '8' => {
          'name' => 'composite_sensor_count',
          'offset' => '34',
          'type' => '135'
        },
        '9' => {
          'name' => 'possible_states',
          'offset' => '35',
          'type' => '974'
        }
      },
      'Name' => 'struct pldm_state_sensor_pdr',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '165486' => {
      'Header' => 'platform.h',
      'Line' => '665',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '164883'
        },
        '1' => {
          'name' => 'terminus_handle',
          'offset' => '16',
          'type' => '5640'
        },
        '2' => {
          'name' => 'effecter_id',
          'offset' => '18',
          'type' => '5640'
        },
        '3' => {
          'name' => 'entity_type',
          'offset' => '20',
          'type' => '5640'
        },
        '4' => {
          'name' => 'entity_instance',
          'offset' => '22',
          'type' => '5640'
        },
        '5' => {
          'name' => 'container_id',
          'offset' => '24',
          'type' => '5640'
        },
        '6' => {
          'name' => 'effecter_semantic_id',
          'offset' => '32',
          'type' => '5640'
        },
        '7' => {
          'name' => 'effecter_init',
          'offset' => '34',
          'type' => '135'
        },
        '8' => {
          'name' => 'has_description_pdr',
          'offset' => '35',
          'type' => '53071'
        },
        '9' => {
          'name' => 'composite_effecter_count',
          'offset' => '36',
          'type' => '135'
        },
        '10' => {
          'name' => 'possible_states',
          'offset' => '37',
          'type' => '974'
        }
      },
      'Name' => 'struct pldm_state_effecter_pdr',
      'Size' => '26',
      'Type' => 'Struct'
    },
    '165665' => {
      'BaseType' => '164333',
      'Name' => 'struct pldm_pdr_record*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '165677' => {
      'BaseType' => '164316',
      'Name' => 'pldm_pdr_record*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '165682' => {
      'BaseType' => '164588',
      'Name' => 'pldm_entity_node*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '166049' => {
      'BaseType' => '164533',
      'Name' => 'pldm_entity_association_tree*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '167194' => {
      'BaseType' => '164233',
      'Name' => 'pldm_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '168505' => {
      'BaseType' => '164328',
      'Name' => 'pldm_pdr_record const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '175739' => {
      'BaseType' => '164487',
      'Name' => 'pldm_entity*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '191861' => {
      'BaseType' => '175739',
      'Name' => 'pldm_entity**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '192508' => {
      'BaseType' => '165682',
      'Name' => 'pldm_entity_node**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '193297' => {
      'BaseType' => '164245',
      'Name' => 'pldm_pdr const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '198774' => {
      'BaseType' => '164600',
      'Name' => 'pldm_entity_node const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '204637' => {
      'BaseType' => '165486',
      'Name' => 'struct pldm_state_effecter_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '209594' => {
      'BaseType' => '165332',
      'Name' => 'struct pldm_state_sensor_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '214242' => {
      'BaseType' => '88',
      'Header' => 'types.h',
      'Line' => '37',
      'Name' => '__int8_t',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '214273' => {
      'BaseType' => '107',
      'Header' => 'types.h',
      'Line' => '39',
      'Name' => '__int16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '214304' => {
      'BaseType' => '53',
      'Header' => 'types.h',
      'Line' => '41',
      'Name' => '__int32_t',
      'PrivateABI' => 1,
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '214342' => {
      'BaseType' => '5561',
      'Header' => 'types.h',
      'Line' => '55',
      'Name' => '__uint_least16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '214395' => {
      'BaseType' => '214242',
      'Header' => 'stdint-intn.h',
      'Line' => '24',
      'Name' => 'int8_t',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '214407' => {
      'BaseType' => '214273',
      'Header' => 'stdint-intn.h',
      'Line' => '25',
      'Name' => 'int16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '214419' => {
      'BaseType' => '214304',
      'Header' => 'stdint-intn.h',
      'Line' => '26',
      'Name' => 'int32_t',
      'PrivateABI' => 1,
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '215036' => {
      'BaseType' => '444',
      'Header' => 'pldm_types.h',
      'Line' => '164',
      'Name' => 'real32_t',
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '215757' => {
      'BaseType' => '214342',
      'Header' => 'uchar.h',
      'Line' => '51',
      'Name' => 'char16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '216590' => {
      'Header' => 'platform.h',
      'Line' => '341',
      'Memb' => {
        '0' => {
          'name' => 'PLDM_SENSOR_OP_STATE',
          'value' => '0'
        },
        '1' => {
          'name' => 'PLDM_STATE_SENSOR_STATE',
          'value' => '1'
        },
        '2' => {
          'name' => 'PLDM_NUMERIC_SENSOR_STATE',
          'value' => '2'
        }
      },
      'Name' => 'enum sensor_event_class_states',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '216624' => {
      'BaseType' => '216590',
      'Name' => 'enum sensor_event_class_states const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '217086' => {
      'Header' => 'platform.h',
      'Line' => '655',
      'Memb' => {
        '0' => {
          'name' => 'state_set_id',
          'offset' => '0',
          'type' => '5640'
        },
        '1' => {
          'name' => 'possible_states_size',
          'offset' => '2',
          'type' => '135'
        },
        '2' => {
          'name' => 'states',
          'offset' => '3',
          'type' => '217148'
        }
      },
      'Name' => 'struct state_sensor_possible_states',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '217143' => {
      'BaseType' => '217086',
      'Name' => 'struct state_sensor_possible_states const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '217148' => {
      'BaseType' => '344',
      'Name' => 'bitfield8_t[1]',
      'Size' => '1',
      'Type' => 'Array'
    },
    '217521' => {
      'Header' => 'platform.h',
      'Line' => '756',
      'Memb' => {
        '0' => {
          'name' => 'value_u8',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'value_s8',
          'offset' => '0',
          'type' => '214395'
        },
        '2' => {
          'name' => 'value_u16',
          'offset' => '0',
          'type' => '5640'
        },
        '3' => {
          'name' => 'value_s16',
          'offset' => '0',
          'type' => '214407'
        },
        '4' => {
          'name' => 'value_u32',
          'offset' => '0',
          'type' => '147'
        },
        '5' => {
          'name' => 'value_s32',
          'offset' => '0',
          'type' => '214419'
        },
        '6' => {
          'name' => 'value_f32',
          'offset' => '0',
          'type' => '215036'
        }
      },
      'Name' => 'union union_range_field_format',
      'Size' => '4',
      'Type' => 'Union'
    },
    '218120' => {
      'Header' => 'platform.h',
      'Line' => '813',
      'Memb' => {
        '0' => {
          'name' => 'value_u8',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'value_s8',
          'offset' => '0',
          'type' => '214395'
        },
        '2' => {
          'name' => 'value_u16',
          'offset' => '0',
          'type' => '5640'
        },
        '3' => {
          'name' => 'value_s16',
          'offset' => '0',
          'type' => '214407'
        },
        '4' => {
          'name' => 'value_u32',
          'offset' => '0',
          'type' => '147'
        },
        '5' => {
          'name' => 'value_s32',
          'offset' => '0',
          'type' => '214419'
        }
      },
      'Name' => 'union union_sensor_data_size',
      'Size' => '4',
      'Type' => 'Union'
    },
    '218133' => {
      'Header' => 'platform.h',
      'Line' => '820',
      'Memb' => {
        '0' => {
          'name' => 'record_handle',
          'offset' => '0',
          'type' => '147'
        },
        '1' => {
          'name' => 'version',
          'offset' => '4',
          'type' => '135'
        },
        '2' => {
          'name' => 'type',
          'offset' => '5',
          'type' => '135'
        },
        '3' => {
          'name' => 'record_change_num',
          'offset' => '6',
          'type' => '5640'
        },
        '4' => {
          'name' => 'length',
          'offset' => '8',
          'type' => '5640'
        }
      },
      'Name' => 'struct pldm_value_pdr_hdr',
      'Size' => '12',
      'Type' => 'Struct'
    },
    '218218' => {
      'Header' => 'platform.h',
      'Line' => '838',
      'Memb' => {
        '0' => {
          'name' => 'entity_instance_num',
          'offset' => '0',
          'type' => '5640'
        },
        '1' => {
          'name' => 'entity_instance',
          'offset' => '0',
          'type' => '5640'
        }
      },
      'Name' => 'anon-union-platform.h-838',
      'Size' => '2',
      'Type' => 'Union'
    },
    '218253' => {
      'Header' => 'platform.h',
      'Line' => '833',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '218133'
        },
        '1' => {
          'name' => 'terminus_handle',
          'offset' => '18',
          'type' => '5640'
        },
        '2' => {
          'name' => 'sensor_id',
          'offset' => '20',
          'type' => '5640'
        },
        '3' => {
          'name' => 'entity_type',
          'offset' => '22',
          'type' => '5640'
        },
        '4' => {
          'name' => 'unnamed0',
          'offset' => '24',
          'type' => '218218'
        },
        '5' => {
          'name' => 'container_id',
          'offset' => '32',
          'type' => '5640'
        },
        '6' => {
          'name' => 'sensor_init',
          'offset' => '34',
          'type' => '135'
        },
        '7' => {
          'name' => 'sensor_auxiliary_names_pdr',
          'offset' => '35',
          'type' => '53071'
        },
        '8' => {
          'name' => 'base_unit',
          'offset' => '36',
          'type' => '135'
        },
        '9' => {
          'name' => 'unit_modifier',
          'offset' => '37',
          'type' => '214395'
        },
        '10' => {
          'name' => 'rate_unit',
          'offset' => '38',
          'type' => '135'
        },
        '11' => {
          'name' => 'base_oem_unit_handle',
          'offset' => '39',
          'type' => '135'
        },
        '12' => {
          'name' => 'aux_unit',
          'offset' => '40',
          'type' => '135'
        },
        '13' => {
          'name' => 'aux_unit_modifier',
          'offset' => '41',
          'type' => '214395'
        },
        '14' => {
          'name' => 'aux_rate_unit',
          'offset' => '48',
          'type' => '135'
        },
        '15' => {
          'name' => 'rel',
          'offset' => '49',
          'type' => '135'
        },
        '16' => {
          'name' => 'aux_oem_unit_handle',
          'offset' => '50',
          'type' => '135'
        },
        '17' => {
          'name' => 'is_linear',
          'offset' => '51',
          'type' => '53071'
        },
        '18' => {
          'name' => 'sensor_data_size',
          'offset' => '52',
          'type' => '135'
        },
        '19' => {
          'name' => 'resolution',
          'offset' => '54',
          'type' => '215036'
        },
        '20' => {
          'name' => 'offset',
          'offset' => '64',
          'type' => '215036'
        },
        '21' => {
          'name' => 'accuracy',
          'offset' => '68',
          'type' => '5640'
        },
        '22' => {
          'name' => 'plus_tolerance',
          'offset' => '70',
          'type' => '135'
        },
        '23' => {
          'name' => 'minus_tolerance',
          'offset' => '71',
          'type' => '135'
        },
        '24' => {
          'name' => 'hysteresis',
          'offset' => '72',
          'type' => '218120'
        },
        '25' => {
          'name' => 'supported_thresholds',
          'offset' => '82',
          'type' => '344'
        },
        '26' => {
          'name' => 'threshold_and_hysteresis_volatility',
          'offset' => '83',
          'type' => '344'
        },
        '27' => {
          'name' => 'state_transition_interval',
          'offset' => '86',
          'type' => '215036'
        },
        '28' => {
          'name' => 'update_interval',
          'offset' => '96',
          'type' => '215036'
        },
        '29' => {
          'name' => 'max_readable',
          'offset' => '100',
          'type' => '218120'
        },
        '30' => {
          'name' => 'min_readable',
          'offset' => '104',
          'type' => '218120'
        },
        '31' => {
          'name' => 'range_field_format',
          'offset' => '114',
          'type' => '135'
        },
        '32' => {
          'name' => 'range_field_support',
          'offset' => '115',
          'type' => '344'
        },
        '33' => {
          'name' => 'nominal_value',
          'offset' => '118',
          'type' => '217521'
        },
        '34' => {
          'name' => 'normal_max',
          'offset' => '128',
          'type' => '217521'
        },
        '35' => {
          'name' => 'normal_min',
          'offset' => '132',
          'type' => '217521'
        },
        '36' => {
          'name' => 'warning_high',
          'offset' => '136',
          'type' => '217521'
        },
        '37' => {
          'name' => 'warning_low',
          'offset' => '146',
          'type' => '217521'
        },
        '38' => {
          'name' => 'critical_high',
          'offset' => '150',
          'type' => '217521'
        },
        '39' => {
          'name' => 'critical_low',
          'offset' => '256',
          'type' => '217521'
        },
        '40' => {
          'name' => 'fatal_high',
          'offset' => '260',
          'type' => '217521'
        },
        '41' => {
          'name' => 'fatal_low',
          'offset' => '264',
          'type' => '217521'
        }
      },
      'Name' => 'struct pldm_numeric_sensor_value_pdr',
      'Size' => '112',
      'Type' => 'Struct'
    },
    '218846' => {
      'BaseType' => '215757',
      'Header' => 'platform.h',
      'Line' => '881',
      'Name' => 'pldm_utf16be',
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '218859' => {
      'Header' => 'platform.h',
      'Line' => '883',
      'Memb' => {
        '0' => {
          'name' => 'tag',
          'offset' => '0',
          'type' => '5611'
        },
        '1' => {
          'name' => 'name',
          'offset' => '8',
          'type' => '218901'
        }
      },
      'Name' => 'struct pldm_entity_auxiliary_name',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '218901' => {
      'BaseType' => '218846',
      'Name' => 'pldm_utf16be*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '218906' => {
      'Header' => 'platform.h',
      'Line' => '893',
      'Memb' => {
        '0' => {
          'name' => 'hdr',
          'offset' => '0',
          'type' => '218133'
        },
        '1' => {
          'name' => 'container',
          'offset' => '18',
          'type' => '164487'
        },
        '2' => {
          'name' => 'shared_name_count',
          'offset' => '24',
          'type' => '135'
        },
        '3' => {
          'name' => 'name_string_count',
          'offset' => '25',
          'type' => '135'
        },
        '4' => {
          'name' => 'names',
          'offset' => '36',
          'type' => '219020'
        },
        '5' => {
          'name' => 'auxiliary_name_data_size',
          'offset' => '50',
          'type' => '164'
        },
        '6' => {
          'name' => 'auxiliary_name_data',
          'offset' => '64',
          'type' => '219025'
        }
      },
      'Name' => 'struct pldm_entity_auxiliary_names_pdr',
      'Size' => '40',
      'Type' => 'Struct'
    },
    '219020' => {
      'BaseType' => '218859',
      'Name' => 'struct pldm_entity_auxiliary_name*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '219025' => {
      'BaseType' => '46',
      'Name' => 'char[]',
      'Size' => '8',
      'Type' => 'Array'
    },
    '219040' => {
      'Header' => 'platform.h',
      'Line' => '923',
      'Memb' => {
        '0' => {
          'name' => 'state_set_id',
          'offset' => '0',
          'type' => '5640'
        },
        '1' => {
          'name' => 'possible_states_size',
          'offset' => '2',
          'type' => '135'
        },
        '2' => {
          'name' => 'states',
          'offset' => '3',
          'type' => '217148'
        }
      },
      'Name' => 'struct state_effecter_possible_states',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '219097' => {
      'BaseType' => '219040',
      'Name' => 'struct state_effecter_possible_states const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '219298' => {
      'Header' => 'platform.h',
      'Line' => '993',
      'Memb' => {
        '0' => {
          'name' => 'set_request',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'effecter_state',
          'offset' => '1',
          'type' => '135'
        }
      },
      'Name' => 'struct state_field_for_state_effecter_set',
      'Size' => '2',
      'Type' => 'Struct'
    },
    '219341' => {
      'BaseType' => '219298',
      'Header' => 'platform.h',
      'Line' => '996',
      'Name' => 'set_effecter_state_field',
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '219354' => {
      'Header' => 'platform.h',
      'Line' => '1002',
      'Memb' => {
        '0' => {
          'name' => 'sensor_op_state',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'present_state',
          'offset' => '1',
          'type' => '135'
        },
        '2' => {
          'name' => 'previous_state',
          'offset' => '2',
          'type' => '135'
        },
        '3' => {
          'name' => 'event_state',
          'offset' => '3',
          'type' => '135'
        }
      },
      'Name' => 'struct state_field_for_get_state_sensor_readings',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '219425' => {
      'BaseType' => '219354',
      'Header' => 'platform.h',
      'Line' => '1010',
      'Name' => 'get_sensor_state_field',
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '219438' => {
      'Header' => 'platform.h',
      'Line' => '1016',
      'Memb' => {
        '0' => {
          'name' => 'effecter_op_state',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'pending_state',
          'offset' => '1',
          'type' => '135'
        },
        '2' => {
          'name' => 'present_state',
          'offset' => '2',
          'type' => '135'
        }
      },
      'Name' => 'struct state_field_for_get_state_effecter_states',
      'Size' => '3',
      'Type' => 'Struct'
    },
    '219495' => {
      'BaseType' => '219438',
      'Header' => 'platform.h',
      'Line' => '1020',
      'Name' => 'get_effecter_state_field',
      'Size' => '3',
      'Type' => 'Typedef'
    },
    '219979' => {
      'Header' => 'platform.h',
      'Line' => '1093',
      'Memb' => {
        '0' => {
          'name' => 'mctp_eid',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'vendor_specific',
          'offset' => '0',
          'type' => '7680'
        }
      },
      'Name' => 'anon-union-platform.h-1093',
      'Size' => '16',
      'Type' => 'Union'
    },
    '220013' => {
      'Header' => 'platform.h',
      'Line' => '1090',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'transport_protocol_type',
          'offset' => '1',
          'type' => '135'
        },
        '2' => {
          'name' => 'event_receiver_address',
          'offset' => '8',
          'type' => '219979'
        }
      },
      'Name' => 'struct pldm_get_event_receiver_resp',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '220315' => {
      'Header' => 'platform.h',
      'Line' => '1178',
      'Memb' => {
        '0' => {
          'name' => 'completion_code',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'comp_effecter_count',
          'offset' => '1',
          'type' => '135'
        },
        '2' => {
          'name' => 'field',
          'offset' => '2',
          'type' => '220372'
        }
      },
      'Name' => 'struct pldm_get_state_effecter_states_resp',
      'Size' => '26',
      'Type' => 'Struct'
    },
    '220372' => {
      'BaseType' => '219495',
      'Name' => 'get_effecter_state_field[8]',
      'Size' => '24',
      'Type' => 'Array'
    },
    '220388' => {
      'Header' => 'platform.h',
      'Line' => '1188',
      'Memb' => {
        '0' => {
          'name' => 'sensor_id',
          'offset' => '0',
          'type' => '5640'
        },
        '1' => {
          'name' => 'sensor_event_class_type',
          'offset' => '2',
          'type' => '135'
        },
        '2' => {
          'name' => 'event_class',
          'offset' => '3',
          'type' => '974'
        }
      },
      'Name' => 'struct pldm_sensor_event_data',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '220502' => {
      'Header' => 'platform.h',
      'Line' => '1228',
      'Memb' => {
        '0' => {
          'name' => 'format_version',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'event_id',
          'offset' => '2',
          'type' => '5640'
        },
        '2' => {
          'name' => 'data_transfer_handle',
          'offset' => '4',
          'type' => '147'
        }
      },
      'Name' => 'struct pldm_message_poll_event',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '220564' => {
      'Header' => 'platform.h',
      'Line' => '1238',
      'Memb' => {
        '0' => {
          'name' => 'format_version',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'format_type',
          'offset' => '1',
          'type' => '135'
        },
        '2' => {
          'name' => 'event_data_length',
          'offset' => '2',
          'type' => '5640'
        },
        '3' => {
          'name' => 'event_data',
          'offset' => '4',
          'type' => '220635'
        }
      },
      'Name' => 'struct pldm_platform_cper_event',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '220635' => {
      'BaseType' => '135',
      'Name' => 'uint8_t[]',
      'Size' => '8',
      'Type' => 'Array'
    },
    '220791' => {
      'Header' => 'platform.h',
      'Line' => '1298',
      'Memb' => {
        '0' => {
          'name' => 'event_data_format',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'number_of_change_records',
          'offset' => '1',
          'type' => '135'
        },
        '2' => {
          'name' => 'change_records',
          'offset' => '2',
          'type' => '974'
        }
      },
      'Name' => 'struct pldm_pdr_repository_chg_event_data',
      'Size' => '3',
      'Type' => 'Struct'
    },
    '229122' => {
      'BaseType' => '220564',
      'Name' => 'struct pldm_platform_cper_event*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '232587' => {
      'BaseType' => '218906',
      'Name' => 'struct pldm_entity_auxiliary_names_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '242107' => {
      'BaseType' => '220315',
      'Name' => 'struct pldm_get_state_effecter_states_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '282001' => {
      'BaseType' => '220013',
      'Name' => 'struct pldm_get_event_receiver_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '283457' => {
      'BaseType' => '2677',
      'Name' => 'size_t*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '294343' => {
      'BaseType' => '220502',
      'Name' => 'struct pldm_message_poll_event*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '295775' => {
      'BaseType' => '295785',
      'Name' => 'uint32_t const*const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '295780' => {
      'BaseType' => '159',
      'Name' => 'uint32_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '295785' => {
      'BaseType' => '295780',
      'Name' => 'uint32_t const*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '295790' => {
      'BaseType' => '220791',
      'Name' => 'struct pldm_pdr_repository_chg_event_data*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '339495' => {
      'BaseType' => '218253',
      'Name' => 'struct pldm_numeric_sensor_value_pdr*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '361613' => {
      'BaseType' => '220388',
      'Name' => 'struct pldm_sensor_event_data*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '361618' => {
      'BaseType' => '361613',
      'Name' => 'struct pldm_sensor_event_data*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '365593' => {
      'BaseType' => '219425',
      'Name' => 'get_sensor_state_field*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '389052' => {
      'BaseType' => '219341',
      'Name' => 'set_effecter_state_field*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '390033' => {
      'BaseType' => '209594',
      'Name' => 'struct pldm_state_sensor_pdr*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '390038' => {
      'BaseType' => '217143',
      'Name' => 'struct state_sensor_possible_states const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '390043' => {
      'BaseType' => '390038',
      'Name' => 'struct state_sensor_possible_states const*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '390443' => {
      'BaseType' => '204637',
      'Name' => 'struct pldm_state_effecter_pdr*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '390448' => {
      'BaseType' => '219097',
      'Name' => 'struct state_effecter_possible_states const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '390453' => {
      'BaseType' => '390448',
      'Name' => 'struct state_effecter_possible_states const*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '394001' => {
      'Line' => '19',
      'Memb' => {
        '0' => {
          'name' => 'prev',
          'offset' => '0',
          'type' => '4821'
        },
        '1' => {
          'name' => 'allocations',
          'offset' => '4',
          'type' => '147'
        }
      },
      'Name' => 'struct pldm_tid_state',
      'PrivateABI' => 1,
      'Size' => '8',
      'Source' => 'instance-id.c',
      'Type' => 'Struct'
    },
    '394040' => {
      'Line' => '24',
      'Memb' => {
        '0' => {
          'name' => 'state',
          'offset' => '0',
          'type' => '394082'
        },
        '1' => {
          'name' => 'lock_db_fd',
          'offset' => '8264',
          'type' => '53'
        }
      },
      'Name' => 'struct pldm_instance_db',
      'PrivateABI' => 1,
      'Size' => '2052',
      'Source' => 'instance-id.c',
      'Type' => 'Struct'
    },
    '394082' => {
      'BaseType' => '394001',
      'Name' => 'struct pldm_tid_state[256]',
      'Size' => '2048',
      'Type' => 'Array'
    },
    '394638' => {
      'BaseType' => '394040',
      'Name' => 'struct pldm_instance_db*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '395025' => {
      'BaseType' => '4821',
      'Name' => 'pldm_instance_id_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '395201' => {
      'BaseType' => '394638',
      'Name' => 'struct pldm_instance_db**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '395909' => {
      'BaseType' => '60',
      'Header' => 'int-ll64.h',
      'Line' => '21',
      'Name' => '__u8',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '395921' => {
      'BaseType' => '67',
      'Header' => 'int-ll64.h',
      'Line' => '24',
      'Name' => '__u16',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '396158' => {
      'Header' => 'socket.h',
      'Line' => '5',
      'Memb' => {
        '0' => {
          'name' => 'size',
          'offset' => '0',
          'type' => '53'
        },
        '1' => {
          'name' => 'socket',
          'offset' => '4',
          'type' => '53'
        },
        '2' => {
          'name' => 'max_size',
          'offset' => '8',
          'type' => '53'
        }
      },
      'Name' => 'struct pldm_socket_sndbuf',
      'PrivateABI' => 1,
      'Size' => '12',
      'Type' => 'Struct'
    },
    '396211' => {
      'BaseType' => '135',
      'Header' => 'pldm.h',
      'Line' => '13',
      'Name' => 'mctp_eid_t',
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '396325' => {
      'BaseType' => '4918',
      'Header' => 'pldm.h',
      'Line' => '30',
      'Name' => 'pldm_requester_rc_t',
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '396337' => {
      'Header' => 'transport.h',
      'Line' => '18',
      'Memb' => {
        '0' => {
          'name' => 'name',
          'offset' => '0',
          'type' => '8971'
        },
        '1' => {
          'name' => 'version',
          'offset' => '8',
          'type' => '135'
        },
        '2' => {
          'name' => 'recv',
          'offset' => '22',
          'type' => '396471'
        },
        '3' => {
          'name' => 'send',
          'offset' => '36',
          'type' => '396512'
        },
        '4' => {
          'name' => 'init_pollfd',
          'offset' => '50',
          'type' => '396593'
        }
      },
      'Name' => 'struct pldm_transport',
      'PrivateABI' => 1,
      'Size' => '40',
      'Type' => 'Struct'
    },
    '396451' => {
      'BaseType' => '396337',
      'Name' => 'struct pldm_transport*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '396456' => {
      'BaseType' => '4809',
      'Name' => 'pldm_tid_t*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '396471' => {
      'Name' => 'pldm_requester_rc_t(*)(struct pldm_transport*, pldm_tid_t*, void**, size_t*)',
      'Param' => {
        '0' => {
          'type' => '396451'
        },
        '1' => {
          'type' => '396456'
        },
        '2' => {
          'type' => '22122'
        },
        '3' => {
          'type' => '2677'
        }
      },
      'Return' => '396325',
      'Size' => '8',
      'Type' => 'FuncPtr'
    },
    '396512' => {
      'Name' => 'pldm_requester_rc_t(*)(struct pldm_transport*, pldm_tid_t, void const*, size_t)',
      'Param' => {
        '0' => {
          'type' => '396451'
        },
        '1' => {
          'type' => '4809'
        },
        '2' => {
          'type' => '1237'
        },
        '3' => {
          'type' => '164'
        }
      },
      'Return' => '396325',
      'Size' => '8',
      'Type' => 'FuncPtr'
    },
    '396537' => {
      'BaseType' => '396542',
      'Name' => 'struct pollfd*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '396542' => {
      'Header' => 'poll.h',
      'Line' => '36',
      'Memb' => {
        '0' => {
          'name' => 'fd',
          'offset' => '0',
          'type' => '53'
        },
        '1' => {
          'name' => 'events',
          'offset' => '4',
          'type' => '107'
        },
        '2' => {
          'name' => 'revents',
          'offset' => '6',
          'type' => '107'
        }
      },
      'Name' => 'struct pollfd',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Struct'
    },
    '396593' => {
      'Name' => 'int(*)(struct pldm_transport*, struct pollfd*)',
      'Param' => {
        '0' => {
          'type' => '396451'
        },
        '1' => {
          'type' => '396537'
        }
      },
      'Return' => '53',
      'Size' => '8',
      'Type' => 'FuncPtr'
    },
    '396598' => {
      'BaseType' => '67',
      'Header' => 'socket.h',
      'Line' => '10',
      'Name' => '__kernel_sa_family_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '396964' => {
      'Header' => 'mctp.h',
      'Line' => '18',
      'Memb' => {
        '0' => {
          'name' => 's_addr',
          'offset' => '0',
          'type' => '396211'
        }
      },
      'Name' => 'struct mctp_addr',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Struct'
    },
    '396991' => {
      'Header' => 'mctp.h',
      'Line' => '22',
      'Memb' => {
        '0' => {
          'name' => 'smctp_family',
          'offset' => '0',
          'type' => '396598'
        },
        '1' => {
          'name' => '__smctp_pad0',
          'offset' => '2',
          'type' => '395921'
        },
        '2' => {
          'name' => 'smctp_network',
          'offset' => '4',
          'type' => '74'
        },
        '3' => {
          'name' => 'smctp_addr',
          'offset' => '8',
          'type' => '396964'
        },
        '4' => {
          'name' => 'smctp_type',
          'offset' => '9',
          'type' => '395909'
        },
        '5' => {
          'name' => 'smctp_tag',
          'offset' => '16',
          'type' => '395909'
        },
        '6' => {
          'name' => '__smctp_pad1',
          'offset' => '17',
          'type' => '395909'
        }
      },
      'Name' => 'struct sockaddr_mctp',
      'PrivateABI' => 1,
      'Size' => '12',
      'Type' => 'Struct'
    },
    '397096' => {
      'BaseType' => '396991',
      'Name' => 'struct sockaddr_mctp const',
      'Size' => '12',
      'Type' => 'Const'
    },
    '397140' => {
      'Line' => '35',
      'Memb' => {
        '0' => {
          'name' => 'transport',
          'offset' => '0',
          'type' => '396337'
        },
        '1' => {
          'name' => 'socket',
          'offset' => '64',
          'type' => '53'
        },
        '2' => {
          'name' => 'tid_eid_map',
          'offset' => '68',
          'type' => '397233'
        },
        '3' => {
          'name' => 'socket_send_buf',
          'offset' => '768',
          'type' => '396158'
        },
        '4' => {
          'name' => 'bound',
          'offset' => '786',
          'type' => '5439'
        },
        '5' => {
          'name' => 'cookie_jar',
          'offset' => '800',
          'type' => '4833'
        }
      },
      'Name' => 'struct pldm_transport_af_mctp',
      'PrivateABI' => 1,
      'Size' => '336',
      'Source' => 'af-mctp.c',
      'Type' => 'Struct'
    },
    '397233' => {
      'BaseType' => '4809',
      'Name' => 'pldm_tid_t[256]',
      'Size' => '256',
      'Type' => 'Array'
    },
    '398034' => {
      'BaseType' => '397140',
      'Name' => 'struct pldm_transport_af_mctp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '398039' => {
      'BaseType' => '397096',
      'Name' => 'struct sockaddr_mctp const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '398352' => {
      'BaseType' => '398034',
      'Name' => 'struct pldm_transport_af_mctp**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '401462' => {
      'Line' => '26',
      'Memb' => {
        '0' => {
          'name' => 'transport',
          'offset' => '0',
          'type' => '396337'
        },
        '1' => {
          'name' => 'socket',
          'offset' => '64',
          'type' => '53'
        },
        '2' => {
          'name' => 'tid_eid_map',
          'offset' => '68',
          'type' => '397233'
        },
        '3' => {
          'name' => 'socket_send_buf',
          'offset' => '768',
          'type' => '396158'
        }
      },
      'Name' => 'struct pldm_transport_mctp_demux',
      'PrivateABI' => 1,
      'Size' => '312',
      'Source' => 'mctp-demux.c',
      'Type' => 'Struct'
    },
    '402067' => {
      'BaseType' => '401462',
      'Name' => 'struct pldm_transport_mctp_demux*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '402573' => {
      'BaseType' => '402067',
      'Name' => 'struct pldm_transport_mctp_demux**',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '425125' => {
      'Header' => 'file_io.h',
      'Line' => '32',
      'Memb' => {
        '0' => {
          'name' => 'handle',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'length',
          'offset' => '4',
          'type' => '147'
        },
        '2' => {
          'name' => 'data',
          'offset' => '8',
          'type' => '220635'
        }
      },
      'Name' => 'struct pldm_oem_meta_file_io_write_req',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '425192' => {
      'Header' => 'file_io.h',
      'Line' => '45',
      'Memb' => {
        '0' => {
          'name' => 'transferFlag',
          'offset' => '0',
          'type' => '135'
        },
        '1' => {
          'name' => 'offset',
          'offset' => '2',
          'type' => '5640'
        }
      },
      'Name' => 'struct pldm_oem_meta_file_io_read_data_info',
      'Size' => '4',
      'Type' => 'Struct'
    },
    '425231' => {
      'Header' => 'file_io.h',
      'Line' => '55',
      'Memb' => {
        '0' => {
          'name' => 'size',
          'offset' => '0',
          'type' => '5640'
        },
        '1' => {
          'name' => 'crc32',
          'offset' => '4',
          'type' => '147'
        }
      },
      'Name' => 'struct pldm_oem_meta_file_io_read_attr_info',
      'Size' => '8',
      'Type' => 'Struct'
    },
    '425270' => {
      'Header' => 'file_io.h',
      'Line' => '70',
      'Memb' => {
        '0' => {
          'name' => 'data',
          'offset' => '0',
          'type' => '425192'
        }
      },
      'Name' => 'anon-union-file_io.h-70',
      'Size' => '4',
      'Type' => 'Union'
    },
    '425288' => {
      'Header' => 'file_io.h',
      'Line' => '65',
      'Memb' => {
        '0' => {
          'name' => 'version',
          'offset' => '0',
          'type' => '164'
        },
        '1' => {
          'name' => 'handle',
          'offset' => '8',
          'type' => '135'
        },
        '2' => {
          'name' => 'option',
          'offset' => '9',
          'type' => '135'
        },
        '3' => {
          'name' => 'length',
          'offset' => '16',
          'type' => '135'
        },
        '4' => {
          'name' => 'info',
          'offset' => '18',
          'type' => '425270'
        }
      },
      'Name' => 'struct pldm_oem_meta_file_io_read_req',
      'Size' => '16',
      'Type' => 'Struct'
    },
    '425366' => {
      'Header' => 'file_io.h',
      'Line' => '86',
      'Memb' => {
        '0' => {
          'name' => 'attr',
          'offset' => '0',
          'type' => '425231'
        },
        '1' => {
          'name' => 'data',
          'offset' => '0',
          'type' => '425192'
        }
      },
      'Name' => 'anon-union-file_io.h-86',
      'Size' => '8',
      'Type' => 'Union'
    },
    '425394' => {
      'Header' => 'file_io.h',
      'Line' => '80',
      'Memb' => {
        '0' => {
          'name' => 'version',
          'offset' => '0',
          'type' => '164'
        },
        '1' => {
          'name' => 'completion_code',
          'offset' => '8',
          'type' => '135'
        },
        '2' => {
          'name' => 'handle',
          'offset' => '9',
          'type' => '135'
        },
        '3' => {
          'name' => 'option',
          'offset' => '16',
          'type' => '135'
        },
        '4' => {
          'name' => 'length',
          'offset' => '17',
          'type' => '135'
        },
        '5' => {
          'name' => 'info',
          'offset' => '18',
          'type' => '425366'
        },
        '6' => {
          'name' => 'data',
          'offset' => '32',
          'type' => '220635'
        }
      },
      'Name' => 'struct pldm_oem_meta_file_io_read_resp',
      'Size' => '24',
      'Type' => 'Struct'
    },
    '429384' => {
      'BaseType' => '425394',
      'Name' => 'struct pldm_oem_meta_file_io_read_resp*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '431642' => {
      'BaseType' => '425288',
      'Name' => 'struct pldm_oem_meta_file_io_read_req*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '432078' => {
      'BaseType' => '425125',
      'Name' => 'struct pldm_oem_meta_file_io_write_req*',
      'Size' => '8',
      'Type' => 'Pointer'
    }
  },
  'UndefinedSymbols' => {
    'libpldm.so.0.13.0' => {
      '_ITM_deregisterTMCloneTable' => 0,
      '_ITM_registerTMCloneTable' => 0,
      '__assert_fail@GLIBC_2.2.5' => 0,
      '__cxa_finalize@GLIBC_2.2.5' => 0,
      '__errno_location@GLIBC_2.2.5' => 0,
      '__gmon_start__' => 0,
      '__isoc23_strtol@GLIBC_2.38' => 0,
      '__memcpy_chk@GLIBC_2.3.4' => 0,
      '__recv_chk@GLIBC_2.4' => 0,
      '__recvfrom_chk@GLIBC_2.4' => 0,
      '__stack_chk_fail@GLIBC_2.4' => 0,
      'bind@GLIBC_2.2.5' => 0,
      'calloc@GLIBC_2.2.5' => 0,
      'clock_gettime@GLIBC_2.17' => 0,
      'close@GLIBC_2.2.5' => 0,
      'connect@GLIBC_2.2.5' => 0,
      'dup@GLIBC_2.2.5' => 0,
      'fclose@GLIBC_2.2.5' => 0,
      'fcntl64@GLIBC_2.28' => 0,
      'fgets@GLIBC_2.2.5' => 0,
      'fopen64@GLIBC_2.2.5' => 0,
      'free@GLIBC_2.2.5' => 0,
      'getsockopt@GLIBC_2.2.5' => 0,
      'malloc@GLIBC_2.2.5' => 0,
      'memcmp@GLIBC_2.2.5' => 0,
      'memcpy@GLIBC_2.14' => 0,
      'memmem@GLIBC_2.2.5' => 0,
      'open64@GLIBC_2.2.5' => 0,
      'poll@GLIBC_2.2.5' => 0,
      'ppoll@GLIBC_2.4' => 0,
      'recv@GLIBC_2.2.5' => 0,
      'recvmsg@GLIBC_2.2.5' => 0,
      'sendmsg@GLIBC_2.2.5' => 0,
      'sendto@GLIBC_2.2.5' => 0,
      'setsockopt@GLIBC_2.2.5' => 0,
      'socket@GLIBC_2.2.5' => 0,
      'stat64@GLIBC_2.33' => 0,
      'strlen@GLIBC_2.2.5' => 0,
      'strnlen@GLIBC_2.2.5' => 0,
      'timerfd_create@GLIBC_2.8' => 0,
      'timerfd_settime@GLIBC_2.8' => 0,
      'write@GLIBC_2.2.5' => 0
    }
  },
  'WordSize' => '8'
};
