$VAR1 = {
  'ABI_DUMPER_VERSION' => '1.4',
  'ABI_DUMP_VERSION' => '3.5',
  'Arch' => 'x86_64',
  'GccVersion' => '14.2.0',
  'Headers' => {
    'firmware_update.hpp' => 1,
    'types.hpp' => 1
  },
  'Language' => 'C++',
  'LibraryName' => 'libpldm++.so.0.17.0',
  'LibraryVersion' => '0.17.0',
  'NameSpaces' => {
    '__gnu_cxx' => 1,
    'libpldm' => 1,
    'pldm::fw_update' => 1,
    'pldm::utils' => 1,
    'std' => 1,
    'std::__cxx11' => 1,
    'std::__detail' => 1,
    'std::__exception_ptr' => 1,
    'std::__expected' => 1,
    'std::__format' => 1
  },
  'Needed' => {
    'libc.so.6' => 1,
    'libgcc_s.so.1' => 1,
    'libpldm.so.0' => 1,
    'libstdc++.so.6' => 1
  },
  'PublicABI' => '1',
  'Sources' => {
    'firmware_update.cpp' => 1,
    'types.cpp' => 1
  },
  'SymbolInfo' => {
    '98408' => {
      'Class' => '98333',
      'Header' => 'firmware_update.hpp',
      'Line' => '209',
      'MnglName' => '_ZN4pldm9fw_update13PackageParser5parseERKSt4spanIKhLm18446744073709551615EENS0_10PackagePinE',
      'Param' => {
        '0' => {
          'name' => 'pkg',
          'type' => '100134'
        },
        '1' => {
          'name' => 'pin',
          'type' => '97186'
        }
      },
      'Return' => '61222',
      'ShortName' => 'parse',
      'Source' => 'firmware_update.cpp',
      'SourceLine' => '104',
      'Static' => 1
    },
    '102048' => {
      'Destructor' => 1,
      'Header' => 'firmware_update.hpp',
      'Line' => '169',

      '_ZNSt7__equalILb0EE5equalIPKN4pldm9fw_update18ComponentImageInfoES6_EEbT_S7_T0_' => 1,
      '_ZNSt7__equalILb0EE5equalIPKN4pldm9fw_update22FirmwareDeviceIDRecordES6_EEbT_S7_T0_' => 1,
      '_ZNSt7__equalILb1EE5equalIhEEbPKT_S4_S4_' => 1,
      '_ZNSt7__equalILb1EE5equalImEEbPKT_S4_S4_' => 1,
      '_ZNSt8__detail14__to_chars_lenIjEEjT_i' => 1,
      '_ZNSt8__detail14__to_chars_lenImEEjT_i' => 1,
      '_ZNSt8__detail18__to_chars_10_implIjEEvPcjT_' => 1,
      '_ZNSt8__detail18__to_chars_10_implImEEvPcjT_' => 1,
      '_ZNSt8expectedINSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEES5_ED1Ev' => 1,
      '_ZNSt8expectedINSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEES5_ED1EvQoont27is_trivially_destructible_vIT_Ent27is_trivially_destructible_vIT0_E' => 1,
      '_ZNSt8expectedINSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEES5_ED2Ev' => 1,
      '_ZNSt8expectedINSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEES5_ED2EvQoont27is_trivially_destructible_vIT_Ent27is_trivially_destructible_vIT0_E' => 1,
      '_ZSt11__equal_auxIN9__gnu_cxx17__normal_iteratorIPKhSt6vectorIhSaIhEEEES7_EbT_S8_T0_' => 1,
      '_ZSt11__equal_auxIN9__gnu_cxx17__normal_iteratorIPKmSt6vectorImSaImEEEES7_EbT_S8_T0_' => 1,
      '_ZSt13__copy_move_aILb0EN9__gnu_cxx17__normal_iteratorIPKhSt6vectorIhSaIhEEEEPhET1_T0_SA_S9_' => 1,
      '_ZSt13__copy_move_aILb0EN9__gnu_cxx17__normal_iteratorIPKmSt6vectorImSaImEEEEPmET1_T0_SA_S9_' => 1,
      '_ZSt18uninitialized_copyIN9__gnu_cxx17__normal_iteratorIPKhSt6vectorIhSaIhEEEEPhET0_T_SA_S9_' => 1,
      '_ZSt18uninitialized_copyIN9__gnu_cxx17__normal_iteratorIPKmSt6vectorImSaImEEEEPmET0_T_SA_S9_' => 1,
      '_ZSt4copyIN9__gnu_cxx17__normal_iteratorIPKhSt6vectorIhSaIhEEEEPhET0_T_SA_S9_' => 1,
      '_ZSt4copyIN9__gnu_cxx17__normal_iteratorIPKmSt6vectorImSaImEEEEPmET0_T_SA_S9_' => 1,
      '_ZSteqIcSt11char_traitsIcESaIcEEbRKNSt7__cxx1112basic_stringIT_T0_T1_EESA_' => 1,
      '_ZSteqIhSaIhEEbRKSt6vectorIT_T0_ES6_' => 1,
      '_ZSteqImSaImEEbRKSt6vectorIT_T0_ES6_' => 1,
      '_ZStneINSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEES5_ENSt9enable_ifIXsrSt14is_convertibleIDTnecl7declvalIRKT_EEcl7declvalIRKT0_EEEbE5valueEbE4typeERKSt8optionalIS8_ERKSI_ISB_E' => 1,
      '_ZTISt19bad_expected_accessINSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEEE' => -24,
      '_ZTISt19bad_expected_accessIvE' => -24,
      '_ZTSSt19bad_expected_accessINSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEEE' => -78,
      '_ZTSSt19bad_expected_accessIvE' => -27,
      '_ZTVSt19bad_expected_accessINSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEEE' => -40,
      '_ZTVSt19bad_expected_accessIvE' => -40,
      '_ZZNSt6vectorImSaImEE17_M_realloc_appendIJRmEEEvDpOT_EN6_GuardD1Ev' => 1,
      '_ZZNSt6vectorImSaImEE17_M_realloc_appendIJRmEEEvDpOT_EN6_GuardD2Ev' => 1,
      '_ZZNSt6vectorItSaItEE17_M_realloc_appendIJRKtEEEvDpOT_EN6_GuardD1Ev' => 1,
      '_ZZNSt6vectorItSaItEE17_M_realloc_appendIJRKtEEEvDpOT_EN6_GuardD2Ev' => 1
    }
  },
  'Target' => 'unix',
  'TypeInfo' => {
    '315' => {
      'BaseType' => '87846',
      'Header' => 'c++config.h',
      'Line' => '310',
      'Name' => 'std::size_t',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '475' => {
      'Header' => 'span',
      'Line' => '84',
      'Memb' => {
        '0' => {
          'access' => 'private',
          'name' => '_M_extent_value',
          'offset' => '0',
          'type' => '315'
        }
      },
      'Name' => 'std::__detail::__extent_storage<18446744073709551615ul>',
      'NameSpace' => 'std::__detail',
      'PrivateABI' => 1,
      'Size' => '8',
      'TParam' => {
        '0' => {
          'key' => '_Extent',
          'type' => '87846',
          'val' => '18446744073709551615'
        }
      },
      'Type' => 'Class'
    },
    '3091' => {
      'Header' => 'new_allocator.h',
      'Line' => '63',
      'Name' => 'std::__new_allocator<char>',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '1',
      'TParam' => {
        '0' => {
          'key' => '_Tp',
          'type' => '88221'
        }
      },
      'Type' => 'Class'
    },
    '3335' => {
      'Base' => {
        '3091' => {
          'pos' => '0'
        }
      },
      'Header' => 'allocator.h',
      'Line' => '128',
      'Name' => 'std::allocator<char>',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '1',
      'TParam' => {
        '0' => {
          'name' => 'char'
        }
      },
      'Type' => 'Class'
    },
    '6854' => {
      'Copied' => 1,
      'Header' => 'alloc_traits.h',
      'Line' => '461',
      'Name' => 'struct std::allocator_traits<std::allocator<char> >',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '1',
      'TParam' => {
        '0' => {
          'type' => '3335'
        }
      },
      'Type' => 'Struct'
    },
    '6868' => {
      'BaseType' => '89524',
      'Header' => 'alloc_traits.h',
      'Line' => '470',
      'Name' => 'std::allocator_traits<std::allocator<char> >::pointer',
      'NameSpace' => 'std::allocator_traits<std::allocator<char> >',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '6931' => {
      'BaseType' => '315',
      'Header' => 'alloc_traits.h',
      'Line' => '485',
      'Name' => 'std::allocator_traits<std::allocator<char> >::size_type',
      'NameSpace' => 'std::allocator_traits<std::allocator<char> >',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '7122' => {
      'Header' => 'basic_string.h',
      'Line' => '86',
      'Memb' => {
        '0' => {
          'access' => 'private',
          'name' => '_M_dataplus',
          'offset' => '0',
          'type' => '7135'
        },
        '1' => {
          'access' => 'private',
          'name' => '_M_string_length',
          'offset' => '8',
          'type' => '7335'
        },
        '2' => {
          'access' => 'private',
          'name' => 'unnamed0',
          'offset' => '22',
          'type' => '7300'
        }
      },
      'Name' => 'std::__cxx11::basic_string<char>',
      'NameSpace' => 'std::__cxx11',
      'PrivateABI' => 1,
      'Size' => '32',
      'TParam' => {
        '0' => {
          'key' => '_CharT',
          'type' => '88221'
        }
      },
      'Type' => 'Class'
    },
    '7135' => {
      'Base' => {
        '3335' => {
          'pos' => '0'
        }
      },
      'Header' => 'basic_string.h',
      'Line' => '186',
      'Memb' => {
        '0' => {
          'name' => '_M_p',
          'offset' => '0',
          'type' => '7265'
        }
      },
      'Name' => 'struct std::__cxx11::basic_string<char>::_Alloc_hider',
      'NameSpace' => 'std::__cxx11::basic_string<char>',
      'Private' => 1,
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Struct'
    },
    '7265' => {
      'BaseType' => '79519',
      'Header' => 'basic_string.h',
      'Line' => '108',
      'Name' => 'std::__cxx11::basic_string<char>::pointer',
      'NameSpace' => 'std::__cxx11::basic_string<char>',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '7300' => {
      'Header' => 'basic_string.h',
      'Line' => '210',
      'Memb' => {
        '0' => {
          'name' => '_M_local_buf',
          'offset' => '0',
          'type' => '93618'
        },
        '1' => {
          'name' => '_M_allocated_capacity',
          'offset' => '0',
          'type' => '7335'
        }
      },
      'Name' => 'std::__cxx11::basic_string<char>::anon-union-basic_string.h-210',
      'NameSpace' => 'std::__cxx11::basic_string<char>',
      'Private' => 1,
      'PrivateABI' => 1,
      'Size' => '16',
      'Type' => 'Union'
    },
    '7335' => {
      'BaseType' => '79543',
      'Header' => 'basic_string.h',
      'Line' => '104',
      'Name' => 'std::__cxx11::basic_string<char>::size_type',
      'NameSpace' => 'std::__cxx11::basic_string<char>',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '15410' => {
      'Header' => 'bitset',
      'Line' => '401',
      'Memb' => {
        '0' => {
          'name' => '_M_w',
          'offset' => '0',
          'type' => '15424'
        }
      },
      'Name' => 'struct std::_Base_bitset<1ul>',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '8',
      'TParam' => {
        '0' => {
          'key' => '_Nw',
          'type' => '87846',
          'val' => '1'
        }
      },
      'Type' => 'Struct'
    },
    '15424' => {
      'BaseType' => '87846',
      'Header' => 'bitset',
      'Line' => '403',
      'Name' => 'std::_Base_bitset<1ul>::_WordT',
      'NameSpace' => 'std::_Base_bitset<1ul>',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '16506' => {
      'Header' => 'stl_tree.h',
      'Line' => '95',
      'Memb' => {
        '0' => {
          'name' => '_S_red',
          'value' => '0'
        },
        '1' => {
          'name' => '_S_black',
          'value' => '1'
        }
      },
      'Name' => 'enum std::_Rb_tree_color',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '4',
      'Type' => 'Enum'
    },
    '16536' => {
      'Copied' => 1,
      'Header' => 'stl_tree.h',
      'Line' => '97',
      'Memb' => {
        '0' => {
          'name' => '_M_color',
          'offset' => '0',
          'type' => '16506'
        },
        '1' => {
          'name' => '_M_parent',
          'offset' => '8',
          'type' => '16562'
        },
        '2' => {
          'name' => '_M_left',
          'offset' => '22',
          'type' => '16562'
        },
        '3' => {
          'name' => '_M_right',
          'offset' => '36',
          'type' => '16562'
        }
      },
      'Name' => 'struct std::_Rb_tree_node_base',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '32',
      'Type' => 'Struct'
    },
    '16562' => {
      'BaseType' => '95903',
      'Header' => 'stl_tree.h',
      'Line' => '99',
      'Name' => 'std::_Rb_tree_node_base::_Base_ptr',
      'NameSpace' => 'std::_Rb_tree_node_base',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '16732' => {
      'Header' => 'stl_tree.h',
      'Line' => '164',
      'Memb' => {
        '0' => {
          'name' => '_M_header',
          'offset' => '0',
          'type' => '16536'
        },
        '1' => {
          'name' => '_M_node_count',
          'offset' => '50',
          'type' => '315'
        }
      },
      'Name' => 'struct std::_Rb_tree_header',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '40',
      'Type' => 'Struct'
    },
    '18154' => {
      'BaseType' => '7122',
      'Header' => 'stringfwd.h',
      'Line' => '77',
      'Name' => 'std::string',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '32',
      'Type' => 'Typedef'
    },
    '18166' => {
      'BaseType' => '18154',
      'Name' => 'std::string const',
      'Size' => '32',
      'Type' => 'Const'
    },
    '23530' => {
      'Copied' => 1,
      'Header' => 'optional',
      'Line' => '443',
      'Name' => 'std::_Optional_base_impl<std::__cxx11::basic_string<char>, std::_Optional_base<std::__cxx11::basic_string<char> > >',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '1',
      'TParam' => {
        '0' => {
          'key' => '_Tp',
          'type' => '7122'
        },
        '1' => {
          'key' => '_Dp',
          'type' => '24790'
        }
      },
      'Type' => 'Class'
    },
    '23720' => {
      'Header' => 'optional',
      'Line' => '112',
      'Memb' => {
        '0' => {
          'name' => '_M_payload',
          'offset' => '0',
          'type' => '23742'
        },
        '1' => {
          'name' => '_M_engaged',
          'offset' => '50',
          'type' => '79157'
        }
      },
      'Name' => 'struct std::_Optional_payload_base<std::__cxx11::basic_string<char> >',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '40',
      'TParam' => {
        '0' => {
          'key' => '_Tp',
          'type' => '7122'
        }
      },
      'Type' => 'Struct'
    },
    '23733' => {
      'Header' => 'optional',
      'Line' => '200',
      'Name' => 'struct std::_Optional_payload_base<std::__cxx11::basic_string<char> >::_Empty_byte',
      'NameSpace' => 'std::_Optional_payload_base<std::__cxx11::basic_string<char> >',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Struct'
    },
    '23742' => {
      'Header' => 'optional',
      'Line' => '233',
      'Memb' => {
        '0' => {
          'name' => '_M_empty',
          'offset' => '0',
          'type' => '23733'
        },
        '1' => {
          'name' => '_M_value',
          'offset' => '0',
          'type' => '7122'
        }
      },
      'Name' => 'union std::_Optional_payload_base<std::__cxx11::basic_string<char> >::_Storage<std::__cxx11::basic_string<char> >',
      'NameSpace' => 'std::_Optional_payload_base<std::__cxx11::basic_string<char> >',
      'PrivateABI' => 1,
      'Size' => '32',
      'TParam' => {
        '0' => {
          'key' => '_Up',
          'type' => '7122'
        }
      },
      'Type' => 'Union'
    },
    '24326' => {
      'Base' => {
        '23720' => {
          'pos' => '0'
        }
      },
      'Header' => 'optional',
      'Line' => '392',
      'Name' => 'struct std::_Optional_payload<std::__cxx11::basic_string<char> >',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '40',
      'TParam' => {
        '0' => {
          'key' => '_Tp',
          'type' => '7122'
        }
      },
      'Type' => 'Struct'
    },
    '24790' => {
      'Base' => {
        '23530' => {
          'pos' => '0'
        }
      },
      'Header' => 'optional',
      'Line' => '508',
      'Memb' => {
        '0' => {
          'name' => '_M_payload',
          'offset' => '0',
          'type' => '24326'
        }
      },
      'Name' => 'struct std::_Optional_base<std::__cxx11::basic_string<char> >',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '40',
      'TParam' => {
        '0' => {
          'key' => '_Tp',
          'type' => '7122'
        }
      },
      'Type' => 'Struct'
    },
    '25002' => {
      'Header' => 'enable_special_members.h',
      'Line' => '87',
      'Name' => 'struct std::_Enable_copy_move<true, true, true, true, std::optional<std::__cxx11::basic_string<char> > >',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '1',
      'TParam' => {
        '0' => {
          'key' => '_Copy',
          'type' => '79157',
          'val' => '1'
        },
        '1' => {
          'key' => '_CopyAssignment',
          'type' => '79157',
          'val' => '1'
        },
        '2' => {
          'key' => '_Move',
          'type' => '79157',
          'val' => '1'
        },
        '3' => {
          'key' => '_MoveAssignment',
          'type' => '79157',
          'val' => '1'
        },
        '4' => {
          'key' => '_Tag',
          'type' => '25065'
        }
      },
      'Type' => 'Struct'
    },
    '25065' => {
      'Base' => {
        '24790' => {
          'pos' => '0'
        },
        '25002' => {
          'pos' => '1'
        }
      },
      'Header' => 'optional',
      'Line' => '703',
      'Name' => 'std::optional<std::__cxx11::basic_string<char> >',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '40',
      'TParam' => {
        '0' => {
          'key' => '_Tp',
          'type' => '7122'
        }
      },
      'Type' => 'Class'
    },
    '25627' => {
      'BaseType' => '25065',
      'Name' => 'std::optional<std::__cxx11::basic_string<char> >const',
      'Size' => '40',
      'Type' => 'Const'
    },
    '25632' => {
      'Header' => 'new_allocator.h',
      'Line' => '63',
      'Name' => 'std::__new_allocator<unsigned char>',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '1',
      'TParam' => {
        '0' => {
          'key' => '_Tp',
          'type' => '87822'
        }
      },
      'Type' => 'Class'
    },
    '25876' => {
      'Base' => {
        '25632' => {
          'pos' => '0'
        }
      },
      'Header' => 'allocator.h',
      'Line' => '128',
      'Name' => 'std::allocator<unsigned char>',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '1',
      'TParam' => {
        '0' => {
          'name' => 'unsigned char'
        }
      },
      'Type' => 'Class'
    },
    '26096' => {
      'Copied' => 1,
      'Header' => 'alloc_traits.h',
      'Line' => '461',
      'Name' => 'struct std::allocator_traits<std::allocator<unsigned char> >',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '1',
      'TParam' => {
        '0' => {
          'type' => '25876'
        }
      },
      'Type' => 'Struct'
    },
    '26110' => {
      'BaseType' => '98654',
      'Header' => 'alloc_traits.h',
      'Line' => '470',
      'Name' => 'std::allocator_traits<std::allocator<unsigned char> >::pointer',
      'NameSpace' => 'std::allocator_traits<std::allocator<unsigned char> >',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '26350' => {
      'Header' => 'stl_vector.h',
      'Line' => '84',
      'Memb' => {
        '0' => {
          'name' => '_M_impl',
          'offset' => '0',
          'type' => '26548'
        }
      },
      'Name' => 'struct std::_Vector_base<unsigned char, std::allocator<unsigned char> >',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '24',
      'TParam' => {
        '0' => {
          'key' => '_Tp',
          'type' => '87822'
        },
        '1' => {
          'key' => '_Alloc',
          'type' => '25876'
        }
      },
      'Type' => 'Struct'
    },
    '26363' => {
      'Header' => 'stl_vector.h',
      'Line' => '91',
      'Memb' => {
        '0' => {
          'name' => '_M_start',
          'offset' => '0',
          'type' => '26536'
        },
        '1' => {
          'name' => '_M_finish',
          'offset' => '8',
          'type' => '26536'
        },
        '2' => {
          'name' => '_M_end_of_storage',
          'offset' => '22',
          'type' => '26536'
        }
      },
      'Name' => 'struct std::_Vector_base<unsigned char, std::allocator<unsigned char> >::_Vector_impl_data',
      'NameSpace' => 'std::_Vector_base<unsigned char, std::allocator<unsigned char> >',
      'PrivateABI' => 1,
      'Size' => '24',
      'Type' => 'Struct'
    },
    '26536' => {
      'BaseType' => '81566',
      'Header' => 'stl_vector.h',
      'Line' => '89',
      'Name' => 'std::_Vector_base<unsigned char, std::allocator<unsigned char> >::pointer',
      'NameSpace' => 'std::_Vector_base<unsigned char, std::allocator<unsigned char> >',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '26548' => {
      'Base' => {
        '25876' => {
          'pos' => '0'
        },
        '26363' => {
          'pos' => '1'
        }
      },
      'Header' => 'stl_vector.h',
      'Line' => '132',
      'Name' => 'struct std::_Vector_base<unsigned char, std::allocator<unsigned char> >::_Vector_impl',
      'NameSpace' => 'std::_Vector_base<unsigned char, std::allocator<unsigned char> >',
      'PrivateABI' => 1,
      'Size' => '24',
      'Type' => 'Struct'
    },
    '27359' => {
      'Base' => {
        '26350' => {
          'access' => 'protected',
          'pos' => '0'
        }
      },
      'Header' => 'stl_vector.h',
      'Line' => '428',
      'Name' => 'std::vector<unsigned char>',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '24',
      'TParam' => {
        '0' => {
          'name' => 'unsigned char'
        }
      },
      'Type' => 'Class'
    },
    '30524' => {
      'BaseType' => '27359',
      'Name' => 'std::vector<unsigned char>const',
      'Size' => '24',
      'Type' => 'Const'
    },
    '30803' => {
      'Base' => {
        '15410' => {
          'pos' => '0'
        }
      },
      'Header' => 'bitset',
      'Line' => '804',
      'Name' => 'std::bitset<16ul>',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '8',
      'TParam' => {
        '0' => {
          'key' => '_Nb',
          'type' => '87846',
          'val' => '16'
        }
      },
      'Type' => 'Class'
    },
    '32164' => {
      'BaseType' => '30803',
      'Name' => 'std::bitset<16ul>const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '32169' => {
      'Base' => {
        '15410' => {
          'pos' => '0'
        }
      },
      'Header' => 'bitset',
      'Line' => '804',
      'Name' => 'std::bitset<32ul>',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '8',
      'TParam' => {
        '0' => {
          'key' => '_Nb',
          'type' => '87846',
          'val' => '32'
        }
      },
      'Type' => 'Class'
    },
    '33530' => {
      'BaseType' => '32169',
      'Name' => 'std::bitset<32ul>const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '33535' => {
      'Header' => 'new_allocator.h',
      'Line' => '63',
      'Name' => 'std::__new_allocator<unsigned long>',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '1',
      'TParam' => {
        '0' => {
          'key' => '_Tp',
          'type' => '87846'
        }
      },
      'Type' => 'Class'
    },
    '33779' => {
      'Base' => {
        '33535' => {
          'pos' => '0'
        }
      },
      'Header' => 'allocator.h',
      'Line' => '128',
      'Name' => 'std::allocator<unsigned long>',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '1',
      'TParam' => {
        '0' => {
          'name' => 'unsigned long'
        }
      },
      'Type' => 'Class'
    },
    '33999' => {
      'Copied' => 1,
      'Header' => 'alloc_traits.h',
      'Line' => '461',
      'Name' => 'struct std::allocator_traits<std::allocator<unsigned long> >',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '1',
      'TParam' => {
        '0' => {
          'type' => '33779'
        }
      },
      'Type' => 'Struct'
    },
    '34013' => {
      'BaseType' => '98989',
      'Header' => 'alloc_traits.h',
      'Line' => '470',
      'Name' => 'std::allocator_traits<std::allocator<unsigned long> >::pointer',
      'NameSpace' => 'std::allocator_traits<std::allocator<unsigned long> >',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '34305' => {
      'Header' => 'stl_vector.h',
      'Line' => '84',
      'Memb' => {
        '0' => {
          'name' => '_M_impl',
          'offset' => '0',
          'type' => '34503'
        }
      },
      'Name' => 'struct std::_Vector_base<unsigned long, std::allocator<unsigned long> >',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '24',
      'TParam' => {
        '0' => {
          'key' => '_Tp',
          'type' => '87846'
        },
        '1' => {
          'key' => '_Alloc',
          'type' => '33779'
        }
      },
      'Type' => 'Struct'
    },
    '34318' => {
      'Header' => 'stl_vector.h',
      'Line' => '91',
      'Memb' => {
        '0' => {
          'name' => '_M_start',
          'offset' => '0',
          'type' => '34491'
        },
        '1' => {
          'name' => '_M_finish',
          'offset' => '8',
          'type' => '34491'
        },
        '2' => {
          'name' => '_M_end_of_storage',
          'offset' => '22',
          'type' => '34491'
        }
      },
      'Name' => 'struct std::_Vector_base<unsigned long, std::allocator<unsigned long> >::_Vector_impl_data',
      'NameSpace' => 'std::_Vector_base<unsigned long, std::allocator<unsigned long> >',
      'PrivateABI' => 1,
      'Size' => '24',
      'Type' => 'Struct'
    },
    '34491' => {
      'BaseType' => '81858',
      'Header' => 'stl_vector.h',
      'Line' => '89',
      'Name' => 'std::_Vector_base<unsigned long, std::allocator<unsigned long> >::pointer',
      'NameSpace' => 'std::_Vector_base<unsigned long, std::allocator<unsigned long> >',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '34503' => {
      'Base' => {
        '33779' => {
          'pos' => '0'
        },
        '34318' => {
          'pos' => '1'
        }
      },
      'Header' => 'stl_vector.h',
      'Line' => '132',
      'Name' => 'struct std::_Vector_base<unsigned long, std::allocator<unsigned long> >::_Vector_impl',
      'NameSpace' => 'std::_Vector_base<unsigned long, std::allocator<unsigned long> >',
      'PrivateABI' => 1,
      'Size' => '24',
      'Type' => 'Struct'
    },
    '35314' => {
      'Base' => {
        '34305' => {
          'access' => 'protected',
          'pos' => '0'
        }
      },
      'Header' => 'stl_vector.h',
      'Line' => '428',
      'Name' => 'std::vector<unsigned long>',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '24',
      'TParam' => {
        '0' => {
          'name' => 'unsigned long'
        }
      },
      'Type' => 'Class'
    },
    '38472' => {
      'BaseType' => '35314',
      'Name' => 'std::vector<unsigned long>const',
      'Size' => '24',
      'Type' => 'Const'
    },
    '38509' => {
      'Header' => 'new_allocator.h',
      'Line' => '63',
      'Name' => 'std::__new_allocator<std::pair<unsigned short const, std::unique_ptr<pldm::fw_update::DescriptorData, std::default_delete<pldm::fw_update::DescriptorData> > > >',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '1',
      'TParam' => {
        '0' => {
          'key' => '_Tp',
          'type' => '38753'
        }
      },
      'Type' => 'Class'
    },
    '38753' => {
      'Base' => {
        '73059' => {
          'pos' => '0'
        }
      },
      'Header' => 'stl_pair.h',
      'Line' => '284',
      'Memb' => {
        '0' => {
          'name' => 'first',
          'offset' => '0',
          'type' => '87841'
        },
        '1' => {
          'name' => 'second',
          'offset' => '8',
          'type' => '48233'
        }
      },
      'Name' => 'struct std::pair<unsigned short const, std::unique_ptr<pldm::fw_update::DescriptorData, std::default_delete<pldm::fw_update::DescriptorData> > >',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '16',
      'TParam' => {
        '0' => {
          'key' => '_T1',
          'type' => '87841'
        },
        '1' => {
          'key' => '_T2',
          'type' => '48233'
        }
      },
      'Type' => 'Struct'
    },
    '39294' => {
      'Base' => {
        '38509' => {
          'pos' => '0'
        }
      },
      'Header' => 'allocator.h',
      'Line' => '128',
      'Name' => 'std::allocator<std::pair<unsigned short const, std::unique_ptr<pldm::fw_update::DescriptorData, std::default_delete<pldm::fw_update::DescriptorData> > > >',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '1',
      'TParam' => {
        '0' => {
          'type' => '38753'
        }
      },
      'Type' => 'Class'
    },
    '39755' => {
      'Base' => {
        '39975' => {
          'pos' => '0'
        }
      },
      'Header' => 'allocator.h',
      'Line' => '128',
      'Name' => 'std::allocator<std::_Rb_tree_node<std::pair<unsigned short const, std::unique_ptr<pldm::fw_update::DescriptorData, std::default_delete<pldm::fw_update::DescriptorData> > > > >',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '1',
      'TParam' => {
        '0' => {
          'type' => '40219'
        }
      },
      'Type' => 'Class'
    },
    '39975' => {
      'Header' => 'new_allocator.h',
      'Line' => '63',
      'Name' => 'std::__new_allocator<std::_Rb_tree_node<std::pair<unsigned short const, std::unique_ptr<pldm::fw_update::DescriptorData, std::default_delete<pldm::fw_update::DescriptorData> > > > >',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '1',
      'TParam' => {
        '0' => {
          'key' => '_Tp',
          'type' => '40219'
        }
      },
      'Type' => 'Class'
    },
    '40219' => {
      'Base' => {
        '16536' => {
          'pos' => '0'
        }
      },
      'Copied' => 1,
      'Header' => 'stl_tree.h',
      'Line' => '212',
      'Memb' => {
        '0' => {
          'name' => '_M_storage',
          'offset' => '50',
          'type' => '86736'
        }
      },
      'Name' => 'struct std::_Rb_tree_node<std::pair<unsigned short const, std::unique_ptr<pldm::fw_update::DescriptorData, std::default_delete<pldm::fw_update::DescriptorData> > > >',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '48',
      'TParam' => {
        '0' => {
          'key' => '_Val',
          'type' => '38753'
        }
      },
      'Type' => 'Struct'
    },
    '40327' => {
      'Header' => 'stl_function.h',
      'Line' => '131',
      'Name' => 'struct std::binary_function<unsigned short, unsigned short, bool>',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '1',
      'TParam' => {
        '0' => {
          'key' => '_Arg1',
          'type' => '87834'
        },
        '1' => {
          'key' => '_Arg2',
          'type' => '87834'
        },
        '2' => {
          'key' => '_Result',
          'type' => '79157'
        }
      },
      'Type' => 'Struct'
    },
    '40368' => {
      'Base' => {
        '40327' => {
          'pos' => '0'
        }
      },
      'Copied' => 1,
      'Header' => 'stl_function.h',
      'Line' => '400',
      'Name' => 'struct std::less<unsigned short>',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '1',
      'TParam' => {
        '0' => {
          'key' => '_Tp',
          'type' => '87834'
        }
      },
      'Type' => 'Struct'
    },
    '40444' => {
      'Header' => 'stl_tree.h',
      'Line' => '138',
      'Memb' => {
        '0' => {
          'name' => '_M_key_compare',
          'offset' => '0',
          'type' => '40368'
        }
      },
      'Name' => 'struct std::_Rb_tree_key_compare<std::less<unsigned short> >',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '1',
      'TParam' => {
        '0' => {
          'key' => '_Key_compare',
          'type' => '40368'
        }
      },
      'Type' => 'Struct'
    },
    '40604' => {
      'Header' => 'stl_tree.h',
      'Line' => '423',
      'Memb' => {
        '0' => {
          'access' => 'protected',
          'name' => '_M_impl',
          'offset' => '0',
          'type' => '40618'
        }
      },
      'Name' => 'std::_Rb_tree<unsigned short, std::pair<unsigned short const, std::unique_ptr<pldm::fw_update::DescriptorData, std::default_delete<pldm::fw_update::DescriptorData> > >, std::_Select1st<std::pair<unsigned short const, std::unique_ptr<pldm::fw_update::DescriptorData, std::default_delete<pldm::fw_update::DescriptorData> > > >, std::less<unsigned short>, std::allocator<std::pair<unsigned short const, std::unique_ptr<pldm::fw_update::DescriptorData, std::default_delete<pldm::fw_update::DescriptorData> > > > >',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '48',
      'TParam' => {
        '0' => {
          'key' => '_Key',
          'type' => '87834'
        },
        '1' => {
          'key' => '_Val',
          'type' => '38753'
        },
        '2' => {
          'key' => '_KeyOfValue',
          'type' => '74138'
        },
        '3' => {
          'key' => '_Compare',
          'type' => '40368'
        },
        '4' => {
          'key' => '_Alloc',
          'type' => '39294'
        }
      },
      'Type' => 'Class'
    },
    '40618' => {
      'Base' => {
        '16732' => {
          'pos' => '2'
        },
        '39755' => {
          'pos' => '0'
        },
        '40444' => {
          'pos' => '1'
        }
      },
      'Header' => 'stl_tree.h',
      'Line' => '658',
      'Name' => 'struct std::_Rb_tree<unsigned short, std::pair<unsigned short const, std::unique_ptr<pldm::fw_update::DescriptorData, std::default_delete<pldm::fw_update::DescriptorData> > >, std::_Select1st<std::pair<unsigned short const, std::unique_ptr<pldm::fw_update::DescriptorData, std::default_delete<pldm::fw_update::DescriptorData> > > >, std::less<unsigned short>, std::allocator<std::pair<unsigned short const, std::unique_ptr<pldm::fw_update::DescriptorData, std::default_delete<pldm::fw_update::DescriptorData> > > > >::_Rb_tree_impl<std::less<unsigned short> >',
      'NameSpace' => 'std::_Rb_tree<unsigned short, std::pair<unsigned short const, std::unique_ptr<pldm::fw_update::DescriptorData, std::default_delete<pldm::fw_update::DescriptorData> > >, std::_Select1st<std::pair<unsigned short const, std::unique_ptr<pldm::fw_update::DescriptorData, std::default_delete<pldm::fw_update::DescriptorData> > > >, std::less<unsigned short>, std::allocator<std::pair<unsigned short const, std::unique_ptr<pldm::fw_update::DescriptorData, std::default_delete<pldm::fw_update::DescriptorData> > > > >',
      'PrivateABI' => 1,
      'Protected' => 1,
      'Size' => '48',
      'TParam' => {
        '0' => {
          'key' => '_Key_compare',
          'type' => '40368'
        }
      },
      'Type' => 'Struct'
    },
    '45739' => {
      'Header' => 'stl_map.h',
      'Line' => '102',
      'Memb' => {
        '0' => {
          'access' => 'private',
          'name' => '_M_t',
          'offset' => '0',
          'type' => '45752'
        }
      },
      'Name' => 'std::map<unsigned short, std::unique_ptr<pldm::fw_update::DescriptorData, std::default_delete<pldm::fw_update::DescriptorData> > >',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '48',
      'TParam' => {
        '0' => {
          'key' => '_Key',
          'type' => '87834'
        },
        '1' => {
          'key' => '_Tp',
          'type' => '48233'
        }
      },
      'Type' => 'Class'
    },
    '45752' => {
      'BaseType' => '40604',
      'Header' => 'stl_map.h',
      'Line' => '155',
      'Name' => 'std::map<unsigned short, std::unique_ptr<pldm::fw_update::DescriptorData, std::default_delete<pldm::fw_update::DescriptorData> > >::_Rep_type',
      'NameSpace' => 'std::map<unsigned short, std::unique_ptr<pldm::fw_update::DescriptorData, std::default_delete<pldm::fw_update::DescriptorData> > >',
      'Private' => 1,
      'PrivateABI' => 1,
      'Size' => '48',
      'Type' => 'Typedef'
    },
    '48206' => {
      'BaseType' => '45739',
      'Name' => 'std::map<unsigned short, std::unique_ptr<pldm::fw_update::DescriptorData, std::default_delete<pldm::fw_update::DescriptorData> > >const',
      'Size' => '48',
      'Type' => 'Const'
    },
    '48233' => {
      'Header' => 'unique_ptr.h',
      'Line' => '271',
      'Memb' => {
        '0' => {
          'access' => 'private',
          'name' => '_M_t',
          'offset' => '0',
          'type' => '66656'
        }
      },
      'Name' => 'std::unique_ptr<pldm::fw_update::DescriptorData, std::default_delete<pldm::fw_update::DescriptorData> >',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '8',
      'TParam' => {
        '0' => {
          'key' => '_Tp',
          'type' => '97210'
        },
        '1' => {
          'key' => '_Dp',
          'type' => '64454'
        }
      },
      'Type' => 'Class'
    },
    '49363' => {
      'Header' => 'new_allocator.h',
      'Line' => '63',
      'Name' => 'std::__new_allocator<pldm::fw_update::FirmwareDeviceIDRecord>',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '1',
      'TParam' => {
        '0' => {
          'key' => '_Tp',
          'type' => '97706'
        }
      },
      'Type' => 'Class'
    },
    '49607' => {
      'Base' => {
        '49363' => {
          'pos' => '0'
        }
      },
      'Header' => 'allocator.h',
      'Line' => '128',
      'Name' => 'std::allocator<pldm::fw_update::FirmwareDeviceIDRecord>',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '1',
      'TParam' => {
        '0' => {
          'type' => '97706'
        }
      },
      'Type' => 'Class'
    },
    '49827' => {
      'Copied' => 1,
      'Header' => 'alloc_traits.h',
      'Line' => '461',
      'Name' => 'struct std::allocator_traits<std::allocator<pldm::fw_update::FirmwareDeviceIDRecord> >',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '1',
      'TParam' => {
        '0' => {
          'type' => '49607'
        }
      },
      'Type' => 'Struct'
    },
    '49841' => {
      'BaseType' => '99524',
      'Header' => 'alloc_traits.h',
      'Line' => '470',
      'Name' => 'std::allocator_traits<std::allocator<pldm::fw_update::FirmwareDeviceIDRecord> >::pointer',
      'NameSpace' => 'std::allocator_traits<std::allocator<pldm::fw_update::FirmwareDeviceIDRecord> >',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '50133' => {
      'Header' => 'stl_vector.h',
      'Line' => '84',
      'Memb' => {
        '0' => {
          'name' => '_M_impl',
          'offset' => '0',
          'type' => '50331'
        }
      },
      'Name' => 'struct std::_Vector_base<pldm::fw_update::FirmwareDeviceIDRecord, std::allocator<pldm::fw_update::FirmwareDeviceIDRecord> >',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '24',
      'TParam' => {
        '0' => {
          'key' => '_Tp',
          'type' => '97706'
        },
        '1' => {
          'key' => '_Alloc',
          'type' => '49607'
        }
      },
      'Type' => 'Struct'
    },
    '50146' => {
      'Header' => 'stl_vector.h',
      'Line' => '91',
      'Memb' => {
        '0' => {
          'name' => '_M_start',
          'offset' => '0',
          'type' => '50319'
        },
        '1' => {
          'name' => '_M_finish',
          'offset' => '8',
          'type' => '50319'
        },
        '2' => {
          'name' => '_M_end_of_storage',
          'offset' => '22',
          'type' => '50319'
        }
      },
      'Name' => 'struct std::_Vector_base<pldm::fw_update::FirmwareDeviceIDRecord, std::allocator<pldm::fw_update::FirmwareDeviceIDRecord> >::_Vector_impl_data',
      'NameSpace' => 'std::_Vector_base<pldm::fw_update::FirmwareDeviceIDRecord, std::allocator<pldm::fw_update::FirmwareDeviceIDRecord> >',
      'PrivateABI' => 1,
      'Size' => '24',
      'Type' => 'Struct'
    },
    '50319' => {
      'BaseType' => '83513',
      'Header' => 'stl_vector.h',
      'Line' => '89',
      'Name' => 'std::_Vector_base<pldm::fw_update::FirmwareDeviceIDRecord, std::allocator<pldm::fw_update::FirmwareDeviceIDRecord> >::pointer',
      'NameSpace' => 'std::_Vector_base<pldm::fw_update::FirmwareDeviceIDRecord, std::allocator<pldm::fw_update::FirmwareDeviceIDRecord> >',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '50331' => {
      'Base' => {
        '49607' => {
          'pos' => '0'
        },
        '50146' => {
          'pos' => '1'
        }
      },
      'Header' => 'stl_vector.h',
      'Line' => '132',
      'Name' => 'struct std::_Vector_base<pldm::fw_update::FirmwareDeviceIDRecord, std::allocator<pldm::fw_update::FirmwareDeviceIDRecord> >::_Vector_impl',
      'NameSpace' => 'std::_Vector_base<pldm::fw_update::FirmwareDeviceIDRecord, std::allocator<pldm::fw_update::FirmwareDeviceIDRecord> >',
      'PrivateABI' => 1,
      'Size' => '24',
      'Type' => 'Struct'
    },
    '51142' => {
      'Base' => {
        '50133' => {
          'access' => 'protected',
          'pos' => '0'
        }
      },
      'Header' => 'stl_vector.h',
      'Line' => '428',
      'Name' => 'std::vector<pldm::fw_update::FirmwareDeviceIDRecord>',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '24',
      'TParam' => {
        '0' => {
          'type' => '97706'
        }
      },
      'Type' => 'Class'
    },
    '54300' => {
      'BaseType' => '51142',
      'Name' => 'std::vector<pldm::fw_update::FirmwareDeviceIDRecord>const',
      'Size' => '24',
      'Type' => 'Const'
    },
    '54337' => {
      'Header' => 'new_allocator.h',
      'Line' => '63',
      'Name' => 'std::__new_allocator<pldm::fw_update::ComponentImageInfo>',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '1',
      'TParam' => {
        '0' => {
          'key' => '_Tp',
          'type' => '97429'
        }
      },
      'Type' => 'Class'
    },
    '54581' => {
      'Base' => {
        '54337' => {
          'pos' => '0'
        }
      },
      'Header' => 'allocator.h',
      'Line' => '128',
      'Name' => 'std::allocator<pldm::fw_update::ComponentImageInfo>',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '1',
      'TParam' => {
        '0' => {
          'type' => '97429'
        }
      },
      'Type' => 'Class'
    },
    '54801' => {
      'Copied' => 1,
      'Header' => 'alloc_traits.h',
      'Line' => '461',
      'Name' => 'struct std::allocator_traits<std::allocator<pldm::fw_update::ComponentImageInfo> >',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '1',
      'TParam' => {
        '0' => {
          'type' => '54581'
        }
      },
      'Type' => 'Struct'
    },
    '54815' => {
      'BaseType' => '98909',
      'Header' => 'alloc_traits.h',
      'Line' => '470',
      'Name' => 'std::allocator_traits<std::allocator<pldm::fw_update::ComponentImageInfo> >::pointer',
      'NameSpace' => 'std::allocator_traits<std::allocator<pldm::fw_update::ComponentImageInfo> >',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '55107' => {
      'Header' => 'stl_vector.h',
      'Line' => '84',
      'Memb' => {
        '0' => {
          'name' => '_M_impl',
          'offset' => '0',
          'type' => '55305'
        }
      },
      'Name' => 'struct std::_Vector_base<pldm::fw_update::ComponentImageInfo, std::allocator<pldm::fw_update::ComponentImageInfo> >',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '24',
      'TParam' => {
        '0' => {
          'key' => '_Tp',
          'type' => '97429'
        },
        '1' => {
          'key' => '_Alloc',
          'type' => '54581'
        }
      },
      'Type' => 'Struct'
    },
    '55120' => {
      'Header' => 'stl_vector.h',
      'Line' => '91',
      'Memb' => {
        '0' => {
          'name' => '_M_start',
          'offset' => '0',
          'type' => '55293'
        },
        '1' => {
          'name' => '_M_finish',
          'offset' => '8',
          'type' => '55293'
        },
        '2' => {
          'name' => '_M_end_of_storage',
          'offset' => '22',
          'type' => '55293'
        }
      },
      'Name' => 'struct std::_Vector_base<pldm::fw_update::ComponentImageInfo, std::allocator<pldm::fw_update::ComponentImageInfo> >::_Vector_impl_data',
      'NameSpace' => 'std::_Vector_base<pldm::fw_update::ComponentImageInfo, std::allocator<pldm::fw_update::ComponentImageInfo> >',
      'PrivateABI' => 1,
      'Size' => '24',
      'Type' => 'Struct'
    },
    '55293' => {
      'BaseType' => '84939',
      'Header' => 'stl_vector.h',
      'Line' => '89',
      'Name' => 'std::_Vector_base<pldm::fw_update::ComponentImageInfo, std::allocator<pldm::fw_update::ComponentImageInfo> >::pointer',
      'NameSpace' => 'std::_Vector_base<pldm::fw_update::ComponentImageInfo, std::allocator<pldm::fw_update::ComponentImageInfo> >',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '55305' => {
      'Base' => {
        '54581' => {
          'pos' => '0'
        },
        '55120' => {
          'pos' => '1'
        }
      },
      'Header' => 'stl_vector.h',
      'Line' => '132',
      'Name' => 'struct std::_Vector_base<pldm::fw_update::ComponentImageInfo, std::allocator<pldm::fw_update::ComponentImageInfo> >::_Vector_impl',
      'NameSpace' => 'std::_Vector_base<pldm::fw_update::ComponentImageInfo, std::allocator<pldm::fw_update::ComponentImageInfo> >',
      'PrivateABI' => 1,
      'Size' => '24',
      'Type' => 'Struct'
    },
    '56116' => {
      'Base' => {
        '55107' => {
          'access' => 'protected',
          'pos' => '0'
        }
      },
      'Header' => 'stl_vector.h',
      'Line' => '428',
      'Name' => 'std::vector<pldm::fw_update::ComponentImageInfo>',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '24',
      'TParam' => {
        '0' => {
          'type' => '97429'
        }
      },
      'Type' => 'Class'
    },
    '59274' => {
      'BaseType' => '56116',
      'Name' => 'std::vector<pldm::fw_update::ComponentImageInfo>const',
      'Size' => '24',
      'Type' => 'Const'
    },
    '59311' => {
      'Copied' => 1,
      'Header' => 'optional',
      'Line' => '443',
      'Name' => 'std::_Optional_base_impl<int, std::_Optional_base<int> >',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '1',
      'TParam' => {
        '0' => {
          'key' => '_Tp',
          'type' => '87879'
        },
        '1' => {
          'key' => '_Dp',
          'type' => '60286'
        }
      },
      'Type' => 'Class'
    },
    '59501' => {
      'Header' => 'optional',
      'Line' => '112',
      'Memb' => {
        '0' => {
          'name' => '_M_payload',
          'offset' => '0',
          'type' => '59523'
        },
        '1' => {
          'name' => '_M_engaged',
          'offset' => '4',
          'type' => '79157'
        }
      },
      'Name' => 'struct std::_Optional_payload_base<int>',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '8',
      'TParam' => {
        '0' => {
          'key' => '_Tp',
          'type' => '87879'
        }
      },
      'Type' => 'Struct'
    },
    '59514' => {
      'Header' => 'optional',
      'Line' => '200',
      'Name' => 'struct std::_Optional_payload_base<int>::_Empty_byte',
      'NameSpace' => 'std::_Optional_payload_base<int>',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Struct'
    },
    '59523' => {
      'Header' => 'optional',
      'Line' => '203',
      'Memb' => {
        '0' => {
          'name' => '_M_empty',
          'offset' => '0',
          'type' => '59514'
        },
        '1' => {
          'name' => '_M_value',
          'offset' => '0',
          'type' => '87879'
        }
      },
      'Name' => 'union std::_Optional_payload_base<int>::_Storage<int>',
      'NameSpace' => 'std::_Optional_payload_base<int>',
      'PrivateABI' => 1,
      'Size' => '4',
      'TParam' => {
        '0' => {
          'key' => '_Up',
          'type' => '87879'
        }
      },
      'Type' => 'Union'
    },
    '60181' => {
      'Base' => {
        '59501' => {
          'pos' => '0'
        }
      },
      'Header' => 'optional',
      'Line' => '334',
      'Name' => 'struct std::_Optional_payload<int>',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '8',
      'TParam' => {
        '0' => {
          'key' => '_Tp',
          'type' => '87879'
        }
      },
      'Type' => 'Struct'
    },
    '60286' => {
      'Base' => {
        '59311' => {
          'pos' => '0'
        }
      },
      'Header' => 'optional',
      'Line' => '637',
      'Memb' => {
        '0' => {
          'name' => '_M_payload',
          'offset' => '0',
          'type' => '60181'
        }
      },
      'Name' => 'struct std::_Optional_base<int>',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '8',
      'TParam' => {
        '0' => {
          'key' => '_Tp',
          'type' => '87879'
        }
      },
      'Type' => 'Struct'
    },
    '60550' => {
      'Header' => 'enable_special_members.h',
      'Line' => '87',
      'Name' => 'struct std::_Enable_copy_move<true, true, true, true, std::optional<int> >',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '1',
      'TParam' => {
        '0' => {
          'key' => '_Copy',
          'type' => '79157',
          'val' => '1'
        },
        '1' => {
          'key' => '_CopyAssignment',
          'type' => '79157',
          'val' => '1'
        },
        '2' => {
          'key' => '_Move',
          'type' => '79157',
          'val' => '1'
        },
        '3' => {
          'key' => '_MoveAssignment',
          'type' => '79157',
          'val' => '1'
        },
        '4' => {
          'key' => '_Tag',
          'type' => '60613'
        }
      },
      'Type' => 'Struct'
    },
    '60613' => {
      'Base' => {
        '60286' => {
          'pos' => '0'
        },
        '60550' => {
          'pos' => '1'
        }
      },
      'Header' => 'optional',
      'Line' => '703',
      'Name' => 'std::optional<int>',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '8',
      'TParam' => {
        '0' => {
          'key' => '_Tp',
          'type' => '87879'
        }
      },
      'Type' => 'Class'
    },
    '61222' => {
      'Header' => 'expected',
      'Line' => '321',
      'Memb' => {
        '0' => {
          'access' => 'private',
          'name' => 'unnamed0',
          'offset' => '0',
          'type' => '61236'
        },
        '1' => {
          'access' => 'private',
          'name' => '_M_has_value',
          'offset' => '64',
          'type' => '79157'
        }
      },
      'Name' => 'std::expected<std::unique_ptr<pldm::fw_update::Package, std::default_delete<pldm::fw_update::Package> >, pldm::fw_update::PackageParserError>',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '48',
      'TParam' => {
        '0' => {
          'key' => '_Tp',
          'type' => '67986'
        },
        '1' => {
          'key' => '_Er',
          'type' => '98165'
        }
      },
      'Type' => 'Class'
    },
    '61236' => {
      'Header' => 'expected',
      'Line' => '1228',
      'Memb' => {
        '0' => {
          'name' => '_M_val',
          'offset' => '0',
          'type' => '67986'
        },
        '1' => {
          'name' => '_M_unex',
          'offset' => '0',
          'type' => '98165'
        }
      },
      'Name' => 'std::expected<std::unique_ptr<pldm::fw_update::Package, std::default_delete<pldm::fw_update::Package> >, pldm::fw_update::PackageParserError>::anon-union-expected-1228',
      'NameSpace' => 'std::expected<std::unique_ptr<pldm::fw_update::Package, std::default_delete<pldm::fw_update::Package> >, pldm::fw_update::PackageParserError>',
      'Private' => 1,
      'PrivateABI' => 1,
      'Size' => '40',
      'Type' => 'Union'
    },
    '62250' => {
      'Header' => 'span',
      'Line' => '102',
      'Memb' => {
        '0' => {
          'access' => 'private',
          'name' => '_M_ptr',
          'offset' => '0',
          'type' => '62648'
        },
        '1' => {
          'access' => 'private',
          'name' => '_M_extent',
          'offset' => '8',
          'type' => '475'
        }
      },
      'Name' => 'std::span<unsigned char const, 18446744073709551615ul>',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '16',
      'TParam' => {
        '0' => {
          'key' => '_Type',
          'type' => '87829'
        },
        '1' => {
          'key' => '_Extent',
          'type' => '87846',
          'val' => '18446744073709551615'
        }
      },
      'Type' => 'Class'
    },
    '62648' => {
      'BaseType' => '98699',
      'Header' => 'span',
      'Line' => '132',
      'Name' => 'std::span<unsigned char const, 18446744073709551615ul>::pointer',
      'NameSpace' => 'std::span<unsigned char const, 18446744073709551615ul>',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '63171' => {
      'BaseType' => '62250',
      'Name' => 'std::span<unsigned char const, 18446744073709551615ul>const',
      'Size' => '16',
      'Type' => 'Const'
    },
    '64454' => {
      'Header' => 'unique_ptr.h',
      'Line' => '69',
      'Name' => 'struct std::default_delete<pldm::fw_update::DescriptorData>',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '1',
      'TParam' => {
        '0' => {
          'key' => '_Tp',
          'type' => '97210'
        }
      },
      'Type' => 'Struct'
    },
    '64539' => {
      'Header' => 'unique_ptr.h',
      'Line' => '142',
      'Memb' => {
        '0' => {
          'access' => 'private',
          'name' => '_M_t',
          'offset' => '0',
          'type' => '66248'
        }
      },
      'Name' => 'std::__uniq_ptr_impl<pldm::fw_update::DescriptorData, std::default_delete<pldm::fw_update::DescriptorData> >',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '8',
      'TParam' => {
        '0' => {
          'key' => '_Tp',
          'type' => '97210'
        },
        '1' => {
          'key' => '_Dp',
          'type' => '64454'
        }
      },
      'Type' => 'Class'
    },
    '64992' => {
      'Header' => 'tuple',
      'Line' => '88',
      'Memb' => {
        '0' => {
          'name' => '_M_head_impl',
          'offset' => '0',
          'type' => '64454'
        }
      },
      'Name' => 'struct std::_Head_base<1ul, std::default_delete<pldm::fw_update::DescriptorData> >',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '1',
      'TParam' => {
        '0' => {
          'key' => '_Idx',
          'type' => '87846',
          'val' => '1'
        },
        '1' => {
          'key' => '_Head',
          'type' => '64454'
        }
      },
      'Type' => 'Struct'
    },
    '65250' => {
      'Base' => {
        '64992' => {
          'access' => 'private',
          'pos' => '0'
        }
      },
      'Header' => 'tuple',
      'Line' => '549',
      'Name' => 'struct std::_Tuple_impl<1ul, std::default_delete<pldm::fw_update::DescriptorData> >',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '1',
      'TParam' => {
        '0' => {
          'key' => '_Idx',
          'type' => '87846',
          'val' => '1'
        },
        '1' => {
          'key' => undef,
          'type' => '64454'
        }
      },
      'Type' => 'Struct'
    },
    '65576' => {
      'Header' => 'tuple',
      'Line' => '197',
      'Memb' => {
        '0' => {
          'name' => '_M_head_impl',
          'offset' => '0',
          'type' => '98859'
        }
      },
      'Name' => 'struct std::_Head_base<0ul, pldm::fw_update::DescriptorData*>',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '8',
      'TParam' => {
        '0' => {
          'key' => '_Idx',
          'type' => '87846',
          'val' => '0'
        },
        '1' => {
          'key' => '_Head',
          'type' => '98859'
        }
      },
      'Type' => 'Struct'
    },
    '65834' => {
      'Base' => {
        '65250' => {
          'pos' => '0'
        },
        '65576' => {
          'access' => 'private',
          'pos' => '1'
        }
      },
      'Header' => 'tuple',
      'Line' => '284',
      'Name' => 'struct std::_Tuple_impl<0ul, pldm::fw_update::DescriptorData*>',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '8',
      'TParam' => {
        '0' => {
          'key' => '_Idx',
          'type' => '87846',
          'val' => '0'
        },
        '1' => {
          'key' => undef,
          'type' => '98859'
        }
      },
      'Type' => 'Struct'
    },
    '66248' => {
      'Base' => {
        '65834' => {
          'pos' => '0'
        }
      },
      'Header' => 'tuple',
      'Line' => '836',
      'Name' => 'std::tuple<pldm::fw_update::DescriptorData*, std::default_delete<pldm::fw_update::DescriptorData> >',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '8',
      'TParam' => {
        '0' => {
          'name' => 'pldm::fw_update::DescriptorData*'
        },
        '1' => {
          'type' => '64454'
        }
      },
      'Type' => 'Class'
    },
    '66656' => {
      'Base' => {
        '64539' => {
          'pos' => '0'
        }
      },
      'Header' => 'unique_ptr.h',
      'Line' => '233',
      'Name' => 'struct std::__uniq_ptr_data<pldm::fw_update::DescriptorData, std::default_delete<pldm::fw_update::DescriptorData> >',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '8',
      'TParam' => {
        '0' => {
          'key' => '_Tp',
          'type' => '97210'
        },
        '1' => {
          'key' => '_Dp',
          'type' => '64454'
        }
      },
      'Type' => 'Struct'
    },
    '67986' => {
      'Header' => 'unique_ptr.h',
      'Line' => '271',
      'Memb' => {
        '0' => {
          'access' => 'private',
          'name' => '_M_t',
          'offset' => '0',
          'type' => '70809'
        }
      },
      'Name' => 'std::unique_ptr<pldm::fw_update::Package, std::default_delete<pldm::fw_update::Package> >',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '8',
      'TParam' => {
        '0' => {
          'key' => '_Tp',
          'type' => '97977'
        },
        '1' => {
          'key' => '_Dp',
          'type' => '68607'
        }
      },
      'Type' => 'Class'
    },
    '68607' => {
      'Header' => 'unique_ptr.h',
      'Line' => '69',
      'Name' => 'struct std::default_delete<pldm::fw_update::Package>',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '1',
      'TParam' => {
        '0' => {
          'key' => '_Tp',
          'type' => '97977'
        }
      },
      'Type' => 'Struct'
    },
    '68692' => {
      'Header' => 'unique_ptr.h',
      'Line' => '142',
      'Memb' => {
        '0' => {
          'access' => 'private',
          'name' => '_M_t',
          'offset' => '0',
          'type' => '70401'
        }
      },
      'Name' => 'std::__uniq_ptr_impl<pldm::fw_update::Package, std::default_delete<pldm::fw_update::Package> >',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '8',
      'TParam' => {
        '0' => {
          'key' => '_Tp',
          'type' => '97977'
        },
        '1' => {
          'key' => '_Dp',
          'type' => '68607'
        }
      },
      'Type' => 'Class'
    },
    '69145' => {
      'Header' => 'tuple',
      'Line' => '88',
      'Memb' => {
        '0' => {
          'name' => '_M_head_impl',
          'offset' => '0',
          'type' => '68607'
        }
      },
      'Name' => 'struct std::_Head_base<1ul, std::default_delete<pldm::fw_update::Package> >',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '1',
      'TParam' => {
        '0' => {
          'key' => '_Idx',
          'type' => '87846',
          'val' => '1'
        },
        '1' => {
          'key' => '_Head',
          'type' => '68607'
        }
      },
      'Type' => 'Struct'
    },
    '69403' => {
      'Base' => {
        '69145' => {
          'access' => 'private',
          'pos' => '0'
        }
      },
      'Header' => 'tuple',
      'Line' => '549',
      'Name' => 'struct std::_Tuple_impl<1ul, std::default_delete<pldm::fw_update::Package> >',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '1',
      'TParam' => {
        '0' => {
          'key' => '_Idx',
          'type' => '87846',
          'val' => '1'
        },
        '1' => {
          'key' => undef,
          'type' => '68607'
        }
      },
      'Type' => 'Struct'
    },
    '69729' => {
      'Header' => 'tuple',
      'Line' => '197',
      'Memb' => {
        '0' => {
          'name' => '_M_head_impl',
          'offset' => '0',
          'type' => '99964'
        }
      },
      'Name' => 'struct std::_Head_base<0ul, pldm::fw_update::Package*>',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '8',
      'TParam' => {
        '0' => {
          'key' => '_Idx',
          'type' => '87846',
          'val' => '0'
        },
        '1' => {
          'key' => '_Head',
          'type' => '99964'
        }
      },
      'Type' => 'Struct'
    },
    '69987' => {
      'Base' => {
        '69403' => {
          'pos' => '0'
        },
        '69729' => {
          'access' => 'private',
          'pos' => '1'
        }
      },
      'Header' => 'tuple',
      'Line' => '284',
      'Name' => 'struct std::_Tuple_impl<0ul, pldm::fw_update::Package*>',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '8',
      'TParam' => {
        '0' => {
          'key' => '_Idx',
          'type' => '87846',
          'val' => '0'
        },
        '1' => {
          'key' => undef,
          'type' => '99964'
        }
      },
      'Type' => 'Struct'
    },
    '70401' => {
      'Base' => {
        '69987' => {
          'pos' => '0'
        }
      },
      'Header' => 'tuple',
      'Line' => '836',
      'Name' => 'std::tuple<pldm::fw_update::Package*, std::default_delete<pldm::fw_update::Package> >',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '8',
      'TParam' => {
        '0' => {
          'name' => 'pldm::fw_update::Package*'
        },
        '1' => {
          'type' => '68607'
        }
      },
      'Type' => 'Class'
    },
    '70809' => {
      'Base' => {
        '68692' => {
          'pos' => '0'
        }
      },
      'Header' => 'unique_ptr.h',
      'Line' => '233',
      'Name' => 'struct std::__uniq_ptr_data<pldm::fw_update::Package, std::default_delete<pldm::fw_update::Package> >',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '8',
      'TParam' => {
        '0' => {
          'key' => '_Tp',
          'type' => '97977'
        },
        '1' => {
          'key' => '_Dp',
          'type' => '68607'
        }
      },
      'Type' => 'Struct'
    },
    '73059' => {
      'Copied' => 1,
      'Header' => 'stl_pair.h',
      'Line' => '260',
      'Name' => 'std::__pair_base<unsigned short const, std::unique_ptr<pldm::fw_update::DescriptorData, std::default_delete<pldm::fw_update::DescriptorData> > >',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '1',
      'TParam' => {
        '0' => {
          'key' => '_U1',
          'type' => '87841'
        },
        '1' => {
          'key' => '_U2',
          'type' => '48233'
        }
      },
      'Type' => 'Class'
    },
    '74106' => {
      'Header' => 'stl_function.h',
      'Line' => '117',
      'Name' => 'struct std::unary_function<std::pair<unsigned short const, std::unique_ptr<pldm::fw_update::DescriptorData, std::default_delete<pldm::fw_update::DescriptorData> > >, unsigned short const>',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '1',
      'TParam' => {
        '0' => {
          'key' => '_Arg',
          'type' => '38753'
        },
        '1' => {
          'key' => '_Result',
          'type' => '87841'
        }
      },
      'Type' => 'Struct'
    },
    '74138' => {
      'Base' => {
        '74106' => {
          'pos' => '0'
        }
      },
      'Copied' => 1,
      'Header' => 'stl_function.h',
      'Line' => '1171',
      'Name' => 'struct std::_Select1st<std::pair<unsigned short const, std::unique_ptr<pldm::fw_update::DescriptorData, std::default_delete<pldm::fw_update::DescriptorData> > > >',
      'NameSpace' => 'std',
      'PrivateABI' => 1,
      'Size' => '1',
      'TParam' => {
        '0' => {
          'key' => '_Pair',
          'type' => '38753'
        }
      },
      'Type' => 'Struct'
    },
    '79145' => {
      'Name' => 'unsigned int',
      'Size' => '4',
      'Type' => 'Intrinsic'
    },
    '79157' => {
      'Name' => 'bool',
      'Size' => '1',
      'Type' => 'Intrinsic'
    },
    '79318' => {
      'Base' => {
        '6854' => {
          'pos' => '0'
        }
      },
      'Copied' => 1,
      'Header' => 'alloc_traits.h',
      'Line' => '45',
      'Name' => 'struct __gnu_cxx::__alloc_traits<std::allocator<char> >',
      'NameSpace' => '__gnu_cxx',
      'PrivateABI' => 1,
      'Size' => '1',
      'TParam' => {
        '0' => {
          'key' => '_Alloc',
          'type' => '3335'
        }
      },
      'Type' => 'Struct'
    },
    '79519' => {
      'BaseType' => '6868',
      'Header' => 'alloc_traits.h',
      'Line' => '54',
      'Name' => '__gnu_cxx::__alloc_traits<std::allocator<char> >::pointer',
      'NameSpace' => '__gnu_cxx::__alloc_traits<std::allocator<char> >',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '79543' => {
      'BaseType' => '6931',
      'Header' => 'alloc_traits.h',
      'Line' => '56',
      'Name' => '__gnu_cxx::__alloc_traits<std::allocator<char> >::size_type',
      'NameSpace' => '__gnu_cxx::__alloc_traits<std::allocator<char> >',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '81365' => {
      'Base' => {
        '26096' => {
          'pos' => '0'
        }
      },
      'Copied' => 1,
      'Header' => 'alloc_traits.h',
      'Line' => '45',
      'Name' => 'struct __gnu_cxx::__alloc_traits<std::allocator<unsigned char> >',
      'NameSpace' => '__gnu_cxx',
      'PrivateABI' => 1,
      'Size' => '1',
      'TParam' => {
        '0' => {
          'key' => '_Alloc',
          'type' => '25876'
        }
      },
      'Type' => 'Struct'
    },
    '81566' => {
      'BaseType' => '26110',
      'Header' => 'alloc_traits.h',
      'Line' => '54',
      'Name' => '__gnu_cxx::__alloc_traits<std::allocator<unsigned char> >::pointer',
      'NameSpace' => '__gnu_cxx::__alloc_traits<std::allocator<unsigned char> >',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '81657' => {
      'Base' => {
        '33999' => {
          'pos' => '0'
        }
      },
      'Copied' => 1,
      'Header' => 'alloc_traits.h',
      'Line' => '45',
      'Name' => 'struct __gnu_cxx::__alloc_traits<std::allocator<unsigned long> >',
      'NameSpace' => '__gnu_cxx',
      'PrivateABI' => 1,
      'Size' => '1',
      'TParam' => {
        '0' => {
          'key' => '_Alloc',
          'type' => '33779'
        }
      },
      'Type' => 'Struct'
    },
    '81858' => {
      'BaseType' => '34013',
      'Header' => 'alloc_traits.h',
      'Line' => '54',
      'Name' => '__gnu_cxx::__alloc_traits<std::allocator<unsigned long> >::pointer',
      'NameSpace' => '__gnu_cxx::__alloc_traits<std::allocator<unsigned long> >',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '83312' => {
      'Base' => {
        '49827' => {
          'pos' => '0'
        }
      },
      'Copied' => 1,
      'Header' => 'alloc_traits.h',
      'Line' => '45',
      'Name' => 'struct __gnu_cxx::__alloc_traits<std::allocator<pldm::fw_update::FirmwareDeviceIDRecord> >',
      'NameSpace' => '__gnu_cxx',
      'PrivateABI' => 1,
      'Size' => '1',
      'TParam' => {
        '0' => {
          'key' => '_Alloc',
          'type' => '49607'
        }
      },
      'Type' => 'Struct'
    },
    '83513' => {
      'BaseType' => '49841',
      'Header' => 'alloc_traits.h',
      'Line' => '54',
      'Name' => '__gnu_cxx::__alloc_traits<std::allocator<pldm::fw_update::FirmwareDeviceIDRecord> >::pointer',
      'NameSpace' => '__gnu_cxx::__alloc_traits<std::allocator<pldm::fw_update::FirmwareDeviceIDRecord> >',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '84738' => {
      'Base' => {
        '54801' => {
          'pos' => '0'
        }
      },
      'Copied' => 1,
      'Header' => 'alloc_traits.h',
      'Line' => '45',
      'Name' => 'struct __gnu_cxx::__alloc_traits<std::allocator<pldm::fw_update::ComponentImageInfo> >',
      'NameSpace' => '__gnu_cxx',
      'PrivateABI' => 1,
      'Size' => '1',
      'TParam' => {
        '0' => {
          'key' => '_Alloc',
          'type' => '54581'
        }
      },
      'Type' => 'Struct'
    },
    '84939' => {
      'BaseType' => '54815',
      'Header' => 'alloc_traits.h',
      'Line' => '54',
      'Name' => '__gnu_cxx::__alloc_traits<std::allocator<pldm::fw_update::ComponentImageInfo> >::pointer',
      'NameSpace' => '__gnu_cxx::__alloc_traits<std::allocator<pldm::fw_update::ComponentImageInfo> >',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '86736' => {
      'Header' => 'aligned_buffer.h',
      'Line' => '47',
      'Memb' => {
        '0' => {
          'name' => '_M_storage',
          'offset' => '0',
          'type' => '101368'
        }
      },
      'Name' => 'struct __gnu_cxx::__aligned_membuf<std::pair<unsigned short const, std::unique_ptr<pldm::fw_update::DescriptorData, std::default_delete<pldm::fw_update::DescriptorData> > > >',
      'NameSpace' => '__gnu_cxx',
      'PrivateABI' => 1,
      'Size' => '16',
      'TParam' => {
        '0' => {
          'key' => '_Tp',
          'type' => '38753'
        }
      },
      'Type' => 'Struct'
    },
    '87822' => {
      'Name' => 'unsigned char',
      'Size' => '1',
      'Type' => 'Intrinsic'
    },
    '87829' => {
      'BaseType' => '87822',
      'Name' => 'unsigned char const',
      'Size' => '1',
      'Type' => 'Const'
    },
    '87834' => {
      'Name' => 'unsigned short',
      'Size' => '2',
      'Type' => 'Intrinsic'
    },
    '87841' => {
      'BaseType' => '87834',
      'Name' => 'unsigned short const',
      'Size' => '2',
      'Type' => 'Const'
    },
    '87846' => {
      'Name' => 'unsigned long',
      'Size' => '8',
      'Type' => 'Intrinsic'
    },
    '87879' => {
      'Name' => 'int',
      'Size' => '4',
      'Type' => 'Intrinsic'
    },
    '88039' => {
      'BaseType' => '87846',
      'Header' => 'stddef.h',
      'Line' => '214',
      'Name' => 'size_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '88051' => {
      'BaseType' => '88039',
      'Name' => 'size_t const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '88221' => {
      'Name' => 'char',
      'Size' => '1',
      'Type' => 'Intrinsic'
    },
    '89524' => {
      'BaseType' => '88221',
      'Name' => 'char*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '91350' => {
      'BaseType' => '87822',
      'Header' => 'types.h',
      'Line' => '38',
      'Name' => '__uint8_t',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '91374' => {
      'BaseType' => '87834',
      'Header' => 'types.h',
      'Line' => '40',
      'Name' => '__uint16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '91403' => {
      'BaseType' => '79145',
      'Header' => 'types.h',
      'Line' => '42',
      'Name' => '__uint32_t',
      'PrivateABI' => 1,
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '91427' => {
      'BaseType' => '87846',
      'Header' => 'types.h',
      'Line' => '45',
      'Name' => '__uint64_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '93618' => {
      'BaseType' => '88221',
      'Name' => 'char[16]',
      'Size' => '16',
      'Type' => 'Array'
    },
    '93816' => {
      'BaseType' => '91350',
      'Header' => 'stdint-uintn.h',
      'Line' => '24',
      'Name' => 'uint8_t',
      'PrivateABI' => 1,
      'Size' => '1',
      'Type' => 'Typedef'
    },
    '93828' => {
      'BaseType' => '93816',
      'Name' => 'uint8_t const',
      'Size' => '1',
      'Type' => 'Const'
    },
    '93833' => {
      'BaseType' => '91374',
      'Header' => 'stdint-uintn.h',
      'Line' => '25',
      'Name' => 'uint16_t',
      'PrivateABI' => 1,
      'Size' => '2',
      'Type' => 'Typedef'
    },
    '93845' => {
      'BaseType' => '93833',
      'Name' => 'uint16_t const',
      'Size' => '2',
      'Type' => 'Const'
    },
    '93850' => {
      'BaseType' => '91403',
      'Header' => 'stdint-uintn.h',
      'Line' => '26',
      'Name' => 'uint32_t',
      'PrivateABI' => 1,
      'Size' => '4',
      'Type' => 'Typedef'
    },
    '93862' => {
      'BaseType' => '93850',
      'Name' => 'uint32_t const',
      'Size' => '4',
      'Type' => 'Const'
    },
    '93867' => {
      'BaseType' => '91427',
      'Header' => 'stdint-uintn.h',
      'Line' => '27',
      'Name' => 'uint64_t',
      'PrivateABI' => 1,
      'Size' => '8',
      'Type' => 'Typedef'
    },
    '94806' => {
      'Header' => 'pldm_types.h',
      'Line' => '177',
      'Memb' => {
        '0' => {
          'name' => 'ptr',
          'offset' => '0',
          'type' => '94851'
        },
        '1' => {
          'name' => 'length',
          'offset' => '8',
          'type' => '88039'
        }
      },
      'Name' => 'struct variable_field',
      'PrivateABI' => 1,
      'Size' => '16',
      'Type' => 'Struct'
    },
    '94846' => {
      'BaseType' => '94806',
      'Name' => 'struct variable_field const',
      'Size' => '16',
      'Type' => 'Const'
    },
    '94851' => {
      'BaseType' => '93828',
      'Name' => 'uint8_t const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '95903' => {
      'BaseType' => '16536',
      'Name' => 'struct std::_Rb_tree_node_base*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '96596' => {
      'Header' => 'types.hpp',
      'Line' => '18',
      'Name' => 'struct libpldm::NonCopyableNonMoveable',
      'NameSpace' => 'libpldm',
      'Size' => '1',
      'Type' => 'Struct'
    },
    '96801' => {
      'Header' => 'types.hpp',
      'Line' => '33',
      'Memb' => {
        '0' => {
          'access' => 'protected',
          'name' => 'struct_size',
          'offset' => '0',
          'type' => '88051'
        },
        '1' => {
          'access' => 'protected',
          'name' => 'reserved_1',
          'offset' => '8',
          'type' => '93867'
        }
      },
      'Name' => 'struct libpldm::GrowableStruct<pldm::fw_update::DescriptorData>',
      'NameSpace' => 'libpldm',
      'Size' => '16',
      'TParam' => {
        '0' => {
          'key' => 'Derived',
          'type' => '97210'
        }
      },
      'Type' => 'Struct'
    },
    '96881' => {
      'BaseType' => '96801',
      'Name' => 'struct libpldm::GrowableStruct<pldm::fw_update::DescriptorData>const',
      'Size' => '16',
      'Type' => 'Const'
    },
    '96886' => {
      'Header' => 'types.hpp',
      'Line' => '33',
      'Memb' => {
        '0' => {
          'access' => 'protected',
          'name' => 'struct_size',
          'offset' => '0',
          'type' => '88051'
        },
        '1' => {
          'access' => 'protected',
          'name' => 'reserved_1',
          'offset' => '8',
          'type' => '93867'
        }
      },
      'Name' => 'struct libpldm::GrowableStruct<pldm::fw_update::ComponentImageInfo>',
      'NameSpace' => 'libpldm',
      'Size' => '16',
      'TParam' => {
        '0' => {
          'key' => 'Derived',
          'type' => '97429'
        }
      },
      'Type' => 'Struct'
    },
    '96966' => {
      'BaseType' => '96886',
      'Name' => 'struct libpldm::GrowableStruct<pldm::fw_update::ComponentImageInfo>const',
      'Size' => '16',
      'Type' => 'Const'
    },
    '96971' => {
      'Header' => 'types.hpp',
      'Line' => '33',
      'Memb' => {
        '0' => {
          'access' => 'protected',
          'name' => 'struct_size',
          'offset' => '0',
          'type' => '88051'
        },
        '1' => {
          'access' => 'protected',
          'name' => 'reserved_1',
          'offset' => '8',
          'type' => '93867'
        }
      },
      'Name' => 'struct libpldm::GrowableStruct<pldm::fw_update::FirmwareDeviceIDRecord>',
      'NameSpace' => 'libpldm',
      'Size' => '16',
      'TParam' => {
        '0' => {
          'key' => 'Derived',
          'type' => '97706'
        }
      },
      'Type' => 'Struct'
    },
    '97051' => {
      'BaseType' => '96971',
      'Name' => 'struct libpldm::GrowableStruct<pldm::fw_update::FirmwareDeviceIDRecord>const',
      'Size' => '16',
      'Type' => 'Const'
    },
    '97056' => {
      'Header' => 'types.hpp',
      'Line' => '33',
      'Memb' => {
        '0' => {
          'access' => 'protected',
          'name' => 'struct_size',
          'offset' => '0',
          'type' => '88051'
        },
        '1' => {
          'access' => 'protected',
          'name' => 'reserved_1',
          'offset' => '8',
          'type' => '93867'
        }
      },
      'Name' => 'struct libpldm::GrowableStruct<pldm::fw_update::Package>',
      'NameSpace' => 'libpldm',
      'Size' => '16',
      'TParam' => {
        '0' => {
          'key' => 'Derived',
          'type' => '97977'
        }
      },
      'Type' => 'Struct'
    },
    '97136' => {
      'BaseType' => '97056',
      'Name' => 'struct libpldm::GrowableStruct<pldm::fw_update::Package>const',
      'Size' => '16',
      'Type' => 'Const'
    },
    '97186' => {
      'Header' => 'firmware_update.hpp',
      'Line' => '27',
      'Memb' => {
        '0' => {
          'name' => 'v1',
          'value' => '0'
        }
      },
      'Name' => 'enum pldm::fw_update::PackagePin',
      'NameSpace' => 'pldm::fw_update',
      'Size' => '4',
      'Type' => 'Enum'
    },
    '97210' => {
      'Base' => {
        '96596' => {
          'access' => 'private',
          'pos' => '1'
        },
        '96801' => {
          'pos' => '0'
        }
      },
      'Header' => 'firmware_update.hpp',
      'Line' => '37',
      'Memb' => {
        '0' => {
          'name' => 'vendorDefinedDescriptorTitle',
          'offset' => '22',
          'type' => '25627'
        },
        '1' => {
          'name' => 'data',
          'offset' => '86',
          'type' => '30524'
        }
      },
      'Name' => 'struct pldm::fw_update::DescriptorData',
      'NameSpace' => 'pldm::fw_update',
      'Size' => '80',
      'Type' => 'Struct'
    },
    '97429' => {
      'Base' => {
        '96596' => {
          'access' => 'private',
          'pos' => '1'
        },
        '96886' => {
          'pos' => '0'
        }
      },
      'Header' => 'firmware_update.hpp',
      'Line' => '63',
      'Memb' => {
        '0' => {
          'name' => 'componentClassification',
          'offset' => '22',
          'type' => '93845'
        },
        '1' => {
          'name' => 'componentIdentifier',
          'offset' => '24',
          'type' => '93845'
        },
        '2' => {
          'name' => 'compComparisonStamp',
          'offset' => '32',
          'type' => '93862'
        },
        '3' => {
          'name' => 'componentOptions',
          'offset' => '36',
          'type' => '32164'
        },
        '4' => {
          'name' => 'requestedComponentActivationMethod',
          'offset' => '50',
          'type' => '32164'
        },
        '5' => {
          'name' => 'componentLocation',
          'offset' => '64',
          'type' => '94846'
        },
        '6' => {
          'name' => 'componentVersion',
          'offset' => '86',
          'type' => '18166'
        }
      },
      'Name' => 'struct pldm::fw_update::ComponentImageInfo',
      'NameSpace' => 'pldm::fw_update',
      'Size' => '88',
      'Type' => 'Struct'
    },
    '97706' => {
      'Base' => {
        '96596' => {
          'access' => 'private',
          'pos' => '1'
        },
        '96971' => {
          'pos' => '0'
        }
      },
      'Header' => 'firmware_update.hpp',
      'Line' => '109',
      'Memb' => {
        '0' => {
          'name' => 'deviceUpdateOptionFlags',
          'offset' => '22',
          'type' => '33530'
        },
        '1' => {
          'name' => 'applicableComponents',
          'offset' => '36',
          'type' => '38472'
        },
        '2' => {
          'name' => 'componentImageSetVersionString',
          'offset' => '72',
          'type' => '18166'
        },
        '3' => {
          'name' => 'recordDescriptors',
          'offset' => '128',
          'type' => '48206'
        },
        '4' => {
          'name' => 'firmwareDevicePackageData',
          'offset' => '296',
          'type' => '30524'
        }
      },
      'Name' => 'struct pldm::fw_update::FirmwareDeviceIDRecord',
      'NameSpace' => 'pldm::fw_update',
      'Size' => '152',
      'Type' => 'Struct'
    },
    '97977' => {
      'Base' => {
        '96596' => {
          'access' => 'private',
          'pos' => '1'
        },
        '97056' => {
          'pos' => '0'
        }
      },
      'Header' => 'firmware_update.hpp',
      'Line' => '158',
      'Memb' => {
        '0' => {
          'name' => 'firmwareDeviceIdRecords',
          'offset' => '22',
          'type' => '54300'
        },
        '1' => {
          'name' => 'componentImageInformation',
          'offset' => '64',
          'type' => '59274'
        }
      },
      'Name' => 'struct pldm::fw_update::Package',
      'NameSpace' => 'pldm::fw_update',
      'Size' => '64',
      'Type' => 'Struct'
    },
    '98160' => {
      'BaseType' => '97977',
      'Name' => 'struct pldm::fw_update::Package const',
      'Size' => '64',
      'Type' => 'Const'
    },
    '98165' => {
      'Header' => 'firmware_update.hpp',
      'Line' => '183',
      'Memb' => {
        '0' => {
          'name' => 'msg',
          'offset' => '0',
          'type' => '18154'
        },
        '1' => {
          'name' => 'rc',
          'offset' => '50',
          'type' => '60613'
        }
      },
      'Name' => 'pldm::fw_update::PackageParserError',
      'NameSpace' => 'pldm::fw_update',
      'Size' => '40',
      'Type' => 'Class'
    },
    '98333' => {
      'Base' => {
        '96596' => {
          'pos' => '0'
        }
      },
      'Header' => 'firmware_update.hpp',
      'Line' => '194',
      'Name' => 'pldm::fw_update::PackageParser',
      'NameSpace' => 'pldm::fw_update',
      'Size' => '1',
      'Type' => 'Class'
    },
    '98509' => {
      'BaseType' => '96881',
      'Name' => 'struct libpldm::GrowableStruct<pldm::fw_update::DescriptorData>const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '98654' => {
      'BaseType' => '87822',
      'Name' => 'unsigned char*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '98699' => {
      'BaseType' => '87829',
      'Name' => 'unsigned char const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '98859' => {
      'BaseType' => '97210',
      'Name' => 'struct pldm::fw_update::DescriptorData*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '98879' => {
      'BaseType' => '96966',
      'Name' => 'struct libpldm::GrowableStruct<pldm::fw_update::ComponentImageInfo>const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '98909' => {
      'BaseType' => '97429',
      'Name' => 'struct pldm::fw_update::ComponentImageInfo*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '98939' => {
      'BaseType' => '97051',
      'Name' => 'struct libpldm::GrowableStruct<pldm::fw_update::FirmwareDeviceIDRecord>const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '98989' => {
      'BaseType' => '87846',
      'Name' => 'unsigned long*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '99524' => {
      'BaseType' => '97706',
      'Name' => 'struct pldm::fw_update::FirmwareDeviceIDRecord*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '99549' => {
      'BaseType' => '97136',
      'Name' => 'struct libpldm::GrowableStruct<pldm::fw_update::Package>const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '99964' => {
      'BaseType' => '97977',
      'Name' => 'struct pldm::fw_update::Package*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '99969' => {
      'BaseType' => '99964',
      'Name' => 'struct pldm::fw_update::Package*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '99979' => {
      'BaseType' => '98160',
      'Name' => 'struct pldm::fw_update::Package const*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '100114' => {
      'BaseType' => '98165',
      'Name' => 'pldm::fw_update::PackageParserError*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '100119' => {
      'BaseType' => '100114',
      'Name' => 'pldm::fw_update::PackageParserError*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '100124' => {
      'BaseType' => '98333',
      'Name' => 'pldm::fw_update::PackageParser*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '100129' => {
      'BaseType' => '100124',
      'Name' => 'pldm::fw_update::PackageParser*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '100134' => {
      'BaseType' => '63171',
      'Name' => 'std::span<unsigned char const, 18446744073709551615ul>const&',
      'Size' => '8',
      'Type' => 'Ref'
    },
    '100963' => {
      'BaseType' => '98165',
      'Name' => 'pldm::fw_update::PackageParserError&&',
      'Size' => '8',
      'Type' => 'RvalueRef'
    },
    '101368' => {
      'BaseType' => '87822',
      'Name' => 'unsigned char[16]',
      'Size' => '16',
      'Type' => 'Array'
    },
    '278311' => {
      'BaseType' => '98509',
      'Name' => 'struct libpldm::GrowableStruct<pldm::fw_update::DescriptorData>const*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '278746' => {
      'BaseType' => '98879',
      'Name' => 'struct libpldm::GrowableStruct<pldm::fw_update::ComponentImageInfo>const*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '278811' => {
      'BaseType' => '98939',
      'Name' => 'struct libpldm::GrowableStruct<pldm::fw_update::FirmwareDeviceIDRecord>const*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '279436' => {
      'BaseType' => '99549',
      'Name' => 'struct libpldm::GrowableStruct<pldm::fw_update::Package>const*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '279891' => {
      'BaseType' => '99979',
      'Name' => 'struct pldm::fw_update::Package const*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '339832' => {
      'BaseType' => '97056',
      'Name' => 'struct libpldm::GrowableStruct<pldm::fw_update::Package>*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '339837' => {
      'BaseType' => '339832',
      'Name' => 'struct libpldm::GrowableStruct<pldm::fw_update::Package>*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '351710' => {
      'BaseType' => '96971',
      'Name' => 'struct libpldm::GrowableStruct<pldm::fw_update::FirmwareDeviceIDRecord>*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '351715' => {
      'BaseType' => '351710',
      'Name' => 'struct libpldm::GrowableStruct<pldm::fw_update::FirmwareDeviceIDRecord>*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '354717' => {
      'BaseType' => '96886',
      'Name' => 'struct libpldm::GrowableStruct<pldm::fw_update::ComponentImageInfo>*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '354722' => {
      'BaseType' => '354717',
      'Name' => 'struct libpldm::GrowableStruct<pldm::fw_update::ComponentImageInfo>*const',
      'Size' => '8',
      'Type' => 'Const'
    },
    '358765' => {
      'BaseType' => '96801',
      'Name' => 'struct libpldm::GrowableStruct<pldm::fw_update::DescriptorData>*',
      'Size' => '8',
      'Type' => 'Pointer'
    },
    '358770' => {
      'BaseType' => '358765',
      'Name' => 'struct libpldm::GrowableStruct<pldm::fw_update::DescriptorData>*const',
      'Size' => '8',
      'Type' => 'Const'
    }
  },
  'UndefinedSymbols' => {
    'libpldm++.so.0.17.0' => {
      '_ITM_deregisterTMCloneTable' => 0,
      '_ITM_registerTMCloneTable' => 0,
      '_Unwind_Resume@GCC_3.0' => 0,
      '_ZNSt9exceptionD2Ev@GLIBCXX_3.4' => 0,
      '_ZSt17__throw_bad_allocv@GLIBCXX_3.4' => 0,
      '_ZSt18_Rb_tree_decrementPSt18_Rb_tree_node_base@GLIBCXX_3.4' => 0,
      '_ZSt18_Rb_tree_incrementPKSt18_Rb_tree_node_base@GLIBCXX_3.4' => 0,
      '_ZSt18_Rb_tree_incrementPSt18_Rb_tree_node_base@GLIBCXX_3.4' => 0,
      '_ZSt19__throw_logic_errorPKc@GLIBCXX_3.4' => 0,
      '_ZSt20__throw_length_errorPKc@GLIBCXX_3.4' => 0,
      '_ZSt20__throw_out_of_rangePKc@GLIBCXX_3.4' => 0,
      '_ZSt21__glibcxx_assert_failPKciS0_S0_@GLIBCXX_3.4.30' => 0,
      '_ZSt28__throw_bad_array_new_lengthv@GLIBCXX_3.4.29' => 0,
      '_ZSt29_Rb_tree_insert_and_rebalancebPSt18_Rb_tree_node_baseS0_RS_@GLIBCXX_3.4' => 0,
      '_ZTISt9exception@GLIBCXX_3.4' => 0,
      '_ZTVN10__cxxabiv120__si_class_type_infoE@CXXABI_1.3' => 0,
      '_ZTVSt9exception@GLIBCXX_3.4' => 0,
      '_ZdlPvm@CXXABI_1.3.9' => 0,
      '_Znwm@GLIBCXX_3.4' => 0,
      '__assert_fail@GLIBC_2.2.5' => 0,
      '__cxa_allocate_exception@CXXABI_1.3' => 0,
      '__cxa_begin_catch@CXXABI_1.3' => 0,
      '__cxa_end_catch@CXXABI_1.3' => 0,
      '__cxa_finalize@GLIBC_2.2.5' => 0,
      '__cxa_free_exception@CXXABI_1.3' => 0,
      '__cxa_rethrow@CXXABI_1.3' => 0,
      '__cxa_throw@CXXABI_1.3' => 0,
      '__gmon_start__' => 0,
      '__gxx_personality_v0@CXXABI_1.3' => 0,
      '__stack_chk_fail@GLIBC_2.4' => 0,
      'decode_pldm_descriptor_from_iter' => 0,
      'decode_pldm_firmware_update_package' => 0,
      'decode_pldm_package_component_image_information_from_iter' => 0,
      'decode_pldm_package_firmware_device_id_record_from_iter' => 0,
      'decode_vendor_defined_descriptor_value' => 0,
      'memcmp@GLIBC_2.2.5' => 0,
      'memcpy@GLIBC_2.14' => 0,
      'memmove@GLIBC_2.2.5' => 0,
      'memset@GLIBC_2.2.5' => 0,
      'pldm_package_component_image_information_iter_init' => 0,
      'pldm_package_firmware_device_id_record_iter_init' => 0,
      'strlen@GLIBC_2.2.5' => 0
    }
  },
  'WordSize' => '8'
};
